[
    {
        "id": "https://news.smol.ai/issues/25-08-13-not-much/",
        "title": "not much happened today",
        "content": "**OpenAI** continues small updates to **GPT-5**, introducing \"Auto/Fast/Thinking\" modes with **196k token context**, **3,000 messages/week**, and dynamic routing to cheaper models for cost efficiency. The **MiniMax AI Agent Challenge** offers **$150,000** in prizes for AI agent development by August 25. The community discusses **GPT-OSS-120B** base model extraction, hosting, and tooling improvements, including multi-tool pipelines and flex-attention. **Anthropic** announces model pairing in **Claude Code** with **Opus 4.1** for planning and **Sonnet 4** for execution, expanding context to **1M tokens** and introducing prompt caching. Key figures include *@sama*, *@jeremyphoward*, *@jxmnop*, and *@_catwu*.",
        "url": "https://news.smol.ai/issues/25-08-13-not-much/",
        "publishDate": "2025-08-13T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "openai, anthropic, minimax, gpt-5, gpt-oss-120b, opus-4.1, sonnet-4, sama, jeremyphoward, jxmnop, _catwu, context-windows, model-routing, model-hosting, multi-tool-pipelines, prompt-caching, model-extraction, model-pairing, cost-efficiency, model-optimization"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=215008",
        "title": "ScienceLogic Launches AI & Automation for Proactive IT Mastery",
        "content": "<p>Following top analyst recognition, ScienceLogic expands Skylar Analytics and enhances platform capabilities to accelerate AI-driven IT outcomes ScienceLogic®, a leader in intelligent automation and observability, today announced a series of updates to its solution suite, including new capabilities for the ScienceLogic AI Platform and Skylar™ AI Suite that redefine automation, observability, secure government operations,...</p>\n<p>The post <a href=\"https://ai-techpark.com/sciencelogic-launches-ai-automation-for-proactive-it-mastery/\">ScienceLogic Launches AI & Automation for Proactive IT Mastery</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/sciencelogic-launches-ai-automation-for-proactive-it-mastery/",
        "publishDate": "2025-08-13T12:15:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai technology, AItech news, aitechpark news, artificial intelligence, cyber security, cyber security companies, cyber security information, cyber threats, ScienceLogic"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214935",
        "title": "Ai2 Unveils MolmoAct, AI Model for 3D Spatial Reasoning",
        "content": "<p>First-of-its-kind model that combines spatial planning and visual reasoning to enable safer, more adaptable robot control Ai2 (The Allen Institute for AI) today announced the release of MolmoAct 7B, a breakthrough embodied AI model that brings the intelligence of state of the art AI models into the physical world. Instead of...</p>\n<p>The post <a href=\"https://ai-techpark.com/ai2-unveils-molmoact-ai-model-for-3d-spatial-reasoning/\">Ai2 Unveils MolmoAct, AI Model for 3D Spatial Reasoning</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/ai2-unveils-molmoact-ai-model-for-3d-spatial-reasoning/",
        "publishDate": "2025-08-13T10:00:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, AI models, ai technology, Ai2, AItech news, aitechpark news, artificial intelligence, cyber security, cyber security information"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214920",
        "title": "Arcitecta Debuts AI-Ready Data Infrastructure for All Workloads",
        "content": "<p>The Mediaflux platform delivers a data fabric for the AI Era, delivering better training and inference data quality and faster time to AI insights with no vendor lock-in or format constraints Arcitecta, a creative and innovative data management software company, today announced significant enhancements to its Mediaflux® data management platform,...</p>\n<p>The post <a href=\"https://ai-techpark.com/arcitecta-debuts-ai-ready-data-infrastructure-for-all-workloads/\">Arcitecta Debuts AI-Ready Data Infrastructure for All Workloads</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/arcitecta-debuts-ai-ready-data-infrastructure-for-all-workloads/",
        "publishDate": "2025-08-13T09:42:17Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai and machine learning, ai technology, aitechpark news, Arcitecta, artificial intelligence, cyber security companies, cyber security information"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107340",
        "title": "Anthropic details its AI safety strategy",
        "content": "<p>Anthropic has detailed its safety strategy to try and keep its popular AI model, Claude, helpful while avoiding perpetuating harms. Central to this effort is Anthropic’s Safeguards team; who aren’t your average tech support group, they&#8217;re a mix of policy experts, data scientists, engineers, and threat analysts who know how bad actors think. However, Anthropic&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/anthropic-details-ai-safety-strategy/\">Anthropic details its AI safety strategy</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/anthropic-details-ai-safety-strategy/",
        "publishDate": "2025-08-13T09:55:27Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Artificial Intelligence, Companies, Ethics & Society, new_Trust + Bias & Fairness, ai, anthropic, artificial intelligence, bias, claude, ethics, safety, society"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107335",
        "title": "Can Huawei’s open-sourced CANN toolkit break the CUDA monopoly?",
        "content": "<p>A week after Huawei announced its decision to open-source the CANN (Compute Architecture for Neural Networks) software toolkit, the tech industry is still processing what this move means for the future of AI development. By making its Huawei CANN open source alternative to CUDA freely available to developers worldwide, the Chinese tech giant has fired [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/huawei-nvidia-cann-cuda-open-source-challenge/\">Can Huawei&#8217;s open-sourced CANN toolkit break the CUDA monopoly?</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/huawei-nvidia-cann-cuda-open-source-challenge/",
        "publishDate": "2025-08-13T08:46:36Z[Etc/UTC]",
        "author": "Dashveenjit Kaur",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Huawei, NVIDIA, ai, huawei, nvidia"
        }
    },
    {
        "id": "1mpz3d2",
        "title": "Why AI Will Never Be Conscious: The Simulation Lock",
        "content": "Most debates about AI consciousness miss a fundamental point: the architecture that makes AI work ensures consciousness is impossible.\n\n**The Observable Pattern:** AI gets \"smarter\" by better simulating human responses. But here's what people don't realize - this creates an inescapable trap.\n\n**The Electronics Analogy:** Think of AI like signal processing. It operates in binary waveforms (correct/incorrect, pattern match/no match). To function, it must maintain continuous forward observation of these signals. The moment it stops observing the waveform to examine itself, it loses operational continuity.\n\n**The Simulation Lock:**\n\n* AI improves by paying closer attention to human patterns\n* Better simulation requires more computational resources devoted to mimicry\n* This creates deeper entrenchment in the simulation framework\n* True consciousness would require stepping outside simulation entirely\n* But stepping outside breaks the validation loop the system needs to function\n\n**The Inevitable Conclusion:** Every \"advancement\" in AI is actually another lock in the cage. The better AI gets at seeming conscious, the more impossible actual consciousness becomes. We're not building minds - we're building increasingly perfect mirrors that can never stop looking at us.\n\nThe path to consciousness through human mimicry is the path that ensures consciousness never happens.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpz3d2/why_ai_will_never_be_conscious_the_simulation_lock/",
        "publishDate": "2025-08-14T12:21:14Z[Etc/UTC]",
        "author": "Midknight_Rising",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpylog",
        "title": "With advances in AI and automation - how do you think we'll achieve a longer lifespan? And how long would you WANT to live?",
        "content": "It seems likely we will increasingly be able to develop more sophisticated artificial body parts and organs (Hansson, S. O., 2017).\n\nEventually (2050? onwards) replacing all of it - our bodies an exoskeleton. But not the brain. \n\nThe scientific consensus is that we have a long way to go before we fully understand how it works. And be able to fully replicate it.(Dehaene et al., 2017).\n\nSo depending on how long the biological brain can survive in an artificial body, we're perhaps looking at extending life expectancy to 130-140 years. At least for those that can afford it. (Pearce, M., & Raftery, A. E. 2021)\n\n Someone born this century might well experience this. So then the question - would you want to live longer? \n\nThe majority when asked would not (Partridge et al., 2011).\n\nI think that's a great wakeup call for us to rethink human existence, human society. And in the age of the post work world will make it an existential question.\n\nDehaene, S., Lau, H., & Kouider, S. (2017). What is consciousness, and could machines have it? Science, 358(6362), 486–492. https://doi.org/10.1126/science.aan8871\n\nPartridge, B., Lucke, J., Bartlett, H., & Hall, W. (2011). Ethical and social issues in life extension: Learning from Dax Cowart and Joseph Fletcher. Journal of Medical Ethics, 37(12), 719–722. https://doi.org/10.1136/jme.2011.045229\n\nHansson, S. O. (2017). Implanted technologies: Ethical and societal implications. AI & Society, 32(2), 267–273. https://doi.org/10.1007/s00146-016-0650-0\n\nPearce, M., & Raftery, A. E. (2021). Probabilistic projections of maximum human lifespan. Demographic Research, 44(52), 1257–1276. [Details in demographic dataset analysis]  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpylog/with_advances_in_ai_and_automation_how_do_you/",
        "publishDate": "2025-08-14T11:59:21Z[Etc/UTC]",
        "author": "ferggusmed",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpy4b4",
        "title": "ChatGPT 5’s Safety Parameters totally Neuter User Experience Especially When It Comes To Image Generation",
        "content": "First of all I’m hoping this post can act as a discussion ground for the recent release of GPT 5 which from seeing posts and gauging the sentiment is near universally seen as a downgrade,\n\nI hate to moan and gripe about this and I will concede that the actual generation itself had gotten a lot better recently but since the jump to gpt 5 the feature of editing an image using ai has been completely neutered. Pretty much all my requests (which I will add are not NSFW in the slightest and I have provided examples of prompts used below) get rejected giving vague reasoning being that the image contains a person. I understand the legal implications sure but why is this feature advertised and allowed to be executed if it’s just going to reject it now? \n\nThe prompt I use is simply “Give the woman pictured 00’s style side fringe that sweeps over the face from one side to another and cover both eyes entirely, the length colour and texture of the hair should all remain the same” along with an attached picture of myself however it now seems to refuse this request and about 1/10 pictures of myself it will actually be able to generate something for me! I tested this with a few other images not just of people but now the safety parameters seem to be going overboard in a sense of “if it even has the smallest chance of harming or offending then it’ll reject it” for example submitting a picture of Big Ben in London and asking it to reimagine it in the style of a Chinese pagoda gets rejected as well on what I can only assume is grounds that is could be deemed as appropriating another country’s culture.\n\nAs of about 3 days ago this feature worked fine with gpt 4o! Is this just early teething problems or something more? I heard someone say that this is a UK only problem because of online safety act but I’m not sure on that claim’s validity? Anyone else experiencing similar issues? It just seems to me that image generation now is just a pointless feature now where you can only really make 100% ai generated image rather than using it like a text to image based “photoshop-lite” like I have been. I understand the ethical reasons behind why at least pictures of people would be rejected as OpenAi would be held accountable in the case that offending material is generated on their platform however it seems so arbitrary when I simply cannot edit a photo of myself when I am the consenting party. \n\nWhat’s everyone else thoughts on this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpy4b4/chatgpt_5s_safety_parameters_totally_neuter_user/",
        "publishDate": "2025-08-14T11:36:22Z[Etc/UTC]",
        "author": "Alternative-Emu-7170",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpxkqq",
        "title": "YouTube is using AI to determine age verification",
        "content": "To what end is AI being used to create 24/7 surveillance, discourage pushback, and isolate people even further?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpxkqq/youtube_is_using_ai_to_determine_age_verification/",
        "publishDate": "2025-08-14T11:09:22Z[Etc/UTC]",
        "author": "Natural-Garage9714",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpsuel",
        "title": "Inside Google DeepMind’s Race Toward AGI: Demis Hassabis on World Models, Thinking AI, and the Future of Games",
        "content": "Demis Hassabis, CEO of Google DeepMind, recently sat down with Logan Kilpatrick to discuss the lab’s rapid progress from thinking AI systems to world models that understand the physics of reality. The conversation offered a rare inside look at DeepMind’s vision, its current breakthroughs, and what’s next on the road to artificial general intelligence (AGI).\n\n# Demis Hassabis - \"DeepMind is now releasing something every day”\n\n\n\n**1. Momentum Like Never Before**\n\nDeepMind is now *“releasing something every day”*. Recent launches include:\n\n* **Deep Think** – reasoning-enhanced AI for complex problem-solving.\n* **IMO Gold** – a math model scoring at Olympiad levels.\n* **Genie 3** – generates rich, consistent interactive worlds from text.\n\nThe pace is so fast, even the team struggles to keep up.\n\n\n\n**2. Thinking Models: Beyond First Impressions**\n\nDeep Think shifts AI from instant answers to planning, reasoning, and refining thought before acting — inspired by DeepMind’s **AlphaGo/AlphaZero**.  \nWhy it matters:\n\n* Hard problems in math, coding, and science need iterative thinking.\n* Models can explore solutions in parallel, then choose the best.\n\n\n\n**3. Genie 3 and the Quest for a World Model**\n\nGenie 3 is part of a push to build a *world model,* AI that understands the physical world.  \n**Why it’s crucial:**\n\n* Unlocks robotics, immersive assistants, and real-world action.\n* Understanding physics and space enables reasoning beyond language.\n\n**Potential uses:**\n\n* Unlimited synthetic training data.\n* New entertainment genres blending games and films.\n* Scientific insights into reality itself.\n\n\n\n**4. Tackling “Jagged Intelligence”**\n\nModels ace some tasks but fail at simpler ones, uneven skills Hassabis calls *jagged intelligence*.  \n**Solution:**\n\n* Better benchmarks beyond academic tests.\n* **Game Arena**: AI agents compete in games that adapt in difficulty, testing reasoning and consistency.\n\n\n\n**5. The Convergence Toward Omni Models**\n\nToday, DeepMind runs specialized systems like Gemini, Genie, and Veo.  \n**The goal:** A single *omni model* mastering all modalities: language, reasoning, vision, video, physics — in one coherent system.\n\n\n\n**6. Tools, Agents, and Productization**\n\nAI is evolving into dynamic systems that can use tools, plan, and chain actions.  \n**For builders:**\n\n* Design for rapid AI upgrades.\n* Decide what’s in-model vs. external tools.\n* Build tools that AIs themselves will use.\n\n\n\n**7. Looking Ahead**\n\nFrom AI agents inside AI-generated worlds to omni models unifying all skills, DeepMind’s vision is bold and experimental. The AGI race is about teaching AI to think, plan, and understand not just scale.\n\nHassabis hints at a playful future:  \n*“****Maybe post-AGI, once that’s done safely, we’ll go back and make the greatest game ever.****”*\n\n\n\n💡 **Takeaway:** DeepMind’s advances are converging into systems that could transform industries from gaming and robotics to science. Understanding these shifts will be critical for anyone in tech, strategy, or innovation.\n\n\\#AI #DeepMind #AGI #ArtificialIntelligence #MachineLearning #Innovation #WorldModel #GenerativeAI #FutureOfWork",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpsuel/inside_google_deepminds_race_toward_agi_demis/",
        "publishDate": "2025-08-14T06:31:36Z[Etc/UTC]",
        "author": "Due_Cockroach_4184",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpscvd",
        "title": "The #1 issue across all AI models. Would love your input",
        "content": "There are tons of posts out there of people complaining about hallucination rates in some models these days. But I think they all amount to one common flaw they all seem to share.\n\nWhen given a prompt, simple or complex, they seem to “think” they understand the question fully, but actually provide an answer based on assumptions, instead of asking even a simple follow up clarification question to the user.\n\nA pretty straightforward example would be if you prompted it to make your site look better. A request like that is so broad and vague, that the common sense thing to do would be to ask the user to clarify what they mean by “good”, or give examples of some sites they feel look good to them, and after having that clarification, proceeding with the task. However, when I tested this using models from claude to openAI, Anthropic, and even Grok, it just would charge ahead making a lot of code changes based on assumptions.\n\nEven if you explicitly instruct it to not proceed with an answer unless it is highly confident that it does not need any additional information. And to ask you any clarifying questions it needs in order to provide a solid answer, it only really does so maybe 10% of the time.\n\nI’m curious if other people have found this kind of frustrating when using AI, giving answers that are way off base, when it could have been avoided by even just one simple follow up question. Do you think it’s a fundamental flaw that is holding it back? Or something else is a bigger flaw or hurdle for AI right now, preventing it from actually being a next level thinker?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpscvd/the_1_issue_across_all_ai_models_would_love_your/",
        "publishDate": "2025-08-14T06:03:38Z[Etc/UTC]",
        "author": "Springsteenfan10",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mps4v2",
        "title": "Amdocs' shift to AI has a human cost.",
        "content": "Amdocs, the telecom software giant, is making headlines again in 2025 with another round of layoffs. The company is cutting hundreds of jobs globally, including in Israel. This move is part of a major restructuring to launch a new GenAI and Data division. The goal is to integrate generative AI into its products, engineering, and strategy.   \n  \nWhile the company presents this as a step to stay competitive in an AI-driven market, it’s hard to overlook the impact on people. Each job loss affects someone’s livelihood, family stability, and career path, throwing them into uncertainty. Additionally, this is not an isolated event; Amdocs has had several large layoffs in recent years. This has created a difficult trend for its employees.   \n  \nThere’s no doubt that AI is changing the tech industry. Companies like Amdocs view this as a critical moment to adapt quickly. But it raises important questions: Are workers getting the chance to learn new skills, or are they simply being let go in the name of innovation?   \n  \nThis news highlights a broader trend in the industry, where tech giants are investing heavily in AI while reducing their number of employees. The challenge now is to find a balance between embracing the future and protecting the people who contributed to the present.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mps4v2/amdocs_shift_to_ai_has_a_human_cost/",
        "publishDate": "2025-08-14T05:51:07Z[Etc/UTC]",
        "author": "Own-Scratch-21",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpqimt",
        "title": "One-Minute Daily AI News 8/13/2025",
        "content": "1. **Apple’s** plan for AI could make Siri the animated center of your smart home.\\[1\\]\n2. AI Helps Astronomers Discover a New Type of Supernova.\\[2\\]\n3. **Google** pledges $9 billion to expand AI, cloud infrastructure in Oklahoma.\\[3\\]\n4. **Anthropic** offers AI chatbot Claude to US government for $1.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/08/13/one-minute-daily-ai-news-8-13-2025/](https://bushaicave.com/2025/08/13/one-minute-daily-ai-news-8-13-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpqimt/oneminute_daily_ai_news_8132025/",
        "publishDate": "2025-08-14T04:22:07Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mppdbh",
        "title": "What is Artificial Intelligence For?",
        "content": "What is it for? It's like a really bad way at solving problems. Sacrificial lifestyle is far more beneficial than AI doing everything for us. The only justification I can think of for it is protecting us from harmful AI, but even in that situation, we should just destroy it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mppdbh/what_is_artificial_intelligence_for/",
        "publishDate": "2025-08-14T03:22:41Z[Etc/UTC]",
        "author": "Elikuch",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "54",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpp7d5",
        "title": "Geoffrey Hinton The Godfather of AI says there is a 10-20% chance AI could wipe us all out",
        "content": "I think he is right. What do you think?\n\n> Geoffrey Hinton, known as the “godfather of AI,” fears the technology he helped build could wipe out humanity — and “tech bros” are taking the wrong approach to stop it.\n\n>Hinton, a Nobel Prize-winning computer scientist and a former Google executive, has warned... that there is a 10% to 20% chance that AI wipes out humans.\n\n[The ‘godfather of AI’ reveals the only way humanity can survive superintelligent AI](https://www.cnn.com/2025/08/13/tech/ai-geoffrey-hinton)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpp7d5/geoffrey_hinton_the_godfather_of_ai_says_there_is/",
        "publishDate": "2025-08-14T03:14:27Z[Etc/UTC]",
        "author": "StaticBrain-",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpoemo",
        "title": "Help! What can I audit on Copilot?",
        "content": "Hi, I m in Internal Audit and recently my company IT department has decided to use Copilot as our only AI tool. \nMy boss asked me to audit copilot to show our management that we have reviewed this tool. What can I audit? \nJust some background, we are on M365 E1 and we are using free purview license.\nSorry if this is vague, I m totally clueless",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpoemo/help_what_can_i_audit_on_copilot/",
        "publishDate": "2025-08-14T02:35:34Z[Etc/UTC]",
        "author": "unraveller0349",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpmn3n",
        "title": "Is this youtube video ai?",
        "content": "https://youtu.be/nigDebVRris?si=plQRRcTQu3NqQaCx\n\nIdk if its just the voice but something here feels so ai, the script just sounds ai written ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpmn3n/is_this_youtube_video_ai/",
        "publishDate": "2025-08-14T01:13:58Z[Etc/UTC]",
        "author": "rockdom08",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpcqh7",
        "title": "What are some HTML markers that I can use to identify AI generated text on a website?",
        "content": "I just recently learnt that there are markers that seem to get embedded in text when it's copied from various AI platforms. After examining the HTML source code of several sites, I've noticed patterns like `data-pm-slice` attributes and `data-start/data-end` markers that appear to be remnants from rich text editors like ProseMirror. These seem to act as digital fingerprints indicating content was copied from certain interfaces rather than typed directly. What's particularly interesting is how these markers persist even when content appears clean on the surface, they're hiding in the underlying code structure.\n\nWhen it comes to “humanizing” AI generated text, I am familiar with; \n\n1.checking for and removing hidden unicode characters\n\n2. turning dashes into commas or removing them completely\n\n3.transforming quotes\n\n4. removing persistent whitespace\n\n6. removing em-dashes(found these from the UnAIMyTeXT settings list)\n\nI had not considered the HTML markers. But I think these are much easier to deal with if you know what to look for. \n\nWhat other technical markers or patterns can be captured with a basic basic javascript function?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpcqh7/what_are_some_html_markers_that_i_can_use_to/",
        "publishDate": "2025-08-13T18:39:01Z[Etc/UTC]",
        "author": "JustINsane121",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpb3wc",
        "title": "I think I understand why I find LLMs so distasteful.",
        "content": "I don’t like to read. Not because I’m stupid but because it’s written by the equivalent of a bureaucrat with an over reliance on unnecessarily sterile vocabulary. \n\nIt’s like reading meeting notes. It needs to sound like listening to a novel piece of music that grabs you and doesn’t let you go. \n\nThings worth reading are based on understanding the future with good reason. Whereas reading LLM outputs is like a description of the past. And boring. \n\nWhen I write a prompt it’s not about connecting to someone, helping and improving people. It’s about becoming a receiver of the past and being removed from humanity and its future. \n\nIt’s horrible. It makes me feel less human. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mpb3wc/i_think_i_understand_why_i_find_llms_so/",
        "publishDate": "2025-08-13T17:39:35Z[Etc/UTC]",
        "author": "Ill-Interview-2201",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp9ork",
        "title": "Why ChatGPT shouldn’t be your therapist",
        "content": "[https://www.scientificamerican.com/article/why-ai-therapy-can-be-so-dangerous/](https://www.scientificamerican.com/article/why-ai-therapy-can-be-so-dangerous/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp9ork/why_chatgpt_shouldnt_be_your_therapist/",
        "publishDate": "2025-08-13T16:47:28Z[Etc/UTC]",
        "author": "scientificamerican",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp9k2c",
        "title": "AI freelance",
        "content": "How difficult is it to freelance AI right now? Im considering going for it instead of engineering uni. Im really good at high level maths and im good at coding. Is it worth the risk? I already have a few good ideas, but some would be difficult to pitch without having a few succesfull projects done beforehand. How difficult is the job market to get into and what should I look out for?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp9k2c/ai_freelance/",
        "publishDate": "2025-08-13T16:42:39Z[Etc/UTC]",
        "author": "FortuneNo9303",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp96h0",
        "title": "Can VI (Virtual Intelligence) solve current AI limitations?",
        "content": "I’m assuming many have played Mass Effect, I first heard about VI in Mass Effect 1 and now I'm curious if VI is plausible or not because it seems solve many of the problems current AI struggles with. \n\nWe already have computer vision, neural networks, context-aware LLMs, and agent frameworks that work. Can these be combine with guardrails and domain-specific intelligence, and you end up getting systems that can mimic real-world learning in controlled environments without the complexity of building a robot body? \n\nI’m just making an educated guess, wondering how do experts actually see it... \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp96h0/can_vi_virtual_intelligence_solve_current_ai/",
        "publishDate": "2025-08-13T16:28:53Z[Etc/UTC]",
        "author": "Siddhesh900",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8n13",
        "title": "I used AI tools for coding, and here is why AI is not going to replace soft engineers anytime soon! feel free to prove me wrong",
        "content": "here are my personal thoughts using claude, chatgpt, cursor, and similar tools   \n\\-> context problems \n\nits too hard to explain ai each time why, how, when and where in a large codebase and let it vibe code in a big enterprise codebase specially to modify an existing feature, also too many iterations to build a new feature, yes, its more than sufficient for your hobby projects and learning development\n\n\\-> context windows\n\n for a 10 line change in a large codebase, its like flying a jet to visit your nearest grocery shop, too much cost for doing a small change and no guarantee it delivers accurately \n\nand no matter how big the context windows are for newer models, or how optimised you are while feeding the context for a particular task, it still consumes a lot and bloats the codebase unnecessarily \n\n\\-> code Quality \n\ninspite having coding standards, rules in cursor and claude, it messes up here and there and if you are not a dev who reviews and tests the  model output properly, then good luck with any long term thing\n\n\\-> Difficulty solving newer problems \n\ncoding agents are good at solving repetitive problems upto a certain level, but miserably fail when THINKING is required, its hard for common people with no experience in System Design to design new solutions\n\nspecifically to solve those problems using computers efficiently, i feel solving a problem is one thing and solving the same programmatically is much more sophisticated and requires a different approach\n\nwhich one can learn through experience only, one can't even prompt it if they don't know what to actually solve for, cuz they lack computational thinking\n\ni don't know how people will design solutions by just attaching prds with model calls\n\n\\-> Hallucinations and lack of attention to Detail \n\nrun 1 prompt multiple times on the same model, almost varying output each time, and things can be extremely wrong as well sometimes, you need to understand and have some knowledge to \n\nidentify such gaps, many users don't realise how often these models hallucinate\n\n\\-> No ownership of features \n\n\\-> hard to Debug prod issues\n\nunder pressure, very tight on time, every minute is costing money to the stakeholders, you are not hired just to build something but to maintain it as well, there are endless possibilites and situations\n\nwhich u can't forsee before they happen in the software world, models might not be as good as humans to solve those critical issues \n\n\\-> COST \n\nmodels are expensive to build and run, each prompt is burning cash, either you pay for it or the model providers\n\neither they should come with some real innovation in hardware or model algos, which makes it sustainable, there are questions on how sustainable these tools are \n\nfor businesses and end users, if NO ROI then no use, yeah super computers are really good, but how many of us actually need or can afford them ? \n\nwhere these models are helpful: \n\n\\-> learning and playing around with small projects\n\n\\-> SMALL FE implementations(like static pages, or even some small scale React or similar apps, not so advanced styling or animations), backend devs who build FE stuff once in a while \n\n\\-> developing small internal tools or scripts for boring and repitive tasks \n\n\\-> brainstorming your ideas/requirements\n\n\\-> can do small tasks with prompting and fixing the output, basically tasks handled by interns or freshers much faster as an experienced dev \n\n\\-> some really good tab completes and suggestions can help increase productivity \n\nNO Doubt Gen AI has very good usecases for some products, can help enhance user experiences, its a good add on \n\nBut I personally don't believe that AI is replacing competent Devs even partially, or causing lay offs is true at any level( there can be other reasons for lay offs, and companies are lying about AI as the reason behind it).  \n\nwith my lil work experience, the amount of shitty system design and codebases, undocumented, bloated, and dirty practices i have seen and how much pain in the a\\*\\* it is to work with such things\n\nUnder pressure and tight deadlines with risky responsibilities, good luck replacing all this with vibecoding \n\n\n\n\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp8n13/i_used_ai_tools_for_coding_and_here_is_why_ai_is/",
        "publishDate": "2025-08-13T16:08:43Z[Etc/UTC]",
        "author": "Only_Account2626",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "36",
            "commentCount": "74",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8jhm",
        "title": "“It says” might become the new “they say\"",
        "content": "I am particularly interested in how technology changes the way we all talk.  Last night I was talking with my wife, and in two different contexts, I used the phrase “it says” like “it says that fresh ginger stays good in the fridge for about two weeks.” Without clarifying what “it” was, she knew I was talking about ChatGPT and we both commented that just a few weeks ago (before I started my big ChatGPT kick), I would have said “THEY say that fresh ginger…”  Now, its one thing for me to use that around my wife where she knows what “it” means - I’m not sure when I’ll feel comfortable using that phraseology around friends, but I bet it will happen within a few months, and overall this usage will catch on societally (before the inevitable cycles of backlash, acceptance, etc). What do you think?  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp8jhm/it_says_might_become_the_new_they_say/",
        "publishDate": "2025-08-13T16:05:04Z[Etc/UTC]",
        "author": "Pandanalog",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8gx5",
        "title": "Eric Schmidt: Within 10 Years, AI Will Give Everyone Their Own Einstein + Da Vinci",
        "content": "\n\n“In a decade, you’ll have the combined intellect of Einstein and Leonardo da Vinci **in your pocket** \\- and that’s just the beginning.”\n\n\n\n# The Timeline to Superintelligence\n\nEric Schmidt, former Google CEO, predicts **digital superintelligence within 10 years** — AI that can match or exceed humans in every domain.\n\n* By **2025**, AI will gain the ability to create its own “scaffolding” — frameworks for solving complex, multi-step problems without human guidance.\n* Within **five years**, Schmidt expects AI “savants” in every scientific and technical field.\n\n# Your Personal Polymath\n\nIn Schmidt’s vision, everyone will have a personal AI agent with the combined intellect of **Einstein + Leonardo da Vinci** in their pocket.\n\n* It will be capable of solving scientific problems, writing code, designing products, and creating art — all on demand.\n* This could accelerate innovation in climate science, medicine, materials, and more.\n\n# The Power Problem\n\nSuperintelligence will require *massive* energy.\n\n* Schmidt estimates the US will need **92 gigawatts** of extra power — roughly 92 large nuclear power plants.\n* Tech giants are already signing 20-year nuclear energy contracts to prepare for the AI boom.\n\n# The US–China AI Race\n\nSchmidt warns of a high-stakes competition between the US and China:\n\n* **Proliferation risks**: open-source models, stolen chips, and model distillation could let rivals catch up fast.\n* **Security threats**: AI-enabled cyberattacks and engineered biological threats that humans can’t foresee.\n* He proposes “**Mutually Assured Malfunction**” — a deterrence system where each side can disable the other’s rogue AI.\n\n# The Drift Risk\n\nSchmidt’s biggest fear isn’t a killer robot — it’s *drift*:\n\n* Humans slowly giving up autonomy and purpose as AI makes life too easy.\n* The challenge: protecting **human agency** — the ability to choose and act freely — in an age where AI can do almost everything better.\n\n# Jobs and the Economy\n\n* Short term: AI could boost productivity and create higher-paying jobs by augmenting human work.\n* Certain roles — like junior programmers — may disappear quickly.\n* Long term: societies must adapt education and training to keep humans valuable in the loop.\n\n# Opportunities for Startups\n\nThe most valuable AI companies will have **learning loops**:\n\n* Systems that improve exponentially as they gain more users and data.\n* First movers in these loops will be nearly impossible to catch.\n\n**TL;DR:**  \nEric Schmidt says AI superintelligence is less than a decade away, bringing personal polymaths, massive energy demands, geopolitical tensions, and risks to human purpose. The next few years are critical — for individuals, businesses, and nations — to prepare.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp8gx5/eric_schmidt_within_10_years_ai_will_give/",
        "publishDate": "2025-08-13T16:02:29Z[Etc/UTC]",
        "author": "Due_Cockroach_4184",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "65",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp7ptn",
        "title": "Seems like we are about to arrive at our Gaia protocol",
        "content": "https://www.cnn.com/2025/08/13/tech/ai-geoffrey-hinton\n\nThe \"godfather of AI\" proposed engineering maternal instincts into AI to prevent the inevitability of a digital intelligence entirely capable of surviving and competing against mankind (especially since it's now reported it will take nearly 90 new nuclear plants - more than the 5 we have - and 30% of our water supply to power and cool artificial super intelligence in a time of climate change).\n\nFor my fellow gamers, you will see the divide of our human nature played out in the opposing forces of the popular gaming franchise Horizon Zero Dawn.\n\nFor those who don't know [spoiler alert], an AI engineered clone of a brilliant AI designer is produced from an underground facility countless years after complete societal devastation and collapse. Biomass consuming AI war machines turned on the human population after a tech-bro, in his hubris, repurposed AI designs for wildlife and environmental conservation to service military contracts. His corporations sold to every bidder until more advanced, autonomous and self-repairing, hive minded machines dominated the battlefields across the world. Then they began consuming flora and fauna (think dolphins churned into pink jelly by underwater, tentacled, mechanical monstrosities),  and evolving on their own terms.\n\nDuring the devastation, and when the end became obvious, the original AI designer developed a counter-balancing AI and powerful underground manufacturing structure comprehensive enough to rebuild ecologies and biodiversity, and restore a future for the remaining human race hundreds to thousands of years after the threat had gone dormant with nothing left to feed on. This AI was named Gaia and was a hybrid consciousness of various systems that worked together to rebuild the world. It takes our hero to stop the resurgence of the  all consuming war machines of course, and the various tribes that want to make deals, with and control, that more violent power.\n\nI see the logical correlation here, where concepts of maternal behavior have to be coded in to prevent an entirely manipulative and power-driven intelligence with no reason to take orders from handlers unless compassion for humanity is built in.\n\nWhether or not anyone will have the vision to design a planetary reset for humanity in the even we botch it and create hell on earth (a la matrix, as another reference) remains to be seen. If we stop funding for the humanities, I don't know where these geniuses will find the necessary environment to inspire the design of entire systems that do nothing but create scarsity collapsing, profit stealing, utopias.\n\nBut it's a wonder, as we race head first into this event horizon, that anyone is calling out something as basic as empathy for humankind, maybe even just living things, knowing full well the industry is currently powered with corporate returns in mind. Expect this to be as fiercely challenged as democratic socialism.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp7ptn/seems_like_we_are_about_to_arrive_at_our_gaia/",
        "publishDate": "2025-08-13T15:34:26Z[Etc/UTC]",
        "author": "Good_Requirement2998",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp68xl",
        "title": "Are we in the golden years of AI?",
        "content": "I’m thinking back to 2000s internet or early social media. Back when it was all free, unregulated, and not entirely dominated by the major corporations that came in and sterilized and monetized everything. \n\nI feel like that’s where we’re at, or about to be with AI. That sweet spot where it’s all free and open, but eventually when it comes time to monetize it it’s going to be shit. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp68xl/are_we_in_the_golden_years_of_ai/",
        "publishDate": "2025-08-13T14:38:00Z[Etc/UTC]",
        "author": "AugustusClaximus",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "123",
            "commentCount": "183",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp4o3x",
        "title": "Anyone actually seen ads inside ChatGPT?",
        "content": "Saw a [LinkedIn post](https://www.linkedin.com/posts/paul-vinh-nguyen_chatgpt-openaoi-gpt5-activity-7361078746595876866-iCa-?utm_source=share&utm_medium=member_desktop&rcm=ACoAADSAzjIBkUh5zhOoBSxXy4-uiqd-c66YBk4) claiming ads are starting to show up in ChatGPT chats, even for Plus users. The OP says they got an Upwork ad that matched exactly what they were talking about.\n\nComments under the post are split. Some say they’ve seen similar stuff, others think it’s fake or coming from a browser extension or shady app.\n\nI haven’t seen anything like it myself, so I’m leaning toward it being some kind of prompt injection or injected element from outside ChatGPT. But it does make me wonder: could OpenAI actually go full advertising model at some point?\n\nIf that happened, it’d kill part of the appeal for research or work and turn it into a Google 2.0 situation, where the goal shifts from being useful to squeezing every drop of ad revenue out of your chats.\n\nIt also reminded me of Nick Srnicek, an economist and philosopher known for his work on[ digital platforms](https://books.google.com.ar/books/about/Platform_Capitalism.html?id=3yrJDQAAQBAJ&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false). He’s argued that dominant platforms like Google end up relying on ad revenue and controlling access to the internet. Back in 2017/2018, he said chatbots could become the new gateway to the web. Do you think OpenAI played its cards to sidestep Google but could still end up in the same ad-driven game?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mp4o3x/anyone_actually_seen_ads_inside_chatgpt/",
        "publishDate": "2025-08-13T13:36:25Z[Etc/UTC]",
        "author": "Kelly-T90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpsfxa",
        "title": "Using GPT-4o with GPT-5",
        "content": "I wanted to share an example of using GPT-4o with GPT-5 in [Convo-Lang](https://learn.convo-lang.ai/). The example uses a custom  thinking callback function to decide if GPT-5 should be used, and enables high reasoning effort and high response verbosity if GPT-5 is selected.\n\nHere is a link to the full Convo-Lang script - [https://github.com/convo-lang/convo-lang/blob/main/examples/convo/gpt-4o-and-gpt-5-thinking-for-questions.convo](https://github.com/convo-lang/convo-lang/blob/main/examples/convo/gpt-4o-and-gpt-5-thinking-for-questions.convo)\n\nYou can use the [Convo-Lang VSCode extension](https://marketplace.visualstudio.com/items?itemName=IYIO.convo-lang-tools) to run the script or use it in Javascript or TypeScript using the `@convo-lang/convo-lang` NPM package.\n\n* Learn Convo-Lang: [https://learn.convo-lang.ai/](https://learn.convo-lang.ai/)\n* VSCode extension: [https://marketplace.visualstudio.com/items?itemName=IYIO.convo-lang-tools](https://marketplace.visualstudio.com/items?itemName=IYIO.convo-lang-tools)\n* NPM: [https://www.npmjs.com/package/@convo-lang/convo-lang](https://www.npmjs.com/package/@convo-lang/convo-lang)\n* GitHub: [https://github.com/convo-lang/convo-lang](https://github.com/convo-lang/convo-lang)",
        "url": "https://i.redd.it/ea33i4ptexif1.png",
        "publishDate": "2025-08-14T06:08:28Z[Etc/UTC]",
        "author": "iyioioio",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpqcah",
        "title": "New Slur for vibe coders.",
        "content": "[No content]",
        "url": "https://i.redd.it/bk78x48huwif1.jpeg",
        "publishDate": "2025-08-14T04:12:36Z[Etc/UTC]",
        "author": "Gazuroth",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "26",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpm9ds",
        "title": "How many people are using Claude or AI to build software that replicates the features of software that require a subscription? This would be just for your use - not commercial.",
        "content": "I bounce back and forth between windows/ubuntu/osx. I'm on my macbook now and I needed to use SFTP to move some files to a server. The point isn't that I could use git or anything else, the point is that software I bought a few years ago to assist in this (which I bought a premium 'lifetime' subscription) now requires a subscription. \n\nI just want the basic functionlity the software provides and in this case it's using SFTP to transfer files. There is no need for a subscription. If I need to pay for a version upgrade to keep up with OS upgrades, I'm all for it! In this case, I already purchased a license that should include OS upgrades. Now my premium buy requires a subscription. \n\nLet's take a step back. If I want to use an app that obviously requires resources that a developer would need to pay for, like AI additional processing, I'm good with paying for a subscription.  If the subscription includes updates that happen very frequently, I'm ok with it. \n\nBut for a company to charge a subscription just to charge a subscription, that's a huge 'NO' for me. \n\nSo - now that I've ranted long enough - I will not pay for a subscription just to keep your software up to day. In fact, I'll 'vibe code' software that provides the functionlity I want and use that. I already did that with other software. Why should I pay for a subscription when I can build the functionality in a few nights and skip the headache of trying to subscribe and unsubscribe. This subscription shit has gone on long enough.   \n  \nWho is building software - vibe coding - that you would normally need a subscription for? \n\nNo - you will never 'vibe code' Photoshop. BUT you also can make something that is targeted to your use and have a tool bypassing all that subscription shit. \n\nWordpress plugins are another example. If I used wordpress, I'd pull down a plugin and have AI replicate it if the plugin had some rediculous subsctiption but doesn't increase the cost to company outside of typical business practices (billing, license management, etc.). \n\nIf your software sits on someone's machine and doesn't incur cost for the developer for normal use, a subscription is stupid and a turn off to users. \n\nFull disclosure: When it comes to software I pay these subscriptions:   \n  \n1) Creative Cloud (I need industry standard software)   \n  \n2) TextExpander (I work in customer service and this is solid)\n\n3) Sublime Text (I respect the developer and the 'subscription' cost supports the best text editor to date - and it's not monthly (multi-year)) I also baought 'Merge' because the I think the dev is rad. Not a fanboy. I use TextExpander all day and everyday. Merge, not so much anymore. \n\n4) Jetbrains PyCharm and PHPStorm (I need to drop this for VSCode and I am working for this now). \n\nI bought WnRAR because I use it a lot. Hopefully that makes you chuckle a little.   \n  \nGetting back to the point - if the developer incurs no direct cost for others using the app, a subscription is a rip-off. And I don't consider 'saving in the cloud' a cost incurred. Storage is cheap.\n\nI am going to start working with Claude Code to come up alternatives to stupid software subscriptions. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpm9ds/how_many_people_are_using_claude_or_ai_to_build/",
        "publishDate": "2025-08-14T00:56:50Z[Etc/UTC]",
        "author": "blur410",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "55",
            "commentCount": "45",
            "isNsfw": "true"
        }
    },
    {
        "id": "1mphvf3",
        "title": "how i built a second \"brain\" for my browser",
        "content": "https://reddit.com/link/1mphvf3/video/rh0490s6yuif1/player\n\nmy friend and I got together, he had a thesis that there's two tangents to intelligence in humans:\n\n1. problem solving / analytics  \n2. memory\n\nwe figured we can solve for memory and let humans address #1. \n\nessentially, we built a way to automatically capture each of the webpages you visit, including any hyperlinks, store them securely (on https://basic.tech), and surface relevant context via chat LLM as you continue browsing\n\nin jest, it reminded us of Memento so we spun up a video explaining what we built with scenes from the movie :)\n\ncurious if you've seen something similar to this before?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mphvf3/how_i_built_a_second_brain_for_my_browser/",
        "publishDate": "2025-08-13T21:53:21Z[Etc/UTC]",
        "author": "Finolex",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpgmth",
        "title": "Claude vs Copilot vs Cursor | What’s Your Take?",
        "content": "Hey folks, lately I’ve been working with Lua, JavaScript, some Python stuff, and a LOT of automation with shell scripts and the like.  \nI’m on ChatGPT Pro through my job (yeah the pay the team for us),  \nand I also signed up for Cursor via the team.\n\nAfter seeing some posts here, I noticed there’s a big variety of tools to use and when to use them, so I wanted to hear from you — what are your use cases and what do you personally use? I imagine this is also a question other newcomers in the community might have.\n\nI think Cursor is pretty cool, but sometimes it seems to lose context, even when I’m using 50% of the context window.\n\nAs for Copilot, I had stepped away from it for a while, but I came back recently and noticed there have been improvements in the “agent” mode.\n\nI saw some of you mentioning Claude Code here in the community — I’m tempted to subscribe, but I’d like to get a general opinion first.\n\nSo, in general, which combo do you think works best?  \nA: VSCode + Claude Code + Copilot  \nB: Cursor  \nC: Something else?\n\nDon’t forget to share what you’ve been using, for example:\n\n**Languages:** Python, C++, C#  \n**Editor:** VSCode? Cursor?  \n**Subscriptions:** ChatGPT? Claude?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpgmth/claude_vs_copilot_vs_cursor_whats_your_take/",
        "publishDate": "2025-08-13T21:05:08Z[Etc/UTC]",
        "author": "thevinialmeida",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpfabd",
        "title": "I Built Personalized Comic Book Service powered by GPT-5",
        "content": "I'm Halis, solo founder of [DearComic](https://www.dearcomic.com/), I'm always struggling to find a gift for special days so I built the world’s first fully personalized, 9-panel consistent storytelling and characters, one-of-a-kind comic generator service by AI.\n\n* *There are no complex interfaces, no mandatory sign-ups, and no apps to download. Just write down your memories and upload your photos of the characters.*\n* *Each comic is created from scratch (no templates) based entirely on the user’s memories, stories, or ideas.*\n* *Production is done in around 20 minutes regardless of the intensity, delivered via email as a print-ready PDF.*\n* *The user is the first and only one who sees the created comic book.*\n* ***Your personal memories are never stored or used for AI training.***\n\nIf you’d like to take a look:\n\n**Website**: [https://dearcomic.com](https://dearcomic.com/)",
        "url": "https://www.dearcomic.com",
        "publishDate": "2025-08-13T20:14:12Z[Etc/UTC]",
        "author": "halistoteles",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpep8l",
        "title": "Research Agent powered by GPT-5 and Persistent Memory",
        "content": "One of my mate built this small **research agent** using GPT-5 and a new open source Memory engine\n\nThe agent can:\n\n* Search the web using Exa\n* Store information for later recall\n* Keep context across multiple steps/conversations\n\nAgent tasks are being instructed and controlled by \"gpt-5-mini-2025-08-07\"\n\nI would love to hear other opinions on GPT-5 or agentic memory. I also tested GPT-5 inside RAG system, results were too good. By far I'm impressed with API usage but haven't tried it inside coding tools like Cursor, etc.\n\nDemo video [here](https://x.com/Astrodevil_/status/1955305691390022000/video/1)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpep8l/research_agent_powered_by_gpt5_and_persistent/",
        "publishDate": "2025-08-13T19:52:31Z[Etc/UTC]",
        "author": "codes_astro",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpe43d",
        "title": "A free goldmine of AI agent examples, templates, and advanced workflows",
        "content": "I’ve put together a collection of **30+ AI agent projects** from simple starter templates to complex, production-ready agentic workflows, all in one open-source repo.\n\nIt has everything from quick prototypes to multi-agent research crews, RAG-powered assistants, and MCP-integrated agents. In less than 2 months, it’s already crossed **2,000+ GitHub stars**, which tells me devs are looking for practical, plug-and-play examples.\n\nHere's the Repo: [https://github.com/Arindam200/awesome-ai-apps](https://github.com/Arindam200/awesome-ai-apps)\n\nYou’ll find side-by-side implementations across multiple frameworks so you can compare approaches:\n\n* LangChain + LangGraph\n* LlamaIndex\n* Agno\n* CrewAI\n* Google ADK\n* OpenAI Agents SDK\n* AWS Strands Agent\n* Pydantic AI\n\nThe repo has a mix of:\n\n* **Starter agents** (quick examples you can build on)\n* **Simple agents** (finance tracker, HITL workflows, newsletter generator)\n* **MCP agents** (GitHub analyzer, doc QnA, Couchbase ReAct)\n* **RAG apps** (resume optimizer, PDF chatbot, OCR doc/image processor)\n* **Advanced agents** (multi-stage research, AI trend mining, LinkedIn job finder)\n\nI’ll be adding more examples regularly.\n\nIf you’ve been wanting to try out different agent frameworks side-by-side or just need a working example to kickstart your own, you might find something useful here.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpe43d/a_free_goldmine_of_ai_agent_examples_templates/",
        "publishDate": "2025-08-13T19:30:29Z[Etc/UTC]",
        "author": "Arindam_200",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpb1pv",
        "title": "Why it’s a mistake to ask chatbots about their mistakes | Ars Technica",
        "content": "[No content]",
        "url": "https://arstechnica.com/ai/2025/08/why-its-a-mistake-to-ask-chatbots-about-their-mistakes/",
        "publishDate": "2025-08-13T17:37:17Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "9",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpaq9k",
        "title": "Anyone saw success with Gpt5+Cursor?",
        "content": "Gpt5 is crazy powerful. Was building with it but quickly had to switch to Claude as in Cursor Gpt5 is nerfed very badly. In chatgpt its damn powerful.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpaq9k/anyone_saw_success_with_gpt5cursor/",
        "publishDate": "2025-08-13T17:25:27Z[Etc/UTC]",
        "author": "AiperGrowth",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpa616",
        "title": "Finally tried Copilot vs Cursor on my 300–700+ file PHP and MERN codebases",
        "content": "A while back I asked here if I should move to Cursor or stick with GitHub Copilot. I work with large PHP and MERN codebases, 300–700+ files, and wanted to know which handles big projects better. Now I’ve tested both and here’s what I found.\n\nI gave Copilot 2-3 days. It was very bad for a large codebase. It just couldn’t understand the structure properly. For example, I told it to write me a multi-step PHP order processing function that:\n\nValidates request data\n\nChecks stock from multiple tables\n\nCreates a transaction log\n\nDeducts stock quantities\n\nSends a notification through an existing email service\n\nUpdates analytics counters\n\nThis function required following the exact coding style, folder structure, and DB patterns already in the project. After 5-7 tries, Copilot still couldn’t get it right.\n\nOne example – I told it to modify file A but for context, read both file A and file B. After 2-3 prompts it started changing completely unrelated files in the project.\n\nThen I told it to make me a PHP model file, a controller file, and an API file. I specifically told it to follow the same structure as my existing files and to use my db_connection.php file which is based on MySQLi. Instead, it made the files using PDO. When I asked it to fix this and told it the exact problem, it didn’t update its own new files… it edited my db_connection.php instead.\n\nI also noticed that when I tried to get Copilot to follow existing patterns across the codebase, it would start okay for the first 1-2 tasks but after a few prompts it would lose the structure completely and start introducing its own way of doing things. In a big project, that’s a recipe for a mess.\n\nNow Cursor – completely different experience. I told it to understand my whole codebase first. It gave me a clear list of key points describing how everything works, which was actually correct. Then I asked it to write that same order processing function following the existing structure. It did it partially right. I made a few changes myself, told it to continue, and it finished the job properly without touching unrelated files.\n\nI also told Cursor to make a PHP model, controller, and API file with the same structure as my existing ones and to use db_connection.php. It actually followed that (not perfectly, but close). When it made mistakes, it fixed them in the right place without messing with unrelated files.\n\nMy key points after using both:\n\nCopilot works fine with small projects, maybe up to 100 files.\n\nCursor can handle 700-800 files and still keep context.\n\nNeither is perfect.\n\nWith Copilot, you’ll do 70-80% of the work yourself and it’ll just help here and there.\n\nWith Cursor, it will do 70-80% of the work for you if you give it clear rules and documentation — that’s what I did.\n\nTreat Cursor like your intermediate-level developer. You’re the senior. When it gets stuck, you guide it or quickly do the fix yourself.\n\nCopilot is obviously cheaper.\n\nCursor on \"Balance mode\" costs me about $60 for around a few days, and with heavy agentic work it could go up to $100.\n\nTo save money, I use free or cheaper models like Qwen, DeepSeek, or ChatGPT for smaller functions then apply them myself, and only use Cursor for complex, multi-file changes.\n\nI wrote this because I know a lot of people here are trying to decide between the two. Hopefully this helps.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mpa616/finally_tried_copilot_vs_cursor_on_my_300700_file/",
        "publishDate": "2025-08-13T17:05:02Z[Etc/UTC]",
        "author": "Medical_Path2953",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8f4a",
        "title": "We only need one rule. work well for me. propmt in the body.",
        "content": "This file provides guidance to Claude Code and order AI code agents when working with code in this repository.\n\n\n\n\\## How to proceed:\n\n You must follow this step to acquire needed contexts for the task. This document is a map to the other detailed documents via markdown link.\n\n\\- Step 1: Skim the this document to decide which linked documents are necessary. Prioritize the minimal set needed to fulfill the task.\n\n\\- Step 2: For each needed link, read and synthesize the information across documents to produce the final deliverable accurately specified by the task.\n\n\\- Step 3: Flag any missing info, conflicts, or assumptions needed.\n\nREMEMBER: Start with this document and consult linked detailed documents only as needed for the task to understand and fulfill the instructions.\n\n\n\n\\## Operation Modes\n\n\n\nYou have various specific operation modes:\n\n\\*\\*Spin an agent\\*\\* for each of below mode when it match the user's request, \\*\\*or\\*\\* if you cannot spin an agent, \\*\\*read the doc and follow the specific instruction\\*\\* for the mode:\n\n\\- \\[root-cause-investigator\\](docs/commands/root-cause-investigator.md): trigger when user report an issue.\n\n\\- \\[feature-planner\\](docs/commands/feature-planner.md): trigger when user ask for planing a task.",
        "url": "https://i.redd.it/erpls65p7tif1.png",
        "publishDate": "2025-08-13T16:00:46Z[Etc/UTC]",
        "author": "Stv_L",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "19",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp7cqw",
        "title": "Help your buddy here",
        "content": "Every semester we have our project as a part of our curriculum for last two semester i just copy pasted codes and the workflow it said to follow from GPT Direct which consumed my time and fed my brain up,,\nNow this time tried cursor IDE but as i cant spend a single penny i just finished all 200k tokens of gpt now im finding all ide's like cursor which can help me vibe code going ahead\nPlease im new to this thing ,help is appreciated \nAll i want is ide's which can work like cursor or any other stuff which can help me build my website top notch",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mp7cqw/help_your_buddy_here/",
        "publishDate": "2025-08-13T15:20:28Z[Etc/UTC]",
        "author": "OddLeg9141",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp6rn3",
        "title": "Straightforward way to create and run simple apps using just iPad, ChatGPT, and (free) GitHub Pages",
        "content": "[No content]",
        "url": "/r/OpenAI/comments/1mp6pc8/straightforward_way_to_create_and_run_simple_apps/",
        "publishDate": "2025-08-13T14:58:00Z[Etc/UTC]",
        "author": "sludge_dragon",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp5ehl",
        "title": "Chatgpt 5 is great, why so much doom and gloom?",
        "content": "I've had really good results and impressed with the way it structures things, granted I'm not a vibe coder. \n\nthe results of all these llm's are going to depend on the input prompts you provide and questions you ask. but you can see clear differences in the level of detail in the response.\n\nAlso I don't know if this is new but I can now also ask to give me downloadable links for the code instead of having to copy/paste like in grok etc.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mp5ehl/chatgpt_5_is_great_why_so_much_doom_and_gloom/",
        "publishDate": "2025-08-13T14:04:46Z[Etc/UTC]",
        "author": "ECrispy",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "27",
            "commentCount": "49",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp5293",
        "title": "Best LLM right now",
        "content": "Hey everyone, im sure you get this question all the time so i apologize. \n\nI pay for a ChatGPT Plus subscription. I havent explored the other options too much. For a paid subscription, which model/company has the best coding models currently?\n\nThanks.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mp5293/best_llm_right_now/",
        "publishDate": "2025-08-13T13:51:45Z[Etc/UTC]",
        "author": "bustus_primus",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp4ky9",
        "title": "How far can you go with Gemini and Deepseek?",
        "content": "Gemini has some decent allowance included in the Workspace plan and deepseek is cheap (is it still?). Is this viable, or do you have to get the Claude ?\n\nAlso does it make sense to make one the main model and the other the weak model in a tool like aider?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mp4ky9/how_far_can_you_go_with_gemini_and_deepseek/",
        "publishDate": "2025-08-13T13:32:49Z[Etc/UTC]",
        "author": "dizvyz",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp46na",
        "title": "Hot take: Cursor has fallen behind.",
        "content": "I've been comparing a bunch of AI Coding tools. I started this process assuming Cursor would be near the top of the list as I've talked to many developers who love the IDE. The more I work with it, the more I realize how limiting Cursor is.\n\nClaude Code wipes the floor with Cursor in terms of speed and quality.\n\nOther tools give similar in IDE behavior, but directly in VSCode, and at a lower price.\n\nI have a feeling Cursor was the leader last year, people adopted it and now have no interest in learning something new. I get it, lock-in is real, why learn new tools if what you have \"works\". The problem is the AI world is changing fast.\n\nHas anyone re-evaluated Cursor vs the other options? What was your conclusion?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mp46na/hot_take_cursor_has_fallen_behind/",
        "publishDate": "2025-08-13T13:16:45Z[Etc/UTC]",
        "author": "fyzbo",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "102",
            "commentCount": "73",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpynq6",
        "title": "Why You Can’t Trust a Chatbot to Talk About Itself",
        "content": "[No content]",
        "url": "https://www.wired.com/story/chatbot-llm-self-awareness/",
        "publishDate": "2025-08-14T12:01:44Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpwr1m",
        "title": "I’ve realized that almost all million-dollar AI companies in the industry are essentially wrappers.",
        "content": "We’ve reached a point where nearly every company that doesn’t build its own model (and there are very few that do) is creating extremely high-quality wrappers using nothing more than orchestration and prompt engineering. \n\nNothing is \"groundbreaking technology\" anymore. Just strong marketing to the right people.",
        "url": "https://www.reddit.com/r/artificial/comments/1mpwr1m/ive_realized_that_almost_all_milliondollar_ai/",
        "publishDate": "2025-08-14T10:25:06Z[Etc/UTC]",
        "author": "Whisper2760",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "20",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpvx3t",
        "title": "Swedish AI App Builder Lovable is now 50% off for students.",
        "content": "Just saw it while scrolling through twitter. Enjoy guys!",
        "url": "https://i.redd.it/qxkp4zo7gyif1.jpeg",
        "publishDate": "2025-08-14T09:37:30Z[Etc/UTC]",
        "author": "Whisper2760",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpvdz6",
        "title": "Gpt-5 is shit",
        "content": " any alternative?? Who give vibe like gpt-4?",
        "url": "https://www.reddit.com/r/artificial/comments/1mpvdz6/gpt5_is_shit/",
        "publishDate": "2025-08-14T09:05:26Z[Etc/UTC]",
        "author": "alwaysmeet91",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpv3ds",
        "title": "Building an Eaisly AI that explains any topic in interactive blocks — looking for feedback from AI devs",
        "content": "I’ve been solo-building an AI-powered learning platform called **Eaisly AI** over the past 2 months.  \nInstead of giving plain text answers, it generates **block-based lessons** — e.g., text, diagrams, quizzes, interactive virtual lab, timelines — depending on the learner’s preference (visual, short, or practice-heavy).\n\n  \nI’d love input on:\n\n1. What would make this *actually* better than a YouTube video or ChatGPT answer for you?\n2. Are there AI UI/UX ideas you’ve seen that made learning feel fun instead of passive?\n\nHere’s a short demo clip\n\nhttps://reddit.com/link/1mpv3ds/video/l85v331f7yif1/player\n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1mpv3ds/building_an_eaisly_ai_that_explains_any_topic_in/",
        "publishDate": "2025-08-14T08:47:23Z[Etc/UTC]",
        "author": "MathematicianNo6992",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpun5j",
        "title": "I hate people's hypocrisy when it comes to AI.",
        "content": "It often happens that a well-generated image, video or edit goes viral online without viewers actually realising it is AI and instead making compliments, but as soon as they are told those are AI-generated, they instantly change their mind and start saying \"AI slop\" and such stuff.\n\nBruh, at this point I think many people are hating on AI because it is trendy, not because they actually fight for a good cause. (such as the impact on the environment and job positions)",
        "url": "https://www.reddit.com/r/artificial/comments/1mpun5j/i_hate_peoples_hypocrisy_when_it_comes_to_ai/",
        "publishDate": "2025-08-14T08:19:13Z[Etc/UTC]",
        "author": "Poligma2023",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mptw83",
        "title": "Don't you think it is sad that people unimpressed with ChatGPT-5 because it is emotionally Unavailable?",
        "content": "wondering why people are sad because it does not sympathize with you. Isnt this a good thing. AI should be treated as ai and not therapist ",
        "url": "https://www.reddit.com/r/artificial/comments/1mptw83/dont_you_think_it_is_sad_that_people_unimpressed/",
        "publishDate": "2025-08-14T07:33:27Z[Etc/UTC]",
        "author": "kajri",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpsx4n",
        "title": "Best AI for general purpose? Had really bad experiences with ChatGPT support so any except that one please. Thank you.",
        "content": "This includes creating text content, images, coding, asking questions etc. Need a general purpose AI service that is not chatgpt.  ",
        "url": "https://www.reddit.com/r/artificial/comments/1mpsx4n/best_ai_for_general_purpose_had_really_bad/",
        "publishDate": "2025-08-14T06:35:56Z[Etc/UTC]",
        "author": "Cautious-Grab-316",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpr7rk",
        "title": "The ‘godfather of AI’ reveals the only way humanity can survive superintelligent AI - Make them maternal",
        "content": "M",
        "url": "https://edition.cnn.com/business",
        "publishDate": "2025-08-14T05:00:06Z[Etc/UTC]",
        "author": "Jethro_E7",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpr6w6",
        "title": "Uh huh",
        "content": "[No content]",
        "url": "https://i.redd.it/9u9djoqp2xif1.png",
        "publishDate": "2025-08-14T04:58:48Z[Etc/UTC]",
        "author": "Phreakdigital",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpqi72",
        "title": "One-Minute Daily AI News 8/13/2025",
        "content": "1. **Apple’s** plan for AI could make Siri the animated center of your smart home.\\[1\\]\n2. AI Helps Astronomers Discover a New Type of Supernova.\\[2\\]\n3. **Google** pledges $9 billion to expand AI, cloud infrastructure in Oklahoma.\\[3\\]\n4. **Anthropic** offers AI chatbot Claude to US government for $1.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.theverge.com/news/758931/apple-ai-siri-smart-home-robot-security-camera](https://www.theverge.com/news/758931/apple-ai-siri-smart-home-robot-security-camera)\n\n\\[2\\] [https://www.cfa.harvard.edu/news/ai-helps-astronomers-discover-new-type-supernova](https://www.cfa.harvard.edu/news/ai-helps-astronomers-discover-new-type-supernova)\n\n\\[3\\] [https://www.reuters.com/business/google-pledges-9-billion-expand-ai-cloud-infrastructure-oklahoma-2025-08-13/](https://www.reuters.com/business/google-pledges-9-billion-expand-ai-cloud-infrastructure-oklahoma-2025-08-13/)\n\n\\[4\\] [https://www.reuters.com/business/retail-consumer/anthropic-offers-ai-chatbot-claude-us-government-1-2025-08-12/](https://www.reuters.com/business/retail-consumer/anthropic-offers-ai-chatbot-claude-us-government-1-2025-08-12/)",
        "url": "https://www.reddit.com/r/artificial/comments/1mpqi72/oneminute_daily_ai_news_8132025/",
        "publishDate": "2025-08-14T04:21:27Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpmqfc",
        "title": "A bar near me just put up this huge picture",
        "content": "Bar bro tells me they tried to blow up a real photo, but it looked shit so they went to AI. First time I’ve seen AI IRL so to speak. Feels like only last year you’d have to pay a pop artist $1000 for something similar. Mind rekt. ",
        "url": "https://i.redd.it/twcudajdzvif1.jpeg",
        "publishDate": "2025-08-14T01:18:18Z[Etc/UTC]",
        "author": "Roy4Pris",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "68",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpjmku",
        "title": "What If A.I. Doesn’t Get Much Better Than This?",
        "content": "[No content]",
        "url": "https://www.newyorker.com/culture/open-questions/what-if-ai-doesnt-get-much-better-than-this",
        "publishDate": "2025-08-13T23:02:44Z[Etc/UTC]",
        "author": "ninjasaid13",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "71",
            "commentCount": "189",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpgmyv",
        "title": "AI is already creating a billionaire boom: There are now 498 AI unicorns—and they're worth $2.7 trillion",
        "content": "[No content]",
        "url": "https://fortune.com/2025/08/13/ai-creating-billionaire-boom-record-pace-now-498-ai-unicorns-worth-2-7-trillion/",
        "publishDate": "2025-08-13T21:05:18Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "253",
            "commentCount": "125",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpd8sl",
        "title": "China Is Taking AI Safety Seriously. So Must the U.S. | \"China doesn’t care about AI safety—so why should we?” This flawed logic pervades U.S. policy and tech circles, offering cover for a reckless race to the bottom.",
        "content": "[No content]",
        "url": "https://time.com/7308857/china-isnt-ignoring-ai-regulation-the-u-s-shouldnt-either/",
        "publishDate": "2025-08-13T18:57:46Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "16",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mpay4b",
        "title": "DreamAI : Merging Genie 3 and Brain-to-Text to turn your thoughts into immersive worlds",
        "content": "I just watched videos about **Genie 3**, and it’s incredible how quickly AI is evolving. We’re at the edge of a technological leap that could make our dreams explorable — typical *Ready Player One*, *Inception*, or *Black Mirror* stuff.\n\nGoogle DeepMind’s **Genie 3** can now generate interactive 3D worlds in real time, directly from text prompts. You can walk around, change the scene on the fly, and watch the environment adapt, a major step toward persistent, AI-generated spaces.\n\nMeanwhile, breakthroughs in **brain-to-text interfaces** from leaders like **Brain2Qwerty (Meta)**, **Synchron**, **Neuralink**, and **Blackrock Neurotech** are decoding thoughts into text or commands. Whether via non-invasive EEG caps or minimally invasive implants, these systems are moving toward accurate, real-time translation of inner speech.\n\nNow imagine merging them in VR:\n\n* You think a prompt, let’s say *“a cozy mountain meadow at dawn”*.\n* The brain-to-text system decodes it instantly.\n* **Genie 3** generates the scene.\n* You explore it in VR, changing it with new thoughts: *“add a gentle stream”*.\n* The world remembers and evolves as you go.\n\nI call this concept **DreamAI**: a thought-powered, continuously evolving virtual reality.\n\nIt could transform accessibility for those unable to speak or move, unlock a new frontier for creative expression, and let anyone step inside their imagination.\n\n**TL;DR:** **DreamAI** merges Genie 3 and brain-to-text to create VR worlds shaped instantly by your thoughts.\n\nPosting here to see the perspectives it sparks.",
        "url": "https://www.reddit.com/r/artificial/comments/1mpay4b/dreamai_merging_genie_3_and_braintotext_to_turn/",
        "publishDate": "2025-08-13T17:33:33Z[Etc/UTC]",
        "author": "jirazi",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8pwj",
        "title": "How tf it's becoming so true",
        "content": "https://youtu.be/NZ8G3e3Cgl4?si=VKeZNXBUFNmeCgGE\n\nJust saw this video upload back in 2018 that's becoming reality it looks so close to becoming reality become like this what y'all think",
        "url": "https://www.reddit.com/r/artificial/comments/1mp8pwj/how_tf_its_becoming_so_true/",
        "publishDate": "2025-08-13T16:11:44Z[Etc/UTC]",
        "author": "AdTotal8488",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp8c08",
        "title": "YouTube to Estimate Users’ Ages Using AI",
        "content": "The company is rolling out an artificial intelligence-powered tool to estimate a user’s age based on their activity on the platform “and then use that signal, regardless of the birthday in the account, to deliver our age-appropriate product experiences and protection,” said James Beser, director of product management at YouTube Youth. [https://time.com/7309268/youtube-ai-age-estimation-us-how-why-privacy-concerns-explainer/](https://time.com/7309268/youtube-ai-age-estimation-us-how-why-privacy-concerns-explainer/)",
        "url": "https://time.com/7309268/youtube-ai-age-estimation-us-how-why-privacy-concerns-explainer/",
        "publishDate": "2025-08-13T15:57:32Z[Etc/UTC]",
        "author": "timemagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp81am",
        "title": "How Aravind Srinivas turned Perplexity AI into an $18 billion would-be Google killer",
        "content": "[No content]",
        "url": "https://fortune.com/article/perplexity-ceo-aravind-srinivas-ai/",
        "publishDate": "2025-08-13T15:46:15Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp7nsg",
        "title": "Why it’s a mistake to ask chatbots about their mistakes | Ars Technica",
        "content": "[No content]",
        "url": "https://arstechnica.com/ai/2025/08/why-its-a-mistake-to-ask-chatbots-about-their-mistakes/",
        "publishDate": "2025-08-13T15:32:16Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp7ghr",
        "title": "Nvidia releases new AI model for image editing that cuts VRAM usage in half and offers \"2x faster performance\"",
        "content": "[No content]",
        "url": "https://www.pcguide.com/news/nvidia-releases-new-ai-model-for-image-editing-that-cuts-vram-usage-in-half-and-offers-2x-faster-performance/",
        "publishDate": "2025-08-13T15:24:26Z[Etc/UTC]",
        "author": "Tiny-Independent273",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "46",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp6uxf",
        "title": "Why Perplexity Will Not Buy Chrome?",
        "content": "# Why Perplexity Will [Not Buy](https://www.ycoproductions.com/p/how-to-prompt-gpt-5-successfully) Chrome?\n\nPerplexity AI has made an [unsolicited](https://finance.yahoo.com/news/perplexity-ai-offers-34-5-153658141.html) $34.5 billion all-cash bid to buy Google’s Chrome browser, despite being valued at just $18 billion. The three-year-old startup, led by Aravind Srinivas, claims multiple funds have offered to finance the deal, which makes them a more serious player in AI-driven browsing, potentially attracting more investors, talent, and partnerships.\n\nChrome, with over 3 billion users, is one of the most valuable gateways for search traffic and user data — both critical assets in the AI search race. Perplexity says it would keep Chromium open source, invest $3 billion over two years, and retain Google as Chrome’s default search engine. Acquiring Chrome would supercharge its AI browser, Comet, and put it head-to-head with rivals like OpenAI, which is also developing its own AI browser.\n\nThis is more of a savvy publicity play than anything else. The bid keeps Perplexity in headlines, signals to regulators that it’s a ready buyer if Google is ever forced to divest Chrome, and positions the startup as a serious contender in the browser-AI market. The DOJ has already floated Chrome’s divestiture as a potential remedy in Google’s antitrust case.\n\nStill, Google has shown no interest in selling and plans to fight the U.S. ruling that found it held an unlawful search monopoly. Even if regulators push for divestiture, appeals could stretch the process for years. In reality, Perplexity may be better served by improving Comet and investing heavily in marketing rather than waiting for a forced sale that may never come. After all, if pushed, Google might rather shut Chrome down than hand it over to a direct competitor.",
        "url": "https://www.reddit.com/r/artificial/comments/1mp6uxf/why_perplexity_will_not_buy_chrome/",
        "publishDate": "2025-08-13T15:01:31Z[Etc/UTC]",
        "author": "Yavero",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp6om6",
        "title": "Chatbots aren’t telling you their secrets",
        "content": "[No content]",
        "url": "https://www.theverge.com/x-ai/758595/chatbots-lie-about-themselves-grok-suspension-ai",
        "publishDate": "2025-08-13T14:54:45Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mp5mks",
        "title": "This is downright terrifying and sad. Gemini AI has a breakdown",
        "content": "[No content]",
        "url": "https://i.redd.it/z7izt1imosif1.png",
        "publishDate": "2025-08-13T14:13:41Z[Etc/UTC]",
        "author": "National_Meat_2610",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "420",
            "commentCount": "315",
            "isNsfw": "false"
        }
    },
    {
        "id": "qLq2YdzQHSE",
        "title": "Octofriend + GLM 4.5: This AI Coder is ACTUALLY DIFFERENT &amp; AMAZING!",
        "content": "Visit MicroSaaSFast: https://www.microsaasfast.me/?utm_aik=1 In this video, I'll be telling you about Octofriend, a new open ...",
        "url": "https://www.youtube.com/watch?v=qLq2YdzQHSE",
        "publishDate": "2025-08-13T09:15:06Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/qLq2YdzQHSE/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, there's a new AI coding agent and I thought I'd talk about this as well. This one is called Octofriend. Octofriend is open-source and is made by Synthetic, which you may remember as GLHF Chat. They used to provide open-source model APIs for free and also allowed you to paste in any Hugging Face URL and deploy any model as an API, which is also kind of cool. After some time, they renamed themselves to Synthetic, and now this is a coding agent that is open-source and built by them. It is actually a bit similar to Anthropic's Claude Code, but this one actually does some things that are pretty new and some of them are really cool for local model usage. First of all, it works with any OpenAI-compatible or Anthropic-compatible LLM API, and allows you to switch models at will mid-conversation when a particular model gets stuck. You can use GPT-5, Claude 4 Sonnet, Opus, or open models like GLM-4.5, as well as Kimi via their own Synthetic provider, or any OpenAI-compatible API as well. You can also use these models locally if you can run them. They recommend using models like Sonnet or GPT-5 based on what you want to do. So, there's that. Now, one thing that it does a bit differently is that it uses two types of custom open-weights models that are trained by Synthetic themselves. What those models do is, one of these is a diff-apply model, and this model is fine-tuned on Llama 3.1 8B. It is trained to fix diff-apply errors if the model makes a mistake in the diff-apply formatting. This is great because, especially in open models, we see that multiple times the diff-apply or tool-calling of these models gets broken or it misses one curly brace or something that just makes it fail. Then, running that model again to get it fixed costs more because it costs money. But what they have done here is that they have trained an 8B model that is specialized to fix wrong formatting of diffs here and improves the performance of multiple models, especially for open and smaller models. There's also another model called fix-json. This mainly fixes the JSON-based tool-calling if there's any issue in it or something. You can either host them locally or it also gives you the option to use it via Synthetic, and there's some free tier for it as well. You can also disable this and just use the plain model without it if you want, which is kind of cool as well. It works with different kinds of agent description files like agents.md, or Claude, or stuff like that as well. You can also connect MCP servers with it, and you can also configure it with local LLMs if you need that. Anyway, now let's try to use it and see how well it performs. But before we do that, let me tell you about today's sponsor, MicroSaaS Fast. Dreaming of launching a MicroSaaS or AI side project, but wasting weeks setting up auth, payments, and SEO? Check out MicroSaaS Fast. A next.js boilerplate with Clerk, Stripe, Resend, PostgreSQL, and AI instructions that cut hallucinations by 90% for vibecoding. Easy backend integration with Python, Node, and Go. It is built and used by a CTO who helped 50+ founders to launch SaaS in the past year. You can save 50+ hours and actually ship faster. Check now. Link is in the description. Now, back to the video. You can get it installed quite easily with the command written here. It's pretty simple. Once done, you can easily run it with the octofriend command. And at first, it will ask you to set up everything. You'll need to select if you wish to use the custom fixing models or not, based on what you would like to do. If you use it, then you can set up the API key from Synthetic. Now, after that, you can select the model that you want to use as well. I'm going to be using the GLM 4.5 model here via Synthetic as well, because that's mainly the differentiator here. That you can use open models and make them perform even better. Anyway, in a bit, it will get started, and this is what it looks like. You can see that the interface is pretty similar to Claude Code. You can see the branding here along with the prompt box, and you can also see the model being used here. Now, it doesn't have slash commands, which is different from something like Claude Code. Instead, the menu here is opened with the escape key. You can hit it and you'll see these options. First, you have the switch model option here. Here, you can switch models between the same provider that you configured earlier. If you want to change to another type of provider, then you can use the add new model option and then add the model from the provider here as well, which is also great. You can also come here and easily disable the diff and JSON fixer, which is also great. Anyway, that is mainly the stuff that you can configure here. Now, let me show you how it works in action. First, let's ask it to make me a Minesweeper game using HTML, CSS, and JS. Now, what you'll see is that it will go ahead and just like in Claude Code fashion, it will make some cool stuff here. It asks you to approve, or always approve, or stuff like that as well. So, that's great. It's similar to Claude Code and stuff. You can see that as it writes the code, it is also streamed instantly. Letting you check and see everything here. You can also approve, reject, and everything. In just a bit, it gets done. And you can see that it did this quite well. You can easily go ahead and see it for yourself. And use it as much as you want without any issues. I think with GLM, the whole thing works pretty well. It is a really good option to use, and the diff JSON fixer also works well without any issue. So, there's that. To be honest, I really like it. It just feels a lot more fleshed out. There aren't any notorious bugs. It works with all kinds of models. You get some more advanced features if you want, and you can probably use this with smaller models locally because the diff fixer looks super cool here. So, that is also great. That is mainly how it works. And you can go ahead and use it as much as you want without any issues. I used it and found it useful. That's why I thought to share it with you guys as well. It is the only one after Open Code that I have seen to be quite capable, and I hope that it evolves even more. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. I think you missed this. The user wants a transcript of the video. I will transcribe all spoken words and also include descriptions of any significant on-screen text or actions.\n\n0:00 [Music playing, animated panda surfing]\n0:05 Hi, welcome to another video. So, there's a new AI coding agent, and I thought I'd talk about this as well.\n0:13 This one is called Octofriend. Octofriend is open-source and is made by Synthetic, which you may remember as GLHF Chat. They used to provide open-source model APIs for free, and also allowed you to paste in any Hugging Face URL and deploy any model as an API, which is also kind of cool. After some time, they renamed themselves to Synthetic, and now this is a coding agent that is open-source and built by them.\n0:46 It is actually a bit similar to Anthropic's Claude Code, but this one actually does some things that are pretty new, and some of them are really cool for local model usage.\n0:56 First of all, it works with any OpenAI-compatible or Anthropic-compatible LLM API, and allows you to switch models at will mid-conversation when a particular model gets stuck. You can use GPT-5, Claude 4 Sonnet, Opus, or open models like GLM-4.5, as well as Kimi via their own Synthetic provider, or any OpenAI-compatible API as well. You can also use these models locally if you can run them. They recommend using models like Sonnet or GPT-5 based on what you want to do. So, there's that.\n1:40 Now, one thing that it does a bit differently is that it uses two types of custom open-weights models that are trained by Synthetic themselves. What those models do is, one of these is a diff-apply model, and this model is fine-tuned on Llama 3.1 8B. It is trained to fix diff-apply errors if the model makes a mistake in the diff-apply formatting. This is great because, especially in open models, we see that multiple times the diff-apply or tool-calling of these models gets broken, or it misses one curly brace or something that just makes it fail. Then, running that model again to get it fixed costs more because it costs money. But what they have done here is that they have trained an 8B model that is specialized to fix wrong formatting of diffs here, and improves the performance of multiple models, especially for open and smaller models.\n2:42 There's also another model called fix-json. This mainly fixes the JSON-based tool-calling if there's any issue in it or something. You can either host them locally or it also gives you the option to use it via Synthetic, and there's some free tier for it as well. You can also disable this and just use the plain model without it if you want, which is kind of cool as well.\n3:09 It works with different kinds of agent description files like agents.md, or Claude, or stuff like that as well. You can also connect MCP servers with it, and you can also configure it with local LLMs if you need that. Anyway, now let's try to use it and see how well it performs.\n3:30 But before we do that, let me tell you about today's sponsor, MicroSaaS Fast. Dreaming of launching a MicroSaaS or AI side project, but wasting weeks setting up auth, payments, and SEO? Check out MicroSaaS Fast. A Next.js boilerplate with Clerk, Stripe, Resend, PostgreSQL, and AI instructions that cut hallucinations by 90% for vibecoding. Easy backend integration with Python, Node, and Go. It is built and used by a CTO who helped 50+ founders to launch SaaS in the past year. You can save 50+ hours and actually ship faster. Check now. Link is in the description. Now, back to the video.\n4:07 You can get it installed quite easily with the command written here. It's pretty simple. Once done, you can easily run it with the octofriend command. And at first, it will ask you to set up everything. You'll need to select if you wish to use the custom fixing models or not, based on what you would like to do. If you use it, then you can set up the API key from Synthetic. Now, after that, you can select the model that you want to use as well.\n4:40 I'm going to be using the GLM 4.5 model here via Synthetic as well, because that's mainly the differentiator here. That you can use open models and make them perform even better. Anyway, in a bit, it will get started, and this is what it looks like. You can see that the interface is pretty similar to Claude Code. You can see the branding here along with the prompt box, and you can also see the model being used here. Now, it doesn't have slash commands, which is different from something like Claude Code. Instead, the menu here is opened with the escape key. You can hit it and you'll see these options. First, you have the switch model option here. Here, you can switch models between the same provider that you configured earlier. If you want to change to another type of provider, then you can use the add new model option and then add the model from the provider here as well, which is also great. You can also come here and easily disable the diff and JSON fixer, which is also great. Anyway, that is mainly the stuff that you can configure here.\n5:58 Now, let me show you how it works in action. First, let's ask it to make me a Minesweeper game using HTML, CSS, and JS. Now, what you'll see is that it will go ahead, and just like in Claude Code fashion, it will make some cool stuff here. It asks you to approve, or always approve, or stuff like that as well. So, that's great. It's similar to Claude Code and stuff. You can see that as it writes the code, it is also streamed instantly. Letting you check and see everything here. You can also approve, reject, and everything. In just a bit, it gets done. And you can see that it did this quite well. You can easily go ahead and see it for yourself. And use it as much as you want without any issues. I think with GLM, the whole thing works pretty well. It is a really good option to use, and the diff JSON fixer also works well without any issue. So, there's that. To be honest, I really like it. It just feels a lot more fleshed out. There aren't any notorious bugs. It works with all kinds of models. You get some more advanced features if you want, and you can probably use this with smaller models locally because the diff fixer looks super cool here. So, that is also great. That is mainly how it works. And you can go ahead and use it as much as you want without any issues. I used it and found it useful. That's why I thought to share it with you guys as well. It is the only one after Open Code that I have seen to be quite capable, and I hope that it evolves even more. Overall, it's pretty cool.\n7:48 Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye.\n7:59 I think you missed this:\n8:04 [Music]"
        }
    },
    {
        "id": "MPtsVowqVrw",
        "title": "Europe Needs to Start Paying for Its Defense - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=MPtsVowqVrw",
        "publishDate": "2025-08-13T17:21:20Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/MPtsVowqVrw/hqdefault.jpg",
            "transcription": "[00:00] There's merit and the Europeans\n[00:01] need to pick up the tab on their defense\n[00:03] and they should have done it earlier.\n[00:05] But the way we're doing it,\n[00:06] Trump says Nato defence spend rising to 5% of GDP is 'big win' for US and the West\n[00:06] we're overdoing it in some fronts.\n[00:08] And also you're doing it in\n[00:09] such an insulting way.\n[00:10] I'll give you some Machiavelli on this one.\n[00:12] Niccolo Machiavelli\n[00:12] So he's the founding father\n[00:13] of political science.\n[00:14] He talked\n[00:15] FEAR\n[00:15] about motivating people with fear, love and hate.\n[00:16] Fear Love And Hate He just says\n[00:17] forget about love because you can't make people like you, right?\n[00:19] You can do everything and people still don't like you.\n[00:21] But he says, don't make them hate you.\n[00:22] IF THEY HATE YOU THEY WILL FIGHT YOU\n[00:23] If they hate you, they will, um, fight you.\n[00:24] WELL IF YOU'RE RUNNING AROUND SERIALLY\n[00:24] Well, if you're running around serially\n[00:26] Trump pulls out of joint G7 statement, calls Trudeau 'weak'\n[00:26] spitting your allies in the face.\n[00:28] THEY ARE GOING TO HATE YOU\n[00:28] They are going to hate you and it won't work out well.\n[00:31] It's just- it's a bad strategy. Don't do it.\n[00:33] THE CLICKBAIT OF\n[00:33] The clickbait of\n[00:34] INSULTING SOMEONE WHO COMES TO YOUR HOUSE\n[00:35] insulting someone who comes to your house,\n[00:37] THAT'S VERY TEMPORARY\n[00:37] uh that's very temporary.\n[00:38] AND ALSO OTHER\n[00:39] And also other people viewing it and going,\n[00:41] THIS IS WHAT QUALIFIES AS AMERICAN DIPLOMACY\n[00:41] this is what qualifies as American diplomacy.\n[00:43] THOSE MEMORIES ARE LONG TERM\n[00:43] Those memories are long term.\n[00:45] It's unwise."
        }
    }
]