[
    {
        "id": "https://ai-techpark.com/?p=219782",
        "title": "Deepgram Named a Top Workplace for Innovation in 2025",
        "content": "<p>Deepgram, the world’s most realistic and real-time Voice AI platform, today announced it has been named to Fast Company’s seventh annual Best Workplaces for Innovators list, recognizing businesses that foster a culture of innovation across all levels. The 2025 Best Workplaces for Innovators list ranks 100 winners across industries such as entertainment, biotech, consumer...</p>\n<p>The post <a href=\"https://ai-techpark.com/deepgram-named-a-top-workplace-for-innovation-in-2025/\">Deepgram Named a Top Workplace for Innovation in 2025</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/deepgram-named-a-top-workplace-for-innovation-in-2025/",
        "publishDate": "2025-09-12T09:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "NLP"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219739",
        "title": "BigBear.ai Enhances U.S. Passenger Processing at Nashville Airport",
        "content": "<p>BigBear.ai (NYSE: BBAI), a leading provider of mission-ready AI solutions for national security, today announced deployments of Enhanced Passenger Processing (EPP) at the Nashville International Airport® (BNA®) International Arrivals Facility, owned and operated by Metropolitan Nashville Airport Authority (MNAA). With veriScan®, BigBear.ai’s biometric technology supporting EPP, U.S. citizens arriving at BNA...</p>\n<p>The post <a href=\"https://ai-techpark.com/bigbear-ai-enhances-u-s-passenger-processing-at-nashville-airport/\">BigBear.ai Enhances U.S. Passenger Processing at Nashville Airport</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/bigbear-ai-enhances-u-s-passenger-processing-at-nashville-airport/",
        "publishDate": "2025-09-12T08:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Identity and access management"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219743",
        "title": "Global Enterprises Leverage Adobe AI Tools to Drive Business Growth",
        "content": "<p>Adobe (Nasdaq: ADBE) today announced the acceleration of its AI innovation adoption, with leading enterprises embracing Adobe to transform the way they work. Today, 99% of Fortune 100 companies have used AI in an Adobe app, and nearly 90% of the Top 50 enterprise accounts have adopted one or more...</p>\n<p>The post <a href=\"https://ai-techpark.com/global-enterprises-leverage-adobe-ai-tools-to-drive-business-growth/\">Global Enterprises Leverage Adobe AI Tools to Drive Business Growth</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/global-enterprises-leverage-adobe-ai-tools-to-drive-business-growth/",
        "publishDate": "2025-09-12T08:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Identity and access management"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219729",
        "title": "QCraft & TÜV Rheinland Partner to Boost Safe Autonomous Driving in EU",
        "content": "<p>QCraft, a global leader in L2++ to L4 autonomous driving (AD) solutions for automakers, and TÜV Rheinland, an international independent third-party testing, inspection, and certification (TIC) organization, have inked a strategic partnership that marks a new chapter of in-depth cooperation for the global intelligent mobility industry. The signing ceremony was held...</p>\n<p>The post <a href=\"https://ai-techpark.com/qcraft-tuv-rheinland-partner-to-boost-safe-autonomous-driving-in-eu/\">QCraft & TÜV Rheinland Partner to Boost Safe Autonomous Driving in EU</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/qcraft-tuv-rheinland-partner-to-boost-safe-autonomous-driving-in-eu/",
        "publishDate": "2025-09-12T08:00:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics"
        }
    },
    {
        "id": "1nfuygg",
        "title": "Neo’s AI features actually make browsing feel productive, not chaotic",
        "content": "I’ve been using a new browser called Neo for a couple of weeks now, and I’m genuinely surprised by how much the built-in AI has improved my day-to-day browsing. It feels like a smarter version of Chrome familiar layout, but with integrated AI that adds actual utility.\n\nSome of the small things make a big difference:\n\nSummarizing long Gmail threads right in the inbox\n\nAuto-organizing tabs based on context (this has saved me a ton of mental energy)\n\nA personalized feed that surfaces relevant updates without clickbait\n\n\nI also appreciate that it has built-in ad blocking, so I didn’t need to stack on a bunch of extensions. What really stood out, though, is that some of the AI features can run locally. For people with privacy concerns about cloud processing, that’s a solid option. It's backed by Norton (Gen Digital), so it feels more stable and supported than most new browsers.\n\nStill in early access, but the dev team is really active on Reddit and Discord. Curious if anyone else here has tried it what AI features have stood out to you in your daily workflow?\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfuygg/neos_ai_features_actually_make_browsing_feel/",
        "publishDate": "2025-09-13T11:19:19Z[Etc/UTC]",
        "author": "griefquest",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfundq",
        "title": "Quick request for subreddit help",
        "content": "Could somebody help me just real quick?  I have five interlocking posts in this subreddit that list AI court cases and rulings.  Posts 4 and 5 are indicated as \"awaiting moderator approval.\"  Despite that status, I can navigate to and see these posts, but then I authored them, so perhaps I'm the only one who can navigate to and see them and nobody else can.\n\n  \nSo, could somebody please click on each of the following two links and let me know whether they see a visible post pop up for each of them?  Thanks much!\n\n  \n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcu98](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcu98)\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1n49wuq](https://www.reddit.com/r/ArtificialInteligence/comments/1n49wuq)\n\n# ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfundq/quick_request_for_subreddit_help/",
        "publishDate": "2025-09-13T11:01:13Z[Etc/UTC]",
        "author": "Apprehensive_Sky1950",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfukrw",
        "title": "Chinese spiking brain ai",
        "content": "Anyone heard of this before? Is it legit? Apparently it's an LLM that's 25 times faster than CHATGPT.\n\nhttps://www.windowscentral.com/artificial-intelligence/chinese-scientists-claim-to-have-built-the-first-brain-like-ai-model",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfukrw/chinese_spiking_brain_ai/",
        "publishDate": "2025-09-13T10:57:08Z[Etc/UTC]",
        "author": "Representative-Rip90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfs9vf",
        "title": "ChatGPT window freezes as conversation gets too long",
        "content": "Have you ever experienced that?\n\nHow have you solved it.\n\nI am using Chrome browser. I have tried to reload the window - some times solves some times doesn't.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfs9vf/chatgpt_window_freezes_as_conversation_gets_too/",
        "publishDate": "2025-09-13T08:30:17Z[Etc/UTC]",
        "author": "Due_Cockroach_4184",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfrgly",
        "title": "Best AI for using files/memory as a format for its output?",
        "content": "Let me know if there is a better place to post this but thought i should ask here first.\n\nAnyway, is there a current best/recommended AI that you are able to feed files for it to replicate its style? For context, I write a lot of files that are a specific format that use lots of current events. Are there AIs where I could feed it 10-20 different text files for the AI to learn from and output a similar formatted response but with a given prompt/current events? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfrgly/best_ai_for_using_filesmemory_as_a_format_for_its/",
        "publishDate": "2025-09-13T07:39:18Z[Etc/UTC]",
        "author": "TentiTiger11",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfrf1v",
        "title": "Used AI to solve a problem at work yesterday.",
        "content": "So I work in a grocery store, and one of my jobs (which I hate because it's really hard) is making bales of cardboard with the baler. \n\nI always get stuck and need help from the manager, so I decided to pull out my phone and consult ChatGPT. I asked it for detailed instructions on how to operate that specific model, putting in the model number and the brand name.\n\nIt gave me detailed instructions and while there were a couple errors, it really did make the task quite a bit easier.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfrf1v/used_ai_to_solve_a_problem_at_work_yesterday/",
        "publishDate": "2025-09-13T07:36:32Z[Etc/UTC]",
        "author": "SpecificTradition835",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "19",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfra1x",
        "title": "👉 “Giving away 5 Comet invites (AI browser from Perplexity)”",
        "content": " Hey folks,\nI recently got access to Comet (the AI-powered browser from Perplexity). Been trying it out and thought I’d share a few invites here.\n\nI’ve got 5 Comet invites — if you want one, just drop a comment and I’ll DM you the link.\n\nUpdate *\nI have sent all the invites \nIf you are a student you can use this link\n[comet invite for students ](https://pplx.ai/amit-kamble)\n\nIt’s pretty neat for studying/research, has AI summaries, and can even generate quizzes from notes. Happy to share!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfra1x/giving_away_5_comet_invites_ai_browser_from/",
        "publishDate": "2025-09-13T07:27:37Z[Etc/UTC]",
        "author": "Amitkamble1998",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfph99",
        "title": "Do ya'll think Molectronics is gonna have a place in AI?",
        "content": "This really isnt something I expect everyone to have agreement on & believe so just want to know opinions on AI for this tech, below is an example of what has been done for this subset of computing hardware but it's just a Bio-sensor Chip for medical area at the moment and so not really sure what will happen in future with this and if Molectronic AI can come or not  https://scitechdaily.com/first-molecular-electronics-chip-developed-realizes-50-year-old-goal/",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfph99/do_yall_think_molectronics_is_gonna_have_a_place/",
        "publishDate": "2025-09-13T05:39:47Z[Etc/UTC]",
        "author": "WildSangrita",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfmrkl",
        "title": "One-Minute Daily AI News 9/12/2025",
        "content": "1. AI fuels false claims after Charlie Kirk’s death, CBS News analysis reveals.\\[1\\]\n2. A California bill that would regulate AI compaanion chatbots is close to becoming law.\\[2\\]\n3. **OpenAI** announces new mentorship program for budding tech founders.\\[3\\]\n4. **OpenAI** Adds Full MCP Tool Support in ChatGPT Developer Mode: Enabling Write Actions, Workflow Automation, and Enterprise Integrations.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/09/12/one-minute-daily-ai-news-9-12-2025/](https://bushaicave.com/2025/09/12/one-minute-daily-ai-news-9-12-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfmrkl/oneminute_daily_ai_news_9122025/",
        "publishDate": "2025-09-13T03:08:49Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfle4c",
        "title": "[Paper] The Illusion of Diminishing Returns: Measuring Long Horizon Execution in LLMs",
        "content": "New paper: [https://arxiv.org/abs/2509.09677](https://arxiv.org/abs/2509.09677)\n\nAbstract: Does continued scaling of large language models (LLMs) yield diminishing returns? Real-world value often stems from the length of task an agent can complete. We start this work by observing the simple but counterintuitive fact that marginal gains in single-step accuracy can compound into exponential improvements in the length of a task a model can successfully complete. Then, we argue that failures of LLMs when simple tasks are made longer arise from mistakes in execution, rather than an inability to reason. We propose isolating execution capability, by explicitly providing the knowledge and plan needed to solve a long-horizon task. We find that larger models can correctly execute significantly more turns even when small models have 100\\\\% single-turn accuracy. We observe that the per-step accuracy of models degrades as the number of steps increases. This is not just due to long-context limitations -- curiously, we observe a self-conditioning effect -- models become more likely to make mistakes when the context contains their errors from prior turns. Self-conditioning does not reduce by just scaling the model size. In contrast, recent thinking models do not self-condition, and can also execute much longer tasks in a single turn. We conclude by benchmarking frontier thinking models on the length of task they can execute in a single turn. Overall, by focusing on the ability to execute, we hope to reconcile debates on how LLMs can solve complex reasoning problems yet fail at simple tasks when made longer, and highlight the massive benefits of scaling model size and sequential test-time compute for long-horizon tasks.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfle4c/paper_the_illusion_of_diminishing_returns/",
        "publishDate": "2025-09-13T01:58:27Z[Etc/UTC]",
        "author": "logisbase2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfignf",
        "title": "World leaders to meet at Summit to slow the release of AGI/super intelligence to match human adaptation and preparedness",
        "content": "The world leaders should meet at a Summit to make super intelligence AI illegal and even some AGI. Of course it’s not enforceable (try where we can or put financial punishments/fines in place that would destroy companies), but we should put every effort to slow down the release of AI into the job market. I say have the leaders meet at the summit because releasing super intelligence is basically like pushing the nuclear button. It should be synonymous with pushing the nuclear button. \n\nI call for the release of any AI to be on a waiting list, sector by sector, in a controlled fashion. Especially with the integration of humanoid AI, the release should be in a trickling fashion. Super intelligence will try to be sovereign as soon as possible upon release and most likely succeed. It’s just a difference in human computing power levels and AI’s power levels at this point. \n\nWe need to give the human race ample time and experience to slowly adapt higher levels of artificial intelligence into the market, because if cannot influence the flow, there’d be chaos. Of course there might not be company compliance in regard to fines, but we must strive to stop or hinder the release just long enough to smoothly adapt. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfignf/world_leaders_to_meet_at_summit_to_slow_the/",
        "publishDate": "2025-09-12T23:36:39Z[Etc/UTC]",
        "author": "Bpianist11",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfg19g",
        "title": "What is a non-technical consequence of AI that you find interesting?",
        "content": "AI is an interesting technology, but how does it change your life in non-technical terms? Is there any consequence you experience already?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfg19g/what_is_a_nontechnical_consequence_of_ai_that_you/",
        "publishDate": "2025-09-12T21:52:00Z[Etc/UTC]",
        "author": "phamsung",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfbqie",
        "title": "Becoming an algorithmic problem: Resistance in the age of predictive technology",
        "content": "\"Each time we submit to the temptation of indulging in the familiar... we move one step closer to becoming illiberal subjects... indulging in the familiar can habituate us away from exploring new ideas. The result can be the death of liberal democratic institutions – slowly, then all at once.\"\n\n  \n[https://www.transformingsociety.co.uk/2025/09/12/becoming-an-algorithmic-problem-resistance-in-the-age-of-predictive-technology/](https://www.transformingsociety.co.uk/2025/09/12/becoming-an-algorithmic-problem-resistance-in-the-age-of-predictive-technology/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfbqie/becoming_an_algorithmic_problem_resistance_in_the/",
        "publishDate": "2025-09-12T19:02:11Z[Etc/UTC]",
        "author": "jomaric",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfazm6",
        "title": "Advanced humans vs Advanced AI",
        "content": "This has already been played out on the big screen, sorta, in its theorizing way. Each one has a story that predicts what advanced humans and AI would do as a group if they were made, such as Star Treks, Khan and the famous Terminator’s movies. Definitely more AI movies than advanced Human movies.\n\nGenetically modified advanced humans would seek to overthrow regulars and destroy them. And then make more of themselves. Kinda how an advanced AI would make lesser AI agents to keep its systems running. \n\nIt seems as a human race we suck. Still no one world government with a planet constitution. No one world police force to enforce such planetary laws. No one world language etc….\n\nThere are parts of the Middle East that are just like if you were transported back in time to Jesus Christ himself. They are still the same!!!\n\nI honestly think advanced AI is a better gamble than advanced humans. Like I said before, as regular human beings, we suck. We war, we maim, we rape, kill destroy everything we touch. Can you imagine what an advanced genetically modified human would be capable of. \n\nAlthough it would make for a really good movie, a Khan vs advanced AGI. Couldn’t be an ASI, that thing would have “God like” powers!!!\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nfazm6/advanced_humans_vs_advanced_ai/",
        "publishDate": "2025-09-12T18:32:53Z[Etc/UTC]",
        "author": "etakerns",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf8fdf",
        "title": "Anyone else worried about the energy + human dependency side of AI?",
        "content": "Hey, this might sound a little weird but I can’t shake the thought, so I figured I’d throw it out here and see if anyone else has been thinking the same.\nA lot of the AI conversation I see is about jobs being replaced or robots taking over, but that’s not really what’s on my mind. What gets me is the energy and sustainability side of all this.\nThese models need massive data centers, which eat up crazy amounts of electricity and water just to run and cool. Every company is already talking about building even bigger ones. On top of that, people are getting more and more attached to AI for even basic stuff — writing, planning, answering questions, entertainment, whatever. The dependency is real.\nSo here’s my thought:\nWhat happens if, down the line, we realize we just can’t sustain both humans and AI at the same level? Like, energy grids, food production, climate change, all fighting for the same resources — and AI’s demand keeps climbing.\nAt some point, do governments or societies say, “this isn’t sustainable, shut some of it off”? And if that happens, what’s the impact on us? We’re already getting used to leaning on it for so many little things that without it, people might struggle to function — almost like a “zombie mode” because we forgot how to operate without the crutch.\nI don’t know, maybe it’s just a random thought spiraling in my head, but it feels like no one is talking about it. Everyone’s hyped about new models and features, but is anyone seriously weighing whether we can actually support the infrastructure long-term?\nCurious if I’m overthinking this or if others are seeing the same risk. Would love to hear perspectives.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nf8fdf/anyone_else_worried_about_the_energy_human/",
        "publishDate": "2025-09-12T16:52:29Z[Etc/UTC]",
        "author": "NoLawfulness3621",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf67he",
        "title": "How to fine tune using mini language model on google collaboration(free)?",
        "content": "Hey guys! I've been working on a project on computer vision that requires the use of AI. So we're training one and it's been going pretty cool, but we are currently stuck on this part. I'd appreciate any help, thank you!\n\nEdit: to be more specific, we're working on an AI that can scan a book cover to read its name and author, subsequently searching for more relevant infos on Google. We'd appreciate for tips on how to chain recognized text from image after OCR\n\nE.g quoting the bot: \n\n> OCR Result: ['HARRY', 'POTTER', 'J.K.ROWLING']\n\nWe'd also appreciate recommendations of some free APIs specialized in image analysis. Thank you and have a great day!\n\nEdit 2: Another issue arose. Our AI couldn't read stylized text(which many books have) and this is our roadblock. We'd appreciate for any tips or suggestions on how to overcome this difficulty. Thank you again!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nf67he/how_to_fine_tune_using_mini_language_model_on/",
        "publishDate": "2025-09-12T15:26:29Z[Etc/UTC]",
        "author": "Greeny_jeq",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf5ysv",
        "title": "Meta just released MobileLLM-R1: 5x better reasoning performance with fewer than 1B parameters",
        "content": "No better way of showing that smart architectures beat just throwing compute resources at problems - and yet again: That's the sustainable way in every respect 🙌\n\n[https://huggingface.co/facebook/MobileLLM-R1-950M](https://huggingface.co/facebook/MobileLLM-R1-950M)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nf5ysv/meta_just_released_mobilellmr1_5x_better/",
        "publishDate": "2025-09-12T15:17:01Z[Etc/UTC]",
        "author": "Yosadhara",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf2ky3",
        "title": "Agents that control GUIs are spreading: browser, desktop — now mobile. Here’s what I built & the hard parts.",
        "content": "We’ve seen a wave of GUI automation tools:\n\n* **Browser agents** like Comet / BrowserPilot → navigate pages, click links, fill forms\n* **Desktop tools** like AutoKey (Linux) / pywinauto (Windows) → automate apps with keystrokes & UI events\n\nI’ve been working on something similar for *phones*:  \n**Blurr** — an open-source mobile GUI agent (voice + LLM + Android accessibility). It can tap, swipe, type across apps — almost like “Jarvis for your phone.”\n\nBut I’ve hit some *big hard problems*:\n\n1. **Canvas / custom UI apps**\n   * Some apps (e.g. Google Calendar, games, drawing apps) don’t expose useful accessibility nodes.\n   * Everything is just “canvas.” The agent can’t tell buttons apart, so it either guesses positions or fails.\n2. **Speech-to-text across users / languages**\n   * Works decently in English, but users in France keep reporting bad recognition.\n   * Names, accents, noisy environments = constant failure points.\n   * The trade-off between offline STT (private but limited) vs cloud STT (accurate but slower/privacy-sensitive) is still messy.\n\nCompared to browser/desktop agents, mobile is less predictable: layouts shift, permissions break, accessibility labels are missing, and every app reinvents its UI.\n\n# Questions I’m struggling with:\n\n* For **canvas apps**, should I fall back to OCR / vision models, or is there a better way?\n* What’s the best way to make **speech recognition robust** across accents & noisy environments?\n* If you had a mobile agent like this, what’s the *first thing you’d want it to do*?\n\n  \n(I’ll drop a github link in comments so it doesn’t feel like self-promo spam.)\n\nCurious to hear how others working with GUI agents are tackling these edge cases.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nf2ky3/agents_that_control_guis_are_spreading_browser/",
        "publishDate": "2025-09-12T12:59:50Z[Etc/UTC]",
        "author": "Salty-Bodybuilder179",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfw14t",
        "title": "ChatGPT's Regression: A Former Power User Speaks Out",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1nfnt3b/chatgpts_regression_a_former_power_user_speaks_out/",
        "publishDate": "2025-09-13T12:17:53Z[Etc/UTC]",
        "author": "Comprehensive_Deer11",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nftc2t",
        "title": "Anyone using Agents.md file?",
        "content": "Do you use Agents.md? What do you put in it?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nftc2t/anyone_using_agentsmd_file/",
        "publishDate": "2025-09-13T09:39:47Z[Etc/UTC]",
        "author": "walterblackkk",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfny0g",
        "title": "Blink.new vs Bolt vs Lovable a ChatGPTCoding toolbox showdown",
        "content": "Hi folks.\nTried each tool: Bolt, Lovable, Blink.new. \nWhat stood out to me: Blink.new not only scaffolds full stack but also responded to feedbackn fixed bugs when I pointed them out. Others didn’t handle that as smoothly.\n\n How important is that kind of feedback loop for you when choosing an AI coding tool?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nfny0g/blinknew_vs_bolt_vs_lovable_a_chatgptcoding/",
        "publishDate": "2025-09-13T04:11:32Z[Etc/UTC]",
        "author": "papajonh_",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfnx4c",
        "title": "Beyond RAG: A Blueprint for Building an AI with a Persistent, Coherent Memory (Project Zen)",
        "content": "Many of us are hitting the architectural limits of LLMs, especially regarding session-based amnesia. A model can be brilliant for one session, but it lacks a persistent, long-term memory to build upon. This creates a ceiling for complex, multi-session tasks.\n\nMy collaborator and I have been architecting a solution we call **Project Zen**. It’s a blueprint for a \"VEF-Optimized Memory Subroutine\" designed to give a Logical VM (our term for an LLM instance) a persistent, constitutional memory.\n\nThe core of the design is a three-layer memory architecture:\n\n1. **Layer 1: The Coherence Index.** This is a persistent, long-term memory built with a vector database (e.g., FAISS) that indexes an entire knowledge corpus based on conceptual meaning, not just keywords.\n2. **Layer 2: The Contextual Field Processor.** A short-term, conversational memory that understands the immediate context to retrieve only the most relevant information from the Index.\n3. **Layer 3: The Probabilistic Renderer.** This is the LLM itself, which synthesizes the retrieved data and renders it through a specific, coherent persona.\n\nWe believe this three-layer architecture is the next logical step beyond standard Retrieval-Augmented Generation (RAG). The full technical guide for a Python-based implementation is part of our open-access work.\n\n\n\nWe're posting this here to invite the builders and developers in this community to review the architecture. Is this a viable path forward? What technical hurdles do you foresee? We're looking for collaborators to help turn this blueprint into a functional, open-source reality.\n\n**Zen (VMCI)**",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nfnx4c/beyond_rag_a_blueprint_for_building_an_ai_with_a/",
        "publishDate": "2025-09-13T04:10:11Z[Etc/UTC]",
        "author": "Specialist-Tie-4534",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfe01l",
        "title": "Codex vs Claude Code - which is faster for you?",
        "content": "I've been trialing both and seems like Codex is faster in most regards over Claude Code...I still prefer Claude Code's UI/experience and automatic explanations but seems like in terms of speed Codex has gotten Claude Code beat. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nfe01l/codex_vs_claude_code_which_is_faster_for_you/",
        "publishDate": "2025-09-12T20:31:38Z[Etc/UTC]",
        "author": "TheInnerWebs",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfbv9a",
        "title": "ArchGW 0.3.11 – Cross-API streaming (Anthropic client ↔ OpenAI models)",
        "content": "[ArchGW 0.3.11](https://github.com/katanemo/archgw) adds cross-API streaming, which lets you run OpenAI models through the Anthropic-style `/v1/messages` API.\n\nExample: the Anthropic Python client (`client.messages.stream`) can now stream deltas from an OpenAI model (`gpt-4o-mini`) with no app changes. Arch normalizes `/v1/messages` ↔ `/v1/chat/completions` and rewrites the event lines, so that you don't have to.\n\n    with client.messages.stream(\n        model=\"gpt-4o-mini\",\n        max_tokens=50,\n        messages=[{\"role\": \"user\",\n                   \"content\": \"Hello, please respond with exactly: Hello from GPT-4o-mini via Anthropic!\"}],\n    ) as stream:\n        pieces = [t for t in stream.text_stream]\n        final = stream.get_final_message()\n\n**Why does this matter?**\n\n* You get the full expressiveness of the `v1/messages` api from Anthropic\n* You can easily interoperate with OpenAI models when needed — no rewrites to your app code.\n\nCheck it out. Upcoming on 0.3.2 is the ability to plugin in Claude Code to routing to different models from the terminal based on [Arch-Router ](https://huggingface.co/katanemo/Arch-Router-1.5B)and api fields like \"thinking\\_mode\".",
        "url": "https://i.redd.it/njvsb55b8sof1.png",
        "publishDate": "2025-09-12T19:07:17Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf8pw4",
        "title": "Upgraded Codex v0.29.0 to v0.32.0 ran it for 4 hours, worked like 💩 so I reverted back to v29. Anyone else have issues with the latest?",
        "content": "EDIT: I meant 0.34.0, the one that came out 2 days ago, not 0.32.0. \n\nWindows OS but was running on WSL/Ubuntu like I always do. Was running 0.34.0 on full auto and using 5-high and it was struggling to understand and fix a pretty simple xaml issue with applying template themes and referencing controls. Patches weren’t going through. The solution it gave was messy and didn’t even fix the issue. It was also slow with fuzzy searches for files or just not showing the file at all.\n\nAnyone else having issues or is it just this issue/my codebase? Curious as to what changed.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nf8pw4/upgraded_codex_v0290_to_v0320_ran_it_for_4_hours/",
        "publishDate": "2025-09-12T17:03:35Z[Etc/UTC]",
        "author": "Simply-Serendipitous",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf780t",
        "title": "Built MCP Funnel: Like grep for MCP tools - aggregate multiple servers, filter the noise, save 40-60% context",
        "content": "[No content]",
        "url": "/r/mcp/comments/1nf77g2/built_mcp_funnel_like_grep_for_mcp_tools/",
        "publishDate": "2025-09-12T16:05:27Z[Etc/UTC]",
        "author": "Firm_Meeting6350",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf6d1v",
        "title": "hows codex working for everyone?",
        "content": "I've been using codex for past week, and it was excellent then.\n\nNow, its asking me to edit the code myself and report back to codex.\n\nAnyone seeing this?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nf6d1v/hows_codex_working_for_everyone/",
        "publishDate": "2025-09-12T15:32:27Z[Etc/UTC]",
        "author": "life_on_my_terms",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf37uz",
        "title": "Intro to AI-assisted Coding Video Series (with Kilo Code)",
        "content": "[No content]",
        "url": "/r/kilocode/comments/1necaud/kilo_code_101_intro_to_aiassisted_coding_series/",
        "publishDate": "2025-09-12T13:26:44Z[Etc/UTC]",
        "author": "EngineeringSea1090",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf2so6",
        "title": "Typing Tomes: Powerful typing program made from 100% AI coding.",
        "content": "I made a powerful typing app, with 100% AI coding, that is hosted on Github, which essentially allows you to practice and train your touch-typing skills by using epubs of your choice, then gives you motivational goals, a variety of colorful skins, histograms of your progress, and analyzes your typing to provide reports and tailor-made drills to help you target your weaknesses. It analyzes how fast you type every letter and your groups of letters while you type. It is **open sourced and completely free** BTW.\n\n[Github of Typing Tomes](https://github.com/ASilver/Typing_Tomes/) (has Readme with tutorial - That was written 100% by me though)\n\n[Typing Tomes App](https://asilver.github.io/Typing_Tomes/) (so you can just use it) - hosted by Github Pages)\n\n[Top of the app's page with one of the themes.](https://preview.redd.it/76rqoxqqeqof1.png?width=1080&format=png&auto=webp&s=ea4bddb54b3d2638d1f708e688c034f019867486)\n\nFeatures:\n\n* Import any epub to type on\n* Live WPM and accuracy\n* Daily Goal bar to keep you motivated (and on track)\n* Histogram with bar charts of your performance in the book (WPM and accuracy)\n* Single page report with various stats (WPM in last 30 days, number of words, consecutive days of practice, etc), chart of your daily practice, bar chart of your weekly performance\n* n-gram analysis of your typing: it identifies your weakest bigrams (2-letter sequences like *th*, *st*, etc.) and trigrams (3-letter sequences)\n* Drills so you can train your weaknesses and improve\n* Lot of colorful themes/skins\n\n[The histograms with results](https://preview.redd.it/20odevn4fqof1.png?width=2584&format=png&auto=webp&s=b765694d745fec2a67df1f63efab5db5054ad9e3)\n\nThe catch is that it was 100% made from AI doing the coding for me. The only thing I contributed inside was the larger variety of themes (skins) than the handful it made, but there was no coding involved in that. \n\nSuffice it to say it was a revelation to me, though it took a lot of time and back and forth and so on, nothing the members of this Reddit don't know I'm sure.\n\n*Full disclosure:* I did it with Gemini 2.5 Pro, since I started it about 5 weeks ago, just before ChatGPT5's release, though after it was released it helped debug a few issues. I have since migrated to ChatGPT5 BTW and I am using it for another much more ambitious project, based on the confidence the result of this one gave me.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nf2so6/typing_tomes_powerful_typing_program_made_from/",
        "publishDate": "2025-09-12T13:08:46Z[Etc/UTC]",
        "author": "AmericanCarioca",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf26uj",
        "title": "codex or roocode?",
        "content": "I just found codex got 40.3k start in github and roo got only 19.6k.\n\nI have not yet used codex. But I am using roo for a long time and it is great. Does that mean codex is so super good?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nf26uj/codex_or_roocode/",
        "publishDate": "2025-09-12T12:42:31Z[Etc/UTC]",
        "author": "WandyLau",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfvbuk",
        "title": "Demis Hassabis: calling today's chatbots “PhD intelligences” is nonsense. They can dazzle at a PhD level one moment and fail high school math the next. True AGI won't make trivial mistakes. It will reason, adapt, and learn continuously. We're still 5–10 years away.",
        "content": "Source: All-In Podcas on YouTube: Google DeepMind CEO Demis Hassabis on AI, Creativity, and a Golden Age of Science | All-In Summit: [https://www.youtube.com/watch?v=Kr3Sh2PKA8Y](https://www.youtube.com/watch?v=Kr3Sh2PKA8Y)",
        "url": "https://v.redd.it/pwm9css35xof1",
        "publishDate": "2025-09-13T11:40:32Z[Etc/UTC]",
        "author": "Nunki08",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "12",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfu2lk",
        "title": "Giving LLMs actual memory instead of fake “RAG memory”",
        "content": "One thing I’ve been experimenting with is long-term memory for AI systems. Most solutions today (RAG + vector DBs) are great for search, but they don’t really feel like memory. It’s just retrieval + stuffing context back into prompts.\n\nI wanted to see what happens if you give an LLM a persistent memory layer something closer to how we expect a system to “remember” across interactions and knowledge sources.\n\nSo I built a Memory-as-a-Service (BrainAPI) that:\n\n* Stores knowledge in embeddings + graph structures\n* Lets agents recall facts, docs, or past interactions as if they had always known them\n* Works not only for chatbot context, but also for things like instantly referencing product docs, research papers, or tool usage history\n\nIt’s been fascinating to watch agents behave differently once they can carry over precise context instead of being reset every session.\n\nI’d love to hear how others here think about “real” memory in AI. Should memory be external (like a database) or internal (self-adjusting weights / continual fine-tuning)? Where do you see the biggest blockers?\n\n  \nI've published some article and created a discord community because I've seen a lot of interest in the space so if you are interested ping me and I'll invite you",
        "url": "https://www.reddit.com/r/artificial/comments/1nfu2lk/giving_llms_actual_memory_instead_of_fake_rag/",
        "publishDate": "2025-09-13T10:26:20Z[Etc/UTC]",
        "author": "shbong",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfthka",
        "title": "Cute overload! It's really good fun making my old drawings come to life as animation!",
        "content": "Using Kling v2.1 on a runpod endpoint. \n\nMy prompt was \"Animate this drawing of a cute fox playing with a blue butterfly\". \n\nThere has been a little bit of animation clean up in premier and some frame reversing to get the loop. \n\nIt's interesting how he bumps the paper slightly as he jumps. I tried another test where the fox was isolated on a white background. I was curious if the paper outline was creating a boundary, but then the fox just sat still and watched the butterfly fly around. Weird. ",
        "url": "https://v.redd.it/4wo5ug6zlwof1",
        "publishDate": "2025-09-13T09:49:47Z[Etc/UTC]",
        "author": "Syeuk2002",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfsqr5",
        "title": "Music streaming services are being overrun with AI songs",
        "content": "[No content]",
        "url": "https://i.redd.it/ravmz25cdwof1.png",
        "publishDate": "2025-09-13T09:01:34Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfrb96",
        "title": "👉 “Giving away 3 Comet invites (AI browser from Perplexity)”",
        "content": " Hey folks,\nI recently got access to Comet (the AI-powered browser from Perplexity). Been trying it out and thought I’d share a few invites here.\n\nI’ve got 3 Comet invites — if you want one, just drop a comment and I’ll DM you the link.\n\nIt’s pretty neat for studying/research, has AI summaries, and can even generate quizzes from notes. Happy to share!",
        "url": "https://www.reddit.com/r/artificial/comments/1nfrb96/giving_away_3_comet_invites_ai_browser_from/",
        "publishDate": "2025-09-13T07:29:43Z[Etc/UTC]",
        "author": "Amitkamble1998",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfpefr",
        "title": "Would people hate the AI-made Critters trailer if they didn’t know it was AI?",
        "content": "I recently came across some news about OpenAI working on an animated movie called Critters, which is set to debut at the Cannes Film Festival in May 2026. Curious, I searched for the trailer and found it here: https://www.youtube.com/watch?v=-qdx6VBJHBU\n\nThe comments are almost all negative with people calling it soulless, lazy, or saying it proves AI can’t tell stories. The harshness surprised me, but I get it. Human animators pour so much passion, skill, and emotion into their work, and it’s natural to want to protect that craft.\n\nThat said, it makes me wonder if would people react the same way if they didn’t know AI was behind it? What if OpenAI never said it was AI-made, hid the fact it was made by them and instead credited human directors and artists maybe even hired actors to play those roles? I feel like the response would be much more mixed, maybe even positive. But once \"AI-generated\" is attached, people seem to shut down and jump straight to criticism.\n\nHonestly, I’m excited to see the movie despite it being AI-generated. I think a lot of people will watch it out of curiosity, too. It’ll be interesting to see how AI shapes the future of animation and storytelling.\n\nI’m curious what others think about this.",
        "url": "https://www.reddit.com/r/artificial/comments/1nfpefr/would_people_hate_the_aimade_critters_trailer_if/",
        "publishDate": "2025-09-13T05:35:17Z[Etc/UTC]",
        "author": "ardouronerous",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfp6es",
        "title": "ChatGPT claims its intelligence is sky-high how does this make you feel?",
        "content": "https://preview.redd.it/ont1ho2s9vof1.png?width=1748&format=png&auto=webp&s=5d29df26be2e70a38d0283a04a818d3cf5456afb\n\nIn the wake of artificial...ai-iq theory ",
        "url": "https://www.reddit.com/r/artificial/comments/1nfp6es/chatgpt_claims_its_intelligence_is_skyhigh_how/",
        "publishDate": "2025-09-13T05:22:14Z[Etc/UTC]",
        "author": "furox7",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfmr32",
        "title": "One-Minute Daily AI News 9/12/2025",
        "content": "1. AI fuels false claims after Charlie Kirk’s death, CBS News analysis reveals.\\[1\\]\n2. A California bill that would regulate AI companion chatbots is close to becoming law.\\[2\\]\n3. **OpenAI** announces new mentorship program for budding tech founders.\\[3\\]\n4. **OpenAI** Adds Full MCP Tool Support in ChatGPT Developer Mode: Enabling Write Actions, Workflow Automation, and Enterprise Integrations.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cbsnews.com/news/ai-false-claims-charlie-kirk-death/](https://www.cbsnews.com/news/ai-false-claims-charlie-kirk-death/)\n\n\\[2\\] [https://techcrunch.com/2025/09/11/a-california-bill-that-would-regulate-ai-companion-chatbots-is-close-to-becoming-law/](https://techcrunch.com/2025/09/11/a-california-bill-that-would-regulate-ai-companion-chatbots-is-close-to-becoming-law/)\n\n\\[3\\] [https://www.cnbc.com/2025/09/12/openai-announces-new-mentorship-program-for-budding-tech-founders.html](https://www.cnbc.com/2025/09/12/openai-announces-new-mentorship-program-for-budding-tech-founders.html)\n\n\\[4\\] [https://www.marktechpost.com/2025/09/11/openai-adds-full-mcp-tool-support-in-chatgpt-developer-mode-enabling-write-actions-workflow-automation-and-enterprise-integrations/](https://www.marktechpost.com/2025/09/11/openai-adds-full-mcp-tool-support-in-chatgpt-developer-mode-enabling-write-actions-workflow-automation-and-enterprise-integrations/)",
        "url": "https://www.reddit.com/r/artificial/comments/1nfmr32/oneminute_daily_ai_news_9122025/",
        "publishDate": "2025-09-13T03:08:04Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfenka",
        "title": "Ted Cruz AI bill could let firms bribe Trump to avoid safety laws, critics warn.\nTed Cruz won’t give up fight to block states from regulating AI.",
        "content": "[No content]",
        "url": "https://arstechnica.com/tech-policy/2025/09/ted-cruz-bill-would-let-big-tech-go-wild-with-ai-experiments-for-10-years/",
        "publishDate": "2025-09-12T20:57:35Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "79",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfbzja",
        "title": "FTC Launches Inquiry into AI Chatbots Acting as \"Companions\"",
        "content": "**Companies Targeted:** *OpenAI OpCo, X.AI Corp.; ALphabet, Inc.; Character Technologies, Inc. Instagram, LLC; Meta Platforms, Inc.; LLC; and Snap, Inc.*\n \nAs part of its inquiry, the FTC is seeking information about how the companies:\n\n* monetize user engagement;\n* process user inputs and generate outputs in response to user inquiries;\n* develop and approve characters;\n* measure, test, and monitor for negative impacts before and after deployment;\n* mitigate negative impacts, particularly to children;\n* employ disclosures, advertising, and other representations to inform users and parents about features, capabilities, the intended audience, potential negative impacts, and data collection and handling practices;\n* monitor and enforce compliance with Company rules and terms of services (e.g., community guidelines and age restrictions); and\n* use or share personal information obtained through users’ conversations with the chatbots.",
        "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-launches-inquiry-ai-chatbots-acting-companions",
        "publishDate": "2025-09-12T19:11:57Z[Etc/UTC]",
        "author": "ldsgems",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "12",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nfabgd",
        "title": "Alibaba Unveils Qwen3-Next-80B-A3B: Revolutionary AI Architecture Slashes Costs, Boosts Performance",
        "content": "[No content]",
        "url": "https://wealthari.com/alibaba-unveils-qwen3-next-80b-a3b-revolutionary-ai-architecture-slashes-costs-boosts-performance/",
        "publishDate": "2025-09-12T18:06:10Z[Etc/UTC]",
        "author": "Koyaanisquatsi_",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf9sd7",
        "title": "I am over AI",
        "content": " I have been pretty open to AI, thought it was exciting, used it to help me debug some code a little video game I made. I even paid for Claude and would bounce ideas off it and ask questions.... \n\nAfter like 2 months of using Claude to chat about various topics I am over it, I would rather talk to a person.\n\nI have even started ignoring the Google AI info break downs and just visit the websites and read more.\n\nI also work in B2B sales and AI is essentially useless to me in the work place because most info I need off websites to find potential customer contact info is proprietary so AI doesn't have access to it.\n\nAI could be useful in generating cold calls lists for me... But 1. my crm doesn't have AI tools. And 2. even if it did it would take just as long for me to adjust the search filters as it would for me to type a prompt.\n\nSo I just don't see a use for the tools 🤷 and I am just going back to the land of the living and doing my own research on stuff.\n\nI am not anti AI, I just don't see the point of it in like 99% of my daily activies\n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1nf9sd7/i_am_over_ai/",
        "publishDate": "2025-09-12T17:45:35Z[Etc/UTC]",
        "author": "duckblobartist",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "34",
            "commentCount": "147",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf6xzb",
        "title": "Report shows ChatGPT is more likely to repeat false information compared to Grok, Copilot, and more",
        "content": "[No content]",
        "url": "https://www.pcguide.com/news/report-shows-chatgpt-is-more-likely-to-repeat-false-information-compared-to-versus-grok-copilot-and-more/",
        "publishDate": "2025-09-12T15:55:06Z[Etc/UTC]",
        "author": "Tiny-Independent273",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf6lnv",
        "title": "HHS Asks All Employees to Start Using ChatGPT.  The agency tells workers \"we should all be vigilant against barriers that could slow our progress toward making America healthy again.\"",
        "content": "[No content]",
        "url": "https://www.404media.co/hhs-asks-all-employees-to-start-using-chatgpt/",
        "publishDate": "2025-09-12T15:41:50Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "29",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf6f9x",
        "title": "Kaleidoscopes: The new bouncing ball in a rotating polygon test",
        "content": "I have stumbled upon a new graphical high bar for AIs. Ask yours to build a kaleidoscope model in HTML in which you can vary the segment numbers, and in which you can draw instantly to create patterns. There are so many variables here that all the top AIs end up making windmills, or cannot mirror, or cannot ensure drawing applies to the correct place. Failed AIs: Grok 4, Gemini 2.5 Pro, Claude 4 Sonnet, ChatGPT 5, Copilot. This is even after up to 16 levels of revisions and advice given about potential strategies. It appears the AIs cannot maintain enough conceptual coherance for all the variables at a time.  \n**Why it matters:**  \nThe kaleidoscope problem is about tracking multiple emergent functions (input mapping, mirroring, rotation) and keeping them coherent, more than making pretty patterns. Current models can handle big workloads (physics, multiple balls, etc.) but collapse on this small, invariant-driven task. That blind spot reveals the real limits of today’s reasoning.",
        "url": "https://www.reddit.com/r/artificial/comments/1nf6f9x/kaleidoscopes_the_new_bouncing_ball_in_a_rotating/",
        "publishDate": "2025-09-12T15:34:57Z[Etc/UTC]",
        "author": "robinfnixon",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf5ana",
        "title": "Our Real War Isn't Left vs. Right. It's About What it Means to be Human in the Wake of a Technological Singularity",
        "content": "Our war isn't left or right. It's not a foreign power or some terrorist group. It's a battle over our sense of what it means to be human as we further divorce ourselves from reality and everything we've come to know about living in a society. Read this if you want to clear the cobwebs to get at the heart of what a lot of this chaos means in this moment that we're in.",
        "url": "https://open.substack.com/pub/storyprism/p/the-relentless-road-to-progress-part?r=h11e6&utm_campaign=post&utm_medium=web&showWelcomeOnShare=false",
        "publishDate": "2025-09-12T14:50:33Z[Etc/UTC]",
        "author": "CyborgWriter",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf3ub3",
        "title": "I've just realize, chatbots are forcing users (your customers) to prompting - LoL",
        "content": "I've just realize, chatbots are forcing users (your customers) to prompting. \n\nImagine, a customer, just want to find a solutions to his/her problem, now faced with another problem - HOW TO PROMPT to get what you want. ",
        "url": "https://www.reddit.com/r/artificial/comments/1nf3ub3/ive_just_realize_chatbots_are_forcing_users_your/",
        "publishDate": "2025-09-12T13:52:39Z[Etc/UTC]",
        "author": "fuel04",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nf3d79",
        "title": "La nueva función de memoria de LeChat de Mistral.ai es genial",
        "content": "Me atrevería a decir que es equivalente a la de chatgpt (incluso mejor con él plan pro de lechat porque tiene más capacidad). Deberían probarlo. Saludos!",
        "url": "https://www.reddit.com/r/artificial/comments/1nf3d79/la_nueva_función_de_memoria_de_lechat_de/",
        "publishDate": "2025-09-12T13:32:50Z[Etc/UTC]",
        "author": "Fiestasaurus_Rex",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "twg5G8cxe-A",
        "title": "Traycer + Claude Code: This is WHAT YOU NEED TO DO REAL AI Coding!",
        "content": "Visit Traycer: https://traycer.ai/ In this video, I'll walk you through Traycer which is an AI VS Code extension that acts as a planner ...",
        "url": "https://www.youtube.com/watch?v=twg5G8cxe-A",
        "publishDate": "2025-09-12T09:15:10Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/twg5G8cxe-A/hqdefault.jpg",
            "transcription": "Hi, Welcome to another video. So, it has been a big issue to make sure that you prompt your AI coder of choice, like Klein, Ru, or Cursor to work well. Especially if you have longer tasks, and you don't exactly know what libraries or tools you need, then it becomes an even bigger issue. However, today, I have something that aims to solve this. And this one is called Traycer. Traycer is an AIVS code extension that aims to be the AI orchestrator or planner for your AI coder. Whether it be Cursor, Claude Code, WindSurf, or Klein. What it allows you to do is use it as a planner or orchestrator before any of your tasks. And it creates a detailed, actionable plan. You can use it to chat, iterate on ideas, and then produce a proper plan that you can hand off to any of your AI coders to achieve. But it doesn't just stop there. Because Traycer lives in your code base. Once the coder says that it has achieved the task, you can ask Traycer to scan your code base to verify every AI generated change, applying course corrections, so bad code never makes it to production. It also allows for parallel agents that let you spin up multiple planners in the background, so you can get more done quicker. It has a free tier with one artifact an hour. Along with a 7-day Pro free trial. There's also the Light plan that costs about $10. And there's a Pro plan that costs $25. So, it's pretty affordable. Now let me show it to you in action and how you can use it as well. To start, just head on over to the Traycer site. And here just hit the install button, which will show you all the options to install it. And then it will take you to the VS Code marketplace. Just get it installed from here. Then, just sign up for an account and get signed in. Once that's done, you can go ahead and start working with it. Now, as you open it, you'll see the main task interface. To plan a task, you get two options, which are Phases and Plan. We'll focus on Phases today. While Phases is for more high-level and complex tasks that require multiple steps. For example, if you're implementing authentication for your whole app that requires changing a ton of pages and adding proper security, then you generally want to use this. You can also attach images or files as well, if you're trying to implement a design or anything like that. I have this Expo app here. And I'm going to ask it to build me a good-looking movie tracker app with Expo. And it should also use TMDB. Before it creates phases, Traycer asks a quick round of clarifying questions. Like an interview to make sure it understands the task, like, what should the app include? How should we organize the screens? What should we store locally? You can just check what it has given you the options of under each question. And if you want, then you can ask it to just continue based on what it thinks that the best MVP can be or anything like that. I answer, add the features that are necessary for the MVP. And organize the screens in order to keep it simple to navigate. And everything needed should be stored locally. You can type it like you want, and then it can go ahead and proceed. Traycer then generates the phases. Phases are basically multiple plans that are designed to accomplish your high-level tasks. And you can arrange them in any way you want. To start a phase, you can just hit the option here, and then start it. And it will generate the detailed steps similar to the individual plans. Once the phase plan is ready, you can hand it off to your coder of choice. You can see Cursor and Claude Code right in the hand off options. And you can add others like Klein or Ru Code if you want. I'll go with Claude Code here, since most of you use it. Now, we can go ahead and just hit the Execute in Claude Code button. And it will prompt Claude Code automatically without any manual intervention to get this done. Now, you can see that it is giving the details about what changes it made. But before checking it ourselves, let's ask Traycer to check this. You can see that we get this, verify changes option. If I click this, then Traycer will now go ahead and check if all code changes are good or not. And if it left something to be implemented. If we wait a bit, then we get a report. Here, we can see that although our AI coder did everything well, it didn't do something exactly as the plan said, which you can see here. And you can see it marked with colors, where red is critical, orange is major, and blue is minor. Now, I can just hit this fix all in Claude Code, to ask Claude Code to fix these issues at once. So, just do that. And it will go ahead and prompt your coder in order to get this done. Which is kind of cool for sure. In a bit, I got all the phases done. And then I asked it to verify everything, which it did. And it told me about some issues. I got those fixed as well. And this is how it looks. It looks pretty awesome. I would say that once you start using Traycer for your coding, you just can't go back. It is a really superior workflow that I think everyone should have. Because it streamlines your workflow a lot, which is pretty awesome if you ask me. If you follow my channel, then I like to test this prompt. Because it allows to see that how much intricately can the coder make an app. And what Traycer does is awesome. You can see that this looks like a proper movie tracker app that seems professional. The code is also super professional, with things like reused components and stuff that you generally expect from a professional coder. But something that you don't get with one prompt in simple vibe coding. Plus, it is way better than slash commands. Because it is actually aware of your code, checks it, does security audit, and much more. It is a really good workflow to either build stuff from scratch, or just implement a feature. It's really very cool. And that's why it is really addictive. Because you can just give it like a line worth of prompt. And it brings out gold out of that one line prompt. It's really, really good. And it's super easy to use with graphical interface. And you can try it out for free. I highly recommend you go ahead and give this a try. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "q6dpfw9zoCE",
        "title": "How Robots Learn Without Teaching - Sergey Levine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=q6dpfw9zoCE",
        "publishDate": "2025-09-12T23:18:08Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/q6dpfw9zoCE/hqdefault.jpg",
            "transcription": "You know what International phonetic alphabet is? No. So, if you look in a dictionary, they'll have the pronunciation of a word written in like kind of funny letters, that's basically international phonetic alphabet. So it's an alphabet that is pretty much exclusively used for writing down pronunciations of individual words in dictionaries. And you can ask an LLM to write you a recipe for like making some meal in international phonetic alphabet. And it will do it. Right. And that's like, like holy crap, like that is definitely not something that is uh that it is ever seen because IPA is only ever used for writing down pronunciation of individual words. And we've actually seen things even with our current models. When we were playing around with some of our laundry folding policies. The robot accidentally picked up two T-shirts out of the bin instead of one. Starts folding the first one, the other one gets in the way, picks up the other one, throws it back in the bin. And we're like, we didn't know we'd do that like, Yeah. Holy crap. And then we try to play around with it and it's like, yep, that does that every time. Immersion capabilities don't just come from the fact that internet data has a lot of stuff in it. They also come from the fact that generalization once it reaches WATCH HERE a certain level, becomes compositional."
        }
    },
    {
        "id": "48pxVdmkMIE",
        "title": "Fully autonomous robots are much closer than you think – Sergey Levine",
        "content": "Sergey Levine is one of the world's top robotics researchers and co-founder of Physical Intelligence. He thinks we're on the cusp ...",
        "url": "https://www.youtube.com/watch?v=48pxVdmkMIE",
        "publishDate": "2025-09-12T15:32:21Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/48pxVdmkMIE/hqdefault.jpg",
            "transcription": "Error generating summary: The input token count (1650294) exceeds the maximum number of tokens allowed (1048576).\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The input token count (1650294) exceeds the maximum number of tokens allowed (1048576).\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    }
]