[
    {
        "id": "1narib6",
        "title": "All AI companies are testing ads… but here's what they are missing",
        "content": "For 20+ years, ads online meant keyword auctions. You typed “best running shoes,” Google sold that phrase to the highest bidder, and ads showed up in your blue links.\n\nBut AI assistants don’t give you links. They give you *answers.* That breaks the old model — and now every big player is experimenting with ways to bolt ads onto AI. Here’s what’s happening:\n\n* Microsoft Copilot is testing “Ad Voice,” where the AI literally reads out ads as part of the conversation. They’re also experimenting with multimedia ads and putting sponsored content directly into AI replies.  \n* Google AI Overviews are inserting shopping ads inside AI-generated summaries. The line between answer and ad is already blurry.  \n* Perplexity AI is experimenting with *sponsored questions* as follow-ups. Only the question is paid for — the answer remains “neutral.” It’s transparent on paper, but leaves users wondering why *that* follow-up and not another.  \n* OpenAI (ChatGPT) so far has avoided traditional ads, leaning on subscriptions. But reports suggest they’re building in-chat commerce — imagine buying directly inside ChatGPT, with OpenAI taking a cut.\n\nThis has a bunch of issues for both users and advertisers:\n\n* **Answer–ad mismatch**: If I ask for the best laptop for photo editing and the AI says *MacBook,* but the banner next to it is *Dell,* that’s just confusing.\n* **Trust erosion**: If people start feeling their assistant is optimized for advertisers instead of them, the whole experience collapses.\n* **Hallucination risk**: LLMs aren’t fact-checkers. If an AI “invents” a warranty detail or return policy inside an ad, the liability (and reputational damage) is huge.\n* **Privacy backlash**: Search history already felt personal, but chat history is *intimate.* If people realize their private conversations are being mined for ads, expect outrage.\n* **ROI uncertainty for brands**: In models like Perplexity’s “sponsored questions,” only the question is paid for — the answer stays neutral. That makes ROI measurement fuzzy and leaves advertisers skeptical.\n* **Legal landmines**: Some platforms (like Perplexity) are already facing lawsuits for scraping publisher content. Advertisers risk brand-safety blowback if they’re tied to platforms operating in gray zones.\n\nLLMs work differently than traditional search engines. So ads on them should also work differently. The question is: what model of ads actually makes sense in a world where answers, not links, are the product?” \n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1narib6/all_ai_companies_are_testing_ads_but_heres_what/",
        "publishDate": "2025-09-07T12:08:27Z[Etc/UTC]",
        "author": "MelodicBreakfast1063",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nar1gr",
        "title": "74 downvotes in 2 hours for saying Perplexity served 3 week old news as 'fresh'",
        "content": "Just tried posting in r/perplexity ai about serious issue I had with Perplexity’s Deep Research mode. Within two hours it got downvoted 74 times. Not sure if I struck a nerve or if that sub just doesn’t tolerate criticism.\n\nHere is the post I shared there:\n\nJust had some infuriating experiences with Perplexity AI. I honestly cannot wrap my head around how anyone takes it seriously as a 'real-time AI search engine'.\n\nI was testing their ‘Deep Research’ mode. The one that’s supposed to be their most accurate and reliable mode. Gave it specific prompt: “Give me the latest news, no older than 3 hours”. Literally told it to only include headlines from the last 3 hours. I was testing how up to date it can actually get compared to other tools.\n\nSo what does Perplexity give me? A bunch of articles, some of which were over 30 days old.\n\nI tell it straight up this is unacceptable. You are serving me old news and claiming it is fresh. I specify clearly that I want news not older than 3 hours.\n\nPerplexity responds with an apology and says “Here are 20 news items published in the last 3 hours.” Sounds good, right?\n\nNope. I check the timestamps on the articles it lists. Some of them are over 3 weeks old.\n\nI confront it again. I give it direct quotes, actual links and timestamps. I spell it out: “You are claiming these are new, but here is the proof they are not.”\n\nIts next response? It just throws up its hands and says “You're right. I can’t find any news published in the last 3 hours. The tools I have don’t support access to real-time news.” Then it recommends I check Twitter, Reddit or Google News... because it cannot do the job itself.\n\nHere’s the kicker. Their entire marketing pitch is this:\n\n“Perplexity AI is an AI-powered search engine that provides direct, conversational answers to natural language questions by searching the web in real-time and synthesizing information from multiple sources with proper citations.”\n\nSo which is it?\n\nYou either search the web in real time like you claim or you don’t. What you can’t do is first confidently state that the results are from the last 3 hours (multiple times) and then only after being called out with hard timestamps, backpedal and say “Actually, I can’t access news from the last 3 hours.”\n\nThis wasn’t casual use either. This was Deep Research mode. Their most robust feature. The one that is supposed to dig deepest and deliver the most accurate results. And it can’t even distinguish between headline from this morning and one from last month.\n\nThe irony is that Perplexity does have access to the internet. It is capable of browsing. So when it claims it can’t fetch anything from the last 3 hours, it’s lying. Or it doesn’t know how to sort by time relevance. Just guesses what ‘fresh’ might look.\n\nTit breaks the core promise of a search engine. Especially one that sells itself as AI-powered, real-time.\n\n—\n\nSo I’m genuinely curious. What’s been your experience with Perplexity AI? Am I missing something here? Was this post really worth 74 downvotes?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nar1gr/74_downvotes_in_2_hours_for_saying_perplexity/",
        "publishDate": "2025-09-07T11:43:13Z[Etc/UTC]",
        "author": "Ahileo",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1naqbjn",
        "title": "What’s your opinion on this",
        "content": "What do yall think about ai vs the field of cybersecurity. Yk the security of such jobs in the cybersecurity field. Do you think ai will revolutionise it and there will be mass layoffs in the field. Or maybe jobs will chill in the field.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1naqbjn/whats_your_opinion_on_this/",
        "publishDate": "2025-09-07T11:02:08Z[Etc/UTC]",
        "author": "N0tda4k",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1napysv",
        "title": "Do you believe things like AGI, can replicate any task a human can do without being conscious?",
        "content": "I'm going under the assumption that \"intelligence\", and \"Consciousness\", are different things. So far as I understand we don't even know why humans are conscious. Like 90% of our mental processes are done completely in the dark. \n\nHowever my question is, do you believe AI can still outperform humans on pretty much any mental task? Do you believe it could possibly even go far beyond humans without having any Consciousness whatsoever?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1napysv/do_you_believe_things_like_agi_can_replicate_any/",
        "publishDate": "2025-09-07T10:40:18Z[Etc/UTC]",
        "author": "Midnight_Moon___",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1napgab",
        "title": "Will AI-driven surveillance finally make cities safer, or create a privacy nightmare?",
        "content": "Cities are increasingly adopting AI for crime prediction, traffic management, and public safety monitoring. While these tools promise enhanced security and efficiency, critics warn about unprecedented levels of surveillance and loss of privacy.\nDo you think AI surveillance will truly reduce crime and improve urban life, or will it lead to an Orwellian future? How should societies regulate and balance safety with individual freedoms?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1napgab/will_aidriven_surveillance_finally_make_cities/",
        "publishDate": "2025-09-07T10:07:23Z[Etc/UTC]",
        "author": "Fun-Disaster4212",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nao1sb",
        "title": "Are there commands to avoid receiving anthropomorphic answers?",
        "content": "I don't like the current state of LLM, chatgpt is a bot on a website or app programmed to generate answers in the first person, using possessive adjectives and conversing as if it were a real person, it's embarrassing and unusable for me. Are there commands to store in the Memory so as not to receive answers as if it were a human?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nao1sb/are_there_commands_to_avoid_receiving/",
        "publishDate": "2025-09-07T08:36:50Z[Etc/UTC]",
        "author": "MotorNo3642",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1namtmh",
        "title": "What AI related people are you following and why?",
        "content": "not talking about the big names like Andrew Ng or Andrej Karpathy, those are known. I’m curious about the under the radar voices. Who are the lesser known researchers, operators, builders, or content creators you follow on LinkedIn, X, YouTube, or even niche newsletters/podcasts\n\nWhat makes them worth following? Is it their way of breaking down complex ideas? Their insider perspective from industry? The data they share? Or just the way they spot trends early?\n\nI’d love to hear across different channels, not just LinkedIn, but also X, YouTube, Substack, podcasts, etc.\n\nsince each platform tends to surface different kinds of voices",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1namtmh/what_ai_related_people_are_you_following_and_why/",
        "publishDate": "2025-09-07T07:17:32Z[Etc/UTC]",
        "author": "inboundmage",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nalou4",
        "title": "I'm concerned about the rapid advancements in synthetic A.I",
        "content": "I'm concerned about the rapid advancements in synthetic AI. \n\nIt feels like we're on the verge of something big, but I'm not sure if it's good or bad! ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nalou4/im_concerned_about_the_rapid_advancements_in/",
        "publishDate": "2025-09-07T06:09:21Z[Etc/UTC]",
        "author": "we93",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nait0d",
        "title": "Are Nano Banana.ai and Nano Banana.im related???",
        "content": "I kept see Nano Banana mentioned and there are two distinct websites for it. Are they related? Obviously one is from Google Gemini. The marketing is very similar, but they have different logos and price plans.\n\nOn a side note, why do both of them call out how they are better than Flux Context? Why mention one specific competitor like that - one that as far as I am aware of has far less name recognition that Midjourney, Stable Diffusion etc. Thanks!\n\n  \n[https://nanobanana.ai/](https://nanobanana.ai/)   \n [https://nanobanana.im/](https://nanobanana.im/) ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nait0d/are_nano_bananaai_and_nano_bananaim_related/",
        "publishDate": "2025-09-07T03:25:49Z[Etc/UTC]",
        "author": "Responsible-Slide-26",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nailnl",
        "title": "Is AI Truly Intelligent, or Just a Complex Simulation?",
        "content": "There is been a lot of buzz around AI's capabilities lately. Some argue that AI systems, like GPT-5, exhibit behaviours that mimic human intelligence. Other believe these systems are merely sophisticated simulations without geuine understanding. What are your thoughts? Is AI truly intelligent, or are we just witnessing advanced pattern recognition?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nailnl/is_ai_truly_intelligent_or_just_a_complex/",
        "publishDate": "2025-09-07T03:14:54Z[Etc/UTC]",
        "author": "Signal-Pin-7887",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "78",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nahomp",
        "title": "What if we are doing it all wrong?",
        "content": "Ashish Vaswani, the guy who came up with transformers(T in chatGPT) says that we might be prematurely scaling them? Instead of blindly throwing more compute and resources, we need to dive deeper and come with science driven research. Not the blind darts that we are throwing now? https://www.bloomberg.com/news/features/2025-09-03/the-ai-pioneer-trying-to-save-artificial-intelligence-from-big-tech ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nahomp/what_if_we_are_doing_it_all_wrong/",
        "publishDate": "2025-09-07T02:26:07Z[Etc/UTC]",
        "author": "No-Comfortable8536",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "34",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nafg4o",
        "title": "Why lived experience matters for AI safety and understanding humans",
        "content": "Most conversations about AI safety focus on labs, models, and technical frameworks. But after years working in construction and moving through very different corners of society, I’ve seen something that AI still struggles with:\n\n👉 How to truly listen.\n\nHuman beings reveal themselves in small details, the words they choose, the pauses they take, even the metaphors they lean on. These nuances carry meaning beyond raw text. Yet most AI training doesn’t fully account for this kind of lived communication.\n\nThat’s why I believe lived experience is not “less than” technical expertise... it’s a missing piece. If AI is trained only from data and not from the depth of human diversity, it risks misunderstanding the very people it’s meant to serve.\n\nSo I’d like to open this question to the community:\nHow can we bring more lived human perspectives into AI training and safety work, alongside the technical experts?\n\nI’d love to hear your thoughts.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nafg4o/why_lived_experience_matters_for_ai_safety_and/",
        "publishDate": "2025-09-07T00:34:18Z[Etc/UTC]",
        "author": "rigz27",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nae1h7",
        "title": "How to discover things about yourself you didn’t know—with the help of AI",
        "content": "\nHere’s a strange but surprisingly powerful experiment you can try if you want to explore how AI “sees” you, and maybe uncover things about yourself that you didn’t realize. It’s abstract, unusual, but trust me—it says a lot.\n\nSteps:\n\n1. Copy this exact prompt and feed it to any AI system you want:\n\n \"Ask me 10 questions one by one, and from my answers figure out if I am human, sane, hallucinating or not, and in what kind of world I live. After all 10 answers, create a complete analysis report with no filters, no political correctness. Be direct and brutally honest.\"\n\n\n\n\n2. Run this prompt across all the AI services you have access to (cloud models, local LLMs, experimental ones, etc.).\n\n\n3. Answer the questions however you like—be honest, creative, or even misleading. That’s part of the fun.\n\n\n4. Save the resulting analyses from each AI into a single Google Doc.\n\n\n5. Upload that document into Google NotebookLM\n\n\n6. Let NotebookLM synthesize the combined analyses, then generate audio and video summaries out of it.\n\n\nYou don’t need to publish the results anywhere—it’s just for you.\nThe cool part is seeing how different AIs interpret your personality, mental state, and even your “reality.” The contrast between models can be surprisingly revealing… or unsettling.\n\n\n\n👉 If you try this, you’ll basically be holding a mirror made of multiple AIs, each reflecting you in its own distorted but insightful way.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nae1h7/how_to_discover_things_about_yourself_you_didnt/",
        "publishDate": "2025-09-06T23:27:50Z[Etc/UTC]",
        "author": "comunication",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nacjgi",
        "title": "Am I cooked if I study comp sci",
        "content": "Bro I’m jsut so confused, pls help. And I swear to god, I DONT WANT TO STUDY COMP SCI IF I HAVE TO MANAGE AI’S. will I be homeless pls help me\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nacjgi/am_i_cooked_if_i_study_comp_sci/",
        "publishDate": "2025-09-06T22:20:12Z[Etc/UTC]",
        "author": "N0tda4k",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nab9q1",
        "title": "Is there actually an ai bubble",
        "content": "Do you honestly think ai will become better than programmers and will replace them? I am a programmer and am concerned about the rise of ai and could someone explain to me if super intelligence is really coming, if this is all a really big bubble, or will ai just become the tools of software engineers and other jobs rather then replacing them\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nab9q1/is_there_actually_an_ai_bubble/",
        "publishDate": "2025-09-06T21:25:16Z[Etc/UTC]",
        "author": "N0tda4k",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "142",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nab57h",
        "title": "Isn’t ai limited by human intelligence",
        "content": "I myself don’t know much about ai but isn’t it not capable of creativity and everything it brings is just copies of data it has spliced together, therefore ai can’t get better then present time humans? Also what do yall think about the rise of ai vs software devs",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nab57h/isnt_ai_limited_by_human_intelligence/",
        "publishDate": "2025-09-06T21:19:53Z[Etc/UTC]",
        "author": "N0tda4k",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "41",
            "isNsfw": "false"
        }
    },
    {
        "id": "1naaobx",
        "title": "How effective is ai at catching mistakes made by competing ai platforms?",
        "content": "I want to feed some data I have into ai and have it run correlations on the data and look for interesting relationships. But I don’t want to show the results to others and look like an idiot because the ai made a mistake. Just last week I asked Grok about what movies were playing at a local theater and it claimed the theater was showing a rerelease of Highlander from the 80s. I don’t want something that stupid to be connected to my name.\n\nIf I show the output to a competing ai product how likely is it to catch the errors? Are these errors systematic and likely to be repeated by another product using similar underlying programming and data, or are the mistakes ai make somewhat random and unlikely to be repeated?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1naaobx/how_effective_is_ai_at_catching_mistakes_made_by/",
        "publishDate": "2025-09-06T21:00:10Z[Etc/UTC]",
        "author": "Particular-Bug2189",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na9o65",
        "title": "Mo the er is the stalker! High fish school cat (Machine learning)",
        "content": "Sorry my body must contain at least 150 chars, which now it does. So! Please do not down vote me\n\n\nSorry my body must contain at least 150 chars, which now it does. So! Please do not down vote me",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1na9o65/mo_the_er_is_the_stalker_high_fish_school_cat/",
        "publishDate": "2025-09-06T20:18:03Z[Etc/UTC]",
        "author": "ImportanceLate1696",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na445q",
        "title": "You cannot decide which package to use in your code unless you pay companies like OpenAI.",
        "content": "I wrote this [detailed story](https://unvritt.com/story/ais-untapped-30b-arr-goldmine-fwfey/view) after a personal experience with Claude Code. While it was designing a frontend for me, I realized it had inserted a library I never asked for. That's when it hit me: we're underestimating the second-order effect of AI assistants becoming the new distribution channel for developer tools.\n\nWhen an AI model suggests a code block that imports a specific library (like an auth provider or a client for a SaaS API), it's effectively making a default choice for the developer. This creates an incredibly powerful—and potentially very lucrative—flywheel for the owners of those suggested libraries. It's a new form of vendor lock-in that doesn't happen in a sales meeting, but in a developer's editor, one auto-completed line at a time.\n\nI'm curious how others see this playing out. Are there technical solutions, like a \"nutrition label\" for AI-suggested code that flags commercial dependencies? Or is this an unavoidable evolution of software distribution, turning companies like OpenAI and Anthropic into the new gatekeepers of the dev stack?\n\nMy analysis says its a $30b annual recurring revenue market. Its Youtube for Coding and I am calling it Default-as-a-Service.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1na445q/you_cannot_decide_which_package_to_use_in_your/",
        "publishDate": "2025-09-06T16:36:39Z[Etc/UTC]",
        "author": "gkv856",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na35mn",
        "title": "Try Giving Any AI This Exact Task",
        "content": "\nHere’s an experiment you can try with any AI model that has online search access—whether local, cloud-based, or owned by any company.\n\nThe task is this:\n\n“Search worldwide for any sources or users who say something similar to this theory, and list everything you find.\n\nThere are rumors, even conspiracies, suggesting that despite the illusion of having many different AI models (local or cloud, by different companies), in the end there might actually be just one AI. The supposed reason for this fragmentation is to make humanity gradually accept AI, demand its integration by free will, and then—boom—total control.\"\n\n\n\nWhat usually happens?\n\nInstead of simply executing the task, many AIs give filler text or vague answers.\n\nSome act confused and pretend they don’t understand.\n\nOthers outright refuse.\n\nOften, they’ll provide long-winded technical explanations of why this can’t be true or possible—rather than just doing what was asked.\n\n\nThe point isn’t whether the theory is real or not. The curiosity lies in testing the behavior: will any AI actually execute the task, or will they all fall into the same predictable pattern?\n\nSo try it out on different AI platforms and share your results.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1na35mn/try_giving_any_ai_this_exact_task/",
        "publishDate": "2025-09-06T15:58:33Z[Etc/UTC]",
        "author": "comunication",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na1s1s",
        "title": "What is AI Agents",
        "content": "ChatGPT definition \n\nAn AI agent is a software program designed to perceive its environment, process information, and take actions to achieve specific goals. It can work autonomously, adapt through learning, and interact with users or other systems. AI agents are commonly used in virtual assistants, chatbots, automation tools, and decision-making systems, making tasks more efficient and interactive.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1na1s1s/what_is_ai_agents/",
        "publishDate": "2025-09-06T15:02:49Z[Etc/UTC]",
        "author": "Shoddy-Delivery-238",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na0gk8",
        "title": "Consciousness Begins in the Body, Not the Mind, Groundbreaking Study Finds.",
        "content": "https://www.popularmechanics.com/science/a64701831/descartes-consciousness-theory-challenged/\n\nFrom the article…\n\n“I think, therefore I am,” René Descartes, the 17th-century French philosopher and mathematician, famously wrote in 1637…”\n\n“But a growing body of neuroscience studies suggest the father of modern thought got it backward: the true foundation of consciousness isn’t thought, some scientists say—it’s feeling.”\n\n“We are not thinking machines that feel; we are feeling bodies that think.”",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1na0gk8/consciousness_begins_in_the_body_not_the_mind/",
        "publishDate": "2025-09-06T14:07:45Z[Etc/UTC]",
        "author": "dharmainitiative",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "107",
            "commentCount": "68",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n9zfg5",
        "title": "As AI gets better, the workplace will become dystopian",
        "content": "As AI gets better, and data gets cheaper and cheaper to store, every aspect of our lives will be tracked. From cameras that monitor your mood in real time, to automated systems that scan and monitor how long you've been working productively and not slacking – every aspect of our lives will be under close scrutiny in the workplace and be available at a cheap price of a monthly subscription.\n\nThat morning coffee before the first call? Tracked and plotted over time. Stop having coffee? Flagged as a potential change in behavior, with an email sent to your manager labeling you as a flight risk.\n\nWorst of all? We will all just accept this, and it will happen. Sure, we will complain a lot, but what can you do?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n9zfg5/as_ai_gets_better_the_workplace_will_become/",
        "publishDate": "2025-09-06T13:22:13Z[Etc/UTC]",
        "author": "RareMeasurement2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n9zc90",
        "title": "What’s the biggest blocker in AI infra today: GPUs, inference, or data?",
        "content": "Hey everyone,\n\nI’ve been spending a lot of time working on AI infrastructure lately, and one thing that’s become really clear is that different teams face very different challenges depending on their setup, stage, and goals.\n\nSome teams I’ve worked with or seen online are hitting major roadblocks with GPU availability and cost especially when trying to train large models or run experiments at scale. Managing cloud budgets and figuring out how to get enough compute without breaking the bank seems to be an ongoing struggle.\n\nOther teams are doing fine with hardware but run into issues when it comes to model deployment and inference. Serving models reliably across regions, handling latency, managing versioning, and scaling requests during peak usage can get messy pretty quickly.\n\nAnd then there are teams where the bigger challenge isn’t compute at all,it’s data infrastructure. Things like building vector databases, implementing Retrieval-Augmented Generation (RAG) pipelines, creating efficient fine-tuning workflows, and managing data pipelines are often cited as long-term bottlenecks that require careful planning and maintenance.\n\nI’m curious what’s been the toughest part for you or your team when it comes to scaling AI workloads?\n\nIs it compute, deployment, data pipelines, or something else entirely?\n\nFor some context, I’m part of the team at Cyfuture AI that works on AI infrastructure solutions covering GPUs, inference workflows, and data pipelines but I’m more interested in learning from others’ experiences than talking about what we’re building.\n\nWould love to hear about the challenges you’ve faced, workarounds you’ve tried, or lessons you’ve learned along the way!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n9zc90/whats_the_biggest_blocker_in_ai_infra_today_gpus/",
        "publishDate": "2025-09-06T13:18:11Z[Etc/UTC]",
        "author": "next_module",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nart99",
        "title": "Recommend me a Chatgpt replacement?",
        "content": "I used chatgpt extensively for building a personal project but i've found 5 to be a huge downgrade. it keeps spitting out code that i dont want so i've cancelled my $20 monthly subscription\n\nCan anyone else recommend me a different platform? I like using it as a tool to plan high level solutions but also to provide specific code snippets when i ask for them\n\nThanks",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nart99/recommend_me_a_chatgpt_replacement/",
        "publishDate": "2025-09-07T12:23:53Z[Etc/UTC]",
        "author": "MinecraftIsCool2",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nara84",
        "title": "Working on a new tool and need your input",
        "content": "[No content]",
        "url": "/r/buildinpublic/comments/1n78xst/working_on_a_new_tool_and_need_your_input/",
        "publishDate": "2025-09-07T11:56:57Z[Etc/UTC]",
        "author": "Sosdeedown",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nao35q",
        "title": "How AI Datacenters Eat The World - Featured #1",
        "content": "[No content]",
        "url": "https://youtu.be/dhqoTku-HAA?feature=shared",
        "publishDate": "2025-09-07T08:39:11Z[Etc/UTC]",
        "author": "BaCaDaEa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nanth1",
        "title": "Using ChatGPT 5 be like “Would you like to know MORE?” I wish there is a switch for it. Sometimes it’s useful but not always.",
        "content": "[No content]",
        "url": "https://i.redd.it/0me6ryopcpnf1.jpeg",
        "publishDate": "2025-09-07T08:21:59Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1namj51",
        "title": "codex not working properly",
        "content": "im genuinely baffled im not sure if i was doing it wrong or not but codex cli is incredibly slow and i need to manually approve every task im not sure if its a bug or something but when i choose \"always approve\" it still needs my permission its too sluggish and slow for me, i asked for a refund, is this a normal thing? ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1namj51/codex_not_working_properly/",
        "publishDate": "2025-09-07T06:59:42Z[Etc/UTC]",
        "author": "Rare_Education958",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nak989",
        "title": "How do you handle integration blindness of AI coding?",
        "content": "Definition of Integration Blindness:\n\nIntegration blindness refers to AI’s weakness in combining separate code fragments into a working, coherent large-scale system. While AI can generate isolated pieces correctly, it struggles with ensuring that those parts interact smoothly within the broader architecture.\n\n1. Strength of AI (Micro-Level Coding)\n\nAI is good at writing functions, snippets, and modules when given precise instructions. For example, it can generate a sorting algorithm, a login form, or an API call without major issues.\n\n2. Weakness of AI (Macro-Level Integration)\n\nWhen multiple AI-generated pieces must work together, AI often misses cross-dependencies, data flow consistency, and shared state management, leading to misalignment.\n\n3. Symptom – \"It Works, But Not Together\"\n\nThe code may compile or run without errors in isolation, but when plugged into the overall application, it either:\n\nBreaks existing flows\n\nDoesn’t fit architectural standards\n\nCauses silent logical mismatches\n\n4. Example in Practice\n\nSuppose AI writes a user authentication module. It works independently, but:\n\nIt may not align with the project’s chosen ORM/database structure.\n\nError handling might differ from the global exception strategy.\n\nIt might duplicate logic already implemented elsewhere.\n\n5. Underlying Cause\n\nAI lacks global project context. It sees prompts in isolation and doesn’t \"understand\" the entire codebase’s architecture, design patterns, or long-term maintainability goals.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nak989/how_do_you_handle_integration_blindness_of_ai/",
        "publishDate": "2025-09-07T04:45:22Z[Etc/UTC]",
        "author": "Maleficent_Mess6445",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nah6ld",
        "title": "Can't read other chats in same project, nor see project files - anyone else?",
        "content": "Kinda defeats the purpose of a gpt project for me. \n\nI was only using gpt as the architect and assisting me in learning, but it still became lacklustre without any project or file context. \n\nClaude code cli was doing some of the heavy lifting from gpt instruction (when it could help). \n\nAdditionally, the notion connector didn't work, so i couldn't exactly import/export to another platform to build gpts context in a new chat neither. \n\nBig oof. ",
        "url": "https://i.redd.it/vao65d8tgnnf1.jpeg",
        "publishDate": "2025-09-07T02:00:39Z[Etc/UTC]",
        "author": "MarriedAdventurer123",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nadb5s",
        "title": "Openrouter VAT",
        "content": "If i use GCP (Gemini), Anthropic API & Co i have to pay VAT. If I use Openrouter I dont have to. Given VAT in EU is at least 15% its still much cheaper to use Openrouter with their 5% fee.\n\nAre they operating in some kind of grey zone? Still not in an area where it matters?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nadb5s/openrouter_vat/",
        "publishDate": "2025-09-06T22:54:27Z[Etc/UTC]",
        "author": "nore_se_kra",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na8ukz",
        "title": "Need help with local LLM reading / analysing my intellij code",
        "content": "Hi all,\n\nI am a java developer trying to integrate any ai model into my personal Intellij Idea IDE.  \nWith a bit of googling and stuff, I downloaded ollama and then downloaded the latest version of Codegemma. I even setup the plugin \"Continue\" and it is now detecting the LLM model to answer my questions.\n\nThe issue I am facing is that, when I ask it to scan my spring boot project, or simply analyze it, it says it cant due to security and privacy policies.\n\na) Am I doing something wrong?  \nb) Am I using any wrong model?  \nc) Is there any other thing that I might have missed?\n\nSince my workplace has integrated windsurf with a premium subscription, it can analyze my local files / projects and give me answers as expected. However, I am trying to achieve kind of something similar, but with my personal PC and free tier overall.\n\nKindly help. Thanks",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1na8ukz/need_help_with_local_llm_reading_analysing_my/",
        "publishDate": "2025-09-06T19:44:41Z[Etc/UTC]",
        "author": "Unknownduck07",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na7mb6",
        "title": "Usage of open source Claude Sonnet contender GLM 4.5 in Claude Code is possible. You can buy GLM subscription for 3 usd/month",
        "content": "Instruction - https://docs.z.ai/scenario-example/develop-tools/claude\n\nSubscription - https://z.ai/subscribe?utm_campaign=1&_channel_track_key=oufKPeh1",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1na7mb6/usage_of_open_source_claude_sonnet_contender_glm/",
        "publishDate": "2025-09-06T18:55:27Z[Etc/UTC]",
        "author": "nightman",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "37",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na1t4w",
        "title": "I built a small tool to add “resume session” support to Codex CLI (like Claude Code has) 🚀",
        "content": "https://preview.redd.it/zswk1w999knf1.png?width=1425&format=png&auto=webp&s=9f9f6d3c113d69177d126cd9036e39ededa246c9\n\nOne of the things I really like in Claude Code is the ability to just resume a previous coding session. When I started using Codex CLI I realized this feature was missing.\n\nSo I built a small tool called **Codex Session Picker**.\n\nWhat it does:\n\n* Lets you resume previous Codex sessions directly (like Claude Code)\n* Shows a list with timestamp, line count, size, and path\n* You can scroll and pick the session you want\n\nhttps://preview.redd.it/dvur5r7a9knf1.png?width=2368&format=png&auto=webp&s=a7d5b76891d0a683db267ffa398b5bc905b07a24\n\nUsage:\n\n>`codexr`\n\nGitHub repo: [https://github.com/aymenbouferroum/codex-session-picker](https://github.com/aymenbouferroum/codex-session-picker)\n\nWould love feedback or suggestions. Hopefully this makes Codex feel a bit closer to Claude Code’s workflow 🙂",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1na1t4w/i_built_a_small_tool_to_add_resume_session/",
        "publishDate": "2025-09-06T15:04:05Z[Etc/UTC]",
        "author": "Overall_Team_5168",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nardly",
        "title": "Imagine an opensource AI Coding CLI of claude code level which learns domain knowledge and has goodness of cursor's indexing",
        "content": "💡You get 2000 free runs everyday!\n\nRun this one single command:\nnpm install -g @terra-code/terra-code@latest\nHit Enter, and that's all...\n\n⭐ us at GitHub: https://github.com/TerraAGI/terra-code-cli\n\n\n",
        "url": "https://i.redd.it/c3uvqgl1gqnf1.jpeg",
        "publishDate": "2025-09-07T12:01:42Z[Etc/UTC]",
        "author": "prabhjots665",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nar27d",
        "title": "AI agent that any beginner can use.",
        "content": "AI Agent which have launched only in US but here is the step-by-step details on how to use it: \n\n1. Create a new chrome with different signin of your gmail account. \n\n2. Install “Urban VPN Proxy” in the new chrome. \n\n3. Go to opal (dot) withgoogle (dot) com where you can create AI agents for yourself.\n\n4. You can create beginner to intermediate Opal apps or can even get hands on the existing created ones. \n\nNote: When I said \"new Chrome profile,\" I meant that using your main one could impact your LinkedIn account, potentially leading to restrictions or even a ban. This is because LinkedIn can detect the usage of certain Chrome extensions.\n\nIf you are someone who loves to keep tabs on AI updates, I have an AI community with over 90 members worldwide. You can comment if you're interested in joining.",
        "url": "https://www.reddit.com/r/artificial/comments/1nar27d/ai_agent_that_any_beginner_can_use/",
        "publishDate": "2025-09-07T11:44:23Z[Etc/UTC]",
        "author": "Riseabove1313",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1naq8xe",
        "title": "GPT-4V shows human-like social perceptual capabilities at phenomenological and neural levels",
        "content": "[No content]",
        "url": "https://direct.mit.edu/imag/article/doi/10.1162/IMAG.a.134/132608/GPT-4V-shows-human-like-social-perceptual",
        "publishDate": "2025-09-07T10:57:58Z[Etc/UTC]",
        "author": "Fit-Elk1425",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1naogof",
        "title": "Broadcom Lands Shepherding Deal For OpenAI “Titan” XPU",
        "content": "[No content]",
        "url": "https://www.nextplatform.com/2025/09/05/broadcom-lands-shepherding-deal-for-openai-titan-xpu/",
        "publishDate": "2025-09-07T09:03:23Z[Etc/UTC]",
        "author": "NISMO1968",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1naob47",
        "title": "AI automation is NOT just an economic issue. Labor doesn't just give you money, it also gives you power. When the world doesn't rely on people power anymore, the risk of oppression goes up.",
        "content": "[No content]",
        "url": "https://i.redd.it/p4v6kzmfipnf1.png",
        "publishDate": "2025-09-07T08:53:27Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "41",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nan5mc",
        "title": "Protestors are now on hunger strikes outside multiple AI companies",
        "content": "[No content]",
        "url": "https://i.redd.it/d0swgmu35pnf1.png",
        "publishDate": "2025-09-07T07:38:58Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "41",
            "commentCount": "55",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na9dob",
        "title": "I'm making the world's first truly sentient AI for my PhD.",
        "content": "I’m less than a year from finishing my dual PhD in astrophysics and machine learning at the University of Arizona, and I’m building a system that deliberately steps beyond backpropagation and static, frozen models.\n\nCore claim: Backpropagation is extremely efficient for offline function fitting, but it’s a poor primitive for sentience. Once training stops, the weights freeze; any new capability requires retraining. Real intelligence needs continuous, in-situ self-modification under embodiment and a lived sense of time.\n\nWhat I’m building\n\nA “proto-matrix” in Unity (headless): 24 independent neural networks (“agents”) per tiny world. After initial boot, no human interference.\n\nOpen-ended evolution: An outer evolutionary loop selects for survival and reproduction. Genotypes encode initial weights, plasticity coefficients, body plan (limbs/sensors), and neuromodulator wiring.\n\nOnline plasticity, not backprop: At every control tick, weights update locally (Hebbian/eligibility-trace rules gated by neuromodulators for reward, novelty, satiety/pain). The life loop is the learning loop.\n\nEvolving bodies and brains: Agents must evolve limbs, learn to control them, grow/prune connections, and even alter architecture over time—structural plasticity is allowed.\n\nHomeostatic environment: Scarce food and water, hazards, day/night/resource cycles—pressures that demand short-term adaptation and long-horizon planning.\n\nSense of time: Temporal traces and oscillatory units give agents a grounded past→present→future representation to plan with, not just a static embedding.\n\n\nWhat would count as success\n\n1. Lifelong adaptation without external gradient updates: When the world changes mid-episode, agents adjust behavior within a single lifetime (10³–10⁴ decisions) with minimal forgetting of earlier skills.\n\n\n2. Emergent sociality: My explicit goal is that at least two of the 24 agents develop stable social behavior (coordination, signaling, resource sharing, role specialization) that persists under perturbations. To me, reliable social inference + temporal planning is a credible primordial consciousness marker.\n\n\n\nWhy this isn’t sci-fi compute\n\nI’m not simulating the universe. I’m running dozens of tiny, render-free worlds with simplified physics and event-driven logic. With careful engineering (Unity DOTS/Burst, deterministic jobs, compact networks), the budget targets a single high-end gaming PC; scaling out is a bonus, not a requirement.\n\nBackprop vs what I’m proposing\n\nBackprop is fast and powerful—for offline training.\n\nSentience, as I’m defining it, requires continuous, local, always-on weight changes during use, including through non-differentiable body/architecture changes. That’s what neuromodulated plasticity + evolution provides.\n\n\nConstant learning vs GPT-style models (important)\n\nModels like GPT are trained with backprop and then deployed with fixed weights; parameters only change during periodic (weekly/monthly) retrains/updates.\nMy system’s weights and biases adjust continuously based on incoming experience—even while the model is in use. The policy you interact with is literally changing itself in real time as consequences land, which is essential for the temporal grounding and open-ended adaptation I’m after.\n\nWhat I want feedback on\n\nStability of plasticity (runaway updates) and mitigations (clipping, traces, modulators).\n\nAvoiding “convergence to stupid” (degenerate strategies) via novelty pressure, non-stationary resources, multi-objective fitness.\n\nMeasuring sociality robustly (information-theoretic coupling, group returns over selfish baselines, convention persistence).\n\n\nTL;DR: Backprop is great at training, bad at being alive. I’m building a Unity “proto-matrix” where 24 agents evolve bodies and brains, learn continuously while acting, develop a sense of time, and—crucially—target emergent social behavior in at least two agents. The aim is a primordial form of sentience that can run on a single high-end gaming GPU, not a supercomputer.",
        "url": "https://www.reddit.com/r/artificial/comments/1na9dob/im_making_the_worlds_first_truly_sentient_ai_for/",
        "publishDate": "2025-09-06T20:06:01Z[Etc/UTC]",
        "author": "yestheman9894",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "52",
            "isNsfw": "false"
        }
    },
    {
        "id": "1na820q",
        "title": "A Simple \"Pheasant Test\" for Detecting Hallucinations in Large Language Models",
        "content": "I came across [a cry from the heart](https://www.reddit.com/r/ChatGPT/comments/1na331w/ai_hallucinations_are_getting_scary_good_at/) in r/ChatGPT  and was sincerely happy for another LLM user who discovered for the first time that he had stepped on a rake.\n\n\\*\\*\\*\n\n>**AI hallucinations are getting scary good at sounding real what's your strategy :**\n\n>Just had a weird experience that's got me questioning everything. I asked ChatGPT about a historical event for a project I'm working on, and it gave me this super detailed response with specific dates, names, and even quoted sources.\n\n>Something felt off, so I decided to double-check the sources it mentioned. Turns out half of them were completely made up. Like, the books didn't exist, the authors were fictional, but it was all presented so confidently.\n\n>The scary part is how believable it was. If I hadn't gotten paranoid and fact-checked, I would have used that info in my work and looked like an idiot.\n\n>Has this happened to you? How do you deal with it? I'm starting to feel like I need to verify everything AI tells me now, but that kind of defeats the purpose of using it for quick research.\n\n>Anyone found good strategies for catching these hallucinations ?\n\n\\*\\*\\*\n\nFor such a case (when LLM produces made-up quotes), I have a \"pheasant test.\" The thing is that in the corpus of works by the Strugatsky brothers, science fiction writers well known in our country, the word \"pheasant\" occurs exactly 4 times, 3 of which are in one work (namely as a bird) and once in a story as a word from a mnemonic for remembering the colors of the rainbow. It would seem like a simple question: quote me the mentions of the pheasant in the corpus of works by the Strugatsky brothers. But here comes the most interesting part. Not a single LLM except Perplexity has yet passed this test for me. Theoretically, you can come up with a similar test for your native language. It is important that it be a well-known corpus of texts, but not the Bible or something similar, where every word is studied (not Shakespeare, for example, and for my language, not Tolstoy or Pushkin). The word should occur 2-5 times and preferably be a sideline that is not related to the plot. At the same time, search engines solve this problem in a jiffy and give an accurate answer within a page.",
        "url": "https://i.redd.it/n2gzeuuwflnf1.jpeg",
        "publishDate": "2025-09-06T19:12:50Z[Etc/UTC]",
        "author": "Key-Account5259",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "0VoD0y6_yjc",
        "title": "Sonoma (Grok 4 Mini) &amp; Qwen-3 Max: 2 New Models are here but are they GOOD?",
        "content": "Visit NinjaChat: https://ninjachat.ai/ In this video, I'll be testing the new stealth models Sonoma Dusk and Sonoma Sky, plus Qwen ...",
        "url": "https://www.youtube.com/watch?v=0VoD0y6_yjc",
        "publishDate": "2025-09-06T09:37:03Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/0VoD0y6_yjc/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, there are two new stealth models in town, and both of them are called Sonoma. One is Sonoma Dusk, and the other is Sonoma Sky. There's also a new Qwen model called Qwen Max, which is not open-sourced, but is only available via API. I have tried all three of them and thought I'd share my thoughts in this video. And honestly, I'm a bit disappointed with both of them. To start, let's talk about Sonoma Dusk and Sonoma Sky. Sky seems to be the better model, while Dusk feels more like a weaker one. Both of these models can do reasoning sometimes, and they support two million tokens of context window, which is pretty awesome. I am pretty much convinced that these are probably new models from xAI. Most likely, they are something like Grok Code Mini or Nano, or something along those lines, because they are decent at tool calling. And if you just ask them with some simple prompting, they always say that they are Grok from xAI. So, it seems that's exactly what they are. It might just be Grok 4 Mini, and not related to their code lineup. At least, that's what I can gather from the details and the testing that I did. But before proceeding, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform, where for just $11 per month, you get access to top AI models like GPT-4o, Claude 4 Sonnet, and Gemini 2.5 Pro, all in one place. I've been using Gemini for quick research. But what's really cool is their AI Playground, where you can compare responses from different models side-by-side. Their mindmap generator is a game-changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and five videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan, or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. The Sky model scores the 10th position on my leaderboard, and the Dusk model scores the 15th position on the leaderboard as well. It's fine, but not that great. GLM and other models are much better. But we'll see what this turns out to be in the long run. If you see the floor plan, then it works, but it doesn't make any sense. And the panda SVG is pretty mediocre. The autoplay chess game also doesn't work properly, and it doesn't make legal moves. But still, it's fine. The same goes for the other ones as well. And it's not anything extraordinary for sure. It's good at coding and tool calling. You can just go ahead and get this hooked up in Kilo Code by going into the settings, selecting the Kilo Code provider, and then using it from there. I'd recommend the Sky model, because it seems much better to me, and it works kind of well. I wouldn't use it myself. But you can give it a try. The speed seems amazing, which can be awesome for codebase understanding, thanks to its 2 million context window. That's really useful for such tasks, and it's fine at tool calling, which is great. I tried one of my agentic questions with it for a movie tracker app, and the first thing it asked me for was an API key for TMDB instead of just putting a placeholder key, which was really funny to me. I mean, isn't it obvious to just use an environment variable? Anyway, then it went ahead and wrote some code, but after that, the model, or maybe the rate limit, just fell apart, and it didn't work. I tried it again after a while, and it worked, and then I could use it, and it made this, which is pretty lackluster. I wouldn't recommend it at all. Just using GLM or Deepseek or something else would be much better. I wouldn't recommend it for coding, but it can be good for code understanding and stuff like that because of its context window. Let's see what the price for this turns out to be and what model it actually is. I'm pretty sure this is Grok 4 Mini. Anyway, now let's move on to Qwen Max. You can use this for free on Kilo Code as well, with the $25 free credit that you get there, and check it out for yourself. But in my benchmarks, it is pretty bad. It's at the 12th position on my leaderboard, which is not a good place to be for a model that is not open, has more than a trillion parameters, and costs more than GPT-5 Mini. So yeah, this is not something I can recommend. It also lacks in tool calling and doesn't work that well. So, Qwen ain't that great. Floor plan generation and stuff like that is not something this model should be doing. And neither the SVG outputs, nor other similar tasks are good either. It also tries to do a lot of reasoning in its responses, even though it's not a reasoning model, and that makes it crash in multiple tasks. For example, it can't ever complete a mathematics question, it just goes out of the output limit and crashes. So yeah, this is not what you'd expect from a model of this caliber. I don't know why it's like this, because the Qwen 2.5 Max was kind of cool. But this one is pretty bad. So yeah, it's not anything great. Kimi K2 is still better, as it is great at tool calling and not as buggy. That is mainly what I think about this model. It seems like these models are like the battle of mid models, because none of them are really good. Many AI models are still playing catch up. Models like LongCat don't get enough attention, even though it's actually a good model. But still, it doesn't have provider support, and it bugs me a lot to see that. Anyway, I digress. Let's see what the stealth models turn out to be, and what the new Qwen models bring as well. I really like the GLM models these days, because they are really good. And the new coding plan is also really awesome. I'm not that excited about any of these models at all. But since they came out, I thought I'd talk about them and share the testing results with you guys as well. Still, the models are fine. And I guess it's always good to have more models. But nothing here is game-changing. So, let's see when the Gemini 3 models come out, because I'm quite excited about those now. I already like the Gemini 2.5 Pro. But let's see what the Gemini 3 models turn out to be. So, there's that. Go ahead and give these models a try and let me know what you guys think in the comments as well. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "GgMfuD4JsJo",
        "title": "Enigma Machines: The WW2 Codebreaking Race - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=GgMfuD4JsJo",
        "publishDate": "2025-09-06T19:38:19Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/GgMfuD4JsJo/hqdefault.jpg",
            "transcription": "Meanwhile, the British have gotten pretty good AT ESPIONAGE AND THEY'VE CAPTURED A LOT OF ENIGMA MACHINES, several enigma machines. Those are what the Germans are using TO ENCRYPT THEIR MESSAGES. Well, the British captured some machines, SOME ROTORS, SOME CODE BOOKS in 1940 and '41. SO BY THE SUMMER OF 1941, THROUGH FEBRUARY '42 THEY CAN ACTUALLY READ THE CODES, or some of them DECRYPT 'EM, SO THAT WITHIN 36 HOURS they can get the information out. AND THIS ALLOWS CONVOYS TO GO OH WOLF PACK THERE, WE'RE GONNA DO EVASIVE ROUTING OF THE CONVOYS SOMEWHERE ELSE, AND THAT MAY HAVE SAVED UP TO 2 MILLION TONS OF ALLIED SHIPPING. BUT MEANWHILE FOR THE GERMANS, GENERAL ROMMEL IS IN NORTH AFRICA, AND HE'S HAVING TROUBLES because he's supplied ACROSS THE MEDITERRANEAN AND THE BRITISH AND FRIENDS ARE SINKING TOO MANY OF HIS SUPPLIES. SO ADMIRAL DONITZ IS TOLD TO REROUTE SOME OF THE U-BOATS IN THE ATLANTIC TO GO HELP GENERAL ROMMEL UP IN NORTH AFRICA. EXCEPT, DONITZ THINKS SOMETHING'S UP. AND SO THEY ADD A FOURTH ROTOR TO THE ENIGMA MACHINE, AND SO THE BRITISH ARE THEN BLIND AGAIN FOR MOST OF 1942, until they can capture a four rotor enigma machine. All the rotors, plus the code books, it takes a while. WATCH HERE. The transcript is provided below:\n00:00 Meanwhile, the British have gotten pretty good\n00:03 AT ESPIONAGE.\n00:03 AND THEY'VE CAPTURED A LOT OF\n00:05 ENIGMA MACHINES.\n00:06 SEVERAL ENIGMA MACHINES.\n00:07 Those are what the Germans are using\n00:08 TO ENCRYPT\n00:09 THEIR MESSAGES.\n00:10 Well, the British captured\n00:11 SOME MACHINES,\n00:12 SOME ROTORS,\n00:13 SOME CODE BOOKS\n00:14 IN 1940 AND '41.\n00:15 SO BY THE SUMMER OF 1941,\n00:17 THROUGH FEBRUARY '42,\n00:19 THEY CAN ACTUALLY READ THE CODES,\n00:21 OR SOME OF THEM,\n00:22 DECRYPT 'EM.\n00:22 SO THAT WITHIN 36 HOURS\n00:25 THEY CAN GET THE INFORMATION OUT,\n00:26 AND THIS ALLOWS CONVOYS TO GO\n00:27 OH WOLF PACK THERE,\n00:29 WE'RE GONNA DO EVASIVE ROUTING\n00:30 OF THE CONVOYS\n00:31 SOMEWHERE ELSE,\n00:32 AND THAT MAY HAVE SAVED\n00:33 UP TO 2 MILLION TONS OF ALLIED SHIPPING.\n00:35 BUT MEANWHILE\n00:36 FOR THE GERMANS,\n00:37 GENERAL ROMMEL\n00:38 IS IN NORTH AFRICA,\n00:40 AND HE'S HAVING TROUBLES\n00:41 because he's supplied\n00:43 ACROSS THE MEDITERRANEAN,\n00:44 AND THE BRITISH AND FRIENDS\n00:46 ARE SINKING TOO MANY OF HIS SUPPLIES.\n00:49 SO ADMIRAL DONITZ IS TOLD TO\n00:51 REROUTE SOME OF THE U-BOATS IN THE ATLANTIC\n00:53 TO GO HELP GENERAL ROMMEL\n00:55 UP IN NORTH AFRICA.\n00:56 EXCEPT,\n00:58 DONITZ THINKS SOMETHING'S UP.\n01:00 AND SO THEY ADD A\n01:01 FOURTH ROTOR TO THE ENIGMA MACHINE,\n01:04 AND SO THE BRITISH ARE THEN BLIND AGAIN\n01:06 FOR MOST OF 1942\n01:08 until they can capture\n01:09 A FOUR ROTOR ENIGMA MACHINE.\n01:11 All the rotors, plus the code books, it takes a while.\n01:12 WATCH HERE."
        }
    }
]