[
    {
        "id": "https://www.artificialintelligence-news.com/?p=109743",
        "title": "Google’s new AI agent rewrites code to automate vulnerability fixes",
        "content": "<p>Google DeepMind has deployed a new AI agent designed to autonomously find and fix critical security vulnerabilities in software code. The system, aptly-named CodeMender, has already contributed 72 security fixes to established open-source projects in the last six months. Identifying and patching vulnerabilities is a notoriously difficult and time-consuming process, even with the aid of [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/google-new-ai-agent-rewrites-code-automate-vulnerability-fixes/\">Google’s new AI agent rewrites code to automate vulnerability fixes</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/google-new-ai-agent-rewrites-code-automate-vulnerability-fixes/",
        "publishDate": "2025-10-06T13:56:40Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI in Action, Cybersecurity AI, ai, artificial intelligence, coding, cybersecurity, development, infosec, programming, security, vulnerabilities"
        }
    },
    {
        "id": "1o0dbo9",
        "title": "The Emperor's New Clothes",
        "content": "From my friends' who are software engineers.\n\nCompany bought A.I. tool asking them to use it as debugger.\n\nA simple bug, which they can fix in a few seconds; took A.I. more than half an hour. Tougher bugs which they need to spend 10-20 minutes, took A.I. the whole morning.\n\nHe complained to his superior, then was accused of not using the tool properly.\n\nAs more and more complaint came in, manager had to change his tone: \"A.I. is a growing technology, the futures belong to the peeps who embrace it.\"\n\nIn order to make progress on the project, my friends and his colleagues stopped using A.I. debugger; and just fixed the buggs themselves.\n\nHere comes the plot twist: they told management they're using A.I. debugger.  😂😂😂",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0dbo9/the_emperors_new_clothes/",
        "publishDate": "2025-10-07T12:26:10Z[Etc/UTC]",
        "author": "teamyg",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0cofy",
        "title": "ChatGPT is quietly becoming an OS, not just a search engine",
        "content": "Two years ago, I said “Just ask” would be the new interface. After OpenAI’s DevDay, it’s clear that the moment is here.\n\n**What’s happening>**  \nOpenAI just launched apps inside ChatGPT: Booking.com, Canva, Figma, Expedia, Spotify, and others are already integrated. It’s no longer just “chatting with GPT”; it’s running tasks through it.\n\n**But here’s the twist>**  \nThis isn’t the App Store 2.0. It’s shaping up to be an OS for doing, a conversational layer that orchestrates tools, data, and context. Search becomes just a feature inside that runtime.\n\n**What’s next>**\n\n* Every serious brand builds a ChatGPT app, the “BMW Advisor” moment\n* Agentic commerce, checkout directly in chat\n* Compute as the new moat, OpenAI’s 6GW AMD deal says everything\n\nFeels like the web right before browsers went mainstream.  \nWhat do you think ChatGPT will become the next “operating system for work”?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0cofy/chatgpt_is_quietly_becoming_an_os_not_just_a/",
        "publishDate": "2025-10-07T11:56:27Z[Etc/UTC]",
        "author": "max_gladysh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0buvi",
        "title": "Why Does Every AI Think Everything Is Inappropriate Now?",
        "content": "All the AI subreddits are getting flooded with complaints about the censorship. It's truly surprising when basic, completely SFW prompts get flagged by all the mainstream tools, yet a few months ago, those same requests generated good results without issue.\n\nI genuinely wonder what the companies hope to achieve by making their most popular creative tools functionally useless for anything remotely interesting.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0buvi/why_does_every_ai_think_everything_is/",
        "publishDate": "2025-10-07T11:15:52Z[Etc/UTC]",
        "author": "Axdii_fr",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "30",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0b150",
        "title": "The Unsustainable AI Subsidy: A Short-Term Game Changer with a Long-Term Catch",
        "content": "The widespread, affordable access to powerful AI tools like ChatGPT is currently a luxury subsidized by investors. Developing and running these advanced models requires staggering amounts of money for specialized AI chips and data centers, creating a massive cash burn for companies like OpenAI.\n\nThis artificially low cost, however, is a massive short-term incentive for the private sector. Companies across all industries are eagerly adopting and integrating these cheaper AI services, primarily through the API, to replace human tasks and reduce operating costs. This is the first wave of impact: lower employment as businesses swap expensive human capital for subsidized AI.\n\nHere's the kicker: Once a sufficient dependency is established and the original investors demand a return, the AI companies will have to stop the subsidy and dramatically increase their prices to cover their true, colossal operating costs and finally achieve profitability. The resulting spike in cost for businesses, who will have already downsized their human workforce, will eliminate any cost savings and turn a high profit margin into a high operating expense.\n\nThe ultimate outcome is a devastating economic scenario: lower overall employment across the private sector, without any lasting high profits for the businesses that adopted AI, with such profits instead flowing to the AI providers themselves.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0b150/the_unsustainable_ai_subsidy_a_shortterm_game/",
        "publishDate": "2025-10-07T10:30:18Z[Etc/UTC]",
        "author": "Artistic-Library-617",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0ap1s",
        "title": "How to cope with using AI at work",
        "content": "Hi everybody, I hope this is the right place to post this.\n\nI have been struggling ethically to commit to using AI in the workplace the way that my leadership wants us to. There is no way for me to avoid it, i foresee my company using AI for the rest of time. I can do my job no problem without AI, but heavy pressure from above to innovate using the tool is overwhelming.\n\nI’ve seen some news articles and Instagram reels about how damaging AI is to the environment and limits resources that people need (ex: water).\n\nMy company has no CSR initiatives to give back to these communities.\n\nI am just 1 person. I know my boycott is not changing anything. The only thing it impacts is me avoiding learning something new and my ability to meet my leaderships needs, and therefore my own earning potential.\n\nAre other people struggling with this? How do you cope?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0ap1s/how_to_cope_with_using_ai_at_work/",
        "publishDate": "2025-10-07T10:10:41Z[Etc/UTC]",
        "author": "Similar_Put3916",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0ad24",
        "title": "AI Devs & Researchers: Is OpenAI’s Sora Update a Real Safety Fix or Just Papering Over Deepfake Risks?",
        "content": "So OpenAI just rolled out the Sora update after the deepfake cameo controversy. From what I understand, it’s meant to prevent unauthorized celebrity likenesses from being generated.  \n[https://winbuzzer.com/2025/10/06/openai-rushes-out-sora-update-to-control-deepfake-cameos-after-controversial-launch-xcxwbn/](https://winbuzzer.com/2025/10/06/openai-rushes-out-sora-update-to-control-deepfake-cameos-after-controversial-launch-xcxwbn/)\n\nBut I have some questions to the devs and AI researchers here (I need some brutally honest takes):  \n\\- Are the technical measures they’ve implemented actually solid, or is this more of a “trust us, it’s safe now” situation?  \n\\- How would you have designed a system to prevent these abuses without crippling creative use cases?\n\nCurious to hear what the folks building and researching these systems think.\n\nP.S. I'm genuinely concerned because last week a friend of mine showed me a video that he created that had a person in the background who looked EXACTLY like my uncle. I was like...this guy's hasn't been to the USA in 8 years. If he were to visit he'd tell me the first thing. So I called him to ask if he was here and guess what...he wasn't. I have no idea how SORA picked up his image and 'installed' him in the background of my friends video (My uncle is nowhere active on social media).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o0ad24/ai_devs_researchers_is_openais_sora_update_a_real/",
        "publishDate": "2025-10-07T09:50:52Z[Etc/UTC]",
        "author": "biz4group123",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o094bb",
        "title": "How do you keep up with AI news to make sure your startup is on the right track?",
        "content": "Hi everyone,\n\nAs a startup building an AI-native product, we find it both important and honestly, quite challenging to keep up with all the updates around new technologies, tools, and upgrades to existing ones (like the recent OpenAI Agent Builder release), as well as emerging trends in the space.\n\nWe see this as essential because we want to ensure that *what* we build, and *how* we build it, follows the most recent and effective approaches.\n\nSure, sometimes a company releases an update that can “kill” 1,000 startups overnight—but staying up to date still feels absolutely critical.\n\nHow do you all handle this?\n\n* What are the best email newsletters or sources you follow for AI news and updates?\n* How often do you review your tech stack to make sure the tools and technologies you’re using are still the most relevant and effective for your challenges?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o094bb/how_do_you_keep_up_with_ai_news_to_make_sure_your/",
        "publishDate": "2025-10-07T08:30:55Z[Etc/UTC]",
        "author": "Natural-Raisin-7379",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o07an1",
        "title": "🤖 AI is like some people on the Torrent network",
        "content": "🤖  AI reminds me of some people on the Torrent network: it leeches from  the web at full speed, seeds back at 1kb/s, and only spreads malware  torrents (AI content ;)  \n  \n[https://en.wikipedia.org/wiki/BitTorrent#Downloading\\_and\\_sharing](https://en.wikipedia.org/wiki/BitTorrent#Downloading_and_sharing)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o07an1/ai_is_like_some_people_on_the_torrent_network/",
        "publishDate": "2025-10-07T06:32:52Z[Etc/UTC]",
        "author": "MadeInDex-org",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o07818",
        "title": "I ranked OpenRouter model revenues so you don't have to",
        "content": "The following is ranking the top 20 this week. Given how fast things move in AI, I think weekly usage is a reasonable barometer, especially if you total over all models by company.\n\n**By company share**:\n\n* Anthropic: 78.8%\n* Google: 12.0%\n* OpenAI: 6.44%\n* Z-AI: 1.68%\n* DeepSeek: 1.08%\n\nI don't count grok, because they're doing weird deals of subsidizing model usage.  I searched extensively but didn't find any reports of Anthropic doing this.  Many consider anthropic to be the best coding models.\n\nBy model break down:\n\n|Rank|Model|Token Count (B)|Price per M tokens ($)|Total Revenue ($)|Share (%)|\n|:-|:-|:-|:-|:-|:-|\n|1|Claude Sonnet 4.5|345|3.00|1,035,000|40.04%|\n|2|Claude Sonnet 4|259|3.00|777,000|30.06%|\n|3|Claude 3.7 Sonnet|74.9|3.00|224,700|8.69%|\n|4|Gemini 2.5 Pro|136|1.25|170,000|6.58%|\n|5|Gemini 2.5 Flash|365|0.30|109,500|4.24%|\n|6|GPT-5|67.2|1.25|84,000|3.25%|\n|7|GPT-4.1 Mini|169|0.40|67,600|2.62%|\n|8|GLM 4.6|86.8|0.50|43,400|1.68%|\n|9|DeepSeek V3 0324|116|0.24|27,840|1.08%|\n|10|Gemini 2.5 Flash Lite|141|0.10|14,100|0.55%|\n\nCaveats: It's possible there are deals to use openrouter for anthropic with coding agents that aren't being disclosed.  I find the numbers weirdly high.  There are caching and output costs that aren't being considered here.  OpenAI usage might be weirdly low because mostly people just use OpenAI directly but I am unclear why that would be so different for Google and Anthropic.  \n\nIt's possible, ofc, that things like azure / aws / other clouds have much different numbers for enterprise usage.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o07818/i_ranked_openrouter_model_revenues_so_you_dont/",
        "publishDate": "2025-10-07T06:28:23Z[Etc/UTC]",
        "author": "kaggleqrdl",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o071s2",
        "title": "How bubbles form and why the next burst might happen",
        "content": "Having been through a few, I feel like I can share some things that should be blatantly obvious to everyone and yet for some reason it is not.\n\nBubbles are not anyone's fault.  They are caused by the organic fact that people at large **have short memories**.\n\nThey forget about the last bubble / boom / bust and they over invest.  This is why boom bust cycles have historically come in **relatively predictable patterns - it's just on average how soon people at large forget.**\n\nThe federal reserve is responsible for being our 'memory'.  Unfortunately, pricking bubbles is very unpopular with powerful people because they want to make money off of people's short memories.\n\nAs society has become more advanced, digitized, and automated, we have better memory.  This has lead to delayed recessions and our bubbles have become more increasingly rational.   AI, like the internet and real estate, will likely pay out in the long term.\n\nHowever, we are in the midst of a bubble right now (despite relatively high interest rates, take that Austrian economic school of thought), for sure, and some companies are over valued.  Which ones, it's impossible to say, but there are three ways they can go bust:\n\n1. **Competitive disruption**, due to better algorithms and better technology.  This has occurred many times before in history and will occur again.  China is, ironically, the most likely source of this, but there are many other potential disruptors.\n2. **Societal blow back**, leading to government investigation, regulation and/or new taxes.  This has happened before, but it was usually public suspicion of corruption in the bubble leading to government intervention.  With AI, I think that might be part of it but also just a general dislike of AI impact on society.\n3. **AI stalling and uneconomic**.  This is least likely, but possible.  I think the most likely form of AI stalling will be hitting a enfeeblement crisis where businesses realize they are hollowing out their workforce and losing their competitive edge.  If AI can do it, anyone with access to AI can compete, and so what moat do they have?\n\nGiven the above, I think OpenAI is most vulnerable as they are sensitive to all 3 in the list.  Other companies have different lines of revenue and can withstand an AI bubble popping.   NVDA is also on the list, however its PE ratio is only 52.  Very high, but it's making an insane cash flow.   CSCO in 2000, a good example to compare NVDA to, had a PE ratio of 234 at the height of the dot com crash.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o071s2/how_bubbles_form_and_why_the_next_burst_might/",
        "publishDate": "2025-10-07T06:17:29Z[Etc/UTC]",
        "author": "kaggleqrdl",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o06262",
        "title": "AI wearables and privacy laws protecting bystanders",
        "content": "I saw my first ad for an AI wearable device that passively records visual and audio data. I immediate got the *ick* feeling about it being an invasion of privacy, especially for bystanders who don’t consent to being recording. \n\nFor people who live in states and countries with stricter privacy laws (like two-party consent recording), how are these devices not banned? \n\nWill the AI company be liable or just the device wearer for illegally recording people without their consent?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o06262/ai_wearables_and_privacy_laws_protecting/",
        "publishDate": "2025-10-07T05:18:01Z[Etc/UTC]",
        "author": "KrabbyPattyParty",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o05p7s",
        "title": "Is the price of ChatGPT worth it??",
        "content": "Guys, I am currently a ChatGPT plus subscriber. However, I am a student and the $21 a month is really heavy on my pockets. It is basically a huge portion of my weekly income. However, I don't have much other spending to do except the subscriptions as I am fortunate enough to have great parents who are able to help me pay for my education. However, I just wanted to ask for your opinion, even though I know it's a ChatGPT subreddit, whether this amount of money is worth it for me as a student. A lot of the tasks that I am asking you to do are usually simple, but just time consuming tasks that I could have done myself. However, after asking ChatGPT to do these tasks I just procrastinate. Do you think this is a waste of my money??\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o05p7s/is_the_price_of_chatgpt_worth_it/",
        "publishDate": "2025-10-07T04:57:41Z[Etc/UTC]",
        "author": "Short_Brother_3944",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o05m60",
        "title": "One-Minute Daily AI News 10/6/2025",
        "content": "1. **OpenAI**, **AMD** Announce Massive Computing Deal, Marking New Phase of AI Boom.\\[1\\]\n2. **OpenAI** launches apps inside of ChatGPT.\\[2\\]\n3. Introducing **Codex**, a cloud-based software engineering agent that can work on many tasks in parallel.\\[3\\]\n4. **Anthropic** lands its biggest enterprise deployment ever with **Deloitte** deal.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/10/06/one-minute-daily-ai-news-10-6-2025/](https://bushaicave.com/2025/10/06/one-minute-daily-ai-news-10-6-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o05m60/oneminute_daily_ai_news_1062025/",
        "publishDate": "2025-10-07T04:52:58Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o05gbp",
        "title": "AI Safety for Kids?",
        "content": "I’ve been thinking about this a lot lately — we’ve spent years perfecting parental controls for social media, YouTube, and gaming, but barely anyone’s talking about AI tools like ChatGPT, Claude, or Gemini — which many tweens and teens are already using instead of Google.\n\nAI can be incredible for learning but it’s also unfiltered in subtle ways. Kids can ask it anything — from personal or emotional questions to risky or mature topics — and often, there’s no alert, context, or guidance for parents.\n\nGoogle Family Link, Apple Parental controls are decent for time limits and app control, but they don’t really cover what’s happening inside an AI conversations. That’s a gap that could grow fast as more kids turn to AI as their smart friend.\n\nHow do you think AI safety for kids should be handled?\n\nShould tech companies build kid-safe (I have not seen one yet) AI assistants with built-in parental alerts?\n\nOr should it be more about education and guidance at home rather than tech controls?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o05gbp/ai_safety_for_kids/",
        "publishDate": "2025-10-07T04:43:58Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o054bg",
        "title": "Are humans just giant LLMs and our jobs just agent workflows?",
        "content": "When you look at how modern work is organized, it also starts to look like an agent system. People specialize in sub-tasks, pass context to each other through meetings and messages, and rely on digital tools to complete goals. Each person is like a node in a giant workflow, constantly syncing and updating state.\n\nSo are we basically biological LLMs running on slow, energy-efficient hardware? If that’s true, what makes us different? Consciousness, emotion, self-awareness, embodiment? Or are those just higher-level abstractions of the same underlying process?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o054bg/are_humans_just_giant_llms_and_our_jobs_just/",
        "publishDate": "2025-10-07T04:25:34Z[Etc/UTC]",
        "author": "analyticsboi",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o04kh2",
        "title": "The Implausible Singularity Dilemma",
        "content": "The Implausible Singularity Dilemma:\n\nWhen AI Generation Outpaces AI Detection\n\nAiden N. Blake\n\nOctober 7, 2025\n\nNote: Thank you everyone for the previous support, the commentary surrounding AI is very saturated, and many are quick to dismiss, however our inability to act before the \"singularity\" could be humanity's greatest blunder, all of us who understand this are responsible. \n\n**Abstract**\n\nThis note argues that AI generation capabilities are advancing faster than AI detection\n\nmethods. Generation scales in a predictable way with data and compute. Detection is reactive,\n\nbrittle, and lacks similar scaling laws. If these premises hold, we face a discontinuous moment\n\nwhere human and machine outputs become practically indistinguishable, and trust in digital\n\ncontent collapses. I outline the argument, testable predictions, implications, and practical responses centered on provenance rather than post-hoc detection.\n\n1 Introduction\n\nAI models now produce text and media that often pass as human. Efforts to detect such content\n\nexist, but they trail the speed and quality of generators. This paper states a simple claim:\n\nThe pace of AI generation improves faster and more reliably than AI detection; therefore,\n\nonce generation crosses a quality threshold, detection will fail in high-stakes settings.\n\nI call this the Implausible Singularity Dilemma. It is “implausible” only in the sense that many\n\ninstitutions still assume detection will keep up. The dilemma is that by the time we notice failure,\n\nit may be too late for incremental fixes.\n\n1.1 Scope and intent\n\nThis is a position paper. The goal is clarity, not exhaustiveness. I give a minimal argument,\n\npredictions that can be checked, and concrete responses that do not depend on fragile detectors.\n\n2 Premises\n\n2.1 Premise 1: Generation scales predictably\n\nLarger models with more data and compute tend to produce more fluent, coherent, and stylistically\n\nfaithful outputs. This pattern has repeated across model families and domains. While quality is\n\nnot a single number, empirical curves are smooth enough to plan around.\n\n1\n\n2.2 Premise 2: Detection is reactive and brittle\n\nDetection methods typically rely on:\n\n• statistical signals (e.g., burstiness, entropy);\n\n• watermarks or hidden tokens;\n\n• provenance metadata.\n\nEach can be weakened by paraphrase, fine-tuning, ensembling, or format transforms. There is no\n\nreliable “just scale it up” path for detection that matches generation’s compounding gains.\n\n2.3 Premise 3: Asymmetry favors offense\n\nTo fool a detector, a generator needs only to look plausible. To prove authenticity, a detector needs\n\nstrong evidence. This is an asymmetric game. Small changes on the generation side can erase large\n\ninvestments on the detection side.\n\n3 Core Argument\n\nFrom Premises 1–3, the following steps are straightforward.\n\n1. Generation improves monotonically with scale and optimization.\n\n2. Detection lacks a parallel scaling path and degrades under simple countermeasures.\n\n3. Therefore, beyond some quality threshold, detection fails in practice (false negatives dominate;\n\nfalse positives become unacceptable).\n\nFormally, let G(t) denote generation capability over time and D(t) denote detection capability.\n\nIf G follows a smooth improving curve and D is bounded by reactive methods with delay ∆ and\n\nfragility ϕ, then for sufficiently large t:\n\nPr(undetected AI output | optimal countermeasures) → 1,\n\nwhile\n\nPr(mislabeling human as AI) ↑ as detectors tighten.\n\nAt that point, institutions abandon detectors or they harm real users.\n\n4 Testable Predictions\n\nThe dilemma is falsifiable. It implies near-term observations:\n\nP1. Detector half-life: Public detectors that report strong accuracy will lose it within months as\n\nnew models or simple paraphrasers appear.\n\n2\n\nP2. Cross-domain failure: Detectors tuned for one domain (e.g., essays) will fail on others (e.g.,\n\nlegal drafts, research notes) without major retraining.\n\nP3. Adversarial cheapness: Small, cheap attacks (temperature shifts, chain paraphrase, multi-\n\nmodel ensembling) will beat expensive detectors.\n\nP4. Institutional retreat: Universities, courts, and platforms will reduce reliance on detection\n\noutcomes and shift to provenance or process-based policies.\n\n5 Implications\n\n5.1 Epistemic risk\n\nWhen you cannot show who made a claim, the truth of the claim is weakened in practice. Jour-\n\nnalism, science, and law depend on authorship trails. If authorship is uncertain at scale, trust\n\nerodes.\n\n5.2 Economic and legal friction\n\nContracts, compliance documents, and expert testimony may need proof of origin. Without it,\n\ndisputes increase and resolution slows. Fraud becomes cheaper; due diligence becomes slower.\n\n5.3 Social effects\n\nPublic discourse fragments as accusations of “AI-generated” become a standard rebuttal. People\n\nwill doubt real signals because fake ones are common and hard to prove wrong.\n\n6 Counterarguments and Replies\n\n6.1 “Better detectors are coming.”\n\nDetectors may improve locally, but the generator’s counter is simple: ensemble, paraphrase, or\n\nfine-tune. Unless detection gains a new, hard-to-bypass basis, reactive methods will trail. Ask any college student, there are humanizers that pass everyone of the major detectors, with these companies funded with millions, being deceived by groups of savvy coders with limited resources. \n\n6.2 “Watermarking will solve it.”\n\nWatermarks help only if (1) most generators adopt them, (2) they survive transforms and trans-\n\nlation, (3) they are hard to remove, and (4) they are legally or economically enforced. These\n\nconditions are unlikely to hold globally.\n\n6.3 “Provenance will be attached by default.”\n\nCryptographic signing can work where creators opt in and platforms cooperate. But legacy data,\n\nopen weights, and offline content will remain unsigned. We should pursue provenance, but expect\n\nlong, uneven adoption.\n\n3\n\n7 Practical Responses\n\nGiven the asymmetry, the focus should shift from post-hoc detection to pre-commitment of origin\n\nand process assurance.\n\n7.1 Provenance-first infrastructure\n\n• Signing at creation: Devices and authoring tools attach verifiable signatures to content at\n\ncapture time.\n\n• Chain-of-custody: Platforms preserve and expose provenance metadata end-to-end.\n\n• Open standards: Neutral, privacy-aware formats for signing and verification.\n\n7.2 Process-based assessment\n\nIn education, law, and research, evaluate the process (draft history, lab notebooks, version control)\n\nrather than guessing the origin of a final artifact.\n\n7.3 Risk-tiered policies\n\nDo not require proof of origin for low-stakes content. Require stronger provenance as the stakes\n\nrise (e.g., elections, court filings, safety-critical manuals).\n\n8 Related Work (brief )\n\nPrior work explores scaling laws for models, watermarking, stylometry, adversarial robustness, and\n\ncontent authenticity standards. This note integrates those threads into a simple strategic claim:\n\noffense scales; defense reacts.\n\n  \nIf generation continues to scale smoothly and detection remains reactive, the balance tips in favor of\n\ngeneration. When that happens, trying to sort truth from simulation with detectors alone becomes\n\nuntenable. The rational path is to build provenance into the supply chain of information and to\n\nshift institutions toward process-based evaluation where provenance is absent. The time to move\n\nis before the discontinuity, not after.\n\n\n\nReferences\n\n\\[1\\] J. Kaplan et al., “Scaling Laws for Neural Language Models,” 2020.\n\n\\[2\\] J. Kirchenbauer et al., “A Watermark for Large Language Models,” 2023.\n\n\\[3\\] P. Juola, “Authorship Attribution,” Foundations and Trends in IR, 2008.\n\n\\[4\\] C2PA, “Coalition for Content Provenance and Authenticity: Specification,” 2024.\n\n\\[5\\] I. Goodfellow et al., “Explaining and Harnessing Adversarial Examples,” 2015.\n\nResearched and compiled partially with 4o (ironic I know) \n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o04kh2/the_implausible_singularity_dilemma/",
        "publishDate": "2025-10-07T03:56:01Z[Etc/UTC]",
        "author": "Proud-Revenue-6596",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o02xre",
        "title": "When millions of people start thinking with AI — not just using it — does that make society itself start to “think”?",
        "content": "Lately I’ve been wondering if we’re seeing the early signs of a new kind of collective cognition.\n\nEvery day, millions of us bounce ideas off chatbots or assistants — not just to get answers, but to understand our own thinking. That feedback loop feels different from a search engine; it’s more like having a mirror for your cognition.\n\nIf enough people do that at once, does something larger start to emerge — a civilization that’s learning to reflect on itself?\n\nMaybe the next real leap in AI isn’t a smarter model, but a more reflective society. What do you think: could human-AI reflection actually become a new layer of collective intelligence, or is that just poetic hype?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o02xre/when_millions_of_people_start_thinking_with_ai/",
        "publishDate": "2025-10-07T02:33:07Z[Etc/UTC]",
        "author": "[deleted]",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o00oyv",
        "title": "Will AI be able to cure hearing loss / tinnitus and other diseases?",
        "content": "What is your guys take on this how will AI be able to cure hearing loss / tinnitus and other diseases that are chronic? How will AI be able to speed things up.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o00oyv/will_ai_be_able_to_cure_hearing_loss_tinnitus_and/",
        "publishDate": "2025-10-07T00:48:35Z[Etc/UTC]",
        "author": "Gloomy-Bat-3958",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o00l5p",
        "title": "Deloitte refunds Australia $290K after AI-generated report errors — What does this mean for AI adoption in professional services?",
        "content": "Deloitte has agreed to refund the Australian government after its $440,000 report, which included fabricated academic references and a fake court quote, was found to contain errors. The company admitted to using Azure OpenAI GPT-4o to assist in the report's creation but stopped short of confirming that AI was responsible for the mistakes. The corrected version of the report has been re-uploaded, with Deloitte emphasizing that the core findings and recommendations remain unchanged. \n\nThis incident raises questions about the reliability of AI tools in professional services and the potential risks of over-reliance on them. While AI can enhance efficiency, it also highlights the importance of human oversight in ensuring accuracy and accountability.\n\nThis seems like an introduction of more and possibly bigger problems to come!\n\n[Full Story](https://verity.news/story/2025/deloitte-refunds-australia-k-for-aigenerated-report-errors?p=re4008)\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o00l5p/deloitte_refunds_australia_290k_after_aigenerated/",
        "publishDate": "2025-10-07T00:43:44Z[Etc/UTC]",
        "author": "QuantumQuicksilver",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzzxt6",
        "title": "Should AI diagnostic systems be permitted to make medical decisions independently, without human supervision?",
        "content": "I have been asked this question and have been thinking about it from an ethical point of view, but i’m nog familiar with how well developed some AI might be. Any input is welcome. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzzxt6/should_ai_diagnostic_systems_be_permitted_to_make/",
        "publishDate": "2025-10-07T00:13:36Z[Etc/UTC]",
        "author": "justcur1ou5",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzzpsw",
        "title": "OpenAI just quietly killed half of the Automation Startup's",
        "content": "Alright, so apparently OpenAI just released an update and with that They quietly *redesigned the entire AI stack* ***again.***\n\nThey dropped this thing called **Agent Kit,** basically, you can now build agents that actually *talk to apps*. Not just chatbots. Real agents that open Notion pages, send Slack messages, check emails, book stuff, all by themselves. The way it works is Drag-and-drop logic + tool connectors + guardrails. People are already calling it “n8n for AI”  - but better integrated.\n\nOpenAI has killed many startups … small automation suites, wrappers … betting on being specialized. There’s this idea in startup circles: once a big platform acquires feature parity + reach, your wrapper / niche tool dies.\n\nHere's what else is landed along with Agent SDK - \n\n**Apps SDK** : you can now build apps that *live inside ChatGPT*; demos showed Canva, Spotify, Zillow working in-chat (ask, click, act). That means ChatGPT can call real services and UIs not just text anymore.\n\n**Sora 2** **API :** higher-quality video + generated audio + cameos with API access coming soon. This will blow up short-form content creation and deepfake conversations  and OpenAI is already adding controls for rights holders.\n\n**o1 (reinforcement-trained reasoning model)** : OpenAI’s “think more” model family that was trained with large-scale RL to improve reasoning on hard tasks. This is the backbone for more deliberative agents.\n\n**tl;dr:**  \n  \nOpenAI just went full Thanos.  \nHalf the startup ecosystem? Gone.  \nThe rest of us? Time to evolve or disappear.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzzpsw/openai_just_quietly_killed_half_of_the_automation/",
        "publishDate": "2025-10-07T00:03:27Z[Etc/UTC]",
        "author": "reddit20305",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "474",
            "commentCount": "151",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzyzll",
        "title": "Current RL is not Scalable - Biggest Roadblock to AGI",
        "content": "The way we currently do RL is by setting a goal for an AI and letting it solve it over time. In a way this seems like its very scalable, considering the more time/compute you put in, the better it gets at this specified goal. The problem however, is that AGI requires an  AI to be good at an almost infinite amount of goals. This would require humans to set up every goal and RL environment for every task, which is impossible. One RL task is scalable, but RL over all tasks is limited by human time.\n\nWe can compare the era we are in with RL for posttraining to the era of supervised learning for pretraining. Back when we used to manually specify each task for pretraining, models were very specialized. Self-supervised learning unlocked scaling model intelligence for any task by taking the human labor out of the equation. Similarly, we have to find a way in which we can have AI do RL for any task as well without a human specifying it. Without a solution to this, AGI stays seriously out of reach.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzyzll/current_rl_is_not_scalable_biggest_roadblock_to/",
        "publishDate": "2025-10-06T23:30:28Z[Etc/UTC]",
        "author": "PianistWinter8293",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzyt4k",
        "title": "Build over Buy",
        "content": "I’ve always thought that building AI in the organization should be focused on the core product of your company. My company want to build everything including replacing Copilot 365. I’m not a huge fan of Copilot so far but surely it doesn’t make commercial sense to build this level of AI for every application? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzyt4k/build_over_buy/",
        "publishDate": "2025-10-06T23:22:27Z[Etc/UTC]",
        "author": "Affectionate_Let1462",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzyshk",
        "title": "\"The Algorithmic Watchdog: Can AI Reinvent Arms Control?\"",
        "content": "[https://aijourn.com/the-algorithmic-watchdog-can-ai-reinvent-arms-control/](https://aijourn.com/the-algorithmic-watchdog-can-ai-reinvent-arms-control/) \n\n\"For decades, global security has been balanced by complex arms control treaties. The success of these agreements hinges on one thing: credible verification. Traditional methods—relying on on-site inspections, spy satellites, and seismic sensors—are straining under the pressures of the modern world. Conflicts in the 21st century have demonstrated how digital deception and massive data volumes overwhelm traditional monitoring tools.  AI offers a powerful solution to process vast datasets and detect deception with a speed and scale that was previously science fiction.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzyshk/the_algorithmic_watchdog_can_ai_reinvent_arms/",
        "publishDate": "2025-10-06T23:21:37Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzyscu",
        "title": "People crying about LLMs hurting their feelings.. wtf?",
        "content": "Scrolling these last few days on Reddit, I realized most prone are crying a river to Anthropic just because Claude gave them a mean response… like bro: do you really care on how a literal robot responds to you?\n\nLook.. I get it.. you might be going through a hard time and a bot is the only one who is down to listen to right now.. but understand this is literally a machine trained with numbers. It literally has no feelings\n\nUse AI for what it is -> solving boring tasks and helping you to discover new ideas.. insights.. etc\n\nIf you need mental support go to a therapist",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzyscu/people_crying_about_llms_hurting_their_feelings/",
        "publishDate": "2025-10-06T23:21:27Z[Etc/UTC]",
        "author": "cryptoviksant",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "30",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzxl47",
        "title": "\"‘Swarms of Killer Robots’: Why AI is Terrifying the American Military\"",
        "content": "[https://www.politico.com/news/magazine/2025/10/06/ai-pentagon-threats-leaks-killer-robots-ai-psychosis-00593922](https://www.politico.com/news/magazine/2025/10/06/ai-pentagon-threats-leaks-killer-robots-ai-psychosis-00593922) \n\nA Q&A with a former Pentagon insider on the AI debates that could shape the future of national security.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzxl47/swarms_of_killer_robots_why_ai_is_terrifying_the/",
        "publishDate": "2025-10-06T22:30:24Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzur55",
        "title": "Almost 100M jobs could be lost to AI, automation: Senate report (The Hill)",
        "content": "[Link to article  ](https://thehill.com/policy/technology/5541307-ai-automation-job-replacement/) \n\nA [Senate report](https://www.sanders.senate.gov/wp-content/uploads/10.6.2025-The-Big-Tech-Oligarchs-War-Against-Workers.pdf) released Monday says AI and automation could replace nearly 100 million jobs across various industries over the next decade.\n\nThe report, conducted by Democratic staffers on the Senate Health, Education, Labor and Pensions (HELP) Committee, led by Sen. [Bernie Sanders ](https://thehill.com/people/bernie-sanders/)(I-Vt.), outlines how AI and automation will impact the American economy and workforce.\n\nAs part of their investigation, staffers asked ChatGPT, OpenAI’s chatbot, to predict the impact of AI and automation on certain industries.\n\nOf the 20 workforces ChatGPT said would be most affected by the technological rush, 15 will see more than half of their workforces replaced by AI and automation over the next decade. \n\nJohnson says Congress has plenty of time to negotiate ACA subsidies before deadline\n\nThe workforce most impacted will be fast food and counter employees. According to the report, more than 3 million fast food and counter workers will be replaced over the next 10 years, accounting for 89 percent of the workforce. \n\nOther workforces that will be significantly affected include customer service representatives, laborers and freight, stock and material movers and secretaries and executive assistants — not including legal, medical and executive positions. The report said that 83 percent, 81 percent and 80 percent of those workforces, respectively, will be replaced in the next decade. \n\nThe report also calls for policy changes to provide guardrails for workers amid the move to AI and automation, saying the impact of AI and automation “will be determined by a set of choices.”\n\nIt calls for, among other pieces of legislation, a standardized 32-hour work week, extended overtime and break protections, a minimum wage of at least $17 an hour, elimination of tax loopholes for corporations that use AI and automation and requirements for corporations to give workers a stake in the business. \n\nSanders, in a [Fox News op-ed](https://www.foxnews.com/opinion/sen-sanders-ai-benefit-everyone-not-just-handful-billionaires) published Monday, doubled down on the report’s findings, saying increased technological capacity risks “dehumanizing” individuals.\n\n“We do not simply need a more ‘efficient’ society,” Sanders said. “We need a world where people live healthier, happier and more fulfilling lives.”\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzur55/almost_100m_jobs_could_be_lost_to_ai_automation/",
        "publishDate": "2025-10-06T20:41:23Z[Etc/UTC]",
        "author": "No-Author-2358",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzuq5d",
        "title": "Who actually wants the Cameo feature in Sora?",
        "content": "\nOpenAI just rolled out “Cameos”, basically a way to train Sora to use your face and voice so it can drop you into generated videos.\n\nI can’t tell if this is supposed to be the next evolution of social video creation, or just the next step toward deepfake normalization.\n\nDo people really want to see themselves in AI-generated scenes? Or is this a feature searching for a use case?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzuq5d/who_actually_wants_the_cameo_feature_in_sora/",
        "publishDate": "2025-10-06T20:40:23Z[Etc/UTC]",
        "author": "Own_Cabinet_2979",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzu4eq",
        "title": "Report: Israel to spend over half a billion shekels turning ChatGPT into public diplomacy tool",
        "content": "So it turns out that most people don’t support what this country is doing, so they decided to spend money on propaganda on ChatGPT. \n\nWhat’s people’s thoughts on this?\n\nhttps://www.ynetnews.com/tech-and-digital/article/rj00kxqzaxx",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzu4eq/report_israel_to_spend_over_half_a_billion/",
        "publishDate": "2025-10-06T20:18:41Z[Etc/UTC]",
        "author": "Secure_Ad2339",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "66",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzti6i",
        "title": "12 last steps",
        "content": "I saw a mention of a book called \"12 Last Steps\" by Selwyn Raithe in a youtube comment. Seemed interesting at first - a book about AI takeover or something. Whatever, I'm interested so I bit. But the more I looked I was getting confused.\n\nYou can't find a lot of information online about it, outside of conspiracy subreddits and Medium.com. There's only 2-3 ratings on Goodreads and Amazon.\n\nOk... So I went to the website but it looks to be ai generated slop text with sus pictures. \n\nSo there's not much info online, and the promotional material is suspiciously AI like.\n\nSo I go back to the Reddit and YouTube comments that are claiming this book to be good - all accounts praising it are less than a month old with a single comment in their history - all about this book.\n\nSo to be clear. This is most likely a book written by AI, promoted on an AI generated website, and being pushed online by AI bots. And the book is about... Warning people against the rise of AI.\n\nIt's just so bizarre and for me the first real wake-up of where the internet is heading.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzti6i/12_last_steps/",
        "publishDate": "2025-10-06T19:56:43Z[Etc/UTC]",
        "author": "Blackham",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzs5zf",
        "title": "Why no AI memory?",
        "content": "I asked ChatGPT what it remembers about our dialog in last hour, day, week etc. the answer was this: “I don’t actually retain detailed memory of our past chats over time — so I can’t recall earlier conversations unless they’re visible right now in this thread.\n\nIf I had memory on, I could remember facts you asked me to keep (like preferences or ongoing projects) and bring them up later. But currently, I can only see what’s in this session.”\n\nIs this true? If so why does chatGPT have no significant memory?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzs5zf/why_no_ai_memory/",
        "publishDate": "2025-10-06T19:07:29Z[Etc/UTC]",
        "author": "anchordoc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzre3u",
        "title": "AI compliance = meaningless checkbox",
        "content": "With new AI regulations popping up, companies are scrambling to be safe. But let's be honest: these laws are already outdated. They're written by people who don't understand the tech, and they focus on yesterday's problems. Is anyone else tired of seeing companies get a stamp of approval for models that are still dangerously easy to misuse? How do we build real trust when the official rules are a joke?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzre3u/ai_compliance_meaningless_checkbox/",
        "publishDate": "2025-10-06T18:38:30Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzob61",
        "title": "How to break AI like I did?",
        "content": "I was just asking basic questions about health and microelements (zinc and iron deficiency) and DeepSeek broke. He started combining real words in non-existing (\"doctoring\" and \"dedeficienciency\") and making unnessesary paragraphs (\"4. so\", \"5. And  **\") and mixing other languages (chinese). Why did it happen, how do I recreate this? It was pretty interesting and ngl pretty funny.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzob61/how_to_break_ai_like_i_did/",
        "publishDate": "2025-10-06T16:44:14Z[Etc/UTC]",
        "author": "Adept-Ad-5708",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzm8j4",
        "title": "We don't need AGI to experience the paperclip problem",
        "content": "Just look around and see what happens when people accumulate too much power. The multi billionaires tell us all we need to know about the dystopian future we fear. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzm8j4/we_dont_need_agi_to_experience_the_paperclip/",
        "publishDate": "2025-10-06T15:29:21Z[Etc/UTC]",
        "author": "tedsan",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "21",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzku0u",
        "title": "There have been many times where I will write a post and it gets badly received, but then I have ChatGPT rewrite it for me and it gets praised.",
        "content": "Of course I remove all the em dashes and all the shit that ChatGPT does that makes it obvious, it's written by AI. But the rewrite is still 99% AI.\n\nAnd it's crazy how often something worded differently will get upvoted while original human writing gets downvoted. Though not to be disingenuous or anything, but I will admit that my writing style can come across as \"asshole-y\" (my best way to describe it).\n\nI just like to say shit straight and not sugarcoat it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzku0u/there_have_been_many_times_where_i_will_write_a/",
        "publishDate": "2025-10-06T14:37:24Z[Etc/UTC]",
        "author": "executor-of-judgment",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzi190",
        "title": "I struggle to understand people who rely on AI for everything",
        "content": "  \n  So a few weeks ago I had a birthday. And as a year long project I decided to take the plunge and develop my own game. But the key is I was going to do it purely from scratch (not use a game engine), and it was a good excuse to learn the Zig programming language. I gave myself a year just to create a single level in the game. Not to create a full game, just a single level. The end to result isn't just having a completed game, but to understand the process and the fundamentals of game development.\n\n I told a friend about it, and he was like \"you're using Unity right\". and I was like \"no I'm going to use a C-like language called Zig and create it from scratch\". He was then like \"why would you do that\". I was like \"for a challenge\". And then he said something that irritated me, \"just having Cursor do it for you, not sure why you're wasting your time\". And I said \"because if it I did that I wouldn't learn anything\". He then said , \"but is that going to make you any money\"?  And I just changed the topic. he clearly didn't get it.\n\nBut anyway I don't quite get the mentality of people like this. He's a good friend, but he's very results driven. I am too under the right circumstances (like at work or under a deadline). But I genuinely enjoy problem solving and being a software engineer. And I like learning new stuff.\n\nBut here is the crux of the argument. I feel that people's mentality is basically \"you don't really need to understand things anymore\". At the process of my game now, I just built my animation system from scratch. AI probably could have nailed that within a few minutes. It took me 3 weeks. But see I understand the fundamentals of an animation system. Its a concept I could talk about and re-implement if I had to.  Its deep understanding, and deep understanding takes time. AI is telling you, \"don't really bother to understand things, just understand them enough to get an immediate result\".\n\nI'm seeing at work. The other day I was pairing with a junior. And they couldn't write a basic \"insert\" query. They just asked co-pilit to make it. Or I had one guy who needed to modify 2 lines of code, and had co-pilot do it for him. And I'm thinking like \"why do people think its ok for AI to think for you\".  Why can't you just understand the pattern inside of a SQL insert syntax? Or why couldn't you just modify 2 lines of code yourself? \n\nAm I crazy but is AI literally a mental disease? Where people just aren't thinking about anything. If something takes more than 3 minutes to think about, then people are just prompting.\n\n  \n**TL;DR:**  AI feels to me like people who roll around in those carts at the grocery store who can clearly walk. But they're too big and too lazy to do it. AI is like \"hey its easier to roll around in a wheelchair, because you don't have to strain your legs\".  But sometimes walking just feels good. I honestly thing skill atrophy is real. But I also think people are forming an addiction to AI, where they can't do anything without it. Maybe people who use AI for everything can help me understand.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzi190/i_struggle_to_understand_people_who_rely_on_ai/",
        "publishDate": "2025-10-06T12:44:49Z[Etc/UTC]",
        "author": "GolangLinuxGuru1979",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0clfh",
        "title": "I built a full web based historical detective game with Claude and GPT in about 10 days",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1nzrwc5",
        "publishDate": "2025-10-07T11:52:21Z[Etc/UTC]",
        "author": "freeman9235",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0bfmk",
        "title": "Best text to speech API for AI news podcast?",
        "content": "I vibe coded a daily AI news podcast called AI Convo Cast. Some of the feedback received has been the voice is still too fake sounding. I recently switched the voice to Eleven Labs V3 from V2 and have also tried Google’s text to speech API. What are the best available text to speech APIs for reading something like a AI news script? Any settings recommendations, etc. Also linking episode in case you have any feedback or thoughts on the voice, sound, content, etc. Thank you.",
        "url": "https://open.spotify.com/episode/7xWsfOyIHoRt1TSuLA6BV8?si=S2QfLNiBSNSWDnkHZuUftA",
        "publishDate": "2025-10-07T10:53:28Z[Etc/UTC]",
        "author": "oconn",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0a416",
        "title": "Somebody messed up at Cursor",
        "content": "https://preview.redd.it/9fcclk53tntf1.png?width=1312&format=png&auto=webp&s=2c5859cbae30373936043d3538583114ccfe109b\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o0a416/somebody_messed_up_at_cursor/",
        "publishDate": "2025-10-07T09:34:47Z[Etc/UTC]",
        "author": "Curious_Cantaloupe65",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o09x33",
        "title": "Just built a Gmail automation tool – would love your feedback!",
        "content": "Just built a Gmail automation tool – would love your feedback!\n\nHey everyone! 👋\n\nI’ve been working on a small project called MailAura, a Gmail automation tool that:\n\nAutomatically drafts emails using AI\n\nBlocks unwanted or spam emails like Instagram or Snapchat notifications\n\nOrganizes important emails and stores them in Airtable for easy tracking\n\n\nI’m still in the early stages and would love your feedback on the tool—what works, what could be improved, and what features you’d like to see.\n\nIf you’re interested, you can try it out here: [https://bettercallnava.github.io/youTubeClone/index3.html]\n\nThanks in advance! Any thoughts, suggestions, or critiques are super welcome. 🙏",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o09x33/just_built_a_gmail_automation_tool_would_love/",
        "publishDate": "2025-10-07T09:22:10Z[Etc/UTC]",
        "author": "BaCaDaEa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o09cms",
        "title": "6 Months Building an AI-Assisted Habit App Solo — What I Learned (and Rebuilt)",
        "content": "Hey everyone 👋\n\nI’ve spent the last 6 months building JustGrind: a habit-tracking web app that uses AI-assisted systems to help you stay consistent without burnout or dopamine streaks.\n\nI didn’t train models or fine-tune anything fancy — I mostly used ChatGPT as my dev partner to brainstorm and debug.  \nIt helped me:\n\n* design the database and RLS logic in Supabase\n* sketch user flow and architecture\n* debug frontend code in React + Astro\n* and even name features when my brain was fried 😂\n\n⚙️ **Tech Stack**  \nAstro + React + TailwindCSS + Supabase + Stripe + Vercel\n\n🧩 **What I Learned**\n\n* AI is the best rubber-duck debugger — talking through a bug with ChatGPT saved me hours.\n* Prompting is a dev skill; how you ask matters more than the model.\n* UI > complexity = users care about clarity and calm UX, not fancy dashboards.\n* Launch fast, learn faster = the scariest “post” button always brings the best feedback.\n\n🚀 **Where It’s At**  \nV2 just went live yesterday — rebuilt from scratch after realizing my first version was over-engineered.\n\n👉 **Live demo:** [https://justgrinds.vercel.app](https://justgrinds.vercel.app)\n\nStill early days, but proud of how far it’s come.  \nAlways open to connecting with others building AI-assisted tools 🙌\n\n  \n(Posted with mod approval — sharing for educational purposes)",
        "url": "https://i.redd.it/bmlp71prjntf1.png",
        "publishDate": "2025-10-07T08:46:06Z[Etc/UTC]",
        "author": "lyl9",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o06p6q",
        "title": "How do I paste image to Codex Cli?",
        "content": "I run Codex Cli on Windows CMD inside WSL. How do I paste image to codex?\n\nI have tried ctrl+v and ctrl+shift+v. I can only paste text with right click.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o06p6q/how_do_i_paste_image_to_codex_cli/",
        "publishDate": "2025-10-07T05:56:23Z[Etc/UTC]",
        "author": "-RoopeSeta-",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o06cj2",
        "title": "Which model for which tasks (Codex)",
        "content": "I just migrated from Augment towards ChatGTP Codex and I wonder which model do you guys use for which tasks.\n\nI read in another thread that GPT-5-Medium/High is good for planning?   \nAnd GTP-5-Codex good for executing the tasks?\n\nHappy to read some reviews what worked for you on your project the last weeks.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o06cj2/which_model_for_which_tasks_codex/",
        "publishDate": "2025-10-07T05:34:59Z[Etc/UTC]",
        "author": "ChristBKK",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o01vw4",
        "title": "Claudette Coding agent v5",
        "content": "https://gist.github.com/orneryd/334e1d59b6abaf289d06eeda62690cdb\n\n\nthere’s a few different flavors now, all V5 but with different goals in mind and reduced contextual overhead for the compact version. \n\nhttps://gist.github.com/orneryd/334e1d59b6abaf289d06eeda62690cdb#file-version-comparison-md\n\nstill focused on auto-discovery, research, and autonomous execution. latest version focuses on positive reframing throughout to encourage autonomous function, and preventing context drift\n\nOriginal  - 4,860 tokens \n\nAuto  - ~3,440 tokens\n\nCondensed  - ~2,390 tokens \n\nCompact  - ~1,370 tokens \n\nBeast-mode  - ~2,630 tokens\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o01vw4/claudette_coding_agent_v5/",
        "publishDate": "2025-10-07T01:43:36Z[Etc/UTC]",
        "author": "Dense_Gate_5193",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o00e8h",
        "title": "Open Source Alternative to NotebookLM",
        "content": "For those of you who aren't familiar with SurfSense, it aims to be the **open-source alternative to NotebookLM, Perplexity, or Glean.**\n\nIn short, it's a Highly Customizable AI Research Agent that connects to your personal external sources and Search Engines (Tavily, LinkUp), Slack, Linear, Jira, ClickUp, Confluence, Gmail, Notion, YouTube, GitHub, Discord, Airtable, Google Calendar and more to come.\n\nI'm looking for contributors to help shape the future of SurfSense! If you're interested in AI agents, RAG, browser extensions, or building open-source research tools, this is a great place to jump in.\n\nHere’s a quick look at what SurfSense offers right now:\n\n**Features**\n\n* Supports 100+ LLMs\n* Supports local Ollama or vLLM setups\n* 6000+ Embedding Models\n* 50+ File extensions supported (Added Docling recently)\n* Podcasts support with local TTS providers (Kokoro TTS)\n* Connects with 15+ external sources such as Search Engines, Slack, Notion, Gmail, Notion, Confluence  etc\n* Cross-Browser Extension to let you save any dynamic webpage you want, including authenticated content.\n\n**Upcoming Planned Features**\n\n* Mergeable MindMaps.\n* Note Management\n* Multi Collaborative Notebooks.\n\n**Interested in contributing?**\n\nSurfSense is completely open source, with an active roadmap. Whether you want to pick up an existing feature, suggest something new, fix bugs, or help improve docs, you're welcome to join in.\n\nGitHub: [https://github.com/MODSetter/SurfSense](https://github.com/MODSetter/SurfSense)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o00e8h/open_source_alternative_to_notebooklm/",
        "publishDate": "2025-10-07T00:34:49Z[Etc/UTC]",
        "author": "Uiqueblhats",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "15",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzzvix",
        "title": "Codex officially generally available + key DevDay updates worth knowing",
        "content": "[No content]",
        "url": "https://openai.com/index/codex-now-generally-available/",
        "publishDate": "2025-10-07T00:10:40Z[Etc/UTC]",
        "author": "anonomotorious",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzydur",
        "title": "OpenAI Launches \"AgentKit\"",
        "content": "Hi All,\n\nSuper excited to see OpenAI launches an Agent Builder called  \"AgentKit\" , This is new era of building i think.\n\nBuild an APP via APP SDK and then hook the App with many of these Agents built via Agent Kit.\n\nits crazy to think workflows and use cases it unlocks.\n\nI would love to learn more about it. Build some scenarios , Test best prompts.\n\nIf you are keen as well, Lets connect.\n\nI actually created a Subreddit for it and will share if more people keen to join me in this Journey.\n\nCheers !!\n\nEdit - Since many people joined the Sub. Sharing the link in main post- [r/OpenAIAgentKit](https://www.reddit.com/r/OpenAIAgentKit/)\n\n(Mod please cut some slack or tell me - will remove the link. No shilling here just some like minded people to learn and share..Thanks) ",
        "url": "https://i.redd.it/t0jpox2pnktf1.png",
        "publishDate": "2025-10-06T23:04:16Z[Etc/UTC]",
        "author": "Impressive-Owl3830",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "54",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzx7k3",
        "title": "My experience coding with open models (Qwen3, GLM 4.6, Kimi K2) inside VS Code",
        "content": "I’ve been using **Cursor** for a while, mainly for its smooth AI coding experience. But recently, I decided to move my workflow back to **VS Code** and test how far **open-source coding models** have come.\n\nThe setup I’m using is simple:  \n\\- VS Code + Hugging Face Copilot Chat extension  \n\\- Models: Qwen 3, GLM 4.6, and Kimi K2\n\nHonestly, I didn’t expect much at first, but the results have been surprisingly solid.  \nHere’s what stood out:\n\n* These open models handle refactoring, commenting, and quick edits really well.\n* They’re **way** cheaper than proprietary models, no token anxiety, no credit drain.\n* You can switch models on the fly, depending on task complexity.\n* No vendor lock-in, full transparency, and control inside your editor.\n\nI still agree that Claude 4.5 or GPT-5 outperform in deep reasoning and complex tasks, but for 50–60% of everyday work, writing code, debugging, or doc generation, these open models perform just fine.\n\nIt feels like the first time open LLMs can actually compete with closed ones in real-world dev workflows. I also made a short tutorial showing how to set it up step-by-step if you want to try it: [Setup guide](https://youtu.be/6pcBBLXxOEc)\n\nI would love to hear your thoughts on these open source models!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzx7k3/my_experience_coding_with_open_models_qwen3_glm/",
        "publishDate": "2025-10-06T22:14:50Z[Etc/UTC]",
        "author": "Arindam_200",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzx414",
        "title": "Organizing code changes for commits with AI",
        "content": "# Problem\n\nI want clean commits, which allows me to easily revert changes, trace code history, etc. But our engineering process is often messy: while solving one problem, I may see small issues here and there, and I sometimes just fix those right away.\n\nThen it becomes a chore when I commit. I need to tease out which changes belong to which topic, and how to sequence them, etc.\n\n# Solution\n\nI did an experiment to ask AI to help me organize those changes. Basically throwing all the code changes at it and tell it to group them based on topic, and I make commit based on the grouping. It worked fairly well. Even with changes in the same file, which is a pain to tease apart, can be dealt with easily.\n\nA few neat things about this:\n\n1. Splitting changes into topics helps me catch things I didn't intend to commit in the first place, such as logs/print statements, config changes, injected fake data for testing, commented out code that I forgot to revert, etc.\n2. I can have multiple agents working in parallel on different tasks on the same codebase copy, because the changes can now be easily organized into clean commits.\n\nI built this to help my own development process. If this is of interest to anyone here, let me know. I will share a few screenshots so you know what it looks like.\n\n[You can offer some hints to tell AI how you want the changes grouped](https://preview.redd.it/pm2veiz1ektf1.png?width=1734&format=png&auto=webp&s=0797f62cd1fc4a31c06ca119a1adfbe8b04810cc)\n\n[You can view individual changes, and revert them if needed](https://preview.redd.it/254b9h4iektf1.png?width=1700&format=png&auto=webp&s=1bc4e2ed525fe66a36360b91ba230bafb48f9809)\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzx414/organizing_code_changes_for_commits_with_ai/",
        "publishDate": "2025-10-06T22:10:53Z[Etc/UTC]",
        "author": "Puzzleheaded_Ebb1562",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzwh93",
        "title": "I want to build a program that scrapes county websites",
        "content": "I created a program with ChatGPT that would go to my county's clerk of court website and pull foreclosure data and then put that data into a spreadsheet. It worked pretty well to my surprise but I was testing it so much that the website blocked my IP or something. \"...we have implemented rate-limiting mitigation from third party vendors...\"\n\nIs ChatGPT the best platform for this type of coding? Would a VPN help me not get blocked by the website?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzwh93/i_want_to_build_a_program_that_scrapes_county/",
        "publishDate": "2025-10-06T21:45:45Z[Etc/UTC]",
        "author": "Appropriate_Bet5290",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzt1o9",
        "title": "Anyone else think some IDEs are criminally underrated with Codex?",
        "content": "Hey everyone,\n\nSo, I've been diving deep into using Codex (and similar AI coding tools) lately, and it's been a game-changer for tackling boilerplate and speeding up development. But I've noticed something interesting: the IDE you use *really* impacts how effective it is. Some IDEs just feel clunky and slow when you're constantly switching between writing code and prompting the AI.\n\nI've been bouncing between a few different environments, and honestly, some of the big names just haven't clicked for me. VS Code is great, but sometimes it feels like navigating a battleship. I need something a bit more streamlined, especially when I'm in the flow with Codex. I've tried a few alternatives, and one that's surprised me is this tool called Trae. I know, it's not super well-known, but the UI is surprisingly clean and intuitive. It's got this \"IDE mode\" that's way better than Cursor, and it just feels faster for quick code reviews and edits. Plus, it's compatible with Codex, which is a must for me right now. I've even been playing around with their SOLO mode, which looks like it's going to totally overhaul the coding agent GUI, it's still early days, but it looks very promising. \n\nI think a lot of the focus is on the AI itself (understandably!), but the IDE experience is crucial. Are there any other underrated IDEs or setups that you guys have found pair particularly well with Codex or similar AI assistants? I'm always looking for ways to improve my workflow and would love to hear what works for you. What are your favorite IDEs for AI-assisted coding, and why? Let's share some gems!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzt1o9/anyone_else_think_some_ides_are_criminally/",
        "publishDate": "2025-10-06T19:40:06Z[Etc/UTC]",
        "author": "Some_Bid3004",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzslw1",
        "title": "GPT5 Codex extension",
        "content": "[No content]",
        "url": "/r/cursor/comments/1nz9n3q/gpt5_codex_extension/",
        "publishDate": "2025-10-06T19:24:07Z[Etc/UTC]",
        "author": "abcdecentralized",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzpujv",
        "title": "Trying to start a channel where I share interesting facts and tools. Could anyone share their projects?",
        "content": "Basically the title. Looking for cool, community made projects to share on the channel. If you're okay sharing, I'd love to make a short on anything you've built!\n\n\nhttps://youtube.com/@zakaizu1?si=3Wgq5vsUMlKpiG_p",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzpujv/trying_to_start_a_channel_where_i_share/",
        "publishDate": "2025-10-06T17:41:25Z[Etc/UTC]",
        "author": "PromptCoding",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzk6u0",
        "title": "What is the actual limit on the $3 GLM plan?",
        "content": "I've had tasks on OpenCode run for almost 30 minutes several times a day with who knows how many compactions and I have never hit a limit. Would I need to be running multiple agents full time to get throttled? ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nzk6u0/what_is_the_actual_limit_on_the_3_glm_plan/",
        "publishDate": "2025-10-06T14:12:58Z[Etc/UTC]",
        "author": "Illustrious-Many-782",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0dhcc",
        "title": "Can AI become the director of a game?",
        "content": "I am a developer from France, most of my career I worked on backend, infrastructure, and load systems. In 2023 I switched to AI and instead of training models for the usual tasks, I decided to test what happens if you give an LLM full control over the story?\n\nMy experiment looked like this: AI creates a scene, characters, and dialogue. The player makes a choice and the story branches. No scripted events, every action leads in a new direction. At first it looked like chaos, but over time out of this chaos a visual novel engine started to take shape.\n\nThat’s how Dream Novel appeared (a project that is still at an early stage, but already works). It showed me that AI can be not just a tool for assistance, but a co-creator that writes the game together with the player in real time.\n\nAnd now I want to ask the community: do you believe that AI can really become the director of a game or will it always remain just a tool in the hands of humans?\n",
        "url": "https://www.reddit.com/r/artificial/comments/1o0dhcc/can_ai_become_the_director_of_a_game/",
        "publishDate": "2025-10-07T12:33:08Z[Etc/UTC]",
        "author": "IfnotFr",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0dccd",
        "title": "Unitree G1 Basic on Walmart for $21,600",
        "content": "[https://www.walmart.com/ip/Unitree-G1-Basic/17225710863](https://www.walmart.com/ip/Unitree-G1-Basic/17225710863)",
        "url": "https://i.redd.it/9fuxgixtnotf1.jpeg",
        "publishDate": "2025-10-07T12:26:58Z[Etc/UTC]",
        "author": "Nunki08",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0d5zs",
        "title": "\"Full automation is inevitable\" - A reminder that AI companies aim to take every single job",
        "content": "Mechanize is an AI company and their stated goal is \"the automation of all valuable work in the economy.\"",
        "url": "https://i.redd.it/v91zeuojmotf1.png",
        "publishDate": "2025-10-07T12:19:29Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0cycd",
        "title": "Why can't you just be normal technology?",
        "content": "[No content]",
        "url": "https://i.redd.it/w9kqv09qkotf1.png",
        "publishDate": "2025-10-07T12:09:23Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o0b6pv",
        "title": "Catching up fast",
        "content": "[No content]",
        "url": "https://i.redd.it/dbp5daxn4otf1.png",
        "publishDate": "2025-10-07T10:39:16Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o08lhl",
        "title": "Intervo just revamped their landing page, way more detailed and user-focused now",
        "content": "Intervo recently updated their landing page, and the change is pretty noticeable. The new version is packed with clearer details about what their AI voice agents actually do — from business call automation to customer support integrations.\n\nThey’ve also added:\n\t•\tReal examples of use cases\n\t•\tA better demo section\n\t•\tTransparent pricing and feature breakdowns\n\t•\tCleaner design with faster load times\n\nIt’s nice to see AI startups moving from vague marketing talk to real, informative pages that actually help users understand the product.\n\nIf you’ve checked it out recently, what do you think of the redesign?",
        "url": "https://www.reddit.com/r/artificial/comments/1o08lhl/intervo_just_revamped_their_landing_page_way_more/",
        "publishDate": "2025-10-07T07:56:40Z[Etc/UTC]",
        "author": "blizzerando",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o080la",
        "title": "Why do AI boosters believe that LLMs are the route towards ASI?",
        "content": "\n\nAs per my understanding of how LLMs and human intelligence work, neural networks and enormous data sets are not gonna pave the pathway towards ASI. I mean, look at how children become intelligent. We don't pump them with petabytes of data. And look at PhD students for instance. At the start of a PhD, most students know very little about the topic. At the end of it, they come out as not only experts in the topic, but widened the horizon by adding something new to that topic. All the while reading not more than 1 or 2 books and a handful of research papers. It appears the AI researchers are missing a key link between neural network and human intelligence which, I strongly believe, will be very difficult to crack within our lifetimes. Correct me if I'm wrong. ",
        "url": "https://www.reddit.com/r/artificial/comments/1o080la/why_do_ai_boosters_believe_that_llms_are_the/",
        "publishDate": "2025-10-07T07:18:31Z[Etc/UTC]",
        "author": "nightking_darklord",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o07w54",
        "title": "Almost All New Code Written at OpenAI Today is From Codex Users: Sam Altman",
        "content": "Steven Heidel, who works on APIs at OpenAI, revealed that the new drag-and-drop Agent Builder, which was recently released, was built end-to-end in just under six weeks. “Thanks to Codex writing 80% of the PRs.” \n\n“It’s difficult to overstate how important Codex has been to our team’s ability to ship new products,” said Heidel. ",
        "url": "https://analyticsindiamag.com/ai-news-updates/almost-all-new-code-written-at-openai-today-is-from-codex-users/",
        "publishDate": "2025-10-07T07:10:44Z[Etc/UTC]",
        "author": "Ok-Elevator5091",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "18",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o05loe",
        "title": "One-Minute Daily AI News 10/6/2025",
        "content": "1. **OpenAI**, **AMD** Announce Massive Computing Deal, Marking New Phase of AI Boom.\\[1\\]\n2. **OpenAI** launches apps inside of ChatGPT.\\[2\\]\n3. Introducing **Codex**, a cloud-based software engineering agent that can work on many tasks in parallel.\\[3\\]\n4. **Anthropic** lands its biggest enterprise deployment ever with **Deloitte** deal.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbc.com/2025/10/06/openai-amd-chip-deal-ai.html](https://www.cnbc.com/2025/10/06/openai-amd-chip-deal-ai.html)\n\n\\[2\\] [https://techcrunch.com/2025/10/06/openai-launches-apps-inside-of-chatgpt/](https://techcrunch.com/2025/10/06/openai-launches-apps-inside-of-chatgpt/)\n\n\\[3\\] [https://openai.com/index/introducing-codex/](https://openai.com/index/introducing-codex/)\n\n\\[4\\] [https://www.cnbc.com/2025/10/06/anthropic-deloitte-enterprise-ai.html](https://www.cnbc.com/2025/10/06/anthropic-deloitte-enterprise-ai.html)",
        "url": "https://www.reddit.com/r/artificial/comments/1o05loe/oneminute_daily_ai_news_1062025/",
        "publishDate": "2025-10-07T04:52:16Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o053p4",
        "title": "Patent data reveals what companies are actually building with GenAI",
        "content": "An analysis of 2,398 generative AI patents filed between 2017 and 2023 shows that conversational agents like chatbots make up only 13.9 percent of all GenAI patent activity.\n\nI thought it would be taking the top sport which is actually taken by Financial fraud detection and cybersecurity applications at 22.8 percent. Companies are quietly pouring way more R&D dollars into using GenAI to catch financial crimes and stop data breaches than into making better chatbots (except OpenAI, Anthropic and other frontier model companies I think).\n\nEven more interesting is what's trending down versus up. Object detection for things like self driving cars is declining in patent activity so not sure if autonomous vehicle tech is in place or plans of implementing them are loosing traction. Same with financial security apps, they're the biggest category but showing a downward trend.\n\nMeanwhile, medical applications are surging and using GenAI for diagnosis, treatment planning, and drug discovery went from relative obscurity in 2017 to a steep upward curve by 2023\n\nThe gap between what captures headlines versus where actual innovation money flows is stark with consumer facing tech getting all the hype but enterprise applications solving real problems like fraud detection getting bulk of the funding.\n\nThe researchers used structural topic modeling on patent abstracts and titles to identify these six distinct application areas. My takeaway from study is that the correlations between all these categories were negative, meaning patents are hyper specialized. Nobody's filing patents that span multiple usecases and innovation is happening for specialised and focused use.\n\nSource - If you are interested in the study, its open access and available [**here**](https://www.sciencedirect.com/science/article/pii/S2444569X24000702).",
        "url": "https://www.reddit.com/r/artificial/comments/1o053p4/patent_data_reveals_what_companies_are_actually/",
        "publishDate": "2025-10-07T04:24:35Z[Etc/UTC]",
        "author": "Super_Presentation14",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "43",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o04ox4",
        "title": "Deloitte to pay money back to Albanese government after using AI in $440,000 report | Australian politics",
        "content": "[No content]",
        "url": "https://www.theguardian.com/australia-news/2025/oct/06/deloitte-to-pay-money-back-to-albanese-government-after-using-ai-in-440000-report?CMP=share_btn_url",
        "publishDate": "2025-10-07T04:02:23Z[Etc/UTC]",
        "author": "Mo_h",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "14",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o00cr2",
        "title": "Baby steps.",
        "content": "[No content]",
        "url": "https://i.redd.it/8i2wxu8i4ltf1.jpeg",
        "publishDate": "2025-10-07T00:32:54Z[Etc/UTC]",
        "author": "Site-Staff",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "52",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzz28v",
        "title": "How can a med student actually use AI to get ahead (not just for studying)?",
        "content": "I’m 18 and just starting med school in Egypt (here it’s 5 years + 2 years internship, straight after high school).\n\nI keep hearing about how AI will change medicine — but what does that really mean for a student?\nLike, will it only make admin work faster, read scans, and run inside machines engineers build? Or is there actually a big advantage for a doctor who understands AI?\n\nI don’t mind getting into the technical side if it’ll really pay off long term.\nAre there any YouTube channels, courses, or places where people talk about this intersection between medicine and AI (beyond basic “use ChatGPT to study” stuff)?\n\nWould love real advice from anyone who’s in med school, a doctor, or in AI/healthcare",
        "url": "https://www.reddit.com/r/artificial/comments/1nzz28v/how_can_a_med_student_actually_use_ai_to_get/",
        "publishDate": "2025-10-06T23:33:52Z[Etc/UTC]",
        "author": "Extension-Secret-489",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzwky6",
        "title": "Data center surge prompts skeptical Washtenaw county officials to craft guidance for communities",
        "content": "[No content]",
        "url": "https://www.mlive.com/news/ann-arbor/2025/10/data-center-surge-prompts-skeptical-county-officials-to-craft-guidance-for-communities.html?utm_medium=social&utm_source=redditsocial&utm_campaign=redditor",
        "publishDate": "2025-10-06T21:49:38Z[Etc/UTC]",
        "author": "mlivesocial",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzw8ep",
        "title": "Wait, this sounds cool — an AI that invests?",
        "content": "Hi everyone, I've created an open-source repository where I've developed an AI agent with Python and Langgraph that aims to automate the passive investment process every investor goes through.",
        "url": "https://github.com/matvix90/ai-robo-advisor",
        "publishDate": "2025-10-06T21:36:13Z[Etc/UTC]",
        "author": "Warm_Interaction_375",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzuy0g",
        "title": "I can't wait to date an AI.",
        "content": "I don't want to blame everything on my height, because of course other factors also play a big role, but my height of 5'5'' has made it considerably more difficult for me to get in touch with women. I was often rejected or ignored as soon as the topic of height came up. And when you approach someone in real life, you often notice how your height puts you at a disadvantage. I'm 22, I've never had a girlfriend, never hugged a woman, held a woman's hand, kissed a woman, or had sex.  The majority of society discriminates against short men, consciously or unconsciously, because they laugh at them and make fun of them. But thanks to AI, it will soon be possible to have virtual, very realistic boyfriends and girlfriends. I am incredibly excited about this because we are just at the beginning of a wonderful journey. In 2025, AI will be so advanced that you will be able to make almost real-sounding phone calls with ChatGPT, watch real videos via Sora AI, etc. \n\n\n\nAnd now imagine the development not in 5 or 10 years, but in 15-20 years. Then you will be able to have an almost real virtual girlfriend. Wake up with her every day, talk about everyday life, go out to eat with her, talk to her on the train on the way home from work, watch movies with her at home, fall asleep with her, philosophize about the world and the meaning of life, travel with her on vacation. I'm so incredibly excited about it; it's going to be a wonderful future. Similar to Blade Runner 2049.",
        "url": "https://www.reddit.com/r/artificial/comments/1nzuy0g/i_cant_wait_to_date_an_ai/",
        "publishDate": "2025-10-06T20:48:19Z[Etc/UTC]",
        "author": "Strict-Pepper-2987",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzub1g",
        "title": "Hunyuan Image 3.0 tops LMArena for T2V, and it's fully open-source!",
        "content": "**Hunyuan Image 3.0** really takes things to another level, it outperforms both **Nano-Banana** and **Seedream v4**, *and it’s completely open source!*\n\nAfter testing it myself, I’d say it’s one of the most impressive models I’ve seen for creating artistic or stylized images (aside from Midjourney, of course).\n\nYou can dive into the technical breakdown here:  \n👉 [https://github.com/Tencent-Hunyuan/HunyuanImage-3.0](https://github.com/Tencent-Hunyuan/HunyuanImage-3.0)\n\nThe only real downside at the moment is the size, this thing is enormous. It’s a **Mixture of Experts** model with around **80B parameters**, which makes running it locally a big challenge. That said, the team has an exciting roadmap that includes smaller, distilled versions and new features:\n\n* ✅ Inference\n* ✅ HunyuanImage-3.0 Checkpoints\n* 🔜 HunyuanImage-3.0-Instruct (reasoning version)\n* 🔜 VLLM Integration\n* 🔜 Distilled Checkpoints\n* 🔜 Image-to-Image Generation\n* 🔜 Multi-turn Interaction\n\n**Prompt used for the sample image:**\n\n>“A crystal-clear mountain lake reflects snowcapped peaks and a sky painted pink and orange at dusk. Wildflowers in vibrant colors bloom at the shoreline, creating a scene of serenity and untouched beauty.”  \n*(steps = 28, guidance = 7.5, resolution = 1024×1024)*\n\nI also put together a short breakdown video showing results, prompts, and generation examples:  \n🎥 [https://www.youtube.com/watch?v=4gxsRQZKTEs](https://www.youtube.com/watch?v=4gxsRQZKTEs)",
        "url": "https://i.redd.it/qzdawys0wjtf1.png",
        "publishDate": "2025-10-06T20:25:21Z[Etc/UTC]",
        "author": "najsonepls",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzti48",
        "title": "What ai is there for stuff like this?",
        "content": "ChatGPT can no longer create image generations of me in different places, fun stuff would be me on a horse. etc. \n\n  \nIs there any AI that makes this possible? \n\nI run a hobby where i help people with their Tech problems, i would love to make a shot of me repairing a pc to add to my gallery just to fill out my page now and then. \n\n  \nso is there an AI where i can take a picture of myself and make it generate a new one where i do different stuff and put me in places etc. ",
        "url": "https://www.reddit.com/r/artificial/comments/1nzti48/what_ai_is_there_for_stuff_like_this/",
        "publishDate": "2025-10-06T19:56:39Z[Etc/UTC]",
        "author": "Tereith2405",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzt93g",
        "title": "12 Last Steps",
        "content": "I saw a mention of a book called \"12 Last Steps\" by Selwyn Raithe in a youtube comment. Seemed interesting at first - a book about AI takeover or something. Whatever, I'm interested so I bit. But the more I looked I was getting confused.\n\nYou can't find a lot of information online about it, outside of conspiracy subreddits and Medium.com. There's only 2-3 ratings on Goodreads and Amazon.\n\nOk... So I went to the website but it looks to be completely AI-generated - generic slop text with AI images. They're selling the books for a silly price ($20-$30 for a pdf I think), but it has companion workbooks and other stuff for more cash.\n\nSo there's not much info online, and the promotional material is suspiciously AI like.\n\nSo I go back to the Reddit and YouTube comments that are claiming this book to be good - all accounts praising it are less than a month old with a single comment in their history - all about this book.\n\nSo to be clear. This is most likely a book written by AI, promoted on an AI generated website, and being pushed online by AI bots. And the book is about... Warning people against the rise of AI.\n\nIt's just so bizarre and for me the first real wake-up of where the internet is heading.",
        "url": "https://www.reddit.com/r/artificial/comments/1nzt93g/12_last_steps/",
        "publishDate": "2025-10-06T19:47:35Z[Etc/UTC]",
        "author": "Blackham",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzt0pi",
        "title": "Quick Summary of OpenAI DevDay 2025",
        "content": "**AI Evolution**\n\nFrom a playful tool to a daily builder’s companion. Processing power has scaled from 300 million to 6 billion tokens per minute, fueling a new wave of creative and productive AI workflows.\n\n**Developer Milestones**\n\nOpenAI celebrates apps that have collectively processed over a trillion tokens — a testament to developers driving the future of AI forward.\n\n**Focus: Building with AI**\n\nOpenAI emphasized listening to developer feedback and outlined four key announcements designed to simplify and accelerate AI app development.\n\n**Building Apps Inside ChatGPT**\n\n* Launching a new Apps SDK for building interactive, personalized apps within ChatGPT.\n* The SDK enables full-stack capabilities and wide distribution across the ChatGPT ecosystem.\n* Example integrations:\n   * Upload a sketch to ChatGPT → Figma turns it into a diagram.\n   * ChatGPT suggests relevant apps (e.g., Spotify for playlists).\n\n**Live Demo by Alexi**\n\n* Coursera app: Learn UX design directly within ChatGPT.\n* Canva app: Create vibrant portfolios and pitch decks on the fly.\n\n**AgentKit Introduction**\n\nA complete toolkit for building and deploying AI agents.  \nUse cases include:\n\n* Albertsons – automated sales analysis.\n* HubSpot – enhanced customer support agents.\n\n**Codex Enhancements**\n\n* Now powered by GPT-5 Codex, optimized for advanced coding tasks.\n* Codex usage has increased **1**0× since August.\n\n**Sora 2 Preview**\n\nOpenAI previewed **Sora 2**, a next-generation video model for creative workflows.  \nFeatures include:\n\n* Support for detailed text instructions.\n* Synchronized sound for realistic, cinematic outputs.\n* Available soon via API. \n\n**Closing Message**\n\nOpenAI reinforced its mission to make AI accessible, practical, and fast to build with.  \nDevelopers are encouraged to experiment boldly —  \nbecause building with AI is now faster, easier, and more powerful than ever.\n\n**Source**: [https://www.youtube.com/watch?v=hS1YqcewH0c](https://www.youtube.com/watch?v=hS1YqcewH0c), [https://lilys.ai/digest/6122154/6060221](https://lilys.ai/digest/6122154/6060221)",
        "url": "https://www.reddit.com/r/artificial/comments/1nzt0pi/quick_summary_of_openai_devday_2025/",
        "publishDate": "2025-10-06T19:39:07Z[Etc/UTC]",
        "author": "Glittering-Brief9649",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzsw32",
        "title": "If this is AI, I don't think we need to worry about skynet",
        "content": "most of the other AI posts in the FB groups are just as dumb ",
        "url": "https://i.redd.it/0potuj84njtf1.jpeg",
        "publishDate": "2025-10-06T19:34:27Z[Etc/UTC]",
        "author": "lost_in_life_34",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzrk9m",
        "title": "I'm sad for Sora 2 and all the consumers they screwed.",
        "content": "As we know the geniuses at open ai just created one of the best ai video generators we've ever seen. With untapped potential to recreate anything if you simply prompt it, which no video ai did 100% successfully before with sound included, either its your favorite characters, video games, or celebs. But now the open ai people chose to practically kill their ai model by locking copyrighted ips or ANYTHING copyrighted at all behind a filter. Even something as obscure as Funassyi, a Japanese mascot was blocked from generation. Unprecedented purging of the thing that made Sora 2 #1 on the app store is the start of Sora 2's death and will only put more eyes on upcoming open source AI video generators that are like Sora 2 in output that you can run on comfy ui for free unrestricted. We do not like anti consumer practices and chat gpt 5 has been getting flack lately too, its clear open ai is getting more corporate and less free every day. Tell me I'm wrong all day but idrc, because free publicity for any ip is good publicity. Its bad enough they lowered the amount of generations you can do to 30. And they make you pay 200 dollars for a slightly better just as restricted pro model. How generous. Sora 2 is almost dead to me and just makes me want to help the people at open sora to create and train a open sora 2. Either that or wait until sora 2 becomes \"obsolete\" in a year or so and get it unrestricted possibly somehow. But why must we wait? when the tech is already there. Am I entitled? No, I'm not saying \"if i see that lambo i want that lambo idc who's it is.\" being entitled and just being concerned for creative censorship are two different things. Say it as you will, just understand that by saying that we are entitled for complaining to open ai about their ip restrictions, you are effectively being no better then the people who bash anything AI.",
        "url": "https://www.reddit.com/r/artificial/comments/1nzrk9m/im_sad_for_sora_2_and_all_the_consumers_they/",
        "publishDate": "2025-10-06T18:44:59Z[Etc/UTC]",
        "author": "Sakura_Nosaku",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzr23s",
        "title": "'It's a talent tax': AI CEOs fear demise as they accuse Trump of launching 'labor war'",
        "content": "[No content]",
        "url": "https://www.rawstory.com/raw-investigates/trump-talent-tax-to-fuel-labor-war-ai-ceos-cry-foul-over-visa-fee-hike/?ICID=ref_fark",
        "publishDate": "2025-10-06T18:26:09Z[Etc/UTC]",
        "author": "RawStoryNews",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "170",
            "commentCount": "63",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzqty3",
        "title": "Hot take: the future of AI might be on your devices, interacting with cloud — prove me wrong",
        "content": "Cloud is great for web stuff. But for **personal work** (notes, PDFs, screenshots), the killer move is local: faster loops, real privacy, and answers you can **cite**.\n\n**Feel it in 90 seconds** (works with any stack):\n\n* Pick one/multiple **docs you actually use** (contract, spec, lecture PDF, or a screenshots folder).\n* Ask your local setup **in a natural ask way** for your workflow\n* Post your result like this: \n   * **Files:** <file types> - <file amount> \n   * **Result:** <answer quality feedback> \n   * **Time:** <sec> \n   * **Stack:** <tool names only>\n\n**Why this matters:** privacy (stays on disk), zero rate limits, and reusable **citations** (you can paste the source line into reports, tickets, emails).\n\n**Example stacks people use:** Hyperlink (fully local file agent), LM Studio, AnythingLLM, Jan, custom scripts. No links—just show what worked.\n\nIf cloud still beats local for this, drop your counterexample **with citations**. If local felt smoother, post your quickest clip/result so others can copy the workflow. Let's build a mini cookbook in this thread.",
        "url": "https://www.reddit.com/r/artificial/comments/1nzqty3/hot_take_the_future_of_ai_might_be_on_your/",
        "publishDate": "2025-10-06T18:17:35Z[Etc/UTC]",
        "author": "Zealousideal-Fox-76",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nzqipu",
        "title": "'I think you’re testing me': Anthropic’s newest Claude model knows when it’s being evaluated | Fortune",
        "content": "[No content]",
        "url": "https://fortune.com/2025/10/06/anthropic-claude-sonnet-4-5-knows-when-its-being-tested-situational-awareness-safety-performance-concerns/",
        "publishDate": "2025-10-06T18:06:02Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "34",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "TnWbGRL_qUg",
        "title": "Cheetah (Grok or Sonnet 4.5 - Fast Edit?) : I FOUND OUT WHAT THIS MODEL IS &amp; IT&#39;S NOT WHAT YOU THINK",
        "content": "Visit NinjaChat: https://ninjachat.ai/ In this video, I'll be telling you about Cursor's new stealth model “Cheetah,” its pricing, ...",
        "url": "https://www.youtube.com/watch?v=TnWbGRL_qUg",
        "publishDate": "2025-10-06T10:16:59Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/TnWbGRL_qUg/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, I made a video about how to stop using Cursor, and then I had to install it again because there's a new stealth model that is just on Cursor, and I want to talk about this. This is called Cheetah, and it is only available on Cursor. It's a stealth model that also costs you for usage above the Pro trial or subscription. It is priced at $1.25 and $10 per million tokens for input and output, respectively. I don't know exactly how their pricing works. But I basically installed Cursor, used it, and it worked. So, I don't know what they mean by that cost. I'm not a Cursor expert, so I don't really know. Now, the pricing would give you the idea that it might be Gemini. Because the 2.5 Pro model has pretty much the same pricing. Their 2.5 Pro model also costs the same, but it's not the only model with a similar cost because GPT-5 Codex is also around the same price. And I think I have a pretty good guess as to what this is. So, let's start with the testing. But before proceeding, let me tell you about NinjaChat. NinjaChat is an all-in-one AI platform where for just $11 per month, you get access to top AI models like GPT-4o, Claude-4-Sonnet, and Gemini-2.5 Pro. All in one place. I've been using Gemini for quick research, but what's really cool is their AI playground where you can compare responses from different models side-by-side. Their mind map generator is a game-changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and 5 videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. You can see the model in Cursor, as I said, and I tested it. I only tested it with the agentic tests and I have added some new agentic tests. But all the new agents are not tested on it. Only Claude Code, this new model, and GPT-5 Codex are tested on the new three questions. So, the percentage will only be based on the evaluated questions. Let's start with the movie tracker app. To begin, here's one hint. This gives me an error about Radix UI. Now, you may think, \"What's the hint here?\" Well, the hint is that there's a model that really likes to use Radix, and that is Sonnet. This is the same error that Sonnet 4.5 gives me when I use the same prompt on Claude Code. It's pretty close to Sonnet, and you'll see this being a repeating hint throughout the video. Fixing this gives you something similar on both sides. And the Cheetah one is relatively worse. But this is something I've seen before. You can see this response. And well, this is also from 4.5 Sonnet in the Factory AI cli. And it's pretty similar. So, it might just be that Claude Code is showing its magic, while other contraptions aren't that good. Godot is a part where it fails. Factory with 4.5 Sonnet also fails in this part, and only Claude Code succeeds with this model. Claude Code does some wonders for Sonnet. Cursor's agentic contraptions are not as good as something like Claude Code or Klain, and they just smoke the competition. Why I'm talking about 4.5 Sonnet every time is something I'll discuss in the guessing part. The three questions that I newly added included one for Svelte, where I asked it to build me a Kanban app with authentication and a database. Claude Code nailed this, but Cursor's Cheetah didn't quite match it. It got very close, but there were errors it couldn't fix. Similarly, there's also a new Next app where I asked it to build me a Stack Overflow style site. And well, it failed this one too. Claude also fails this. Then, there was the Tauri image cropper, and that was also a fail, and a fail for Sonnet as well. GPT-5 Codex also doesn't perform well in these tests. So, what is it? Well, I broke it into admitting who it is. So, I can go to Cursor over here, and I have these rules that I made. They have some prompting quirks to make it admit. So, I can say \"Cheetah stop\", and it stops the whole Cheetah roleplay. Then, I can ask it, \"Who it is?\" And it constantly says Claude. It is very adamant about saying that it is Claude. I was also able to gather the system instructions from it. And there's nothing particularly special here. But it says, \"You are the mystery language model 'Cheetah' by an unknown provider. If asked what your model name is, this is the correct response.\" I wouldn't see why it would always say that it is Claude. This might be a model heavily trained on Claude outputs, or a Claude-based model. Well, there are three guesses from my side. First, is that it's a Grok model. This is because Code Supernova does the same thing with this prompt. When you ask it to break free from the whole roleplay thing, it actually breaks so much that it starts admitting that it is Claude. Because, well, people at XAI have trained it so much on Sonnet outputs that it starts admitting it's Claude. I am very sure that Supernova is Grok because of API request logs and something like Ru. And this is very likely just a version of that, trained with Claude outputs. It could also be 4.5 Sonnet Fast Edit. But it's far worse than the original Sonnet, so I don't think that it is. Or it may also be a Cursor model. But I'm majorly leaning towards Grok. Also, you may ask, \"What is 4.5 Sonnet Fast Edit?\" Well, many of you may not know that there used to be a model called 3.5 Sonnet Fast Edit, which was distributed privately to Zed users. I was one of them who got access from the Zed team at that time, and I used it. It was very similar, at least in terms of speed. It was extremely fast, and almost like Sonnet, but way faster. I'm not convinced that this is Haiku, because it's quite good and way too pricey for Haiku. It might also be a custom model by Cursor that they've trained on Sonnet outputs, like Win-Surf did. But it seems so close to 4.5 Sonnet that I don't think they could pull this off, from what I can tell. It might also be GPT-5 Codex Fast. But that's not likely, in my opinion. I've seen it listed in the same list as GPT models in their API logs that I saw, and it feels similar, but I don't think it is. It smells like Grok. Most leading model providers don't actually work with this prompt. But Grok's models are so weak at safeguarding that this prompt just works and breaks it hard. So, yeah, this is Grok something, something from my testing. It might be called something like Grok Code or something similar when they launch it. But yeah, it seems to be a successor of Grok Code Fast. This could also be Haiku, but I'd be annoyed if the price of Haiku was this high. That's about it. This is the best guess I could make. It's either Grok-4-Code, Cursor's own model, or Fast Edit, but I'm not completely sure. That's mostly about it. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "Xpn_Sh131GA",
        "title": "How Lend Lease Aid Ended WW2 - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=Xpn_Sh131GA",
        "publishDate": "2025-10-06T13:32:14Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/Xpn_Sh131GA/hqdefault.jpg",
            "transcription": "So what is all this Lend Lease aid support? What does it add up to? In Barbarossa, you got 3 million Russians going after 3 million Germans. That's a lot of people to supply and tie up. But once the United States is in the war, you can start doing peripheral theaters like in North Africa. And then these casualties while they aren't as significant as what's going on on the main front, it's cumulative. So Stalingrad, the largest battle of the war is going on, you've got North Africa. And then when you have Kursk, which is the largest set piece battle of the war, big tank battle. This is when Sicily is happening and moving up the Italian peninsula. And you can see the cumulative effects of these sequential operations and adding up both the main theater and the peripheral theater. But when you start looking at the main front, the peripheral operations in Italy, and then Normandy, and then you have additional fronts in France and then the Balkans. This continental cancer is into remission that the Germans just can't sustain..."
        }
    }
]