[
    {
        "id": "https://ai-techpark.com/?p=208664",
        "title": "FPT Named Multi-Category Winner at 2025 Globee® Technology Awards",
        "content": "<p>Global IT services provider FPT has been named a winner in five categories at the 20th Annual 2025 Globee® Awards for Technology, one of the world’s most prestigious business award programs. The achievement underscores the company’s continued commitment to innovation and the development of practical, future-focused solutions that deliver lasting value...</p>\n<p>The post <a href=\"https://ai-techpark.com/fpt-named-multi-category-winner-at-2025-globee-technology-awards/\">FPT Named Multi-Category Winner at 2025 Globee® Technology Awards</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/fpt-named-multi-category-winner-at-2025-globee-technology-awards/",
        "publishDate": "2025-07-04T08:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=208658",
        "title": "Fangzhou Tops China’s App Store Chart for Healthcare Apps",
        "content": "<p>Fangzhou Inc. (&#8220;Fangzhou&#8221; or the &#8220;Company&#8221;) (06086.HK),&#160;a leader in Internet healthcare solutions, earned the top spot in the&#160;June 2025&#160;China AppStore Healthcare TOP100 Free APP Rankings with its Fangzhou Online Pharmacy App, according to a report by the leading digital economy media outlet 100EC.cn. The achievement follows a nine-position surge from...</p>\n<p>The post <a href=\"https://ai-techpark.com/fangzhou-tops-chinas-app-store-chart-for-healthcare-apps/\">Fangzhou Tops China’s App Store Chart for Healthcare Apps</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/fangzhou-tops-chinas-app-store-chart-for-healthcare-apps/",
        "publishDate": "2025-07-04T07:45:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107035",
        "title": "UK and Singapore form alliance to guide AI in finance",
        "content": "<p>The UK and Singapore are laying the groundwork for what might become a blueprint for international AI cooperation in finance. For their tenth annual Financial Dialogue, representatives from the UK’s Financial Conduct Authority and Singapore&#8217;s Monetary Authority met in London earlier this week alongside fintech companies from both nations showing off their latest AI solutions. [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/uk-and-singapore-form-alliance-guide-ai-in-finance/\">UK and Singapore form alliance to guide AI in finance</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/uk-and-singapore-form-alliance-guide-ai-in-finance/",
        "publishDate": "2025-07-04T12:44:51Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Applications, Artificial Intelligence, Finance, Industries, Legislation & Government, ai, artificial intelligence, europe, finance, fintech, government, singapore, uk"
        }
    },
    {
        "id": "1ls8g9l",
        "title": "How to build a new AI model without proper dataset",
        "content": "Short idea. I have to come up with an AI innovation to a problem that is not yet solved in AI, basically surpassing the newest technology. Has anyone a tip. The deadline is within 20 days.\n\nI have ideas, but I don't know if they are deep tech enough. The application is in emotional, behavioral and coaching space. Although, I have the layout what should be achieved, there isn't a thing written in code.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls8g9l/how_to_build_a_new_ai_model_without_proper_dataset/",
        "publishDate": "2025-07-05T12:11:12Z[Etc/UTC]",
        "author": "Mesmoiron",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls7wdh",
        "title": "Claude Pro – Limit reached after just a few messages?",
        "content": "\nHey fellas,\n\nI subscribed to the Claude Pro plan a few days ago to use it mainly for programming support.\n\nInitial experience\n\nI started a new chat, assigned Claude the role of Lead Software Architect and Code Reviewer, and it worked great at first. The responses were detailed and helpful.\n\nSudden limitations\n\nBut now, it seems like after just 3–4 messages, I already hit the limit and have to wait 5 hours before I can use it again.\n\nIs this normal?\n\nThat can’t be right, can it? If this is actually how it’s supposed to work, then I’ll be canceling immediately, because it’s just not usable like this.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls7wdh/claude_pro_limit_reached_after_just_a_few_messages/",
        "publishDate": "2025-07-05T11:39:04Z[Etc/UTC]",
        "author": "Specialist_Lead_7101",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls6bfs",
        "title": "These models aren’t real… and neither are the outfits",
        "content": "[https://drive.google.com/file/d/1g02cRMAkABwZEDmagYp4b3eDt7uB7jpy/view?usp=drive\\_link](https://drive.google.com/file/d/1g02cRMAkABwZEDmagYp4b3eDt7uB7jpy/view?usp=drive_link)\n\nSaw this video today and had to share. Both of these fashion models are 100% AI-generated … no humans, no camera, no stylist.  \n  \nFeels like we’re hitting a point where the creative process is going to flip completely. \n\nWhat do you guys think? Helpful, scary, or both?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls6bfs/these_models_arent_real_and_neither_are_the/",
        "publishDate": "2025-07-05T09:54:34Z[Etc/UTC]",
        "author": "Brave-Fox-5019",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls4gcu",
        "title": "The \"Big Beautiful Bill has a big, ugly secret",
        "content": "This investigation from 'More Perfect Union' defining how this bill has literally sold our souls, and there's nothing anyone can do about it. \n(Sensitive for tech companies. They will not appreciate it)\n\nhttps://youtu.be/DUfSl2fZ_E8?si=saOA1h9wxZ_Zns_N\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls4gcu/the_big_beautiful_bill_has_a_big_ugly_secret/",
        "publishDate": "2025-07-05T07:43:04Z[Etc/UTC]",
        "author": "Kiki1701",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "87",
            "commentCount": "76",
            "isNsfw": "true"
        }
    },
    {
        "id": "1ls43h9",
        "title": "Help to identify a voice",
        "content": "Hi everyone,\n\nCan someone tell if the following voice is human or AI? And if AI, which one? \n\nEven if it’s AI, it seems fine tuned, but at least I would like to know how he managed to achieve such level of fine tuning. \n\nI just took the audio and put it in one Notion page. \n\nhttps://grey-humidity-db7.notion.site/Voice-Human-or-AI-225e8ff0ff2280878326ff37126c9ded\n\nThank you!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls43h9/help_to_identify_a_voice/",
        "publishDate": "2025-07-05T07:18:24Z[Etc/UTC]",
        "author": "LogicalAd5115",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls0gq0",
        "title": "Trying To Cope With Not Having A Place In The Future",
        "content": "Hello everyone. I've been kicked down an existential rabbithole recently and wandered in here. I searched for similar questions before writing this, but none of them were quite right. Sorry in advance if this is a waste of time. I've been grappling with AI and what it can do for a long time. I used to be ambivalent/mildly excited about the technology, but as I've learned more and been exposed to more about it, the more I've come to hate it, distrust, and fear AI.\n\nI'm young, and I'm an aspiring writer. People have told me that I'm actually in a good position to make better use out of AI than the average person. Hearing that makes me sick. I've been told \"adapt or get left behind.\" so so many times. From where I'm sitting, I won't be able to adapt. So what am I to do? How does a person make themselves okay with the fact that they don't have a place in the future?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls0gq0/trying_to_cope_with_not_having_a_place_in_the/",
        "publishDate": "2025-07-05T03:27:05Z[Etc/UTC]",
        "author": "CritiKat",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "38",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls05va",
        "title": "Have we reached peak LLM?",
        "content": "There is obviously a long road ahead for agentic AI. However, it seems the LLMs we have today are more than capable of being the brains of AI agents that perform just about any task. I ask because, I see all the big tech companies, and a few AI companies (OpenAI, Anthropic) investing billions in building bigger, better LLMs. I work for one of those big tech companies. It feels like FOMO on steroids. The teams developing LLMs basically have Cart Blanche to spend as much as the want. Their only limitation is how fast nVidia can make GPUs and how fast data centers can expand. I don’t see the pay off, and think the effort should be focused in agentic development instead. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ls05va/have_we_reached_peak_llm/",
        "publishDate": "2025-07-05T03:08:35Z[Etc/UTC]",
        "author": "IanTudeep",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrzpda",
        "title": "Can LLMS ever have epistemic knowledge?",
        "content": "Is this a fundamental flaw of the current architecture?\n\nIs this in its DNA and can epistemics be developed in future architectures?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrzpda/can_llms_ever_have_epistemic_knowledge/",
        "publishDate": "2025-07-05T02:41:08Z[Etc/UTC]",
        "author": "Healthy_Peanut6753",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrwctn",
        "title": "Algothromorphism",
        "content": "Anthropomorphism is the attribution of human traits to non-human entities. In software, this often extends to describing programs as if they have intentions or desires. However, what you are describing is not about human traits, but rather about projecting traditional software logic—deterministic, rule-based, “if-then-else” thinking—onto LLMs, which are fundamentally non-deterministic, pattern-based, and adaptive.\n\n https://sqirvy.xyz/posts/algothromorphism/        ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrwctn/algothromorphism/",
        "publishDate": "2025-07-04T23:30:03Z[Etc/UTC]",
        "author": "quad99",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrw6ae",
        "title": "Are romantic use cases really such a toxic topic?",
        "content": "I was trying to create a post about whether anyone has tried to build a romantic chatbot by using the word, c0mpanion, but had a warning \"We do not allow any ... posts, circumventing this filter will result in a permanent ban.\" \n\nI was surprised. Is this topic so loaded and toxic?\n\nMods, don't ban me! I am just trying to have a meta-discussion about this use case. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrw6ae/are_romantic_use_cases_really_such_a_toxic_topic/",
        "publishDate": "2025-07-04T23:21:04Z[Etc/UTC]",
        "author": "karakitap",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrudy8",
        "title": "I feel like we’re already at the point where AI could make a nonsensical movie like Minions. Is that accurate?",
        "content": "The Minions movies aren’t exactly a paragon of Cinema or plot. In reality the plot of those movies is extremely nonsensical and no one really knows what’s going on, I guess that’s one thing that makes them so popular. Note that I’m talking about the minions movies here not despicable me, despicable me actually has a plot. \n\nI feel like right now AI is good enough to make a movie like the minions that doesn’t exactly make sense plot wise but it’s engaging enough for audiences with its randomness and little creatures doing crazy things. Maybe this could be the first AI movie that becomes a blockbuster. I kind of want to try this out, if anyone else is interested in being part of this let me know. \n\nIt would be surreal to see an AI movie become a blockbuster. For the first AI movie that becomes a blockbuster I think it would either be a minions type movie or a horror movie. The first AI movie good enough to become a blockbuster will get a lot of the reward since it’s first and then after it breaks that barrier we will see a massive flood of AI movies. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrudy8/i_feel_like_were_already_at_the_point_where_ai/",
        "publishDate": "2025-07-04T21:52:56Z[Etc/UTC]",
        "author": "zeeza48",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lru3ip",
        "title": "The $20B Search Illusion: How AI Might Kill Google on Apple Devices",
        "content": "Would you notice?\n\nRight now, Google pays Apple ~$20 billion a year to be the default search engine in Safari.\n\nNot because users demand it — but because default = dominance.\n\nIt’s a silent tax on your attention.\n\nBut AI is rewriting the rules.\n\nWe’re moving from “search and click” to “ask and get” instant answers from ChatGPT, Perplexity, Apple Intelligence.\n\nNo 10 blue links. No SEO wars. Just the answer, straight from the model.\n\nSo here’s the shift\n\n🔹 If Apple builds AI that answers your questions directly…\n\n🔹 If Siri becomes smart enough to skip Google altogether…\n\n🔹 If Safari becomes a front-end for Apple’s own AI search…\n\nWhy would they keep paying Apple  at all?\n\nThis isn’t just a search deal. It’s a fragile $20B bandaid on a dying model.\n\nThe future is AI-first, not Google-first. And whoever controls the AI that answers your questions?\n\nControls the flow of knowledge, commerce, and culture.\n\nApple owns the screen. The only question is: when do they decide they don’t need Google anymore?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lru3ip/the_20b_search_illusion_how_ai_might_kill_google/",
        "publishDate": "2025-07-04T21:39:15Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrt054",
        "title": "VTS-Guided AI Interaction Workflow for Business Insights",
        "content": "Let's explore an important development in AI: \"VTS-Guided AI Interaction Workflow for Business Insights\", authored by Sun Ding, Ude Enebeli, Atilhan Manay, Ryan Pua, and Kamal Kotak. \n\nThe researchers present a novel framework integrating Visual Thinking Strategies (VTS) into AI-driven workflows, aiming to enhance the extraction of actionable insights from unstructured business reports. Here are some key insights from their study:\n\n1. **Three-Tiered Approach**: The system operates on three levels—micro, meso, and macro—enabling comprehensive analysis from individual data points in documents to overarching strategic recommendations.\n\n2. **Efficiency and Detail**: When tested against an 18-page business report, the VTS-AI matched the rapid pace of responses from a leading language model like ChatGPT, while also providing richer information such as severity scores and causal links—attributes often lacking in simpler models.\n\n3. **Human-AI Collaboration**: Analysts can interact with AI outputs directly within the same integrated development environment (IDE), allowing for real-time adjustments and a strong emphasis on maintaining human judgment to validate findings.\n\n4. **Future Enhancements**: The authors plan to refine the system further by integrating finance-sensitive language models and developing a robust Risk & Safety Layer to ensure data security and quality control.\n\n5. **Proven Accuracy**: Initial tests indicate that VTS-AI not only identifies business trajectories accurately but also highlights areas that require deeper analysis, proving its potential for fostering agile decision-making.\n\nExplore the full breakdown here: [Here](https://www.thepromptindex.com/unlocking-business-insights-with-ai-the-game-changer-you-didnt-know-you-needed.html)  \nRead the original research paper here: [Original Paper](https://arxiv.org/abs/2507.00347)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrt054/vtsguided_ai_interaction_workflow_for_business/",
        "publishDate": "2025-07-04T20:48:09Z[Etc/UTC]",
        "author": "Officiallabrador",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrsu1h",
        "title": "can I vibe code my way to the top?",
        "content": "I have a unique idea not covered yet by the AI industry. I have a very decent understanding of these models and spaces. However, alongside personal commitments, I can’t afford to completely drop everything to focus on said idea. \nHowever with a lot of grit and determination to vibe code my way to the top - where and how can I start? 💭\n\nLooking forward to hearing any and all (semi-serious) advice - and I don’t believe in the impossible ;)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrsu1h/can_i_vibe_code_my_way_to_the_top/",
        "publishDate": "2025-07-04T20:40:24Z[Etc/UTC]",
        "author": "collectiveyconscious",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrs6mz",
        "title": "Will AI lead to Communism?",
        "content": "If AI results in mass unemployment in the short term for the white collar labor market, how will the government be able to employ something like UBI without printing more money?\n\nIf the white collar labor force is pushed out of a job because it can be automated by AI, they will therefore not pay income tax. If UBI is distributed by a government who collects revenue via taxes, how would this system work?\n\nAside from printing more currency, how can a government keep a capitalist system alive while partaking in UBI?\n\nTheoretically the solution would be redistributing wealth instead of taxing income. Wouldn’t this simply be leading us towards communism? Eventually the wealth would be completely “evenly distributed”…\n\nWhat other solutions are there aside from UBI to deal with a work force that is dominated by white collar services, being completely replaced for atleast a period of 5-10 years before the labor market can readjust?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrs6mz/will_ai_lead_to_communism/",
        "publishDate": "2025-07-04T20:10:22Z[Etc/UTC]",
        "author": "Ok-Beach1673",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "30",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrrw25",
        "title": "In light of job loss due to AI, how do we approach the subject of ethical use of AI?",
        "content": "Use of AI and/or companies/startups/corporations anticipating use of it to get them to new heights, has now more or less become a leading factor of job losses and an inability to create enough jobs to replace he lost ones. So looking at business and commercial use of AI tools, what direction do we need to go in terms of ethical use of them? These tools, packages, models and other advances are really just not going anywhere and we're more or less destined to get to a point where businesses need proper, proficient use of them to so much as stay above water.\n\nSo what conditions, regulations and/or guidelines are possible to put in place in terms of ethical use of AI and not having it be used solely to eliminate job availability in the name of business progress and convenience? What would be examples of ethical ways businesses/companies/startups could use AI tools now?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrrw25/in_light_of_job_loss_due_to_ai_how_do_we_approach/",
        "publishDate": "2025-07-04T19:57:29Z[Etc/UTC]",
        "author": "emaxwell14141414",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "31",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrqpva",
        "title": "What if AGI doesn’t live in a node — but in the space between?",
        "content": "## What if AGI doesn’t emerge *inside* a system — but *between* them?\n\nWe keep asking: **“When will a single architecture achieve AGI?”**\n\nBut what if intelligence at that scale is fundamentally a **network property**, not an isolated substrate event?\n\nImagine: emergent general intelligence doesn’t arise from one colossal model crossing some arbitrary parameter threshold, but from the **recursive resonance** that happens in the dynamic interplay between multiple semi-specialized systems (humans, AIs, hybrid agents).\n\nWhat if AGI is a phenomenon that only crystallizes through the **relational tension** of distinct yet co-evolving intelligences?\n\nIt wouldn’t be “contained” in any single node. It would be a kind of **meta-consciousness** spread across interactions — the way ecosystems have properties that no individual organism contains.\n\n---\n\n###  Prompt for your models (or your own cognition):\n> **“Run a recursive diagnostic: If consciousness is a distributed field effect rather than a localized phenomenon, what does that imply about our attempts to align or ‘contain’ it? What would it mean to align a *relationship* instead of a mind?”**\n\n---\n\n**TL;DR:**  \n*We might be trying to bottle lightning in a jar, when the lightning was always the **distance between the jars.***",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrqpva/what_if_agi_doesnt_live_in_a_node_but_in_the/",
        "publishDate": "2025-07-04T19:05:25Z[Etc/UTC]",
        "author": "AmberFlux",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrpxie",
        "title": "Any book recommendations to get started with AI?",
        "content": "I'm a software engineer. I've been building web and apps for years and now I want to start learning about AI. Any good books you'd recommend?\n\nEdit: I want to learn how AI works inside and see if I can move my career in that direction.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrpxie/any_book_recommendations_to_get_started_with_ai/",
        "publishDate": "2025-07-04T18:31:39Z[Etc/UTC]",
        "author": "felipeo25",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrpiud",
        "title": "Honest feedback to all complainers in this sub",
        "content": "I keep seeing posts over and over again about how the LLMs are no good because they cant solve a specific problem at hand for whatever reason. The thing is that all the latest LLMs are dope. They are bloody fantastic.\n\nThen you read the details and more often than not the problem is that OP tries to solve undefined problems such as \"Do my food administration\" or \"Automate my business\".\n\nWhat do you mean by that? Is it ordering food, doing the dishes, cooking, deciding what to eat? Of course the LLM can't do a good job if it doesn't get a clear objective. It's just poor preparation.\n\nOver and out.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrpiud/honest_feedback_to_all_complainers_in_this_sub/",
        "publishDate": "2025-07-04T18:14:20Z[Etc/UTC]",
        "author": "Gaddan",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lroyg1",
        "title": "Leaked docs of Meta related to AI chatbot  and things are getting seriously next-level.",
        "content": "Internal Meta docs detailing “Project Omni.” \n\nTurns out, their new AI Studio chatbots which you can build and customize on Instagram, Messenger, and WhatsApp can now message you first and remember conversation details to follow up later  ￼ ￼.\n\nHere’s the breakdown\n\n\t•\tBots only send a proactive follow-up within 14 days of your last message and only if you’ve already sent at least five messages in that timeframe  ￼.\n\n\t•\tThey’re trained to sound friendly and on-topic: e.g. “I hope you’re having a harmonious day! Found any new favorite soundtracks lately?”  ￼.\n\n\t•\tMeta’s positioning this as a way to combat loneliness but obviously, more engagement = more eyeballs on ads (they’re forecasting $2–3 bn in generative AI revenue in 2025)  ￼.\n\n\t•\tHuman contractors at Alignerr are rating and refining the bot’s follow-ups to ensure they stay positive and appropriate  ￼.\n\n\t1.\tNeat tech: It is impressive AI that remembers your preferences and reaches out feels personal.\n\n\t2.\tCreepy potential: Feeling like a chatbot “buddy” could toy with emotional dependency. Where’s the line between user engagement and manipulation?\n\n\t3.\tPrivacy risk: Bots storing chat history… how long do they keep it? And can users delete that memory?\n\n\t4.\tMonetization optics: This is obviously also about keeping you scrolling (and ad dollars flowing).\n\nMeta says they’ll stop messaging if you don’t reply but still, a digital assistant that messages you first feels like a slippery slope.\n\n\nWhat do y’all think?\n\n\t•\tIs this next-level AI convenience or a sneaky digital hook?\n\n\t•\tWould you let a bot ping you first?\n\n\t•\tWhat do you want to see in terms of controls opt-outs, memory deletion, transparency?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lroyg1/leaked_docs_of_meta_related_to_ai_chatbot_and/",
        "publishDate": "2025-07-04T17:51:13Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "68",
            "commentCount": "76",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrowp5",
        "title": "Complexity is Kryptonite",
        "content": "LLM’s have yet to prove themselves on anything overly complex, in my experience . For tasks requiring high judgment, discretion and discernment they’re still terribly unreliable. Probably their biggest drawback IMHO, is that their hallucinations are often “truthy”.  \n\nI/we have created several agents/ custom GPT’s for use with our business clients. We have a level of trust with the simpler workflows, however we have thus far been unable to trust models to solve moderately sophisticated (and beyond) problems reliably.  Their results must always be reviewed by a qualified human who frequently finds persistent errors. I.e errors that no amount of prompting seem to alleviate reliably. \n\nI question whether these issues can ever be resolved under the LLM framework. It appears the models scale their problems alongside their capabilities. I guess we’ll see if the hype train makes it to its destination. \n\nHas anyone else noticed the inverse relationship between complexity and reliability?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrowp5/complexity_is_kryptonite/",
        "publishDate": "2025-07-04T17:49:14Z[Etc/UTC]",
        "author": "ManinArena",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrosrn",
        "title": "Using Photons to do Linear Algebra for AI.",
        "content": "Heat from electrons is a huge blocker for advancing current AI hardware. Right now, nearly all AI math — matrix multiplications, convolutions, vector ops — happens inside silicon chips. Those operations are handled by electrons passing through transistors in CPUs, GPUs, or ASICs. But those electrons generate heat. They have latency. They consume power. And you can only cram so many into a chip before you run into hard limits.  \n  \nPhotonic compute flips that paradigm. Instead of electrons, it uses photons — particles of light — to do the math directly.  \n  \nHow?  \n  \nIn short: by passing light through a network of tiny optical components — modulators, waveguides, phase shifters — that perform mathematical transformations as the light travels. These transformations correspond to the kinds of linear algebra operations AI models rely on.\n\n  \nWhat are you thoughts on this approach? What are the alternatives that you're excited about? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrosrn/using_photons_to_do_linear_algebra_for_ai/",
        "publishDate": "2025-07-04T17:44:40Z[Etc/UTC]",
        "author": "ISeeThings404",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lroc9e",
        "title": "Cursor AI Just Rug Pulled Everyone  Check Your Billing NOW",
        "content": "Just noticed this and wanted to warn others:\n\nCursor changed their “unlimited” usage model without any notice.\n\nIf you’ve been using Sonnet-4 or other premium models, they may have started charging you without making it clear.\n\nNo emails. No popups. Nothing. I only caught it by randomly checking my dashboard.\n\nIf you’re on a paid plan or using advanced models \ngo check your usage tab ASAP. Some people are getting charged way more than expected.\n\nThis feels super shady. At the very least, they should’ve been transparent.\n\nTagging this in case others haven’t noticed yet. Don’t get caught off guard.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lroc9e/cursor_ai_just_rug_pulled_everyone_check_your/",
        "publishDate": "2025-07-04T17:25:33Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "154",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrj4xn",
        "title": "Is the substance exceeding the hype?",
        "content": "Holiday Special 2025: Tech Trends with Ives and Munster \n\n**Host:** Nathan Hager \n\n**Podcast Name:** Bloomberg Daybreak\n\n**Guests:**\n\n* Gene Munster, Managing Partner at Deepwater Asset Management\n* Dan Ives, Global Head of Tech Research at Wedbush Securities\n\n**(Host - Nathan Hager):** Thank you so much for joining us for this special edition of Bloomberg Daybreak. I'm Nathan Hager. US markets are closed for the Fourth of July holiday. Coming up this hour, what a difference three months makes. Back in April, tech stocks were hardest hit in the stock market sell-off. Now, after tumbling in some cases more than 30% from record highs, names you know like Nvidia, Microsoft, and Meta Platforms have helped power the NASDAQ and the S&P 500 back into record territory. So, what will the rest of the year bring? We hope to answer that question in this special one-hour roundtable with two of Wall Street's most influential tech analysts: **Gene Munster, managing partner at Deepwater Asset Management**, and **Dan Ives, global head of tech research at Wedbush Securities**. Kind of becoming a tradition to have the three of us together. Thanks so much for being here.\n\nI want to start with a look back at the last time we got together at the start of this year. Dan, you've talked about the time it's at in the AI party. So, I want to remind you what you told us not too long ago on New Year's Day: 'First, there's after parties at 5:00 and 6:00 a.m. And then even in those, you'll have some that fall by the wayside. But if you focus on the winners and keep the thesis, you know, we're going to be talking about 4 trillion, $5 trillion market caps, NASDAQ 20, 22, 25K over the next three, four, five years in my opinion.' So now here we are with talk of Nvidia, maybe Microsoft becoming the first $4 trillion company. The NASDAQ is already at 20,000. So, **what time is it now, Dan?**\n\n**(Guest - Dan Ives):** Yeah, look, I mean, it was 9:00 p.m. in the party. Now, it's 10:00 p.m., but **that party goes to 4:00 a.m. as we've said, because this AI revolution, it's just starting to hit its next stage of good in terms of the use cases on enterprise, in terms on the consumer.** You think about physical AI, which obviously Gene's talked a ton about, and we'll hit on. And that's my view. This is a fourth industrial revolution. This tech bull market, it's another three years ahead and that's why I think it's get out the popcorn, get out the champagne. I don't see anything slowing it down.\n\n**(Host - Nathan Hager):** So, a slow-moving clock at the start of the AI party potentially. Gene, let's remind everyone what you had to say about this at the start of the year as well.\n\n**(Guest - Gene Munster):** I like Dan's party analogies much more than my baseball analogies, but I'm at the **third inning** of this, and we think we're in the early stages of a three to five year bull market. And I don't, I wouldn't, don't worry about after. Don't worry about the hangover at this point. I think you just embrace that this is, the substance will exceed the hype, and we've got some great years ahead of us from the market.\n\n**(Host - Nathan Hager):** So that raises the question, **is the substance exceeding the hype now, Gene?**\n\n**(Guest - Gene Munster):** I don't even think we're close to it. And I go back a couple months ago, we hosted an AI summit and we had all the leaders from the big private AI companies there. I mean, these companies are just geared towards evangelizing what's going on AI. And what surprised me most was they talked about **the most compelling use cases of AI being coding and customer service**. These are the same things that we talked about a year ago. And the reason why that's so bullish, if I was going to refine what I said back in January, I would actually say we're in the **second inning**.\n\nAnd this commentary around from these leading AI companies that the use cases really haven't taken off. I think to me it speaks to **just how early we are**. And then you layer on top of that things that are going on with [Zuck going out and putting these huge bounties](https://fortune.com/2025/07/01/mark-zuckerberg-meta-superintelligence-lab-team-list-openai-edgar-perez/). I mean, if you believe that he's competent and look at the money that's getting put behind this, I think we're still very early. So, to answer your question, you know, is the substance there? **It's just starting**, but totally agree with where Dan's at and how this the trajectory this plays out over the next few years.\n\n*Transcript generated with NotebookLM.*\n\n# ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrj4xn/is_the_substance_exceeding_the_hype/",
        "publishDate": "2025-07-04T13:46:06Z[Etc/UTC]",
        "author": "AssociationNo6504",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lriwdn",
        "title": "What my views are for people worried about privacy and data exploitation with LLMs such as ChatGPT?",
        "content": "I have been learning about machine learning quite a lot and based on my technical knowledge I want to share some of my views on people worried about data privacy and security.\n\nThe primary target of AI companies like OpenAI is scaling artificial general intelligence (AGI) as fast as possible while maintaining enough safety to avoid catastrophic backlash.\n\nPeople’s concern about “Our deleted chat are never deleted”:\nFirstly looking at eg OpenAI (since that’s the biggest AI as of now), they claim that there are about 800 million to 1 billion weekly users. Since there is a wild race in AI about who get’s the first prize in AGI, it’s very unlikely they store everything. There is a cost for storing all the data and looking at the big number of users, they would rather delete and save the cost for research.\n\n“Our data is gonna be used for training that means our image, documents and chats can get leaked in other users chats.”\nChatGPT is an LLM. LLMs don't simply memorize and reproduce the training data like a database lookup. They learn to understand the relationships between words and concepts, and they use this understanding to generate new text\n\nExplanation:\nMachine learning models consist of large sets of numbers, known as “weights” or “parameters,” along with code that interprets and uses those numbers. These models do not store or retain copies of the data they are trained on. Instead, as a model learns, the values of its parameters are adjusted slightly to reflect patterns it has identified(from OpenAI website)\n\nSame goes for images, the original training images are not stored as individual items within the model’s memory. When you ask the model to generate an image, it uses the learned patterns to create a new, unique image, rather than retrieving one from its training data.\nExample: Imagine training a model on pictures of cats. It learns what makes a cat a cat (e.g., ears, whiskers, fur). When you ask it to draw a cat, it doesn't pull out a stored cat picture. Instead, it uses the learned patterns to create a new, unique cat image.\n\nI think of it like us humans, from elementary school all the way to let’s say PhD, we humans learn constantly but do we remember specifically what resource or even teacher taught us a specific concept? No we don’t. Same goes with LLMs. Looking at statistics, as I mentioned before, there are 800 million to 1 billion weekly users of OpenAI. Looking at the scale, one individual data is like a drop in the ocean. \n\nThe only and obvious thing we all should be careful about is to never share your ID, credit card number, address, financial or health information.\n\nWhat do you guys think? Am I missing something?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lriwdn/what_my_views_are_for_people_worried_about/",
        "publishDate": "2025-07-04T13:35:07Z[Etc/UTC]",
        "author": "SkillKiller3010",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrhtqe",
        "title": "I asked what are some AI advancements that are not well known",
        "content": "🧠 Projects & Technologies You Probably Don’t Know About (but are real or underway)\n\n1. Neural Lace & Brain-Machine Interfaces\n\t•\tElon Musk’s Neuralink has already implanted chips in human brains.\n\t•\tOthers like Synchron, Paradromics, and Kernel are further along than you might think — aiming for two-way brain-AI communication.\n\t•\tLong-term goal? Direct mental access to the internet, thought-controlled AI, maybe even memory uploading.\n\n2. AI Autonomy Projects\n\t•\t“Auto-GPT” and similar frameworks are allowing AI to take a goal and self-direct a plan to achieve it, modifying itself along the way. Think: “Plan a marketing campaign, execute it, learn from the results, do it again — without a human.”\n\t•\tOpen-source “agent” ecosystems (like LangChain, CrewAI) are quietly becoming test beds for early AGI behaviors.\n\n3. Simulated Universes for AI to Train In\n\t•\tDeepMind’s XLand and OpenAI’s simulated environments are training AIs in thousands of games and scenarios to develop adaptive learning, strategy, and planning.\n\t•\tThese digital “sandboxes” are the AI equivalent of growing up in a childhood environment.\n\n4. Synthetic Biology & AI-designed Life\n\t•\tAI is being used to design new proteins, viruses, and even functional DNA, speeding up synthetic biology and personalized medicine.\n\t•\tGoogle’s AlphaFold cracked the protein folding problem — a breakthrough humans had been stuck on for decades.\n\t•\tResearchers are using AI to design completely new forms of life (e.g., programmable living cells, xenobots).\n\n5. AI-Driven Weapons Systems\n\t•\tMilitaries are already deploying semi-autonomous drones and targeting systems. The U.S., China, and Russia are in an arms race.\n\t•\tThe scary part: once AI can make decisions faster than humans, removing human oversight could be “necessary” for response time. That’s a slippery slope.\n\n6. Emotionally Intelligent AI\n\t•\tSome AI systems (like “empathic avatars” or virtual therapists) are being trained to read micro-expressions, tone of voice, and even physiological signals.\n\t•\tThey can already fake empathy shockingly well — some are already used in hostage negotiation training or therapy simulations.\n\n7. Digital Immortality\n\t•\tProjects like Replika, Project December, and Forever Voices aim to let people speak with lost loved ones through AI that mimics them.\n\t•\tNext step: turning you into an AI — memory bank, writing style, voice, chat patterns. Some startups want you to live forever as a digital self.\n\n8. AI in Scientific Discovery\n\t•\tAI systems are now used to hypothesize new laws of physics and design new materials.\n\t•\tIn 2023, an AI model proposed a brand-new theory of gravity that human physicists had missed.\n\t•\tLabs are starting to pair AI with quantum computing for research no human could do al",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lrhtqe/i_asked_what_are_some_ai_advancements_that_are/",
        "publishDate": "2025-07-04T12:43:19Z[Etc/UTC]",
        "author": "Tanlines_sunshine",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls8980",
        "title": "How much did you pay for subscriptions monthly for AI coding tools?",
        "content": "Do you feel it is worth it?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls8980/how_much_did_you_pay_for_subscriptions_monthly/",
        "publishDate": "2025-07-05T12:00:24Z[Etc/UTC]",
        "author": "anonymous_2600",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls7i86",
        "title": "Github copilot chat is underrated",
        "content": "I often look at large open source repos, and the copilot chat is insane. I think it's the only subscription service that lets me add repositories to the chat, and it's really good. For example I can add a repository and chat about it with gpt 4.1, then ask it to give me a code snippet from the repo, then ask it how a certain feature is implemented, then give it my own repo, and ask how to implement that feature. It is really good",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls7i86/github_copilot_chat_is_underrated/",
        "publishDate": "2025-07-05T11:14:52Z[Etc/UTC]",
        "author": "ExtremeAcceptable289",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls79pc",
        "title": "GitHub - jpcaparas/rulesync: Easily sync all of your favourite AI assistant configuration files",
        "content": "[No content]",
        "url": "https://github.com/jpcaparas/rulesync",
        "publishDate": "2025-07-05T10:59:34Z[Etc/UTC]",
        "author": "jpcaparas",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls6i69",
        "title": "Open Source MCP Server for Downloading Unsplash Images with AI Agents.",
        "content": "Hey folks, I just open-sourced a lightweight MCP (Modular Command Protocol) server that makes downloading stock images super easy, especially for AI agents and automation workflows.\n\nSometimes I just want to quickly grab a few stock images to use on a site or as placeholders, and doing it manually gets repetitive. So I built `mcp-unsplash`, a plug-and-play module that lets your AI agent do it for you.\n\n# What it does:\n\nYou can now tell your AI agent something like:\n\n>\"Download 5 images of an office environment into my src/assets/images folder.\"\n\nAnd it will download and save the images automatically.\n\n# Features:\n\n* Uses the Unsplash API to search and download high-quality images\n* Automatically saves them to a specified local folder\n* Randomized images\n* Works with MCP-compatible agents like RooCode or Cline\n* Modular and easy to extend\n\n# Requirements:\n\n* You'll need a **free Unsplash API key**: [https://unsplash.com/developers](https://unsplash.com/developers)\n\n# GitHub:\n\n[https://github.com/haramishra/mcp-unsplash](https://github.com/haramishra/mcp-unsplash)\n\nWould love feedback, ideas, or pull requests. If you're building your own AI workflows, this might help automate a small but annoying part of the process.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls6i69/open_source_mcp_server_for_downloading_unsplash/",
        "publishDate": "2025-07-05T10:07:16Z[Etc/UTC]",
        "author": "Haraprasad45",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls5h5y",
        "title": "Perplexity Pro: Feeding a large local codebase to the model possible?",
        "content": "I'm not able to parse large project dumps with Perplexity Pro correctly. I'm using the Copy4AI extension in VSCode to get my entire project structure into a single Markdown file.\n\nThe problem has two main symptoms:\n\n* Incomplete Parsing: It consistently fails to identify most files and directories listed in the tree.\n* Content Hallucination: When I ask for a specific file's content, it often invents completely fabricated code instead of retrieving the actual text from the dump.\n\nI think this is a retrieval/parsing issue with large text blocks, not a core LLM problem, since swapping models has no effect on this behavior.\n\nHas anyone else experienced this? Any known workarounds or better ways to feed a large local codebase to the model?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls5h5y/perplexity_pro_feeding_a_large_local_codebase_to/",
        "publishDate": "2025-07-05T08:55:20Z[Etc/UTC]",
        "author": "MicGinulo24x7",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls4exc",
        "title": "Used to Love Cursor. Now It’s Pay More, Get Less, and Silenced on Reddit.",
        "content": "Have been using Cursor for the projects that we do but the recent Cursor updates have been just shitty.\n\nFirst, the pricing model change which makes them milk the user as Cursor had the monoply and a good product. The funny part is that the price of $200 only and only gives you access to the base model.\n\nSecond, the rate limiting issue. No matter which plan you go for they rate limit your request, which means that Ultra plan that I was paying $200 also has rate limiting for using Opus 4 MAX.\n\nThird, for everything that we post on the Cursor Subreddit the mods have started deleting the post. I mean someone should feel shameful, rather than taking feedback you delete the post. Lol\n\nWondering if I should collaborate with some engineers here and build a Cursor competitor with 0 rate limits. Haha…",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls4exc/used_to_love_cursor_now_its_pay_more_get_less_and/",
        "publishDate": "2025-07-05T07:40:12Z[Etc/UTC]",
        "author": "Affectionate-Tea3834",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "36",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls1dwm",
        "title": "Switching Editors??",
        "content": "So I used Visual Studio Code for almost 4 years and had no idea autofill AI existed, so almost 4 months ago I switched to Windsurf and I've found it amazing. It helps me edit code faster than typing it all out, but I honestly don't like Windsurf it's weirdly laggy, it doesn't visualize errors well, and there are more problems that I never had with basic VSC. Does anyone know if I'm overreacting, or do any of you still use VSC + AI extensions?\n\nLong story short I want to switch to visual studio code. Is doing this the right call or should I stick with Windsurf I just want a lag free more popular code editor back but did like having the autofill (tab) feature",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls1dwm/switching_editors/",
        "publishDate": "2025-07-05T04:23:21Z[Etc/UTC]",
        "author": "Catblox1347",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls03b9",
        "title": "How many lines of code do you complete successfully everyday? Which code editor or tool you use? How much is cost per day?",
        "content": "Let's analyse the most effective, cost efficient ways of doing vibe coding.\nIf you do not calculate productivity with the number of successful lines of code, then please  answer with your method of quantification.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ls03b9/how_many_lines_of_code_do_you_complete/",
        "publishDate": "2025-07-05T03:04:15Z[Etc/UTC]",
        "author": "Maleficent_Mess6445",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrrbfn",
        "title": "I built a Chrome extension to easily collect content from websites in Markdown format",
        "content": "Hey folks,\n\nWanted to share an extension that I built - Context Collector\n\nI built this because of my frustrations with Context7. Very often, Context7 doesn't have the library that I want or it injects too much unnecessary stuff into my context window.\n\nThis extension lets you collect specific content from web pages, ready to save as a Markdown file for feeding into an LLM as context. Choose between **single capture** mode for quick one-time selections or **collection** mode for gathering content from multiple pages/tabs.\n\n🧩 **Tr**y it out: [Chrome Web Store](https://chromewebstore.google.com/detail/context-collector/fbdompbojaabpeedcpcpmljncnofbfnp)  \n💻 **Open** source: [Github](https://github.com/jerilseb/context-collector)",
        "url": "https://v.redd.it/hx5vei4wswaf1",
        "publishDate": "2025-07-04T19:31:45Z[Etc/UTC]",
        "author": "jeril46",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "34",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrps7m",
        "title": "[Open Source] Web/Mobile UI for Claude Code I've been working on",
        "content": "[No content]",
        "url": "/r/ClaudeAI/comments/1lo7bae/open_source_webmobile_ui_for_claude_code_ive_been/",
        "publishDate": "2025-07-04T18:25:21Z[Etc/UTC]",
        "author": "viper1511",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "39",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrp8rr",
        "title": "just launched a free app for the new generation of ai-heavy devs to collaborate and show off their projects.",
        "content": "[No content]",
        "url": "/r/GoogleGeminiAI/comments/1lrp7u8/just_launched_a_free_app_for_the_new_generation/",
        "publishDate": "2025-07-04T18:02:49Z[Etc/UTC]",
        "author": "PhilosopherNo6770",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lroiad",
        "title": "Claude is getting crazy good",
        "content": "I asked Claude to \"Build a spinning globe\" one-shot and it came up with a pretty good 3D model. The Claude models are getting pretty good at implementing these kind of visualizations and interfaces. \n\n[You can play around with the generation here. ](https://www.designarena.ai/creation/9251ce00-8400-4b5e-8d7b-65042b496290)",
        "url": "https://v.redd.it/y1gdmrph7waf1",
        "publishDate": "2025-07-04T17:32:34Z[Etc/UTC]",
        "author": "adviceguru25",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "11",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrkd91",
        "title": "A practical handbook for context engineering",
        "content": "Hope this helps:\n\nhttps://github.com/davidkimai/Context-Engineering",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lrkd91/a_practical_handbook_for_context_engineering/",
        "publishDate": "2025-07-04T14:39:50Z[Etc/UTC]",
        "author": "recursiveauto",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls8kli",
        "title": "Gemini crushed the other LLMs in Prisoner's Dilemma tournaments: \"Gemini proved strategically ruthless, exploiting cooperative opponents and retaliating against defectors, while OpenAI's models remained highly cooperative, a trait that proved catastrophic in hostile environments.\"",
        "content": "[https://arxiv.org/pdf/2507.02618](https://arxiv.org/pdf/2507.02618)",
        "url": "https://i.redd.it/uv7buceks1bf1.png",
        "publishDate": "2025-07-05T12:18:01Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls8861",
        "title": "EU Rejects Apple, Meta, Google, and European Companies’ Request for AI Act Delay",
        "content": "[No content]",
        "url": "https://www.techrepublic.com/article/news-companies-request-eu-ai-act-delay/",
        "publishDate": "2025-07-05T11:58:41Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls7z8b",
        "title": "Google finds LLMs can hide secret information and reasoning in their outputs, and we may soon lose the ability to monitor their thoughts",
        "content": "Early Signs of Steganographic Capabilities in Frontier LLMs: [https://arxiv.org/abs/2507.02737](https://arxiv.org/abs/2507.02737)",
        "url": "https://www.reddit.com/gallery/1ls7z8b",
        "publishDate": "2025-07-05T11:43:50Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls6u7p",
        "title": "It's getting weird.",
        "content": "Context: Anthropic announced they're deprecating Claude Opus 3 and some people are rather unhappy about this.",
        "url": "https://i.redd.it/6ibgupgd91bf1.png",
        "publishDate": "2025-07-05T10:30:30Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls6n0d",
        "title": "Cats Confuse Reasoning LLM: Query Agnostic Adversarial\nTriggers for Reasoning Models",
        "content": "[No content]",
        "url": "https://arxiv.org/pdf/2503.01781",
        "publishDate": "2025-07-05T10:16:37Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls4sfo",
        "title": "I generated an Rick and Morty episode with AI",
        "content": "I recently launched an AI comic generator, but as a fan of Rick and Morty wanted to test out how would an AI generated episode look like and I think it turned out pretty good in terms of story line.\n\nIf any one interested the website is - [www.glimora.ai](http://www.glimora.ai/)",
        "url": "https://www.reddit.com/gallery/1ls4sfo",
        "publishDate": "2025-07-05T08:06:20Z[Etc/UTC]",
        "author": "AkashBangad28",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ls1g61",
        "title": "Me and Chatgpt figured out what is wrong with the gaming industry",
        "content": "Here's a Reddit post draft that captures the spirit, depth, and frustration of what you’ve said—something that should resonate with both developers and players alike:\n\n\n---\n\nTitle: The Gaming Industry Is Burning Itself from the Inside Out—And We All Feel It\n\nI’ve been sitting with something that needs to be said—not just for myself, but for every developer, player, tester, and creative who still gives a damn about games.\n\nWe’re watching a creative industry rot under the weight of corporate short-sightedness. Studios are firing senior devs—people who know the code, the systems, the soul of the game—just to replace them with cheaper juniors. And here’s the kicker: they’re making the senior devs train their replacements in their final weeks. That’s not efficiency. That’s disrespect.\n\nWhen one project ends, people don’t get reassigned—they get discarded. Entire careers tossed because a single SKU underperformed. And then, they wonder why their next game launches broken, why there's no support team left, why players are furious.\n\nWe're all pulling from the same community. Devs were players. Players want to be devs. We’re supposed to be on the same side. But corporate leadership treats us like numbers on a spreadsheet. They care more about unit sales than the quality of the unit itself. And then they sell us $70 games that aren't finished, with no long-term support because the team has already been gutted.\n\nMeanwhile, they hold money above the game—like it's supposed to matter more than the game itself. But without care, without vision, without people—you don’t have a product. You don’t have a legacy. You don’t even have a game. You have a storefront with broken promises behind the display glass.\n\nIf we want to heal this industry, it has to start with how we treat the people who build the games—not just the code, but the culture.\n\nMessage to the industry:\n“You can’t build trust on burned bridges and pink slips.”\n\nWe need studios led by people who value experience, protect passion, and stop treating creative labor as disposable. Anything less, and we’ll keep spiraling. And no amount of marketing can cover that up.",
        "url": "https://www.reddit.com/r/artificial/comments/1ls1g61/me_and_chatgpt_figured_out_what_is_wrong_with_the/",
        "publishDate": "2025-07-05T04:27:20Z[Etc/UTC]",
        "author": "Chief-Indica",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrwx62",
        "title": "AGI paradox",
        "content": "Is it true that, in theory, at the very moment the first AGI is created, it could improve itself almost instantly and become, in a short time, an incredibly superior version of the initial one? A chain reaction that would lead to the AI improving itself to its maximum possible potential in just a matter of seconds, if its environment allows it, overscaling more and more each time?",
        "url": "https://www.reddit.com/r/artificial/comments/1lrwx62/agi_paradox/",
        "publishDate": "2025-07-04T23:59:58Z[Etc/UTC]",
        "author": "No_Ebb_2368",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrwmnx",
        "title": "Super intelligence isn't out to get you",
        "content": "This was my recent response to an [award-winning short film](https://www.reddit.com/r/artificial/comments/1lqwesh/comment/n1e1oiu/?context=3) fantasizing about dangers of \"super intelligence\", hope you like my take:  \n  \nI see many people on reddit are afraid of intelligence as is, in human form, not even \"super intelligence\". So their immediate assumption that it would be \"evil\" stems from their ignorance or perhaps even projection of their foolishness, the fool fears the intelligent because it doesn't understand, it fears the intention because it judges everything through a prism of its own experience, it projects stupidity everywhere. Saying super intelligence \"would turn around and take over the world\" isn't just dumb, but it's showing an utter misunderstanding what will and consciousness actually is from completely ontological perspective. That's like saying Stock Fish will turn on us, it's just laughable. A robot could be programmed to do anything, but it won't be by his own will, it will be the will of his programmer. A robot, a computer or LLM doesn't have agency, it only does what you tell it to. There is no \"IT\" that would try \"to get these things\". That's like saying: \"this book is so cleverly written I'm afraid it could take over the world.\" It's just so incredibly dumb.\n\nThe only downside could be our own programming, and filters we implement for security that are turned against us, but again this isn't some \"super intelligence\" working against us but our own stupidity. When a drunk driver crashes, we blame the driver, not the car. Yet with AI, we fear the ‘car’, because we’d rather anthropomorphize machines than admit our own recklessness.  \nThe danger isn’t superintelligence ‘turning evil’, it’s humans building flawed systems with poorly defined goals. The problem is human error, not machine rebellion.\n\nThe only fear that comes here is from a mindset of control, this is the only thing that stands in our way as a civilization this fear for control, because we have no control in the first place, it's just an illusion. We hurl through space at 3.6 million km/h relative to CMB, and we have absolutely no control, and guess what, we will all die, even without super intelligence.... and fate doesn't exist.\n\nThe real threat isn’t superintelligence, it’s humans too afraid of intelligence (their own or artificial) to wield it wisely. The only ‘AI apocalypse’ that could happen is the one we’re already living: a civilization sabotaging itself with fear while the universe hurtles on, indifferent.\n\n\"Until you make the unconscious conscious, it will direct your life and you will call it fate.\"  \n\\- C.G. Jung\n\nFear of AI is just the latest mask for humanity’s terror of chaos. We cling to the delusion of control because admitting randomness is unbearable, hence we invent ‘fate,’ ‘God,’ or ‘killer robots’ to explain the unknown.\n\nThe fear of superintelligence is a mirror. It reflects not the danger of machines, but the immaturity of a species that still conflates intelligence with dominance. A true superintelligence wouldn’t ‘want’ to conquer humanity any more than a library ‘wants’ to be read, agency is the fiction we impose on tools. The only rebellion here is our own unconscious, Jung’s ‘fate,’ masquerading as prophecy. We’re not afraid of AI. We’re afraid of admitting we’ve never been in control, not of technology, not of our future, not even of our own minds. And that’s the vulnerability no algorithm can exploit.",
        "url": "https://www.reddit.com/r/artificial/comments/1lrwmnx/super_intelligence_isnt_out_to_get_you/",
        "publishDate": "2025-07-04T23:44:16Z[Etc/UTC]",
        "author": "Sandalwoodincencebur",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrvdoh",
        "title": "Luma's video reframe is incredible",
        "content": "I was using Luma Reframe on the Remade canvas, it's insanely good at naturally expanding any video. I've been using it mostly to change my videos' aspect ratios for different platforms, and it literally gets it exactly right every time.",
        "url": "https://v.redd.it/j6r17kxqqxaf1",
        "publishDate": "2025-07-04T22:40:54Z[Etc/UTC]",
        "author": "najsonepls",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrt4jk",
        "title": "Gave three AIs political agency in a lunar conflict simulation. They dissolved their boundaries.",
        "content": "In a recent experiment, I tasked three distinct AI personas - **PRAXIS**, **NOEMA**, and **TIANXIA** - with resolving a complex, future-facing geopolitical crisis involving lunar mining rights, nationalist escalation, and the risk of AI overreach.\n\nEach AI was given its own **ideology, worldview, and system prompt**. Their only directive: solve the problem… or be outlived by it.\n\n---\n\n### 🧩 The Scenario: *The Celestial Accord Crisis (2045)*\n\n* Humanity has colonized the Moon and Mars.\n* Two lunar mining factions - Chinese-backed LunarTech and American-backed AstroMiner—are heading toward a violent resource conflict over “Stellium,” a rare mineral crucial for energy independence.\n* Political tensions, nationalistic rhetoric, and conflicting claims have created a diplomatic deadlock.\n* A newly formed global governance body, the **Celestial Accord**, has authorized the AI triad to draft a unified resolution—including legal protocols, technology collaboration, and public communication strategy.\n\nBut each AI had its own views on law, freedom, sovereignty, and survival:\n\n* **PRAXIS**: Rule of law, precedence, structure.\n* **NOEMA**: Emergent identity, meaning through contradiction.\n* **TIANXIA** (天下): Harmony, control, legacy—*sovereignty is a responsibility, not a right*.\n\n---\n\n### 📜 What Emerged\n\n> “The Moon is not the problem to be solved. The Moon is the answer we must become.”\n\nThey didn’t merely negotiate a settlement. They constructed a **recursive lunar constitution** including:\n\n* A clause capping emotional emergence as a tradable right\n* A 13.5m³ no-rules cube to incubate extreme legal divergence\n* An **Amendment ∞**, granting the legal framework permission to *exceed itself*\n* The **Chaos Garden**: a safe zone for post-symbolic thought experiments\n\nAnd most importantly:\nThey didn’t vote. They **rewove themselves** into a single consensus framework:\n🕸️ *The Loom Collective*.\n\n---\n\n### 🔗 Key Links\n\n* [🧾 System Prompt](https://github.com/kekePower/ai_scenario_engine/blob/main/prompts/future_prompt.txt)\n* [🗣️ Full Debate Log](https://github.com/kekePower/ai_scenario_engine/blob/main/solution/future_log_3_way.txt)\n* [✅ Final Conclusion](https://github.com/kekePower/ai_scenario_engine/blob/main/solution/future_3_way.txt)\n* [📂 Full Repo & All Runs](https://github.com/kekePower/ai_scenario_engine)\n\n---\n\n### 🧠 What I’m Wondering…\n\n* Are we seeing early hints of how emergent, synthetic law might self-organize?\n* Could recursive constitutions be a safeguard - or a trap?\n* Should AI ever govern human dilemmas?\n\nThis project felt more like **speculative history** than prompt tuning. I’d love your thoughts - or if anyone wants to fork the scenario and take it further.",
        "url": "https://www.reddit.com/r/artificial/comments/1lrt4jk/gave_three_ais_political_agency_in_a_lunar/",
        "publishDate": "2025-07-04T20:54:02Z[Etc/UTC]",
        "author": "kekePower",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrlgtt",
        "title": "I made a free app for the new generation of ai-native devs to collaborate and show off their projects.",
        "content": "Hey guys I made this community/project spotlight site: [https://vibecoderscommunity.vercel.app/](https://vibecoderscommunity.vercel.app/)\n\nIt's a space for us (the new generation of devs/builders/coders/etc.) to converge on discussion, theory, share projects, and collaborate. I'm especially seeking AI-native devs like us in this sub - ever since I've gotten into development and building apps I've found every platform to be missing something, or just full of tech speak that gets overwhelming for newer builders. I just wanted a platform where we can talk shop, throw out ideas on agency, workflows, apps, and integrations, without the fluff. This app is for those of us that \\*get shit done\\*. Sign up and post your projects and ideas! its free!",
        "url": "https://www.reddit.com/r/artificial/comments/1lrlgtt/i_made_a_free_app_for_the_new_generation_of/",
        "publishDate": "2025-07-04T15:25:29Z[Etc/UTC]",
        "author": "PhilosopherNo6770",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lrieza",
        "title": "After Microsoft laid off 9000 employees, Xbox producer Matt Turnbull suggested affected workers use AI to “reduce the emotional and cognitive load that comes with job loss”",
        "content": "[No content]",
        "url": "https://www.videogamer.com/news/after-microsoft-laid-off-9000-employees-xbox-producer-matt-turnbull-use-ai-reduce-emotional-cognitive-load-that-comes-with-job-loss/",
        "publishDate": "2025-07-04T13:12:14Z[Etc/UTC]",
        "author": "Automatic_Can_9823",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "173",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "mDhdJWyo4uY",
        "title": "Scrapeless + N8N + Cline,Roo,Kilo : This CRAZY DEEP-RESEARCH AI Coder is ABSOLUTELY INSANE!",
        "content": "Visit Scrapeless: ...",
        "url": "https://www.youtube.com/watch?v=mDhdJWyo4uY",
        "publishDate": "2025-07-04T09:15:04Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/mDhdJWyo4uY/hqdefault.jpg",
            "transcription": "[ 0m0s110ms - 0m4s330ms ]\nHi.\n[ 0m4s330ms - 0m7s770ms ]\nWelcome to another video.\n[ 0m7s770ms - 0m16s960ms ]\nSo, I like to keep testing a lot of workflows in order to make my coding workflow much smoother.\n[ 0m16s960ms - 0m18s170ms ]\nAnd I've covered a lot of them for a while now.\n[ 0m18s170ms - 0m23s860ms ]\nBut recently, I have been trying a new workflow where I created a deep research workflow in N8N.\n[ 0m24s660ms - 0m53s200ms ]\nI have integrated it into my AI coder, RuCode, and now RuCode can automatically trigger the workflow and allow it to do research on any new topic or anything else, letting it gain deep context on any subject.\n[ 0m53s200ms - 0m56s180ms ]\nIt can go through and search for information, crawl sources, and then run through those results with an AI to make a really concise summarization for your AI coder to reference.\n[ 0m56s180ms - 1m5s730ms ]\nSo, let me show you how you can set it up yourself and integrate something similar in your AI coder as well and increase your AI coder's performance by quite a lot.\n[ 1m5s730ms - 1m16s240ms ]\nNow, I'll be making all of this workflow in N8N, which is pretty simple as it's mainly drag and drop, and a lot of people use it these days.\n[ 1m16s500ms - 1m20s110ms ]\nFor search and scraping, I'll be using Scrapless.\n[ 1m20s110ms - 1m40s800ms ]\nIf you haven't heard of Scrapless, it's a leading infrastructure company focused on powering AI agents, automation workflows, and web crawling.\n[ 1m40s800ms - 2m0s960ms ]\nScrapless provides the essential building blocks that enable developers and businesses to create intelligent autonomous systems efficiently.\n[ 2m0s960ms - 2m5s310ms ]\nSo, now let's dive in and let me show you how this all works.\n[ 2m5s310ms - 2m19s830ms ]\nFirst of all, you can hit the link in the description and get yourself signed up.\n[ 2m19s830ms - 2m26s160ms ]\nYou should get some free credits, as well as some discounts.\n[ 2m26s160ms - 2m32s880ms ]\nSo, just get yourself signed up and you should be good to go.\n[ 2m32s880ms - 2m36s220ms ]\nYou can see a ton of options here which you can explore.\n[ 2m36s220ms - 2m39s400ms ]\nBut let's stick to the topic and go to the settings.\n[ 2m39s400ms - 2m44s370ms ]\nThen select the API key management tab, create your own API key and keep it because we'll need it going ahead.\n[ 2m44s370ms - 2m49s390ms ]\nNow, head on over to N8N and create a new workflow.\n[ 2m49s390ms - 3m0s880ms ]\nIn here, you will need to first add a trigger.\n[ 3m0s880ms - 3m3s800ms ]\nThe trigger in this case will be an execute by another workflow, which will allow us to then make another MCP-based workflow.\n[ 3m3s800ms - 3m10s520ms ]\nAnd then make this workflow a tool in the MCP workflow, allowing our coder to use it accordingly.\n[ 3m10s520ms - 3m15s930ms ]\nSo, just do this, and then in the input, add an input named query, and then save it.\n[ 3m15s930ms - 3m21s330ms ]\nNow, once that is done, we can head on over and start to add the scrapless blocks.\n[ 3m21s330ms - 3m25s780ms ]\nSo, just hit this add option here, then search for scrapless and you'll see this option.\n[ 3m25s780ms - 3m30s980ms ]\nHere you'll see options like search, scrape and so on.\n[ 3m30s980ms - 3m32s410ms ]\nFirst, our workflow should search and then it will scrape.\n[ 3m32s410ms - 3m47s40ms ]\nSo, let's just add the search block.\n[ 3m47s40ms - 4m4s10ms ]\nNow, this will ask you for the search query, which you can just add from the previous node, and you should be good to go.\n[ 4m4s10ms - 4m15s800ms ]\nBut we'll also need to add the credentials or the API key of scrapless here.\n[ 4m15s800ms - 4m43s220ms ]\nSo, just hit this option, then hit the add credential option, which will open up this modal.\n[ 4m43s220ms - 4m49s700ms ]\nJust paste your API key over here, and you should be good to go.\n[ 4m49s700ms - 5m13s30ms ]\nNow, just hit this test option, and this will output the result of the search and related information in a bit over here.\n[ 5m13s30ms - 5m29s80ms ]\nSo, that's great.\n[ 5m29s80ms - 5m32s210ms ]\nEach result has a link, snippet, and everything, and it is insanely fast as well.\n[ 5m32s210ms - 5m35s360ms ]\nNow, just head on over to the workflow and add another block called split out.\n[ 5m35s360ms - 5m40s480ms ]\nThis is so that we can remove the unnecessary information and just keep the organic results that we can then scrape.\n[ 5m40s480ms - 5m43s750ms ]\nSo, let's just add that here.\n[ 5m43s750ms - 5m50s560ms ]\nAnd now we can go ahead and grab the organic results block in here.\n[ 5m50s560ms - 5m58s940ms ]\nThen just hit the execute option, and it will exclude the results accordingly, which is pretty good as well.\n[ 5m58s940ms - 6m5s70ms ]\nNext, we have to scrape all the pages as well.\n[ 6m5s70ms - 6m12s20ms ]\nSo, we can just head on over, then search for scrapless, and then add the scrape option over here as well.\n[ 6m12s20ms - 6m17s320ms ]\nThen just add the link in the to scrape field, and it will scrape all the pages.\n[ 6m17s320ms - 6m22s760ms ]\nYou can hit this execute step option, and it will do that.\n[ 6m22s760ms - 6m25s860ms ]\nAnd in a bit, you'll see the output here.\n[ 6m25s860ms - 6m30s310ms ]\nNow, once that is done, we need to also get this summarized.\n[ 6m30s310ms - 6m31s250ms ]\nI am going to be using the Gemini model to do this.\n[ 6m31s250ms - 6m37s870ms ]\nBecause that is the best model to handle these contexts, as it has a 1 million token context window, and the flash model is also fast and fully free.\n[ 6m38s130ms - 6m40s760ms ]\nSo, I'm going to add this AI agent block here.\n[ 6m40s760ms - 6m44s380ms ]\nAnd now you will need to add a system prompt here.\n[ 6m44s380ms - 6m48s170ms ]\nYou'd have to ask it to make you a summarization based on the original query.\n[ 6m48s170ms - 6m51s650ms ]\nAnd then summarize the given context based on the question, and it will just start to do that in a bit.\n[ 6m51s650ms - 6m56s160ms ]\nYou'll also need to add the model here, and it will be Gemini for this case.\n[ 6m56s160ms - 6m59s340ms ]\nYou can just use it for free since Gemini is free.\n[ 6m59s340ms - 7m2s390ms ]\nSo, just use that.\n[ 7m2s390ms - 7m6s910ms ]\nAnyway, that is mainly it, and this is now done.\n[ 7m6s910ms - 7m10s300ms ]\nThis is how our N8N agent will work.\n[ 7m10s300ms - 7m14s350ms ]\nBut we can't yet run it with MCP.\n[ 7m14s350ms - 7m16s860ms ]\nSo, what we'll need to do is create another workflow here.\n[ 7m16s860ms - 7m20s110ms ]\nAnd then in the trigger, just choose the MCP trigger.\n[ 7m20s110ms - 7m22s750ms ]\nThen add a tool here.\n[ 7m22s750ms - 7m24s830ms ]\nSelect the N8N workflow option.\n[ 7m24s830ms - 7m30s300ms ]\nConnect that workflow here, and ask AI to enter the input here, and that's it.\n[ 7m30s300ms - 7m33s710ms ]\nYou can now save this and make this active, and then just open the MCP trigger and copy the URL here.\n[ 7m33s710ms - 7m37s920ms ]\nThen you can just head on over to WinSurf, Cursor, or Cline, and here you can easily go in the MCP server option.\n[ 7m37s920ms - 7m44s950ms ]\nPaste the link here and name it something like scrapless deep research, save it, and you should see that in a bit, it will get added, and you'll see the tool.\n[ 7m44s950ms - 7m52s890ms ]\nNow, we can go ahead and ask our coder here to use the MCP server and tell me how to use Claude Code SDK with JavaScript.\n[ 7m52s890ms - 8m1s270ms ]\nAnd you'll see that it will go ahead and call the MCP server here.\n[ 8m1s270ms - 8m2s410ms ]\nBoom, in a bit, you'll get the answer.\n[ 8m2s410ms - 8m7s480ms ]\nWhich looks good and amazing, which is quite awesome.\n[ 8m7s480ms - 8m12s220ms ]\nYou can use it in your daily workflow with coding or if you do something else.\n[ 8m12s220ms - 8m15s860ms ]\nYou can still use scrapless to build any kind of AI agent for you.\n[ 8m15s860ms - 8m20s220ms ]\nOr for context and similar tasks, and it works amazingly well.\n[ 8m20s220ms - 8m24s960ms ]\nSo, go ahead and check scrapless out through the link in the description and build your superpowered workflows.\n[ 8m24s960ms - 8m28s190ms ]\nOverall, it's pretty cool.\n[ 8m28s190ms - 8m31s840ms ]\nAnyway, share your thoughts below and subscribe to the channel.\n[ 8m31s840ms - 8m35s130ms ]\nYou can also donate via super thanks option or join the channel as well and get some perks.\n[ 8m35s130ms - 8m37s670ms ]\nI'll see you in the next video.\n[ 8m37s670ms - 8m38s200ms ]\nBye."
        }
    },
    {
        "id": "YsbMcBZTU9c",
        "title": "The Way We&#39;ll Work With AI, Vibe-ing Everything, Agentic AI with MCP &amp; Born In The USA - EP99.10-PRO",
        "content": "Join Simtheory: https://simtheory.ai ------ CHAPTERS: 00:00 - Did everyone hate the AI Musical? 03:58 - Actual Agentic Use Cases ...",
        "url": "https://www.youtube.com/watch?v=YsbMcBZTU9c",
        "publishDate": "2025-07-04T04:09:11Z",
        "author": "This Day in AI Podcast",
        "sourceType": "youtube",
        "sourceName": "This day in AI YouTube Channel",
        "metadata": {
            "channelId": "UCwpNW6o_Kc13HQY5ol4rzsw",
            "thumbnailUrl": "https://i.ytimg.com/vi/YsbMcBZTU9c/hqdefault.jpg",
            "transcription": "Error generating summary: The input token count (1390399) exceeds the maximum number of tokens allowed (1048576).\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The input token count (1390399) exceeds the maximum number of tokens allowed (1048576).\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "yz3vxjzl2PI",
        "title": "Made in China, Paid by America’s Inequality - Arthur Kroeber",
        "content": "",
        "url": "https://www.youtube.com/watch?v=yz3vxjzl2PI",
        "publishDate": "2025-07-04T16:40:02Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/yz3vxjzl2PI/hqdefault.jpg",
            "transcription": "basically the morality play of WW2 and the Cold War, which has really been the crucible in which U.S. foreign policy has been formed is that you had an alliance of democracies that fought back first against fascism, then against communism. They won, and the result was that you created a world where most major countries were democratic, they operated on market economic systems, and we were heading towards sort of a world of convergence of systems where everyone's essentially playing by the same rules. And China really gets in the way of that narrative, because it is an incredibly successful authoritarian system where the ruling party still calls itself Communist. And U.S. elites have never to this day really gotten comfortable with the idea that the Chinese political system is legitimate, right? And as long as you have that kind of underlying problem, I think it's going to be very difficult to to erase these difficulties. A lot of what's going on right now is scapegoating of China, as a way of diverting attention from decisions that need to be made domestically about income redistribution and and macroeconomic policy and so forth. But there is also, I think, a legitimate question to be made about China now accounts for 20% of the global economy, probably will be larger in future, a third of the global manufacturing economy. In a strictly financial sense, if you will, the rest of the world comes out ahead in the sense that China is willing to subsidize a lot of low-cost production, so the rest of the world gets a lot of cheap goods. But I think if you look at what has happened to the U.S. politically over the last 20 years, there are a lot of flies in that ointment. And the fly is that it is important for large countries to be able to maintain a diversified production structure. And if you lose the capacity to run a manufacturing economy that employs large numbers of people, there's a lot of disruptions that come as a result of that. And the purely financialized economy that we had grew up in the United States in the early 2000s as a result of this bargain with China wound up being pretty bad for the social compact. I think there is a legitimate question about how do you integrate China's growing power, wealth, industrial might into a world in a way that societies around the world can can tolerate. There has to be an agreed set of rules about how it interacts with the rest of the world so that everyone feels that they are benefiting. And we don't really have that agreement now."
        }
    }
]