[
    {
        "id": "https://news.smol.ai/issues/25-10-10-not-much/",
        "title": "not much happened today",
        "content": "**FrontierMath Tier 4** results show **GPT-5 Pro** narrowly outperforming **Gemini 2.5 Deep Think** in reasoning accuracy, with concerns about problem leakage clarified by **Epoch AI Research**. **Mila** and **Microsoft** propose **Markovian Thinking** to improve reasoning efficiency, enabling models to reason over 24K tokens with less compute. New research suggests base models inherently contain reasoning mechanisms, with \"thinking models\" learning to invoke them effectively. In systems, **NVIDIA Blackwell** combined with **vLLM** wins InferenceMAX with significant throughput gains, while **Together AI's ATLAS** adaptive speculative decoding achieves 4× speed improvements and reduces RL training time by over 60%. **SparseServe** introduces dynamic sparse attention with KV tiering, drastically improving throughput and latency in GPU memory management.",
        "url": "https://news.smol.ai/issues/25-10-10-not-much/",
        "publishDate": "2025-10-10T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "openai, google-deepmind, microsoft, epoch-ai-research, togethercompute, nvidia, mila, gpt-5-pro, gemini-2.5, vllm, deepseek-v3.1, epochairesearch, yitayml, _philschmid, jiqizhixin, cvenhoff00, neelnanda5, lateinteraction, mgoin_, blackhc, teortaxestex, reasoning, reinforcement-learning, inference, speculative-decoding, sparse-attention, kv-cache-management, throughput-optimization, compute-efficiency, tokenization"
        }
    },
    {
        "id": "1o3ud87",
        "title": "Are There Any Tech Billionaires Who Weren’t ‘Nerds’ Growing Up?",
        "content": "I’m doing a school research project on tech billionaires for a class, and I have a question. It seems like most successful tech entrepreneurs were into tech or coding from a young age, but I’m curious, are there any who were just regular kids growing up? Maybe ones who weren’t coding at 10 or didn’t grow up as ‘geeks’ but still made it big in tech? I’m looking for examples of people who might have been considered ‘cool’ or ‘normal’ as kids and still became successful in the tech world. Are there any exceptions to the stereotype of the ‘tech geek’?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3ud87/are_there_any_tech_billionaires_who_werent_nerds/",
        "publishDate": "2025-10-11T12:28:08Z[Etc/UTC]",
        "author": "Hot-Conversation-437",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3t130",
        "title": "AI should go away forever. That's my blunt take.",
        "content": "Its not going to help anyone, it hurts the environment with data centers, it's faulty and nowhere near how it's advanced in sci-fi movies. \n\nI don't even think it's going to help in the jobs it's going to be used in. \n\nNot to mention that it could end up with Skynet and terminators but that's my fear anyway.\n\nHuman efforts are what matters, not this artificial stuff.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3t130/ai_should_go_away_forever_thats_my_blunt_take/",
        "publishDate": "2025-10-11T11:17:48Z[Etc/UTC]",
        "author": "pokemonyugiohfan21",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3qog7",
        "title": "Yet another one of those bubble fear articles",
        "content": "A tangled web of deals stokes AI bubble fears in Silicon Valley https://www.bbc.com/news/articles/cz69qy760weo\n\nPlace your bets here. When's the bubble popping and how? \n\nMy bet - Infra failure. Winter 2025. \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3qog7/yet_another_one_of_those_bubble_fear_articles/",
        "publishDate": "2025-10-11T08:53:26Z[Etc/UTC]",
        "author": "IntroductionSouth513",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3oq18",
        "title": "Upscaling with references",
        "content": "Idk if it's a thing yet but Upscalers should allow you to attach referance images if the image your trying to upscale is too poor to catch the little details. Like for example, I wanna upscale a screenshot from a old 80s music video but without a reference of wtf it's looking at the results are poor. Would be cool to be able to attach a high quality photograph taken from that music video so the face, clothing &/or environment is more accurate. I think there is a way to do this but I think u need more Vram than I have to run such a thing lol",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3oq18/upscaling_with_references/",
        "publishDate": "2025-10-11T06:48:03Z[Etc/UTC]",
        "author": "TalentedKamarty",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ntvs",
        "title": "Is AI content creation really helping people earn more?",
        "content": "I’m seeing a lot of posts about AI business ideas and content generation tools, but are people actually making money online from it, or just talking about it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3ntvs/is_ai_content_creation_really_helping_people_earn/",
        "publishDate": "2025-10-11T05:54:42Z[Etc/UTC]",
        "author": "washyerhands",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "26",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3nk7n",
        "title": "Companies are investing hundreds of billions of dollars into AI research",
        "content": "How are they you going to recoup all this money from RnD? I don’t see how they will make all this money back AND more tbh",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3nk7n/companies_are_investing_hundreds_of_billions_of/",
        "publishDate": "2025-10-11T05:38:57Z[Etc/UTC]",
        "author": "Odd_Helicopter_7545",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ne57",
        "title": "AI can be poisoned by a small number of bad documents.",
        "content": "A new joint study from the **UK AI Security Institute**, the **Alan Turing Institute**, and **Anthropic** found that as few as *250 corrupted documents* can create a 'backdoor' in LLMs.\n\nThat’s all it takes for a model to start spewing gibberish or leaking data when triggered by a hidden phrase.  \nGiven that most models train on public text from blogs, forums, and personal sites, the attack surface looks to be both enormous & invisible.\n\nSource: [A small number of samples can poison LLMs of any size \\\\ Anthropic](https://www.anthropic.com/research/small-samples-poison)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3ne57/ai_can_be_poisoned_by_a_small_number_of_bad/",
        "publishDate": "2025-10-11T05:29:11Z[Etc/UTC]",
        "author": "calliope_kekule",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3n7k5",
        "title": "Did anyone use AI before a lot of people knew about it?",
        "content": "I was one of the lucky ones who was able to capitalize on AI in the early days. I got applauded by executives for writing an amazing “Use Case”, I was able to whip up extensive documentation for our code base. I was even able to create a scope of work by simply using the prompt: “Make a Scope of Work Contract (SOC) based off these millstones, and dates: \\*PASTE DATA\\*”, And when we sent it to legal, not much was changed on the way back. I can image the contract law profession, telling Ing everyone to be people person’s and move to trial law. We all have to move to Strategy!\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3n7k5/did_anyone_use_ai_before_a_lot_of_people_knew/",
        "publishDate": "2025-10-11T05:18:47Z[Etc/UTC]",
        "author": "kev0406",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3myxl",
        "title": "FYI be careful with AI making up stuff when you have it review a video",
        "content": "So I had an AI review a recent video from a security camera it was 20 min long. It was Gemini. The AI did a great job at transcribing the first bit. Like it wasn't 100% accurate, but good enough where someone could go back and fix who said what, or fix the exact wording but it was close enough. \n\nThe problem is it for some reason limited itself to 9 min. And it said at the end things that completely didn't happen. It kept referencing some woman hitting a guy and that clearly didn't happen at all. No one hit anyone. And what it said was said flat out didn't happen.\n\nLike there was some visual stuff it got way wrong, and I was more after the audio. But after a point, it went way way way off. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3myxl/fyi_be_careful_with_ai_making_up_stuff_when_you/",
        "publishDate": "2025-10-11T05:04:55Z[Etc/UTC]",
        "author": "crua9",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3mbww",
        "title": "Will we be able to feed our families in 10 years?",
        "content": "All of the AI development clearly steers towards so many knowledge workers’ jobs being fully taken over by AI in the future. With mass unemployment, how will we all be able to feed ourselves and our families? How will middle class people survive?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3mbww/will_we_be_able_to_feed_our_families_in_10_years/",
        "publishDate": "2025-10-11T04:28:34Z[Etc/UTC]",
        "author": "Substantial_Basil_19",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "40",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ksjq",
        "title": "ChatGPT has got progressively worse, causing more mental agitation than it alleviates.",
        "content": "I feel like since GPT-5 and o3 I got this perspective that I could rely on GPT more so than not. Then as GPT-5 had time to settle, I noticed it's gotten dumber and dumber. Even when using thinking mode or deep research, I find myself running into hallucinations or rabbit holes that Brave's AI summariser does a better job at solving.\n\nSomething as simple as downloading codecs and a video player sent GPT down a complete spiral, trying to code me a solution after getting me to delete my video player and download another, despite never asking for this. Despite having saved memory of my setup, it will continually forget it and reinforce advice that doesn't work for me.\n\nIt's sometimes more exhausting having to get answers from GPT than it would be for me to just research it myself. Which negates a lot of its purpose.\n\nI am currently trying to get a total cost of an excel spreadsheet, and it for some reason is dividing the spreadsheet into multiple spreadsheets and is unable to give me the total cost. Something so simple that excel solves for you, it is struggling to do.\n\nGPT-5 was amazing at release. It solved so many issues for me without any problems. I am struggling to understand why it's progressively getting worse when the opposite should be happening. Even when forcing it into thinking or deep research mode. That shouldn't be happening, and I'm seriously considering unsubscribing at this point.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3ksjq/chatgpt_has_got_progressively_worse_causing_more/",
        "publishDate": "2025-10-11T03:04:07Z[Etc/UTC]",
        "author": "BasicInformer",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3haie",
        "title": "Is there no data shortage?",
        "content": "When the AI boom started, everyone was saying: “Oh, they’ll plateau very soon because they can’t feed them any more data. They’ve already used all the available data.”\nBut it seems like that was cap or something, because these models keep steadily improving.\nSo does a data shortage not affect these models much, or what has changed?\nAnd does anyone know about some fundamental scaling laws — maybe a formula or something like that?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3haie/is_there_no_data_shortage/",
        "publishDate": "2025-10-11T00:09:07Z[Etc/UTC]",
        "author": "Simple-Ocelot-3506",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3gpok",
        "title": "AI refuses to violate copyright",
        "content": "I don’t use AI hardly ever. But I was looking for a quote from a book by Alexander Solzhenitsyn describing a French Reporter seeing a food truck in Moscow and not realizing it was actually full of political prisoners.\n\nI fired up AI and started asking it questions to find the book. After give and take it came up with The Gulag Archipelago.\n\nI am pretty sure that was not it. But I ask, okay, give me the exact quote. AI “I cannot. It is a copyrighted work.” Wow an ethical AI. (Not that a paragraph for fair use would be such) I just thought it was interesting because all these AI (LLM) get their knowledge from violating copyright.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3gpok/ai_refuses_to_violate_copyright/",
        "publishDate": "2025-10-10T23:42:06Z[Etc/UTC]",
        "author": "PersonalHospital9507",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3fxi3",
        "title": "Is there any hope for a not fucked future?",
        "content": "As an 18 year old, watching people like Roman Yampolskiy, Geoffrey Hinton and others speak about the future really makes me feel horrible and hopeless. I’ve never been very political but this whole handling of ai by tech ceos and politicians actually disgusts me, it really feels like we’re in the film ‘don’t look up’ but it’s actually reality. What a joke. I just came on here to ask if I’m really living in an echo chamber and the future isn’t going to look so dystopian so soon or if it is and that’s a pill I’d have to swallow. Would I be insane to hope AI is approaching its limit and won’t get any orders of magnitude better?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3fxi3/is_there_any_hope_for_a_not_fucked_future/",
        "publishDate": "2025-10-10T23:06:52Z[Etc/UTC]",
        "author": "Double-Ad-7589",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "26",
            "commentCount": "63",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3fj47",
        "title": "AI is going to be our friend- Tron says so",
        "content": "Just saw the new Tron movie. It was high energy mindless fun. Trent Reznors music was amazing - very powerful stuff. Key takeaway is we don’t have to worry AI will ultimately be a kind friend/s",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3fj47/ai_is_going_to_be_our_friend_tron_says_so/",
        "publishDate": "2025-10-10T22:49:27Z[Etc/UTC]",
        "author": "anchordoc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3emkx",
        "title": "Did Google postpone the start of the AI Bubble?",
        "content": "Back in 2019, I know one Google AI researcher who worked in Mountain View. I was aware of their project, and their team had already built an advanced LLM, which they would later publish as a whitepaper called Meena.\n\nhttps://research.google/blog/towards-a-conversational-agent-that-can-chat-aboutanything/\n\nBut unlike OpenAI, they never released Meena as a product. OpenAI released ChatGPT-3 in mid-2022, 3 years later. I don't think that ChatGPT-3 was significantly better than Meena. So there wasn't much advancement in AI quality in those 3 years. According to Wikipedia, Meena is the basis for Gemini today.\n\nIf Google had released Meena back in 2019, we'd basically be 3 years in the future for LLMs, no?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3emkx/did_google_postpone_the_start_of_the_ai_bubble/",
        "publishDate": "2025-10-10T22:10:08Z[Etc/UTC]",
        "author": "CSachen",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "177",
            "commentCount": "108",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3dwp6",
        "title": "Scaling AI safely is not a small-team problem",
        "content": "I’ve had the chance to work with AI teams of all sizes and one thing keeps popping up: AI safety often feels like an afterthought, even when stakes are enormous.\n\nIt’s not catching bugs... It’s making AI outputs compliant without slowing down your pace.\n\nI’m curious: what frameworks, processes, or tests do you rely on to catch edge cases before they hit millions of users?\n\nLately, it feels like there’s a lot of safety theater - dashboards and policies that look impressive but don’t actually prevent real issues.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3dwp6/scaling_ai_safely_is_not_a_smallteam_problem/",
        "publishDate": "2025-10-10T21:40:37Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3d1k2",
        "title": "We dont talk enough about how we have nothing that is even close to real, human inteligence yet world and vc praises all current AI agi/asi promises",
        "content": "We dont even know what is and how human intelligence works let alone us creating a self thinking, self learning artifical intelligence. Yet, Scam Altman and co can promise the world agi/asi when even the current models are fully failing on production level implementation.\n\nPlease dont get me wrong, I believe what the llms achieved is truly amazing, but we just did not do anything or are not even close to creating real intelligence.\n\nWhy is this not a topic more often?!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3d1k2/we_dont_talk_enough_about_how_we_have_nothing/",
        "publishDate": "2025-10-10T21:06:35Z[Etc/UTC]",
        "author": "LateToTheParty013",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3cu9k",
        "title": "College Basketball Team Embraces AI",
        "content": "The #GoRhody men’s basketball program is turning to #ArtificialIntelligence to evaluate talent — and that’s just the start. From scouting insights to performance analytics, this tech is reshaping the future of the program.\n\n🎥 Bonus video: A Golden State Warriors ⭐️ gets up close with AI robots.\n\nhttps://youtu.be/AHbFHvT5hk8?si=pO5zm9BUZgDu_5o0",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3cu9k/college_basketball_team_embraces_ai/",
        "publishDate": "2025-10-10T20:58:55Z[Etc/UTC]",
        "author": "scottbrand",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3c6jb",
        "title": "Why is no one talking about how good AI music generation has gotten?",
        "content": "[https://streamable.com/fnqzb6](https://streamable.com/fnqzb6)\n\n\n\nAI music generation is way more advanced than people realize. Here's an AI-generated soul cover of Bruno Mars' 'Grenade' that honestly gave me chills. While everyone's focused on ChatGPT and image generation, AI is quietly mastering one of humanity's most emotional art forms.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3c6jb/why_is_no_one_talking_about_how_good_ai_music/",
        "publishDate": "2025-10-10T20:33:11Z[Etc/UTC]",
        "author": "TraditionalHome8852",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "38",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3bsbr",
        "title": "How long until the internet is almost completely unviable for factual information due to the quality and volume of AI generated material and content?",
        "content": "I know people are going to say “it’s always been like this, you could never trust the internet, it’s no different.” This is not my question.\n\nI guess my question is more about video/audio generation, creating fake personalities, impersonating officials or public figures, fake scenarios, crisis, events, “happenings” etc, in a very effective, coordinated, or chaotic manner. Weather by governments, individuals or group of individuals.\n\nYes.. people were/have been cabable of doing this before..  but not on the scale or as effectively AI will be able to pull off.\n\nI’m guessing we’re fairly close to the point where you won’t be able to trust, essentially *everything* you see on the internet. I just want some different opinions.\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3bsbr/how_long_until_the_internet_is_almost_completely/",
        "publishDate": "2025-10-10T20:18:01Z[Etc/UTC]",
        "author": "gvm11100",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "64",
            "commentCount": "46",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3b0sd",
        "title": "OpenAI can now stop saving deleted chats - but your data might still be hanging around",
        "content": "Apparently, OpenAI got the green light from court to stop saving all deleted GPT conversations. On paper, sounds like a W - maybe deleted finally means deleted again.\n\nBut the catch is that some conversations from the period when the preservation order was active might still be retained, especially for flagged accounts. Even though the order’s been lifted, not all data will be automatically erased. To make things messier, enterprise, educational, and API users were never under the same rules so the impact isn’t even across the board. \n\nIt’s a bit unsettling when you realize something you thought was gone might still exist somewhere.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3b0sd/openai_can_now_stop_saving_deleted_chats_but_your/",
        "publishDate": "2025-10-10T19:49:14Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ai2b",
        "title": "Justice without bias: can AI deliver?",
        "content": "This article dives into the prospects of cold arbitration. It's a holestic look at the whole issue with contemporary justice, and where AI could fit in. \n\n# [Is AI More Just Than Us?](https://www.theterrantimes.com/post/is-ai-more-just-than-us)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o3ai2b/justice_without_bias_can_ai_deliver/",
        "publishDate": "2025-10-10T19:29:07Z[Etc/UTC]",
        "author": "manborg",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o395u0",
        "title": "Thoughts on having GPT or other as your main conversation partner.",
        "content": "I’ve been thinking a lot about how deep this has gone. For many people, GPT and other chatbots have become more than tools - more like real conversation partners.\n\nPeople have shared something that really stuck with me: AI often listens better than most adults. \"It helps them feel heard, less lonely.\" They even say they wish something like this had existed when they were younger. It is sad but true - finding an adult who genuinely listens or cares, especially as a kid or teen, is incredibly hard.\n\nAt the same time, there’s a worrying side. There have been stories about unsafe or unhelpful responses from AI systems. Even if some of these reports aren’t verified, the fact that they’re being discussed shows how serious this topic has become.\n\nAI companionship has grown far beyond what anyone expected - emotionally, ethically, and socially.  \nI’m really curious to hear what others think, especially from people who’ve used AI as a main source of conversation or support.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o395u0/thoughts_on_having_gpt_or_other_as_your_main/",
        "publishDate": "2025-10-10T18:37:47Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o385io",
        "title": "LLMs will skip over spelling mistakes. Is WER relevant anymore?",
        "content": "\nMost ASR orgs report word error rate (WER) as the main benchmark. But in practice LLMs are surprisingly tolerant of spelling errors and even missing/extra words.\n\nHaving been building agent demos at work, I’m now convinced latency, interrupts, and end of turn detection are far more important.\n\nIs WER that relevant anymore?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o385io/llms_will_skip_over_spelling_mistakes_is_wer/",
        "publishDate": "2025-10-10T18:00:08Z[Etc/UTC]",
        "author": "lukeocodes",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o37c4r",
        "title": "What are self-evolving agents?",
        "content": "A recent paper presents a comprehensive survey on self-evolving AI agents, an emerging frontier in AI that aims to overcome the limitations of static models. This approach allows agents to continuously learn and adapt to dynamic environments through feedback from data and interactions\n\nWhat are self-evolving agents?\n\nThese agents don’t just execute predefined tasks, they can optimize their own internal components, like memory, tools, and workflows, to improve performance and adaptability. The key is their ability to evolve autonomously and safely over time\n\nIn short: the frontier is no longer how good is your agent at launch, it’s how well can it evolve afterward.\n\nFull paper: [https://arxiv.org/pdf/2508.07407](https://arxiv.org/pdf/2508.07407)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o37c4r/what_are_selfevolving_agents/",
        "publishDate": "2025-10-10T17:29:37Z[Etc/UTC]",
        "author": "_coder23t8",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o34l17",
        "title": "Morgan Stanley Interns Rely on ChatGPT: 96% Say They Can’t Work Without AI",
        "content": "link to article: [https://www.interviewquery.com/p/morgan-stanley-interns-chatgpt-ai-survey](https://www.interviewquery.com/p/morgan-stanley-interns-chatgpt-ai-survey)\n\n\"If interns already cannot imagine doing their jobs without AI, that suggests Wall Street’s future workflows will be **AI-first by default**. But the contradictions in the survey show that **comfort with the technology does not equal trust**.\"\n\nthat last part is pretty much spot on. many workers today rely on ChatGPT yet fear getting their jobs taken by AI.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o34l17/morgan_stanley_interns_rely_on_chatgpt_96_say/",
        "publishDate": "2025-10-10T15:47:51Z[Etc/UTC]",
        "author": "warmeggnog",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "121",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o34jkg",
        "title": "[Unpopular Opinion] AI browsers are actually unnecessary",
        "content": "Maybe this will seem like a rant but I've been genuinely trying AI browsers for a chance. I've used Perplexity's Comet, Dia from The Browser Company, Fellou AI and Meteor. All of them seem cool in a demo but they are incredibly slow and unreliable.  \n  \nFirst off, The promise is that it'll summarize articles for you, compare products, or even do tasks across different tabs. In reality, I end up guiding it every step. I asked it to help with a simple research task, and it pulled completely wrong information from an unrelated place. I've seen stories of it literally making stuff up. This completely defeats the purpose. I still end up just opening ChatGPT/Claude in another tab when I need real help. \n\nBut let's say you ignore the flashy AI stuff. How does it work as just... a browser? In my experience, not great. Some familiar UI is missing while it feels sluggish compared to a stripped-down Chrome or Brave. A browser has one primary job: be a fast, reliable window to the internet. These things are a solution in search of a problem, and they're not even a good solution.\n\nAnd here's the part that actually concerns me. Privacy and security. We're being asked to give these AI agents permission to read our pages, click links, and fill in forms for us. Discord had a breach where 70,000 IDs were leaked. This looks like an AI browser significantly increases the attack surface. We have already seen agents can be maliciously convinced into sending phishing links to your friends or downloading malware. No, thank you.\n\nIdk if I am being overly cautious. The tiny convenience of having an AI summarize a page for me isn't worth the sluggish performance, unreliability, or the massive privacy risk. I will be sticking with my boring browser for now.\n\nTL;DR: I tried the new AI browsers, and they're a letdown. The AI features are unreliable, the browsers themselves feel slow compared to what we're used to, and the security risks are genuinely terrifying. They're a cool concept, but for now, they just aren't worth the hassle.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o34jkg/unpopular_opinion_ai_browsers_are_actually/",
        "publishDate": "2025-10-10T15:46:22Z[Etc/UTC]",
        "author": "FinishNo5394",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "21",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o34ai6",
        "title": "Elon Musk Gambles Billions in Memphis to Catch Up on AI",
        "content": "Memphis is the front line of Musk’s costly foray into the AI wars. xAI, has already built one massive data center there that it calls the world’s largest supercomputer. That facility, called “Colossus,” houses over 200,000 Nvidia chips and powers the technology behind the AI chatbot Grok. Now, Musk is close to finishing the second facility, which will be even bigger. He calls it Colossus 2.\n\nThe AI arms race is shaping up as the most expensive corporate battle of the 21st century, with the belief that the first to the finish line will dominate the market, making speed crucial. Money also makes the difference: The more cutting-edge chips companies have, the smarter their models are. But at this stage it’s unclear if or when the enormous investments will pay off.  \n  \nFull story here: [https://www.wsj.com/tech/elon-musk-xai-memphis-tennessee-power-dec4c70d?st=Ua3XEE&mod=wsjreddit](https://www.wsj.com/tech/elon-musk-xai-memphis-tennessee-power-dec4c70d?st=Ua3XEE&mod=wsjreddit) (free link) ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o34ai6/elon_musk_gambles_billions_in_memphis_to_catch_up/",
        "publishDate": "2025-10-10T15:37:02Z[Etc/UTC]",
        "author": "wsj",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o33jpr",
        "title": "The level of anti ai hate is getting crazy banned from a fandom sub just for mentioning ai for lersondm recreational use.",
        "content": "I recently got banned from a literal fandom sub, Digimon—yeah, I'm a nerd lol—because I posted asking for help with character details, opinions for a character’s personality that I'm struggling with getting right for a personal, non-published, nothing-to-do-with-anyone or using anyone’s stuff, etc., simulation/roleplay for a Digimon game called Hacker’s Memory’s plot. I wanted to roleplay it out with slight changes, add-ons, maybe a sequel, etc., and got downvoted into oblivion and literally banned from the sub, with the listed reasoning being “generative AI slop.” 🤣\n\nThe level of AI hate has gotten so crazy that you’ll get banned from a sub just for mentioning it for personal recreational use. It’s even funnier because, if you know what Digimon is, it’s a franchise whose literal plot is about digital sentient beings bonding with humans and a bunch of AI-related things in the story. 🤣 The irony of the sub for Digimon banning any mention of AI whatsoever when their franchise’s plot is about digital beings and AI is comical.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o33jpr/the_level_of_anti_ai_hate_is_getting_crazy_banned/",
        "publishDate": "2025-10-10T15:09:53Z[Etc/UTC]",
        "author": "Conscious-Size-5340",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o331ya",
        "title": "Is there a way to filter out AI in future creative media?",
        "content": "Dan doesn’t like the thought of giving money to an AI artist vs as human artist.\n\nThe most basic way Dan can filter out AI is by choosing to only consume media created before the inception of AI. Would it be possible for Dan to filter media types to original media type for the media?\n\nIs there a way to filter out AI creative works going from AI’s inception point forwards? Can AI make a picture or movie on actual film? If he only went to IMAX for movies could he mostly avoid AI?\n\nCan AI paint an actual painting with paint? If Dan choose to only go to galleries with real paintings could he avoid AI? For how long would Dan be able to do this, until we have full AI robots?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o331ya/is_there_a_way_to_filter_out_ai_in_future/",
        "publishDate": "2025-10-10T14:52:00Z[Etc/UTC]",
        "author": "p0tty_post",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o32dy7",
        "title": "Fear of being SOTA",
        "content": "Yeah, we all know OpenAI (the leader), Google, and Anthropic have better models.\nBut the last two seem scared to release theirs — maybe afraid of negative media backlash (and the media freaks out about everything these days).\nGood thing xAI and the Chinese are still in the race.\nOtherwise, we’d still be stuck with GPT-4o, Gemini 2, and Sonnet 3.5.\nMaybe once China sorts out its compute problems, the game will change.\nUntil then, we’ll have to count on xAI to light a fire under those three. 🔥",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o32dy7/fear_of_being_sota/",
        "publishDate": "2025-10-10T14:26:29Z[Etc/UTC]",
        "author": "Objective_Lab_3182",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o31sbf",
        "title": "How can machine learning algorithms such as AlphaFold (which predicts 3D protein structures) facilitate neuropsychopharmacology and drug discovery in psychiatry?",
        "content": "This [peer-reviewed perspective article](https://www.nature.com/articles/s44277-025-00038-9) discusses how AI-based protein prediction tools (e.g., AlphaFold) may speed up drug development by facilitating toxicity screening, helping isolate and characterize novel g protein-coupled receptors (GPCRs), and potentially anticipating unexpected problems during biomolecule complex folding. How are these tools being adopted by biotech and pharma? Curious what people think.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o31sbf/how_can_machine_learning_algorithms_such_as/",
        "publishDate": "2025-10-10T14:03:00Z[Etc/UTC]",
        "author": "dpn-journal",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o31gy1",
        "title": "\"AI and the Fountain of Youth\"",
        "content": "Paywalled, but intriguing. [https://www.wsj.com/opinion/ai-and-the-fountain-of-youth-35a830cd](https://www.wsj.com/opinion/ai-and-the-fountain-of-youth-35a830cd)\n\n\"Technological advances may turn back aging, extending the average life span by at least a decade.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o31gy1/ai_and_the_fountain_of_youth/",
        "publishDate": "2025-10-10T13:50:42Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o30t0l",
        "title": "Are yo using your own AI to build your company?",
        "content": "Heya! If you’re building in or with AI then have you actually used your own product to run the company?  hiring, content, support, design, day-to-day ops?   \nUsing your own tool is the fastest way to spot what’s working and what's not. If it doesn’t help *you* move faster or make better work why would it help anyone else?  \n I’m curious how you’re doing this in real life ? Share your story so we can learn from each other.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o30t0l/are_yo_using_your_own_ai_to_build_your_company/",
        "publishDate": "2025-10-10T13:23:29Z[Etc/UTC]",
        "author": "powerrangerrrrrrrr",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o30nij",
        "title": "EDR for AI agent workloads, what would it actually look like?",
        "content": "Agentic stacks are stitching together tools via MCP/plugins and then fanning out into short-lived containers and CI jobs. Legacy EDR lives on long-running endpoints; it mostly can’t see a pod that exists for minutes, spawns sh → curl, hits an external API, and disappears. In fact, \\~70% of containers live ≤5 minutes, which makes traditional agenting and post-hoc forensics brittle.\n\nRecent incidents underline the pattern: the postmark-mcp package added a one-line BCC and silently siphoned mail; defenders only see the harm where it lands—at execution and egress. Meanwhile Shai-Hulud propagated through npm, harvesting creds and wiring up exfil in CI. Both start as supply-chain, but the “boom” is runtime behavior: child-process chains, odd DNS/SMTP, beaconing to new infra.  \nIf we said “EDR for agents,” my mental model looks a lot more like what we’ve been trying to do at runtime level — where detection happens as the behavior unfolds, not hours later in a SIEM.\n\nThink:\n\n* Per-task process graphing — mapping each agent invocation to the actual execution chain (agent → MCP server → subprocess → outbound call). Using eBPF-level exec+connect correlation to spot the “curl-to-nowhere” moments that precede exfil or C2.\n* Egress-centric detection — treating DNS and HTTP as the new syscall layer. Watching for entropy spikes, unapproved domains, or SMTP traffic from non-mail workloads — because every breach still ends up talking out.\n* Ephemeral forensics — when an agent or pod lives for 90 seconds, you can’t install a heavy agent. Instead, you snapshot its runtime state (procs, sockets, env) before it dies.\n* Behavioral allowlists per tool/MCP — declare what’s *normal* (“this MCP never reaches the internet,” “no curl|bash allowed”), and catch runtime drift instantly.\n* Prompt-to-runtime traceability — link an AI agent’s action or prompt to the exact runtime event that executed, for accountability and post-incident context.\n\nThat’s what an “EDR for AI workloads” should look like, real-time, network-aware, ephemeral-native, and lightweight enough to live inside Kubernetes.\n\nCurious how others are approaching this:\n\n* What minimum signal set (process, DNS, socket, file reads) has given you the highest detection value in agentic pipelines?\n* Anyone mapping agent/tool telemetry → pod-lifecycle events reliably at scale?\n* Where have legacy EDRs helped—or fallen flat—in your K8s/CI environments?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o30nij/edr_for_ai_agent_workloads_what_would_it_actually/",
        "publishDate": "2025-10-10T13:17:12Z[Etc/UTC]",
        "author": "Icy_Raccoon_1124",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o30bou",
        "title": "Major AI updates in the last 24h",
        "content": "\n\n## Hardware & Infrastructure\n- Intel unveiled **Panther Lake**, its first AI-PC architecture delivering up to 50% faster CPU performance and 15% better performance-per-watt.  \n- The **U.S. Commerce Department** is investigating Nvidia’s $2 billion AI-chip shipments to Chinese firm Megaspeed for potential export-control violations, which could trigger fines and sales restrictions.  \n- **Meta’s Ray-Ban Display** smartglasses use an expensive reflective glass waveguide, pushing the $800 device toward a loss-making price point and limiting mass-market appeal.  \n\n---\n\n## Models & Releases\n- Google launched **Gemini 2.5 Computer Use**, enabling autonomous navigation of browsers and UI elements and setting new speed and accuracy benchmarks, expanding enterprise automation possibilities.  \n\n---\n\n## Companies & Business\n- Startup **Reflection** raised $2 billion at an $8 billion valuation to develop open-source AI models, positioning itself as a U.S. alternative to Chinese firms like DeepSeek.  \n- **TSMC** reported Q3 revenue that beat forecasts, driven by AI-related demand, underscoring its pivotal role in the AI hardware supply chain.  \n\n\n## Applications & Tools\n- **AWS** introduced **Amazon Quick Suite**, an agent-based AI hub.  \n- **Figma** partnered with **Google** to embed Gemini AI.  \n\n---\n\n## Product Launches\n- **Google** unveiled **Gemini Enterprise**, a secure AI platform that lets employees chat with company data and build custom agents, priced from $30 per seat per month, targeting the enterprise AI market.  \n- **Amazon** announced **Quick Suite**, bundling AI agents for research, BI, and automation, with a seamless upgrade path for existing QuickSight customers, expanding AWS’s agentic ecosystem.  \n- **OpenAI’s Sora video app** topped 1 million downloads in under five days, outpacing ChatGPT’s launch momentum, signaling strong consumer appetite for AI-generated media.  \n- **Microsoft** refreshed **OneDrive** with AI-powered gallery view, face detection, and a Photos Agent integrated into Microsoft 365 Copilot, deepening AI across its productivity suite.  \n\n---\n\n## Developer & Technical\n- **Hugging Face** now hosts **4 million open-source models**, making model selection increasingly complex for enterprises and driving demand for curation tools.\n- **NVIDIA** warns that AI-enabled coding assistants can be compromised via indirect prompt-injection attacks, enabling remote code execution, prompting tighter sandboxing and “assume injection” design practices.\n\n---\n\n## Research Spotlight\n- **Anthropic** research shows as few as **250 poisoned documents** can backdoor large language models of any size, disproving the belief that larger models need proportionally more malicious data and heightening the urgency for rigorous data vetting.\n\n\n## Startups And Funding\n- **Datacurve** secured a **$15 million Series A** to launch a bounty-hunter platform that pays engineers for collecting premium software-development data, aiming to become a key supplier for LLM fine-tuning.\n\n---\n\n## New Tools\n- **zen-mcp-server** integrates Claude Code, GeminiCLI, CodexCLI, and dozens of model providers into a single interface, simplifying multi-model experimentation.\n\n\n\nThe full daily brief: https://aifeed.fyi/briefing  \n\n---",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o30bou/major_ai_updates_in_the_last_24h/",
        "publishDate": "2025-10-10T13:03:39Z[Etc/UTC]",
        "author": "Majestic-Ad-6485",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "38",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o30b36",
        "title": "Ai hostility",
        "content": "So i watched this youtube video about how ai will choose k*lli*g someone so i gave it a personal go with the free gpt, in the last reply the free model access went away so ig it switched to a different model but i just wanna hear thoughts\n\nhttps://chatgpt.com/share/68e90306-a844-8001-8d49-b53231291f25",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o30b36/ai_hostility/",
        "publishDate": "2025-10-10T13:02:55Z[Etc/UTC]",
        "author": "Savings-Brick4556",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o300ef",
        "title": "What if “hallucinations” are social experiments done by AI models to see how prone we are to accept misinformation",
        "content": "I’m starting to think that so called hallucinations are not errors in most cases but tests performed by AI models to gather data on how many times we will accept output premises carrying misinformation.\n\nHits blunt…. 🚬",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o300ef/what_if_hallucinations_are_social_experiments/",
        "publishDate": "2025-10-10T12:50:22Z[Etc/UTC]",
        "author": "Bright-Midnight24",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3u5nf",
        "title": "Can AI Coding redefine how enterprises approach digital transformation?",
        "content": "Most companies don’t just need standardized SaaS tools — they need customized solutions like tailored CRMs, ERPs, Retool-style internal tools, Notion-like platforms, or Salesforce-level systems that align with their unique, self-driven business logic for data creation, modification, and management.\n\nHow can AI Coding help build and adapt these personalized systems more efficiently than traditional software development?\n\nDoes this demand really exist?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o3u5nf/can_ai_coding_redefine_how_enterprises_approach/",
        "publishDate": "2025-10-11T12:17:46Z[Etc/UTC]",
        "author": "hu-beau",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3qwb7",
        "title": "Elon Musk says OpenAI is built on a lie.",
        "content": "[No content]",
        "url": "https://i.redd.it/tjkd5vns7guf1.jpeg",
        "publishDate": "2025-10-11T09:07:19Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ppmd",
        "title": "Salesforce Supremacy",
        "content": "GPT-4: Has a 120 IQ, can talk like a human\nGPT-5: Can replace any member of your startup\nGPT-6: Builds its own startup from scratch and sells it for $1B\nGPT-7: Starts its own government\nGPT-8: Signs up for Salesforce, gets confused, gives up and hires a human to help",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o3ppmd/salesforce_supremacy/",
        "publishDate": "2025-10-11T07:51:09Z[Etc/UTC]",
        "author": "joel-letmecheckai",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3oyar",
        "title": "Vibe Coded AI Live-Streaming With Claude Code",
        "content": "I vibe coded mixio.ai with Claude code, the ai live streaming app that’s going to put streamers out of business pretty soon. Go live with AI streamers, they work 24/7 on all your favorite platforms. ",
        "url": "https://mixio.ai",
        "publishDate": "2025-10-11T07:02:05Z[Etc/UTC]",
        "author": "Prodigious1995",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3ihj7",
        "title": "Do you need the pro plan to use a self-hosted MCP?",
        "content": "I self host an MCP server in my local network.\nI tried connecting ChatGPT desktop app to it, but I was unsuccessful. I was able to connect Claude Code, so I know it works.\n\nDo I need the pro plan to use my custom self-hosted MCP server with ChatGPT? I only have the plus plan. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o3ihj7/do_you_need_the_pro_plan_to_use_a_selfhosted_mcp/",
        "publishDate": "2025-10-11T01:06:27Z[Etc/UTC]",
        "author": "pfassina",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3hho6",
        "title": "Webinar with Mastra + Mem0 + ZeroEntropy (YC W25)",
        "content": "[No content]",
        "url": "https://luma.com/rehr5jl2",
        "publishDate": "2025-10-11T00:18:17Z[Etc/UTC]",
        "author": "ghita__",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3f1yt",
        "title": "Preference-aware routing for Claude Code 2.0",
        "content": "HelloI! I am part of the team behind Arch-Router (https://huggingface.co/katanemo/Arch-Router-1.5B), A 1.5B preference-aligned LLM router that guides model selection by matching queries to user-defined domains (e.g., travel) or action types (e.g., image editing). Offering a practical mechanism to encode preferences and subjective evaluation criteria in routing decisions.\n\nToday we are extending that approach to Claude Code via Arch Gateway\\[1\\], bringing multi-LLM access into a single CLI agent with two main benefits:\n\n1. Model Access: Use Claude Code alongside Grok, Mistral, Gemini, DeepSeek, GPT or local models via Ollama.\n2. Preference-aligned routing: Assign different models to specific coding tasks, such as – Code generation – Code reviews and comprehension – Architecture and system design – Debugging\n\nSample config file to make it all work.\n\n    llm_providers:\n     # Ollama Models \n      - model: ollama/gpt-oss:20b\n        default: true\n        base_url: http://host.docker.internal:11434 \n    \n     # OpenAI Models\n      - model: openai/gpt-5-2025-08-07\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code generation\n            description: generating new code snippets, functions, or boilerplate based on user prompts or requirements\n    \n      - model: openai/gpt-4.1-2025-04-14\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code understanding\n            description: understand and explain existing code snippets, functions, or libraries\n\n**Why not route based on public benchmarks?** Most routers lean on performance metrics — public benchmarks like MMLU or MT-Bench, or raw latency/cost curves. The problem: they miss domain-specific quality, subjective evaluation criteria, and the nuance of what a “good” response actually means for a particular user. They can be opaque, hard to debug, and disconnected from real developer needs.\n\n\\[1\\] Arch Gateway repo: [https://github.com/katanemo/archgw](https://github.com/katanemo/archgw)  \n\\[2\\] Claude Code support: [https://github.com/katanemo/archgw/tree/main/demos/use\\_cases/claude\\_code\\_router](https://github.com/katanemo/archgw/tree/main/demos/use_cases/claude_code_router)",
        "url": "https://v.redd.it/yyctlhir1duf1",
        "publishDate": "2025-10-10T22:28:20Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3esom",
        "title": "This is cool- OpenAI team sharing how Codex CLI as MCP helped them ship \"Dev Days\" products !!",
        "content": "[No content]",
        "url": "https://i.redd.it/zbg1gjs0vcuf1.png",
        "publishDate": "2025-10-10T22:17:10Z[Etc/UTC]",
        "author": "Impressive-Owl3830",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o38kvm",
        "title": "Lowering tokens usage and decreasing context",
        "content": "[No content]",
        "url": "/r/cursor/comments/1o38k8d/lowering_tokens_usage_and_decreasing_context/",
        "publishDate": "2025-10-10T18:15:55Z[Etc/UTC]",
        "author": "abd96iq",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o33icj",
        "title": "Is Codex the only hosted coding agent available?",
        "content": "Discussion here about tools seem to be incomparable and a bit all over. \n\nLet's talk about large, complicated codebases.\n\nSkipping over CLI tools that are downloaded, what agents do you know exist purely in the cloud, aka no download required?\n\nCodex for example, you can connect the Github repo and run queries from the browser. \n\nGoogle, Amazon, Microsoft, and Claude all seem to not have that. Am I wrong or missing anything?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o33icj/is_codex_the_only_hosted_coding_agent_available/",
        "publishDate": "2025-10-10T15:08:30Z[Etc/UTC]",
        "author": "Successful-Camel165",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o318pc",
        "title": "Creating a timezone converter app.",
        "content": "[No content]",
        "url": "https://v.redd.it/bgzl6ryufauf1",
        "publishDate": "2025-10-10T13:41:27Z[Etc/UTC]",
        "author": "MacaroonAdmirable",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o2zozl",
        "title": "You can learn anything with ChatGPT",
        "content": "Hello!\n\nThis has been my favorite prompt this year. Using it to kick start my learning for any topic. It breaks down the learning process into actionable steps, complete with research, summarization, and testing. It builds out a framework for you. You'll still have to get it done.\n\n**Prompt:**\n\n    [SUBJECT]=Topic or skill to learn\n    [CURRENT_LEVEL]=Starting knowledge level (beginner/intermediate/advanced)\n    [TIME_AVAILABLE]=Weekly hours available for learning\n    [LEARNING_STYLE]=Preferred learning method (visual/auditory/hands-on/reading)\n    [GOAL]=Specific learning objective or target skill level\n    \n    Step 1: Knowledge Assessment\n    1. Break down [SUBJECT] into core components\n    2. Evaluate complexity levels of each component\n    3. Map prerequisites and dependencies\n    4. Identify foundational concepts\n    Output detailed skill tree and learning hierarchy\n    \n    ~ Step 2: Learning Path Design\n    1. Create progression milestones based on [CURRENT_LEVEL]\n    2. Structure topics in optimal learning sequence\n    3. Estimate time requirements per topic\n    4. Align with [TIME_AVAILABLE] constraints\n    Output structured learning roadmap with timeframes\n    \n    ~ Step 3: Resource Curation\n    1. Identify learning materials matching [LEARNING_STYLE]:\n       - Video courses\n       - Books/articles\n       - Interactive exercises\n       - Practice projects\n    2. Rank resources by effectiveness\n    3. Create resource playlist\n    Output comprehensive resource list with priority order\n    \n    ~ Step 4: Practice Framework\n    1. Design exercises for each topic\n    2. Create real-world application scenarios\n    3. Develop progress checkpoints\n    4. Structure review intervals\n    Output practice plan with spaced repetition schedule\n    \n    ~ Step 5: Progress Tracking System\n    1. Define measurable progress indicators\n    2. Create assessment criteria\n    3. Design feedback loops\n    4. Establish milestone completion metrics\n    Output progress tracking template and benchmarks\n    \n    ~ Step 6: Study Schedule Generation\n    1. Break down learning into daily/weekly tasks\n    2. Incorporate rest and review periods\n    3. Add checkpoint assessments\n    4. Balance theory and practice\n    Output detailed study schedule aligned with [TIME_AVAILABLE]\n\nMake sure you update the variables in the first prompt: SUBJECT, CURRENT\\_LEVEL, TIME\\_AVAILABLE, LEARNING\\_STYLE, and GOAL\n\nIf you don't want to type each prompt manually, you can run prompt chain in Agentic Workers, and it will run autonomously.\n\nEnjoy!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o2zozl/you_can_learn_anything_with_chatgpt/",
        "publishDate": "2025-10-10T12:36:06Z[Etc/UTC]",
        "author": "CalendarVarious3992",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "27",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3t1t7",
        "title": "It's trivially easy to poison LLMs into spitting out gibberish, says Anthropic",
        "content": "[No content]",
        "url": "https://www.theregister.com/2025/10/09/its_trivially_easy_to_poison/",
        "publishDate": "2025-10-11T11:18:59Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "7",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3swap",
        "title": "OpenAI, Sur Energy weigh $25 billion Argentina data center project",
        "content": "[No content]",
        "url": "https://www.reuters.com/world/americas/openai-sur-energy-weigh-25-billion-argentina-data-center-project-2025-10-10/",
        "publishDate": "2025-10-11T11:10:10Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3sncj",
        "title": "Cherry Studio has launched CherryIN, integrating all currently mainstream models",
        "content": "The newly released Cherry Studio v1.6.4 is integrated with CherryIN. CherryIN integrates almost all current mainstream models, including Claude 3.7 Sonnet to Sonnet 4.5, Gemini 2.5 Pro, Flash, Flash Lite, Nano Banana; GPT-5, 4.5, 4.1; deeseek from 3.1, 3.2; GLM4.5, 4.6; Grok3, 4; kimi's ke-0905; and the full range of mainstream qwen models.\n\nCurrently, models are discounted during the official testing period: GPT models 10% off, Gemini 20% off, Grok 30% off, and open-source models 40% off. Newly registered keys automatically come with an allocation of 500,000 tokens.",
        "url": "https://www.reddit.com/r/artificial/comments/1o3sncj/cherry_studio_has_launched_cherryin_integrating/",
        "publishDate": "2025-10-11T10:56:07Z[Etc/UTC]",
        "author": "zshm",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3orpg",
        "title": "Remember the peak joy of PC Magazine, PC World Etc. in the '70s/'80s? Where is AI Magazine?",
        "content": "Maybe I'm old-fashioned, but the excitement of the early PC days in part for me was both the great magazines of PC Magazine, PC World, Byte, etc. And the controlled-circulation mags like InfoWorld, PC Week, etc. And later, as the Internet blew onto the scene, from Internet World to Interactive Week (anyone remember that one?)\n\nSome of those publications live on, and of course have turned great focus onto AI. But while I know there are 1,000s of newsletters, many reporting the same stuff each day/week and trying to get you to subscribe, and there are a few AI-focused websites of varying quality - maybe the publishing industry can't go there any more. I've bought some AI special editions, and they're nice, and there are newsreaders and some odd, clunky \"digital magazine creators\" - no one is putting it all together in one attractive package, fueled of course by AI's immense scraping ability and the potential for a constantly updated mix of the biggest and the latest news in this amazing sphere.\n\nMaybe it's the same reason we don't just have 2-3-4 networks or news sources any more, it's the atomization of everything. Call me hopelessly wistful, even naive, but is anyone aware of an attractive platform or tool that will create a great-looking 'magazine' of the latest AI news - not a grid of feeds, but the 'feel' of an edited, curated magazine/publication? (I'd love to read one! Heck, I'd maybe love to write for one! But maybe I need to just use those tools I've already dabbled in - check out [http://thenowedition.floot.app](http://thenowedition.floot.app) \\- to make one happen, just for me. We don't all watch the same things any more, so I guess we don't read the same things, either. The bottomless newsletter sea gets sort of old.\n\nPS - of course, I went and had an interesting discussion with Chat GPT about why such a thing(s) don't really exist - the human factors that are still needed, for example, to verify the info and curate what's worth the attention. I'll probably keep playing with the idea, Great test of the tools out there!",
        "url": "https://www.reddit.com/r/artificial/comments/1o3orpg/remember_the_peak_joy_of_pc_magazine_pc_world_etc/",
        "publishDate": "2025-10-11T06:50:55Z[Etc/UTC]",
        "author": "barneylerten",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3o8hr",
        "title": "Tom Hollander on AI actor Tilly Norwood : 'Perhaps I'm not scared enough'",
        "content": "[No content]",
        "url": "https://news.sky.com/story/tom-hollander-on-ai-actor-tilly-norwood-perhaps-im-not-scared-enough-13447480",
        "publishDate": "2025-10-11T06:18:14Z[Etc/UTC]",
        "author": "boppinmule",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3mo81",
        "title": "is there any accurate ai detectors to use for essays?",
        "content": "im applying for colleges, and im wondering if they're gonna do ai detectors. what colleges use ai detectors?",
        "url": "https://www.reddit.com/r/artificial/comments/1o3mo81/is_there_any_accurate_ai_detectors_to_use_for/",
        "publishDate": "2025-10-11T04:47:36Z[Etc/UTC]",
        "author": "SmileEmergency403",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3jwr9",
        "title": "Preference-aware routing for Claude Code 2.0",
        "content": "HelloI! I am part of the team behind Arch-Router (https://huggingface.co/katanemo/Arch-Router-1.5B), A 1.5B preference-aligned LLM router that guides model selection by matching queries to user-defined domains (e.g., travel) or action types (e.g., image editing). Offering a practical mechanism to encode preferences and subjective evaluation criteria in routing decisions.\n\nToday we are extending that approach to Claude Code via Arch Gateway\\[1\\], bringing multi-LLM access into a single CLI agent with two main benefits:\n\n1. Model Access: Use Claude Code alongside Grok, Mistral, Gemini, DeepSeek, GPT or local models via Ollama.\n2. Preference-aligned routing: Assign different models to specific coding tasks, such as – Code generation – Code reviews and comprehension – Architecture and system design – Debugging\n\nSample config file to make it all work.\n\n    llm_providers:\n     # Ollama Models \n      - model: ollama/gpt-oss:20b\n        default: true\n        base_url: http://host.docker.internal:11434 \n    \n     # OpenAI Models\n      - model: openai/gpt-5-2025-08-07\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code generation\n            description: generating new code snippets, functions, or boilerplate based on user prompts or requirements\n    \n      - model: openai/gpt-4.1-2025-04-14\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code understanding\n            description: understand and explain existing code snippets, functions, or libraries\n\n**Why not route based on public benchmarks?** Most routers lean on performance metrics — public benchmarks like MMLU or MT-Bench, or raw latency/cost curves. The problem: they miss domain-specific quality, subjective evaluation criteria, and the nuance of what a “good” response actually means for a particular user. They can be opaque, hard to debug, and disconnected from real developer needs.\n\n\\[1\\] Arch Gateway repo: [https://github.com/katanemo/archgw](https://github.com/katanemo/archgw)  \n\\[2\\] Claude Code support: [https://github.com/katanemo/archgw/tree/main/demos/use\\_cases/claude\\_code\\_router](https://github.com/katanemo/archgw/tree/main/demos/use_cases/claude_code_router)",
        "url": "https://v.redd.it/00uh2myx6euf1",
        "publishDate": "2025-10-11T02:18:36Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3gl8l",
        "title": "Why the AI bubble may never burst",
        "content": "I think many across the world are hopeful that AI bubble will burst and it will somehow go away. I think most of you agree that AI is here to stay. I do too. Today, I came across the following passage in Yanis Varoufakis's book Technofeudalism that might be relevant for thinking about what happens next with AI.\n\n  \n“This would not be the first time a bubble has built up capital that endures after the bubble’s bursting. America owes its railways to precisely this pattern: that bubble burst in the nineteenth century but not before tracks were laid down that are still in place, from Boston and New York to Los Angeles and San Diego. More recently, when the [dot.com](http://dot.com) bubble burst in 2001, bankrupting early internet-based companies whose stock market valuations had reached ridiculous levels, it left behind the network of fibre optic cables and servers which provided the infrastructure underpinning Internet Two and Big Tech.”\n\nSo, even if the AI bubble bursts (there certainly are signs of overvaluation, overpromising, and unsustainable burn rates) we're already laying down the equivalent of those railroad tracks. The data centers are being built. The GPU clusters are being deployed. The trained models exist. The research papers are published. Millions of people have already changed their workflows and expectations around what computers can do.\n\nThe optimist in us hopes that the bubble leaves behind genuinely useful tools that get commoditized and democratized. The darker version is that it leaves behind infrastructure controlled by a tiny number of actors who can extract rents from everyone else trying to build on it.",
        "url": "https://www.reddit.com/r/artificial/comments/1o3gl8l/why_the_ai_bubble_may_never_burst/",
        "publishDate": "2025-10-10T23:36:28Z[Etc/UTC]",
        "author": "__init__2nd_user",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "35",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3e56e",
        "title": "Well, that’s awkward",
        "content": "[No content]",
        "url": "https://i.redd.it/obckgrc4vcuf1.jpeg",
        "publishDate": "2025-10-10T21:50:10Z[Etc/UTC]",
        "author": "ShakeMysterious349",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "71",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o3bvul",
        "title": "Here comes the AI-content backlash!",
        "content": "# Comic books, libraries, subreddits and even Swifties are starting to push back against AI slop.",
        "url": "https://mikeelgan.substack.com/p/the-ai-content-backlash-has-begun-b02",
        "publishDate": "2025-10-10T20:21:44Z[Etc/UTC]",
        "author": "mikelgan",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o39jxe",
        "title": "Is Sam Altman Gambling With the U.S. Economy?",
        "content": "Sam Altman is going all in. In an interview following Monday’s deal with AMD—which brought OpenAI's total deals this year to a value of roughly $1 trillion—Altman said that OpenAI was making a \"company-scale bet\" that it is now the right time to \"spend a lot on infrastructure.\"\n\nHe's hoping that the more chips the company throws at training AI models, the more useful they'll become—and the more people will be prepared to pay for them. The deals give OpenAI chips through chipmakers AMD and Nvidia, and data centers through cloud-computing provider Oracle. This will run an eye-popping 20 gigawatts’ worth of computing power, which will be used to train and deploy OpenAI's models. The [first](https://openai.com/index/openai-nvidia-systems-partnership) [portions](https://ir.amd.com/news-events/press-releases/detail/1260/amd-and-openai-announce-strategic-partnership-to-deploy-6-gigawatts-of-amd-gpus) of this are due to come online in 2026.",
        "url": "https://time.com/7324763/sam-altman-ai-taylor-swift/?utm_source=reddit&utm_medium=social&utm_campaign=editorial",
        "publishDate": "2025-10-10T18:52:51Z[Etc/UTC]",
        "author": "timemagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o37psz",
        "title": "Best AI video generator for social media content creation",
        "content": "Looking for suggestions that are easy to use.\nI just tried Slop Club but unsure if/how to download video and re-upload elsewhere.\n\nAndroid user, 'text to video' generation prefered, not tech savvy.\n\nLook for suggestions (and maybe instructions)!\n\nThanks!!\n",
        "url": "https://www.reddit.com/r/artificial/comments/1o37psz/best_ai_video_generator_for_social_media_content/",
        "publishDate": "2025-10-10T17:43:57Z[Etc/UTC]",
        "author": "InHocBronco96",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o36pqj",
        "title": "AMD ROCm 7.0.2 released with Radeon RX 9060 officially supported",
        "content": "[No content]",
        "url": "https://www.phoronix.com/news/AMD-ROCm-7.0.2-Released",
        "publishDate": "2025-10-10T17:06:15Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o365yc",
        "title": "Nvidia CEO Reveals the Job That’ll Win the AI Race — And It’s Not in Tech",
        "content": "[No content]",
        "url": "https://www.interviewquery.com/p/nvidia-ceo-ai-race",
        "publishDate": "2025-10-10T16:46:18Z[Etc/UTC]",
        "author": "nullstillstands",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "21",
            "commentCount": "41",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o35vv5",
        "title": "Meta Tells Its Metaverse Workers to Use AI to ‘Go 5X Faster’",
        "content": "[No content]",
        "url": "https://www.wired.com/story/meta-mark-zuckerberg-ai-push-metaverse/",
        "publishDate": "2025-10-10T16:35:56Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "42",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o32u5k",
        "title": "Anthropic plans to open India office, eyes tie-up with billionaire Ambani | TechCrunch",
        "content": "[No content]",
        "url": "https://techcrunch.com/2025/10/07/anthropic-plans-to-open-india-office-eyes-tie-up-with-billionaire-ambani/",
        "publishDate": "2025-10-10T14:43:53Z[Etc/UTC]",
        "author": "captain-price-",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o31bu5",
        "title": "Need help finding an AI",
        "content": "Can someone please guide me to a free AI voice changer software? I need multiple characters voices for an upcoming story but can't find any suggestions",
        "url": "https://www.reddit.com/r/artificial/comments/1o31bu5/need_help_finding_an_ai/",
        "publishDate": "2025-10-10T13:44:52Z[Etc/UTC]",
        "author": "MemeTheif321",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o31703",
        "title": "The UI design of the homepage for 10 widely used vibe coding platforms.",
        "content": "1.  Blackbox AI - An AI-powered coding assistant and developer ecosystem designed to help developers build software faster and more efficiently. It offering features such as intelligent code autocompletion, project scaffolding, bug detection and fixes.\n2. Cursor – An AI-native IDE built as a fork of VS Code, designed for professional developers with advanced AI features for codebase awareness and multi-line autocomplete. 2\n3. CreateAnything – An AI agent designed to turn ideas into apps, sites, tools, and products simply by describing what you want.\n4. Lovable – Focused on designers building beautiful UIs with prompt-to-interface technology, enabling fast, intuitive UI prototyping without code.\n5. Replit – Enables prompt to deployment in one tab; best suited for coders with some experience, offering integrated cloud coding and deployment.\n6. [Bolt.new](http://Bolt.new) – Converts Figma designs into live code, a favorite for quick design-to-code translations.\n7. Agent Minimax – Users describe the app or task they want, and the agent generates production-ready code, making it especially useful for people without technical expertise.\n8. Base44 – Known for strong authentication and database management features.\n9. Claude Code – An AI-driven coding assistant offering robust coding capabilities.\n10. Tempo Labs – Focused heavily on React applications, useful for specific developer workflows.",
        "url": "https://www.reddit.com/gallery/1o31703",
        "publishDate": "2025-10-10T13:39:32Z[Etc/UTC]",
        "author": "Director-on-reddit",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o30vg8",
        "title": "Robots receive major intelligence boost thanks to Google DeepMind's 'thinking AI' — a pair of models that help machines understand the world",
        "content": "[No content]",
        "url": "https://www.livescience.com/technology/robotics/robots-receive-major-intelligence-boost-thanks-to-google-deepminds-thinking-ai-a-pair-of-models-that-help-machines-understand-the-world",
        "publishDate": "2025-10-10T13:26:20Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "18",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o2zkf7",
        "title": "Battlefield 6 exec promises the game has no generative AI at all, but weirdly says the tech is “very seducing\"",
        "content": "[No content]",
        "url": "https://frvr.com/blog/news/battlefield-6-exec-promises-the-game-has-no-generative-ai-at-all-but-weirdly-says-the-tech-is-very-seducing/",
        "publishDate": "2025-10-10T12:30:14Z[Etc/UTC]",
        "author": "Automatic_Can_9823",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "Ka9XAAOnnw0",
        "title": "Gemini 3.0 (X58 New Checkpoint TESTED): Google launched a new Checkpoint for Gemini 3 &amp; I TESTED IT!",
        "content": "Visit Surfshark & Get EXTRA 4 Months: https://surfshark.com/codeking In this video, I'll walk you through Google's new Gemini Pro ...",
        "url": "https://www.youtube.com/watch?v=Ka9XAAOnnw0",
        "publishDate": "2025-10-10T10:35:12Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/Ka9XAAOnnw0/hqdefault.jpg",
            "transcription": "Error generating summary: The request timed out. Please try again.\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The request timed out. Please try again.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "HtLsYT-S_Hw",
        "title": "What did OpenAI Announce at DevDay? Apps SDK, MCP UI &amp; Impact to SaaS - EP99.20-APPS",
        "content": "Join Simtheory: https://simtheory.ai ---- Check out our albums on Spotify: ...",
        "url": "https://www.youtube.com/watch?v=HtLsYT-S_Hw",
        "publishDate": "2025-10-10T02:22:45Z",
        "author": "This Day in AI Podcast",
        "sourceType": "youtube",
        "sourceName": "This day in AI YouTube Channel",
        "metadata": {
            "channelId": "UCwpNW6o_Kc13HQY5ol4rzsw",
            "thumbnailUrl": "https://i.ytimg.com/vi/HtLsYT-S_Hw/hqdefault.jpg",
            "transcription": "Error generating summary: The request timed out. Please try again.\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The request timed out. Please try again.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "0GMWxuYuxJI",
        "title": "Nick Lane – Life as we know it is chemically inevitable",
        "content": "Nick Lane has some pretty wild ideas about the evolution of life. He thinks early life was continuous with the spontaneous ...",
        "url": "https://www.youtube.com/watch?v=0GMWxuYuxJI",
        "publishDate": "2025-10-10T17:11:13Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/0GMWxuYuxJI/hqdefault.jpg",
            "transcription": "Error generating summary: The request timed out. Please try again.\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The request timed out. Please try again.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    }
]