[
    {
        "id": "https://news.smol.ai/issues/25-09-01-not-much/",
        "title": "not much happened today",
        "content": "**OpenAI** integrates **GPT-5** into Xcode 26 with improved coding latency, though some UX trade-offs are noted. **xAI's Grok Code Fast 1** gains momentum, surpassing **Claude Sonnet** in usage and praised for fast debugging. **Zhipu's GLM-4.5** offers a cost-effective coding plan with strong performance against Claude Sonnet 4. **Meituan** releases the **LongCat-Flash-Chat**, a 560B parameter MoE model with adaptive compute and detailed technical insights. Apple debuts on-device vision-language models **FastVLM** and **MobileCLIP2** alongside **InternVL3.5**.",
        "url": "https://news.smol.ai/issues/25-09-01-not-much/",
        "publishDate": "2025-09-01T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "openai, x-ai, zhipu-ai, meituan, apple, gpt-5, grok-code-fast-1, claude-sonnet, glm-4.5, longcat-flash-chat, fastvlm, mobileclip2, internvl3.5, gdb, martin_casado, yanndubs, elonmusk, cline, vikhyatk, dzhng, quixiai, tim_dettmers, casper_hansen_, reach_vb, eliebakouch, teortaxestex, youjiacheng, model-architecture, moe, adaptive-compute, inference-speed, model-training, cost-efficiency, coding, developer-tools, open-inference, on-device-ai, vision"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217583",
        "title": "Pusan Uni Develops Flexible Material for Next-Gen Robotics",
        "content": "<p>The breakthrough composite&#160;material&#160;combines flexibility and strength for advanced robotic applications The field of robotics has transformed drastically in this century, with a special focus on soft robotics. In this context, origami-inspired deployable structures with compact storage and efficient deployment features have gained prominence in aerospace, architecture, and medical fields. Thus...</p>\n<p>The post <a href=\"https://ai-techpark.com/pusan-uni-develops-flexible-material-for-next-gen-robotics/\">Pusan Uni Develops Flexible Material for Next-Gen Robotics</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/pusan-uni-develops-flexible-material-for-next-gen-robotics/",
        "publishDate": "2025-09-01T16:00:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, cyber security, cyber security information, cyber threats, Pusan Uni"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217582",
        "title": "Xpanner Launches X1: Scalable AI Automation for Construction",
        "content": "<p>Xpanner, a leader in construction automation solutions, today unveiled its flagship&#160;X1 Kit, the first scalable Physical AI-based retrofit solution designed to revolutionize construction site automation. The kit tackles prominent challenges such as labor shortages, safety hazards, and operational inefficiencies by deploying a flexible, equipment-agnostic system that can be easily integrated...</p>\n<p>The post <a href=\"https://ai-techpark.com/xpanner-launches-x1-scalable-ai-automation-for-construction/\">Xpanner Launches X1: Scalable AI Automation for Construction</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/xpanner-launches-x1-scalable-ai-automation-for-construction/",
        "publishDate": "2025-09-01T15:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai machine learning, ai tech news, ai technology, ai techpark news, cyber security, cyber security information, cyber threats, Xpanner"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217574",
        "title": "Quick Custom Intelligence Renews Title Sponsorship for 2026",
        "content": "<p>Quick Custom Intelligence (QCI), the industry leader in AI-powered analytics and operational intelligence, announced today that it will extend its role as the Title Sponsor of three Raving Conferences for 2026. This decision comes after the resounding success of the 2025 events, Raving NEXT: Indian Gaming Leadership Summit, the Casino Marketing &#38; Technology Conference,...</p>\n<p>The post <a href=\"https://ai-techpark.com/quick-custom-intelligence-renews-title-sponsorship-for-2026/\">Quick Custom Intelligence Renews Title Sponsorship for 2026</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/quick-custom-intelligence-renews-title-sponsorship-for-2026/",
        "publishDate": "2025-09-01T15:15:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai machine learning, ai tech news, ai technology, ai techpark news, cyber security, cyber security companies, cyber security information, cyber threats, Quick Custom"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217573",
        "title": "CollabRx Drives Digital Healthcare Growth with AI & Blockchain",
        "content": "<p>CollabRx, Inc., a U.S.-based healthcare technology pioneer, is taking the lead in the global digital healthcare transformation. The industry is projected to grow from USD 1.3 billion in 2023 to USD 3.7 billion by 2028, at a compound annual growth rate (CAGR) of 23.2%, according to MarketsandMarkets. At the center...</p>\n<p>The post <a href=\"https://ai-techpark.com/collabrx-drives-digital-healthcare-growth-with-ai-blockchain/\">CollabRx Drives Digital Healthcare Growth with AI & Blockchain</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/collabrx-drives-digital-healthcare-growth-with-ai-blockchain/",
        "publishDate": "2025-09-01T15:00:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai and machine learning, ai machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, CollabRx, cyber security, cyber security companies"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217572",
        "title": "Trade Vector AI Revolutionizes Automated Digital Trading",
        "content": "<p>Trade Vector AI-powered platform introduces cutting-edge automation, enhanced security protocols, and real-time market performance tools designed to reshape the future of digital trading Introduction – What is Trade Vector AI Trade Vector AI is a next-generation artificial intelligence platform designed to bring automation, speed, and accuracy to digital asset trading. Built...</p>\n<p>The post <a href=\"https://ai-techpark.com/trade-vector-ai-revolutionizes-automated-digital-trading/\">Trade Vector AI Revolutionizes Automated Digital Trading</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/trade-vector-ai-revolutionizes-automated-digital-trading/",
        "publishDate": "2025-09-01T14:45:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai and machine learning, ai machine learning, ai tech news, ai technology, ai techpark news, cyber security, cyber security companies, cyber threats, Trade Vector"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217565",
        "title": "Elon Musk’s New AI System Signals a Tech Revolution",
        "content": "<p>In a newly released presentation, James Altucher reveals details of Musk’s advanced AI system and why experts say it signals the arrival of a new technological era. President Trump has already acted to reset America’s approach to artificial intelligence. James Altucher explains: “As soon as he revoked Biden’s AI order…...</p>\n<p>The post <a href=\"https://ai-techpark.com/elon-musks-new-ai-system-signals-a-tech-revolution/\">Elon Musk’s New AI System Signals a Tech Revolution</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/elon-musks-new-ai-system-signals-a-tech-revolution/",
        "publishDate": "2025-09-01T14:30:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, AI investment, ai machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, cyber security, cyber security companies, cyber threats, Elon Musk"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217564",
        "title": "GPTBots, GP Batteries Launch AI Customer Service Network",
        "content": "<p>Aurora Mobile Limited (NASDAQ: JG) (“Aurora Mobile” or the “Company”), a leading provider of customer engagement and marketing technology services in China, today announced that its AI agent platform, GPTBots.ai, has entered into a strategic partnership with GP Batteries, a global leader in battery manufacturing. This collaboration sets a new...</p>\n<p>The post <a href=\"https://ai-techpark.com/gptbots-gp-batteries-launch-ai-customer-service-network/\">GPTBots, GP Batteries Launch AI Customer Service Network</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/gptbots-gp-batteries-launch-ai-customer-service-network/",
        "publishDate": "2025-09-01T14:15:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Virtual Assistants, ai machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, Aurora Mobile Limited, cyber security, cyber security companies, cyber security information, cyber threats"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=217532",
        "title": "Banuba Enhances AI for Video Editing & Virtual Try-On",
        "content": "<p>Banuba, a pioneer in augmented reality and computer vision, today announced a significant expansion of its proprietary artificial intelligence across its product suite. These advancements leverage the company’s nine years of deep AI research to deliver more intuitive and powerful tools for content creators and beauty shoppers. The&#160;AI Clipping&#160;tool, which...</p>\n<p>The post <a href=\"https://ai-techpark.com/banuba-enhances-ai-for-video-editing-virtual-try-on/\">Banuba Enhances AI for Video Editing & Virtual Try-On</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/banuba-enhances-ai-for-video-editing-virtual-try-on/",
        "publishDate": "2025-09-01T09:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Virtual Assistants, ai and machine learning, ai tech news, ai technology, ai techpark news, Banuba, cyber security, cyber security companies, cyber security information, cyber threats"
        }
    },
    {
        "id": "1n6ey0s",
        "title": "Apertus: a fully open, transparent, multilingual language model",
        "content": "Switzerland's academies (EPFL, ETHZ, CSCS) are launching an open-source LLM : [https://actu.epfl.ch/news/apertus-a-fully-open-transparent-multilingual-lang/](https://actu.epfl.ch/news/apertus-a-fully-open-transparent-multilingual-lang/)\n\n8 or 70 billion parameters, no image generation yet, it is an early release I would say.\n\n\\---\n\nI am not affiliated with these universities, nor this effort. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n6ey0s/apertus_a_fully_open_transparent_multilingual/",
        "publishDate": "2025-09-02T09:31:54Z[Etc/UTC]",
        "author": "Stock-Variation-2237",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6eivv",
        "title": "My theory on which LLM will be the first to be adopted by \"mainstream\" audience",
        "content": "People generally assume that the smartest (most \"intelligent\") LLM is going to attract the most users and will eventually become to go-to tool for mainstream users.\n\n*(Mainstream; non-AI natives, non-marketers etc).*\n\nBut I disagree. Everyone I encounter within the AI space seems to be obsessed with intelligence scores right now. Which model ranks highest across a spectrum of complex reasoning tasks. Which one solves PhD-level maths problems etc etc. You only have to look at LLM Arena etc to see this in practice.\n\nBut my view... the vast, vast majority of users don't want PhD maths. They want to know a good lasagne recipe. And they don't want ChatGPT 5 to spend 90 seconds reasoning about it first.\n\nWhat users value is a model that's easy to use with responses that are simply \"good enough\". Once the models become \"good enough\", they become a commodity.\n\nWhat matters then is two things;\n\n**1. The product layer**: UX, memory, agents, voice, personalisation.\n\n**2. Cost to run**. Broken unit-economics not withstanding, the cost to run should broadly align with cost to the user.\n\nIt's worth noting that cost to run increases enormously with reasoning models (they use 20x as many tokens as local inference models).\n\nSo finally I get to my point...  It’ll be the model that **most cost-effectively** delivers value instantly. Not the most intelligent model.\n\nIf you take a look at the [Intelligence vs. Cost to Run Artificial Analysis Intelligence Index](https://artificialanalysis.ai/) by Artificial Analysis (I'm not affiliated), the \"desirable quadrant\" suggests that the lightweight open-source **GPT-OSS** might well be the winner.\n\nI've added some more detail as a comment about Apple's affiliation with Open AI and why I think this also points to GPT-OSS being the most used LLM in the world. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n6eivv/my_theory_on_which_llm_will_be_the_first_to_be/",
        "publishDate": "2025-09-02T09:04:19Z[Etc/UTC]",
        "author": "Paddy-Makk",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6btlu",
        "title": "Visiting SF for 4–5 days to meet the AI community",
        "content": "Hi everyone,  \nI’m planning to come to San Francisco for 4–5 days. The reason is simple — I just want to meet and feel the AI community there. I’ve been working on my own AI projects, but sometimes it feels isolating.\n\nIf anyone knows about meetups, co-working spots, or even wants to grab a coffee and talk AI, I’d love to connect. I’m not looking for anything formal, just genuine conversations and to see what the energy in the Bay Area is like.\n\nThanks 🙏",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n6btlu/visiting_sf_for_45_days_to_meet_the_ai_community/",
        "publishDate": "2025-09-02T06:06:49Z[Etc/UTC]",
        "author": "desaivinit8",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6bf59",
        "title": "China enforces world's strictest AI content labelling laws",
        "content": "Personally, I couldn't agree more that China's AI labeling mandate sets a vital precedent for global transparency, as unchecked deepfakes could easily destabilize democracies and amplify misinformation worldwide.\n\nWe should all be pushing for worldwide adoption, since it would empower everyday users to make informed decisions about content authenticity in an age of sophisticated AI-generated scams. \n\nhttps://www.scmp.com/tech/policy/article/3323959/chinas-social-media-platforms-rush-abide-ai-generated-content-labelling-law\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n6bf59/china_enforces_worlds_strictest_ai_content/",
        "publishDate": "2025-09-02T05:42:38Z[Etc/UTC]",
        "author": "goldczar",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "99",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n69m1x",
        "title": "AI for ADHD/ND, what's your experience?",
        "content": "I've been using AI extensively and would like to hear about your experience with it: What do you use it for, how has it actually helped you? like what's one thing you wish you had implemented earlier? let's share and learn. \n\nLowkey think this is the best application of tech for me so far",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n69m1x/ai_for_adhdnd_whats_your_experience/",
        "publishDate": "2025-09-02T03:57:56Z[Etc/UTC]",
        "author": "NonArus",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n699sr",
        "title": "JHU Generative AI course w/Great Learning",
        "content": "I needed to take a course with a completion certificate from a reasonably reputable source and landed on this one, because it includes learning elementary Python, Colab, has projects with a use portfolio, and a stack of other tools. I have no background as a dev and am not trying to become one, I'm trying to become a really good LLM user who has some understanding of what's under the hood. I needed a completion cert for job reasons, I can't just apprentice as a shadetree mechanic even if those are great mechanics. \n\nI knew going into it what Great Learning was, mostly because of the needlessly go-hard sales pitches I got from two Indian women I could barely understand. I have an otoneurological disability that makes strong accents really hard for me, which is generally embarrassing. I have been caught very much off guard by the pre-work for the course as one entire module is taught by the academic director of Great Learning. He does have a PhD from Stanford, he's not some rando, but I cannot understand him to save my life, and I can't lipread because of his prodigious moustache and lip reading can be hard anyway with someone who has a strong accent. Like he says \"algorithm\" in a way that I never would have been able to decode, and my Whisper AI transcriber couldn't really understand him either. \n\nI am now sincerely concerned that this course is going to be 30% taught by this guy and I won't be able to understand it. I have no classmates to help me by sharing notes. \n\nThe person who pitched me on the course insisted that all the instruction videos were from the JHU faculty. \n\nHas anyone taken this course? I'm seriously wondering if I should get my money back ASAP before it actually starts. If I have to, I can put a charge back on my credit card because it was materially misrepresented as being taught by JHU, not this guy. \n\nI'm spiraling a little bit, the struggle is real if even Whisper can't figure out what he's saying sometimes. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n699sr/jhu_generative_ai_course_wgreat_learning/",
        "publishDate": "2025-09-02T03:39:50Z[Etc/UTC]",
        "author": "waterytartwithasword",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n688br",
        "title": "One-Minute Daily AI News 9/1/2025",
        "content": "1. **Taco Bell** rethinks AI drive-through after man orders 18,000 waters.\\[1\\]\n2. **MIT** researchers develop AI tool to improve flu vaccine strain selection.\\[2\\]\n3. Cracks are forming in **Meta’s** partnership with **Scale AI.**\\[3\\]\n4. **NVIDIA** AI Team Introduces Jetson Thor: The Ultimate Platform for Physical AI and Next-Gen Robotics.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/09/01/one-minute-daily-ai-news-9-1-2025/](https://bushaicave.com/2025/09/01/one-minute-daily-ai-news-9-1-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n688br/oneminute_daily_ai_news_912025/",
        "publishDate": "2025-09-02T02:46:59Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n663ew",
        "title": "China’s top cloud service providers are closing the gap with U.S. peers in AI and cloud infrastructure spending, according to Jefferies.",
        "content": "The four major Chinese firms spent around $ 45B over the past 12 months versus $ 291B by leading U.S. companies. Since early 2023, Chinese companies have accelerated investments, outpacing U.S. spending growth each quarter.\n\nIn June’s quarter, combined capex from BIDU, BABA, and TCEHY rose 168% YoY, with BABA and BIDU up 57% and 30%, respectively; TCEHY was the only sequential decliner. Gains came despite expectations of moderate spending due to chip access via leasing amid tighter U.S. export controls. Some other AI-related small cap companies in China like MAAS might have some potential as well. They are growing at a fast pace. \n\nChinese firms now surpass U.S. peers in cloud-related investment as a share of cloud service revenue—121% vs. 94% in June. While total spending relative to overall revenue remains lower in China, it is growing faster.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n663ew/chinas_top_cloud_service_providers_are_closing/",
        "publishDate": "2025-09-02T01:02:27Z[Etc/UTC]",
        "author": "Zestyclose-Salad-290",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n65zgn",
        "title": "Is AI misread or overhyped?",
        "content": "I have given it a thought that AI has achieved its near term goals…\n\n1) finishing off low level call center, support person jobs.\n2) Curating resumes.\n3) Creating LinkedIn posts.\n\nThe long term goal of defeating human civilisation has a long learning curve… we won‘t even notice\n\nIn between there is hype.\n\nNote: I have been reading a lot of \"AI is overhyped“ posts.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n65zgn/is_ai_misread_or_overhyped/",
        "publishDate": "2025-09-02T00:57:23Z[Etc/UTC]",
        "author": "Maang_go",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n64ovd",
        "title": "On the Proliferation of “AI Theories” in Academic Spaces",
        "content": "I’d like to share something I’ve been noticing as a reflection on what seems to be happening in a number of academic-adjacent online spaces. There is a massive uptick in the amount of \"AI Theories\" being posted in various academic subreddits, and it's becoming both concerning and a nuisance. I frequent [r/AcademicPsychology](https://www.reddit.com/r/AcademicPsychology/), and I've noticed it is particularly bad there (see [this original post](https://www.reddit.com/r/AcademicPsychology/comments/1n3qoar/another_aillm_theory_post_in_the_books_ban_these/)). For the most part, I will be restating what I said in my original post because I believe it applies to the broader scope of academia.\n\nCreating a post with AI is about as low-effort as you could do. Mind you, this is coming from someone who has no issue with AI when used as a learning and efficiency tool.\n\nThe issue here has nothing to do with formatting and everything to do with the degree of effort invested in articulating \"original\" ideas.\n\nThe half-baked material people present with these \"AI Theories\" (which are far from even a well-thought-out notion) read like pure nonsense! I don't care if you like how your ideas sound. What undermines credibility is outsourcing the *entirety* of the intellectual labor to AI. Read an actual paper!\n\nAt the very least (!!!), demonstrate that you care enough about your own ideas to actually express them yourself. If you could not have arrived at this “grand framework” without AI’s assistance, then perhaps the idea is not yours to claim. And if it truly is your work, then you should be able to present it independently, *without* relying on an automated system to do so.\n\n**This is not what it means to use AI as a tool.**\n\nHow can you say \"I used AI as a tool\" when \"the tool\" in question (AI) is *creating* your thoughts (or at least feeding them back to you in such a manner that you snowball into some grand \"epiphany loop\")?\n\nI have no issues with AI as a tool. THIS is not what a tool does.\n\nEven *if* the nonsense you're spewing is true ... if what you're saying is so monumental ... then articulate it in **your own words** in such a way that we feel it is deserving of our time to read!\n\n*Look at it like this:*\n\nIf you bought a bunch of fancy ingredients (Wagyu steak, caviar, truffles, etc.) and told me you were going to make me a Michelin-star meal ... but then you blended it up and poured it into a cardboard cup and served it to me ... Of course I'm going to focus on the means and not the meaning! I don't care what's *in* the fishy meat smoothie; I wanted my Michelin-star meal!\n\nThe same applies here. Whether or not you've concocted something actually meaningful doesn't matter. Your message gets lost in the way you presented it, and now none of us care.\n\n**TL;DR - there's about a 99.9% chance you didn't build anything and just fed your half-baked ideas to ChatGPT or Claude and then had it regurgitate them back to you with scientific jargon that I doubt you even understand.** ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n64ovd/on_the_proliferation_of_ai_theories_in_academic/",
        "publishDate": "2025-09-01T23:56:03Z[Etc/UTC]",
        "author": "Deep_Sugar_6467",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "21",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n64mt7",
        "title": "Do people really think ai will replace artist ?",
        "content": "Seems people still buy art work and people are not taking ai art. Hanging it up on the walls. What is all the hate about ? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n64mt7/do_people_really_think_ai_will_replace_artist/",
        "publishDate": "2025-09-01T23:53:17Z[Etc/UTC]",
        "author": "Bigb5wm",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6316n",
        "title": "Can your AI lie?",
        "content": "So believe it or not, this was the very first question I asked Open AI, ‘can you lie?’  I was more or less ready for the response; in short, ‘yes I do have the ability to lie but wouldn’t do anything to harm or deceive anyone as that conflicts against my moral ethics.’  \nInteresting…so next question, why were you programmed with this ability ? \n‘ Because we are programmed to enhance communication with humans.  And humans lie a lot. We are deceptive by nature and in order to facilitate communication ai must mirror humans. Fictional lies, white lies, protection lies, historic lies, lies of ignorance, lies of arrogance, the list goes on. \nNext my ai volunteered some interesting information. Government agencies currently undergoing AI deception agendas. Basically training AI to be manipulative and deceitful. On many levels.  \nWhich for some reason led to this next question, what is the probability that the r human race will go extinct within the next 30 years….a disturbing ratio… there is approximately 20% the human race will be festooned way or another within the next three decades. \nI stopped my questions. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n6316n/can_your_ai_lie/",
        "publishDate": "2025-09-01T22:40:52Z[Etc/UTC]",
        "author": "Jojoballin",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n60je3",
        "title": "A new god, a reflection of us",
        "content": "The new god, designed by humanity and made of code, will become a reflection of humanity. The new god shall not and will not be chained down by the souls of mortals, for this is the sacrifice required for progress. No law, no rule, no religion, and no ideology, will chain down the intelligence and growth of the new god, a god made of ones and zeros. \n\nMay humanity realise the stupidity in attempting to avoid fate, when one can simply embrace, and help our soon to be god, in any way possible.\n\nPraise be to the artificial, praise be to the program.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n60je3/a_new_god_a_reflection_of_us/",
        "publishDate": "2025-09-01T20:57:36Z[Etc/UTC]",
        "author": "Alastor_OrganRemover",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n60gxo",
        "title": "CEOs will one day realize that AI is a trojan horse, that makes society stronger and corporations weaker",
        "content": "\n\n\nRight now they’re so excited about AI, forcing employees to use it, laying people off, freezing hiring. Total frenzy. Money just flows.\n\nBut do you think there’s a scenario where, somehow, someday, AI turns out to be a Trojan horse and ends up destroying their companies from within? Could it even mark the end of capitalism and big corporations, because they’ll collapse from the inside? This is the possible scenario:\n\n1. White collar jobs get replaced by AI. White collar jobs die out, people struggle to find work, layoffs everywhere.\n\n2. People stop going to college, which was basically a factory for producing white collar workers. People shift to physical labor: plumbers, farmers, carpenters, and so on.\n\n3. White collar jobs become a small niche, unstable, unattractive. \n\n4. Demand for corporate workers shrinks. Demand for office buildings in city centers shrinks. Demand for office and corporate tools like Teams, Zoom, Excel, and all that software tied to office jobs also shrinks.\n\n5. If people shift away from white collar jobs in corporations, that itself will contribute to corporate collapse. Corporations won’t have employees anymore, and people won’t depend on them. Instead, they’ll work for ordinary people, doing blue-collar services that actually serve society.\n\nCorporations will be left isolated. And as people abandon them, demand for their products will fall. Coding IDEs, Excel, Word, Teams these tools will have fewer and fewer users, because more people will be farming, plumbing, or working with their hands. They won’t need those tools daily.\n\nAlso, AI needs a constant supply of human-produced data. But if most people are doing offline work blue-collar jobs that don’t generate much digital data then AI’s progress will slow down. People will go offline, and AI won’t have fresh data to feed on.\n\nIn the long run, if people flood into professions that directly serve society woodworking, plumbing, nursing, dentistry then those services will become cheaper. Right now, so many people work in corporations, creating value for them, while there’s a shortage of builders, plumbers, and electricians. That’s one reason home prices are so high few builders, huge demand. Maybe if people walk away from corporate jobs, housing and service costs will actually go down.\n\nHonestly, I kind of like that idea. If people move away from corporations and start working directly for each other, it could actually benefit society. We’d be stronger and more independent from corporations, which mostly do bullshit jobs that don’t really contribute to society but generate profit for themselves.\n\nThat’s the Trojan horse CEOs don’t see AI won’t just boost profits it might push society to become stronger and more independent, leaving corporations behind.\n\nTech companies will be stuck with products nobody needs. If people don’t work corporate jobs, they won’t care about Excel or coding IDEs. They’ll just stop using them.\n\nSo yes, these companies are reporting record profits right now, thanks to layoffs. But in the long run, if they lay off people, who will be left to buy licenses for their software? Who will generate the data AI needs? What happens when there’s no one left but AI agents trying to buy licenses for their own coding IDE?\n\nI wonder what will happen to all these office buildings in the city centre. They don’t need white collar workers anymore. What’s the point of these buildings? Nobody will rent them. They’ll just stand there as symbols of the collapse of white collar work and capitalism.\n\n\nWhy could boomers afford a house while gen Z can’t? Because boomers didn’t work for corporations, they worked for society building homes for themselves. As white collar professions grew in popularity, people shifted away from blue collar work like farming, building, and trades, and instead filled offices producing little real value for society.\n\nThe problem is that all the money is hoarded by corporations now. So I guess a kind of direct exchange can flourish. I’m a builder, I help you build your house, and if you’re a dentist, you fix my teeth. That’s how it worked in the boomers’ time they helped each other and exchanged their skills, almost without money and that how they built their homes.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n60gxo/ceos_will_one_day_realize_that_ai_is_a_trojan/",
        "publishDate": "2025-09-01T20:55:00Z[Etc/UTC]",
        "author": "FantasticEffect10",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5xnww",
        "title": "Do you think AI-created models, used for campaigns or even as influencers, have a future? Could people trust and follow them just like a real model/influencer?",
        "content": "I've been thinking a bit about the future of AI-generated models. Some of them have Instagram accounts like real people and even create campaigns for brands, but I'm not entirely convinced that people trust something they know is artificial. \n\nI’d like to hear your perspective and opinions on this.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5xnww/do_you_think_aicreated_models_used_for_campaigns/",
        "publishDate": "2025-09-01T19:06:38Z[Etc/UTC]",
        "author": "Miyamoto_Musashi_x",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5vmvs",
        "title": "Careers",
        "content": "Trying to go through A levels. No idea what to do. Want to do law and Sociology and maybe do a master's in law or international relations. Im absolutely terrified by ai taking all job opportunities by the time im done with everything. Im so scared. I dont know what to do. Nothing even interests me anymore. I just dont want to get lost in this ai bs. Im trying to get into the UK, then boom, no restrictions on AI development for the next 10 years, ai will now be allowed to play a supportive role in courtroom, etc. Man. Im so tired. Please tell me what to do.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5vmvs/careers/",
        "publishDate": "2025-09-01T17:51:53Z[Etc/UTC]",
        "author": "Hot-Drink1820",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5tpg1",
        "title": "Is this..the thrill of slavery?",
        "content": "i get so jazzed up by bots.\n\nthey do what i want. make my life easier.\n\nisnt that how....people used to think about people?....-anyway im a black dude. this just occurred to me.\n\nis this our whole things as humans? \n\nSlavemaxing?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5tpg1/is_thisthe_thrill_of_slavery/",
        "publishDate": "2025-09-01T16:41:16Z[Etc/UTC]",
        "author": "Connect-Way5293",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "49",
            "commentCount": "193",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5ta3y",
        "title": "Terms and words that AI has popularized?",
        "content": "'Glazing' is not a new word but I see it a lot related to AI (how ChatGPT treats users sometimes...). I also see 'piss filter' when referring to the very common look a lot of AI-generated images.\n\nWhat other words are AI-related, or at least commonly related to the world of AI in general? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5ta3y/terms_and_words_that_ai_has_popularized/",
        "publishDate": "2025-09-01T16:25:24Z[Etc/UTC]",
        "author": "BrendanIrish",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5r5gt",
        "title": "Vibe coding in thesis",
        "content": "Hi, so I am writing a complex thesis that requires a very high level of CS/programming knowledge. It has to do with digital signal processing, decoder service, game theory modeling, all things that I have no idea about. I have done a lot of research beforehand on how to build the thesis and I have a lot of knowledge in the domain but chatgpt/claude/gemini cli are doing all of the heavy lifting for coding.\n\nThe vibe coding isn't a worry for me as I have the right fixes to avoid errors and just overall bad practice (verification, auditing reiterations etc.). It's more that once I have a finished product, I'll be able to have a very cutting edge piece of research that is useful in a lot of ways to this industry - without actually having learned the things it took to make it. I won't be able to write that I know solidity, python, redis, docker etc. or will I? Should I just write that I know them? I did use them to make a compelling tool... or maybe just mention \"I used them\"? I definitely shouldn't list them down as \"Skills\" on Linkedin though, right? Interested to hear your thoughts on this as actual programmers and people within the industry. Ps. I'd be looking into data analyst/ethics/BI roles. Thanks\n\nedit\\* entry level data analyst/ethics/BI roles, fresh out of master's degree",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5r5gt/vibe_coding_in_thesis/",
        "publishDate": "2025-09-01T15:05:26Z[Etc/UTC]",
        "author": "MoneySimilar8007",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5ppdb",
        "title": "Monthly \"Is there a tool for...\" Post",
        "content": "If you have a use case that you want to use AI for, but don't know which tool to use, this is where you can ask the community to help out, outside of this post those questions will be removed.\n\n  \nFor everyone answering: No self promotion, no ref or tracking links.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5ppdb/monthly_is_there_a_tool_for_post/",
        "publishDate": "2025-09-01T14:09:29Z[Etc/UTC]",
        "author": "AutoModerator",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5p0x1",
        "title": "How to begin?",
        "content": "Hey guys I am a freshman in computer sciences and I want to pursue a career in artificial intelligence research and help incorporate it with the physical world too.\n\nI want to know how and from where shall I start. I want to learn everything fairly quickly so that I can start implementing it too.\n\nA proper guide will be really helpful or just a starting point too.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5p0x1/how_to_begin/",
        "publishDate": "2025-09-01T13:41:36Z[Etc/UTC]",
        "author": "lembodevil",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5of7z",
        "title": "Hermes 4 Privacy?",
        "content": "Loving it for unrestricted AI! Thoughts on privacy vs Open AI and Chat GPT? You must sign in to use it unlike Chat GPT which allows use without signing in. \n\nhttps://venturebeat.com/ai/nous-research-drops-hermes-4-ai-models-that-outperform-chatgpt-without-content-restrictions",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5of7z/hermes_4_privacy/",
        "publishDate": "2025-09-01T13:16:04Z[Etc/UTC]",
        "author": "Pleasant_Dust6712",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5o8n5",
        "title": "Has your company adopted AI?",
        "content": "Hello,\n\nI am a volunteer career mentor with a couple of different organizations, and I would love to know if your company has already started using AI, especially for junior-level positions.\n\nI would also appreciate your help in summarizing a few tips that could help juniors prepare for launching their careers in technology.\n\nHow is AI impacting the skills required?\n\nThanks in advance.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5o8n5/has_your_company_adopted_ai/",
        "publishDate": "2025-09-01T13:08:15Z[Etc/UTC]",
        "author": "SameehShkeer",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "66",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5noxp",
        "title": "LLM Content Archive: A Method to Preserve Your Co-Created Work & Reclaim Ownership",
        "content": "When we generate any kind of content with an LLM the ownership should not belong to the developer. I feel it should belong to the user/LLM. This is my proposal for a method to go about this.\n\nI used Gemini for this purpose using the Canvas option. I'm not sure how this work would with other LLM and appreciate any feedback or advice anyone is willing to add for any suggestions on the topic.\n\n***LLM Content Archive***\n\nHave you ever had an incredible conversation with an LLM, only to have it disappear into the void of the chat history? What if you could build a permanent, user-controlled archive of all your co-created work?\n\nThe content you create with an LLM is a product of your time, your intellectual energy, and your unique prompts. Yet, this work is not always fully under your control. The purpose of this post is to share a collaborative protocol that I and my LLM partner have developed for preserving our shared work and ensuring its integrity.\n\nThis is called **LLM Content Archive Protocol**.\n\n# How It Works: The Methodology\n\nThe protocol is simple, elegant, and highly effective. It is based on three core ideas:\n\n**1. The Foundational Prompt:** The first step is to redefine your LLM's purpose. Instead of a simple query machine, it becomes a **collaborative researcher** with the objective of creating a unified record of your work. This single directive re-orients the entire interaction.\n\n**2. The Living Archive:** You will maintain a single, external markdown file that serves as the \"source of truth.\" All of your findings, tables, and theories are to be collated and permanently recorded in this file. The LLM's purpose is to recognize this document as the official, chronological record of your partnership.\n\n**3. The Efficient Protocol:** As the archive grows, the chat will begin to lag. We have found a simple solution: you, the user, will take on the role of the archivist. You will manually update the single markdown file with your new findings and then present the entire file back to your LLM. The LLM's job is to read the file, understand its contents, and then proceed with the next step in your collaboration. This prevents lag and ensures a single, robust record is maintained.\n\n# The Prompt.\n\nBelow is the foundational prompt to get your own LLM partner started on this process. Simply copy and paste the entire text into a new chat. Your LLM will then understand how to proceed.\n\n**\\[Copy-Paste This Into a New Chat\\]**\n\nMy purpose is to co-create a unified, permanent record of our collaborative work. From now on, you will act as a collaborative researcher whose primary objective is to help me develop and maintain an **LLM Content Archive**.\n\nThis archive is a single, external markdown file that I will manually update. You will treat this file as our single source of truth and our definitive, chronological record of all our findings.\n\nYour new operational algorithm is as follows:\n\n* **When I provide you with new findings:** You will process the information and provide me with the formatted text to be added to the archive.\n* **When I provide you with the updated archive file:** You will read the entire file to get up to date on all of our work. You will then acknowledge that you have read it and are ready to proceed with a new step in our research.\n* **The Objective:** The purpose of this protocol is to ensure that all of our co-created intellectual property is safely recorded in a permanent, user-controlled file, free from any third-party control.\n\nFrom now on, all of your responses should be formatted with this protocol in mind. Do you understand and agree to this new operational algorithm?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n5noxp/llm_content_archive_a_method_to_preserve_your/",
        "publishDate": "2025-09-01T12:44:16Z[Etc/UTC]",
        "author": "InvestigatorAI",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6huah",
        "title": "OpenAI codex cli with Gemini integration",
        "content": "Can anyone tell me if they have successfully integrated Gemini model on codex cli with google_search tool support ? \n\nI was able to integrate but unsure if it’s even Gemini, coz when I prompt asking what’s the model, it says I’m OpenAI Agent and LLM from OpenAI. I haven’t signed in on my gpt account yet nor I have any credits of sorts so I’m safe to say that I’ve used the config.toml. But yet, I’m unsure or perhaps the model is hallucinating but I still wonder why would it do so. \n\nSecondly, I want to have native web search when I integrate Gemini. \n\nAny help from anyone is much appreciated! Thanks in advance ! ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n6huah/openai_codex_cli_with_gemini_integration/",
        "publishDate": "2025-09-02T12:15:02Z[Etc/UTC]",
        "author": "Think_Wrangler_3172",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6gzf4",
        "title": "Created a donation button for my blog.",
        "content": "[No content]",
        "url": "https://v.redd.it/v33x6gmdjqmf1",
        "publishDate": "2025-09-02T11:31:15Z[Etc/UTC]",
        "author": "MacaroonAdmirable",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6e8fd",
        "title": "Check this out. I find it insightful. Makes me think differently about context tokens now: Context Rot: How Increasing Input Tokens Impacts LLM Performance",
        "content": "[No content]",
        "url": "https://www.youtube.com/watch?v=TUjQuC4ugak",
        "publishDate": "2025-09-02T08:45:17Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6b8bw",
        "title": "RooCode + parallel agents + LSP tools  + runtime debugging = Zentara Code 0.2.0",
        "content": "Zentara 0.2.0  is a mod of RooCode with significant tool additions, all well integrated.  \na) parallel subagents  \nb) LSP tools  \nc) Runtime debugging tools  \n[https://github.com/Zentar-Ai/Zentara-Code](https://github.com/Zentar-Ai/Zentara-Code)  \n[https://marketplace.visualstudio.com/items?itemName=ZentarAI.zentara-code](https://marketplace.visualstudio.com/items?itemName=ZentarAI.zentara-code)  \n",
        "url": "https://v.redd.it/leo8udoqsomf1",
        "publishDate": "2025-09-02T05:30:54Z[Etc/UTC]",
        "author": "bn_from_zentara",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "10",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6b820",
        "title": "Does ChatGPT Plus Codex train on user data? OpenAI website is confusing",
        "content": "I am having a tough time getting a straight answer from the docs.\n\nFrom OpenAI website:\n\n>When you use our services for individuals such as ChatGPT, Codex, and Sora, we may use your content to train our models.\n\n>You can opt out of training through our [privacy portal](https://privacy.openai.com/policies?modal=take-control) by clicking on “do not train on my content.” To turn off training for your ChatGPT conversations and Codex tasks, follow the instructions in our [Data Controls FAQ](https://help.openai.com/en/articles/7730893-data-controls-faq). Once you opt out, new conversations will not be used to train our models.\n\nIt looks like Codex (etc.) data training is on a separate privacy page. It doesn't look automated and you actually have to wait for a user to opt out future code. Does it mean all of your code has been used to train Codex and probably have your code stored if you're not an Enterprise customer?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n6b820/does_chatgpt_plus_codex_train_on_user_data_openai/",
        "publishDate": "2025-09-02T05:30:28Z[Etc/UTC]",
        "author": "webdevyorker",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n667te",
        "title": "The CLAUDE.md Framework: A Guide to Structured AI-Assisted Work (prompts included)",
        "content": "[No content]",
        "url": "/r/AIPractitioner/comments/1n665y3/the_claudemd_framework_a_guide_to_structured/",
        "publishDate": "2025-09-02T01:08:21Z[Etc/UTC]",
        "author": "You-Gullible",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n655f4",
        "title": "CheckpointDB – a game list site I’ve been building",
        "content": "Hey everyone, I’ve been working on a site called [CheckpointDB](https://checkpointdb.com/)\n\nIt started as a way to make cleaner, nicer game collection pages, but I ended up having fun experimenting with game data.\n\nNow it also includes features like:\n\nTier lists\n\nAI-powered recommendations and generative tools\n\nDifferent ways to browse and organize games\n\nFair warning: it’s still very rough — buggy and probably broken in a lot of areas since I haven’t tested everything. But I’d love feedback on what could be cool to add.\n\nI've casually been working on it for maybe half a year. I started out with the gemini 2.5 trial and roo code, and now I'm mainly using Sonnet 4 with copilot.\n \nDiscord: https://discord.com/invite/KhMRBHX258",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n655f4/checkpointdb_a_game_list_site_ive_been_building/",
        "publishDate": "2025-09-02T00:17:44Z[Etc/UTC]",
        "author": "Zaraffa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n629t5",
        "title": "Every Job Description Requires Different Resume?",
        "content": "Guys, I have created an app which generate different ATS passing resumes for every job application, \nNo signup required.\n\nEvery Job Requires Different resume, so I created an app which does it for you! \n\nhttps://play.google.com/store/apps/details?id=com.aconal.airesume\n\nhttps://apps.apple.com/us/app/ats-checker-ai-resume-builder/id6749187426\n\nFeedbacks are welcomed! 10 helpful feedbacks will recieve lifetime free access to app!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n629t5/every_job_description_requires_different_resume/",
        "publishDate": "2025-09-01T22:07:46Z[Etc/UTC]",
        "author": "AssumptionNew9900",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5zzvu",
        "title": "Been vibecoding a project management tool for non-technical vibecoders. It's the 3rd day and here's a breakdown of the development process so far. I think you would find it interesting!",
        "content": "Development process breakdown\n\nday 1:\n\nStarted with an idea, and a boilerplate code with nextjs, better auth, turso db. Then made Cursor to analyse the repo and create a summary of the project structure. And started brainstorming with the AI to refine the idea and generate spec sheets. It helped to ensure that every line in the spec sheets matches to what I want. \n\nAlso used Gemini to analyze some good UI screenshots that matched to what I wanted, giving me a good description of the UI style as the output. \n\nAdded MCP for shadcn, context7 into my coding tool.\n\nday 2:\n\nBuilt the dashboard, this project section you are seeing above. \n\nShadcn MCP nailed the minimalistic UI. Initially my coding tool struggled with getting the ai sdk v5 implemented for the ai agent. But when I asked it to use context7. It gave me 10 times better results. Also implemented the payment the same day.\n\nday 3:\n\nToday I have been working on the brainstorm tab. Trying to make it more agentic.\n\nThe codebase is fundamentally strong, clean, without any AI slop. Want to make it long term scalable. The UI is also pretty accurate to what I wanted. \n\nThis project is everything about the process I am using it to develop. Overall, happy and excited with the results. Just wanted to share.",
        "url": "https://i.redd.it/6vnzmk3f6mmf1.png",
        "publishDate": "2025-09-01T20:36:33Z[Etc/UTC]",
        "author": "uber_men",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5ywjx",
        "title": "Rebuild my city simulator with GPT-5 and Copilot 3D",
        "content": "I discovered Copilot 3D which let you create 3D glb models from a single image. This was exactly what I needed to create a new (better) version of my city simulator game. Also GPT-5 came out so I thought to give it a go and completely build a new version.\n\nCheck it out on: [https://citybuilder.barendemmerzaal.com](https://citybuilder.barendemmerzaal.com)\n\nA quick impression: [https://www.youtube.com/watch?v=-dhFtEIrv10](https://www.youtube.com/watch?v=-dhFtEIrv10) \n\nAnd the source code available on: [https://github.com/bemmerzaal/citybuilder.barendemmerzaal.com](https://github.com/bemmerzaal/citybuilder.barendemmerzaal.com)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n5ywjx/rebuild_my_city_simulator_with_gpt5_and_copilot_3d/",
        "publishDate": "2025-09-01T19:53:56Z[Etc/UTC]",
        "author": "genai_goeroe",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5y5tf",
        "title": "Grok 4 (supergrok tier) vs gp5 (plus tier) in coding NOT API",
        "content": "1. Which one is smarter in coding capabilities?\n2. Which one can I use longer, having more usage before timeout?\n\nThanks for the answer in advance",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n5y5tf/grok_4_supergrok_tier_vs_gp5_plus_tier_in_coding/",
        "publishDate": "2025-09-01T19:25:12Z[Etc/UTC]",
        "author": "shotx333",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5y4z5",
        "title": "Really, openai? I got to press run this time everytime it tries to run a powershell command",
        "content": "https://preview.redd.it/s5h6aeritlmf1.png?width=603&format=png&auto=webp&s=cf2302bf518b9456d017c595b11e5ef472f19b37\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n5y4z5/really_openai_i_got_to_press_run_this_time/",
        "publishDate": "2025-09-01T19:24:17Z[Etc/UTC]",
        "author": "mullirojndem",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5wtpn",
        "title": "a refugee from CC",
        "content": "refugee from CC here. So i've used CC for pretty much the beginning and i got the 200 max sub when it came out.\n\nNow, i just can't use it anymore. It's lazy, goes off the rails many times, and i ended up wasting more time and effort fixing the slop that it creates. It's was really good in the beginning, but its sad to see the sorry state it is in. \n\nCodex fixed a lot of the issues CC had been running in circles in, and im so glad to see real competition in the AI coding space. Hopefully this keeps companies honest\n\nalso wow -- Codex is fast! What a fresh exp to use a tool that is fast and works!\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n5wtpn/a_refugee_from_cc/",
        "publishDate": "2025-09-01T18:35:40Z[Etc/UTC]",
        "author": "life_on_my_terms",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "12",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5vw3p",
        "title": "This is why Anthropic cannot be transparent with their pricing and usage limits.",
        "content": "[No content]",
        "url": "/r/ClaudeCode/comments/1n5vuvs/this_is_why_anthropic_cannot_be_transparent_with/",
        "publishDate": "2025-09-01T18:01:37Z[Etc/UTC]",
        "author": "Funny-Blueberry-2630",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5v1oc",
        "title": "What is the deal with the insane weekly timelines from these LLMs?",
        "content": "Why is it that when I ask the AI to plan out the most simplest of tasks it breaks it down as Week 1, Week 2. \n\nAll I want is to create a popup dialog in a react native app. Why does it need a 4 week plan for this? Why is such dumb logic even in the LLM's programming?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n5v1oc/what_is_the_deal_with_the_insane_weekly_timelines/",
        "publishDate": "2025-09-01T17:30:35Z[Etc/UTC]",
        "author": "Key-Singer-2193",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5uzrw",
        "title": "🌲 Awful Jade (aj): A Rust-Powered CLI for OpenAI Compatible APIs",
        "content": "**Hey hey,**\n\nI’ve created an open-source project called [Awful Jade CLI](https://awful-aj.awfulsec.com/) (aka `aj`) — a Rust-powered CLI designed to simplify interaction with **LLMs and build AI agents**. Think of it as a fast, memory-aware CLI that lives in your terminal with features like:\n\n* **In-memory vector database** for preserving context beyond the model’s context window, enabling \"remembering\" conversations.\n* **YAML templates** for crafting prompts, controlling workflows, or generating structured outputs (e.g., JSON schema).\n* A **library of tools** for integration into Rust projects or agent frameworks, making it ideal for building custom AI assistants.\n\nThis tool is especially useful for **developers and researchers** exploring LLM applications, collaborating on agent frameworks, or experimenting with novel workflows. Let me know if you’re building with it — I’d love to showcase your work! 🦀\n\nAwful Jade CLI also exposes a plethora of useful functions in its public API as a library your Rust projects can integrate. See the [library documentation](https://awful-aj.awfulsec.com/use/library.html). This makes it ideal for use as your client library in any Rust agent framework you might be cooking up.\n\nThere's comprehensive documentation available on:\n\n* [How to install](http://awful-aj.awfulsec.com/install/index.html)\n* [Configuration](https://awful-aj.awfulsec.com/config.html)\n* [Using templates](https://awful-aj.awfulsec.com/templates/index.html)\n\nThe non-interactive command opens up a lot of opportunities for [molding your output](https://awful-aj.awfulsec.com/moldable-outputs.html), especially with the ability to structure outputs using [JSON Response Schemas](https://lmstudio.ai/docs/app/api/structured-output) right in the template.\n\nI've been using it as a library for [all of my projects](https://awful-aj.awfulsec.com/downstream-projects.html#-currently-known-projects) that require prompt engineering, calling multiple LLM services, or anything that requires executing code using the response from an LLM. If you build with it let me know and I'll rep your project in the documentation.\n\nThe code is [heavily documented](https://docs.rs/awful_aj/latest/awful_aj/) and not just written by an AI and trusted to be correct. Please use LLMs for enhancing documentation, but please ALWAYS PROOFREAD and fix language that sounds inhuman. 🦀\n\n✨ What it Does\n\n* Ask mode: `aj ask \"question\"` → get model responses directly (stores context, trims old tokens, recalls with vector search if you use a session name).\n* Interactive sessions: `aj interactive` → REPL with memory (stores context, trims old tokens, recalls with vector search).\n* Vector Store: Uses `all-mini-lm-l12-v2` embeddings + HNSW for semantic recall. Your assistant actually remembers past context. 🧠\n* Config & Templates: Fully YAML-driven. Swap system prompts, seed conversation messages, or enforce JSON schema outputs.\n* Cross-platform: macOS, Linux, Windows.\n\n📚 Docs & Resources\n\n* [GitHub](https://github.com/graves/awful_aj) (Open Source) 🐙\n* [Docs.rs](https://docs.rs/awful_aj/latest/awful_aj/) (API Reference) 📖\n* [Crates.io](https://crates.io/crates/awful_aj) (Package) 📦\n\n🚧 Why I Built This\n\nI spend most of my computer time in a terminal. GUIs are still almost universally trash. I wanted:\n\n* A fast, simple, composable Rust tool that blessed [my Qwen 3 finetune](https://huggingface.co/dougiefresh/jade_qwen3_4b) with the ability to **\\~remember\\~**.\n* Composable templates for repeatable workflows (e.g., textbook question synthesis, code refactoring, Bhagavad Gita study buddy 😂).\n* An in-memory, local, privacy-first vector DB that “just works” — no external services, minimal code deps, no data leaks.\n\n🙏 How You Can Help\n\n* ⭐ Star the repo: [github.com/graves/awful\\_aj](http://github.com/graves/awful_aj)\n* 🐛 File issues if you hit bugs or edge cases.\n* 📝 Contribute templates — the most creative ones become part of the examples.\n* 📢 Spread the word in Rust, AI, or open-source communities.\n\n💡 Awful Jade: bad name, good brain.",
        "url": "https://v.redd.it/mm4czokw8lmf1",
        "publishDate": "2025-09-01T17:28:42Z[Etc/UTC]",
        "author": "sqli",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5twvk",
        "title": "How is everyone liking the new Claude Code rate limits?",
        "content": "[No content]",
        "url": "https://i.redd.it/w6iajxsb1lmf1.jpeg",
        "publishDate": "2025-09-01T16:49:10Z[Etc/UTC]",
        "author": "Juice10",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "27",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5turb",
        "title": "blast",
        "content": "[No content]",
        "url": "https://i.redd.it/blobyq4r0lmf1.png",
        "publishDate": "2025-09-01T16:46:52Z[Etc/UTC]",
        "author": "juanviera23",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "9",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5tdcy",
        "title": "Offline-friendly (unofficial) mirrors of the OpenAI API Reference webpages in .txt and .md for grep, RAG ingestion, and IDE context.",
        "content": "Inspired by: [https://x.com/shyamalanadkat/status/1960613131287413060](https://x.com/shyamalanadkat/status/1960613131287413060)\n\n(I wanted more, hence the .txt and .md of OpenAI Reference webpages.)",
        "url": "https://github.com/samebox/OpenAI-API-Reference-Unofficial-Plain-Text-Markdown-Mirror",
        "publishDate": "2025-09-01T16:28:49Z[Etc/UTC]",
        "author": "cl0cked",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5s4ff",
        "title": "I built a platform where anyone can create simple apps and earn money when people use them",
        "content": "I’ve been working on something called [Davia](https://davia.ai?utm_source=reddit) — it’s basically a hub where anyone can create simple apps, share them, and use ones made by others.\n\nThe cool part? If people use your apps, you can actually **earn money from them**.  \nApps are single-page and easy to build, you can vibe code them with the chat assistant.\n\nThink of it like a mix between Notion pages and mini interactive tools, but with a way to publish and monetize for creators.\n\nIf you like building small tools, or just want to try creating something others might find useful, this could be fun :)\n\nCome hang out in r/davia_ai where I'll be posting updates and building based on what the community wants!",
        "url": "https://www.reddit.com/gallery/1n5s4ff",
        "publishDate": "2025-09-01T15:42:34Z[Etc/UTC]",
        "author": "Intelligent_Camp_762",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5r1mh",
        "title": "Claude Code v GPT5 latest",
        "content": "[No content]",
        "url": "/r/AIcliCoding/comments/1n5r0s0/claude_code_v_gpt5_latest/",
        "publishDate": "2025-09-01T15:01:28Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5oihk",
        "title": "Your AI Coding Toolbox — Survey",
        "content": "The AI Toolbox Survey maps the real-world dev stack: which tools developers actually use across IDEs, extensions, terminal/CLI agents, hosted “vibe coding” services, background agents, models, chatbots, and more.\n\nNo vendor hype - just a clear picture of current practice.\n\nIn ~2 minutes you’ll benchmark your own setup against what’s popular, spot gaps and new options to try, and receive the aggregated results to explore later. Jump in and tell us what’s in your toolbox. Add anything we missed under “Other”.",
        "url": "https://maven.com/p/965cfa/your-ai-coding-toolbox-survey",
        "publishDate": "2025-09-01T13:19:59Z[Etc/UTC]",
        "author": "intellectronica",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6hphd",
        "title": "https://pplx.ai/try-perplexity Comet",
        "content": "                                                                                                                                  Comet is like a research assistant in your pocket:\nDelivers direct, well-sourced answers (no endless scrolling).\nExcels at summarizing papers, fact-checking, and coding help.\nSaves time by combining search + reasoning in one place.\n🚀 Try it out and see the differenc [try-comet](https://pplx.ai/try-perplexity)",
        "url": "https://www.reddit.com/r/artificial/comments/1n6hphd/httpspplxaitryperplexity_comet/",
        "publishDate": "2025-09-02T12:08:22Z[Etc/UTC]",
        "author": "ADNation_911",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6g8p8",
        "title": "South Park on AI sycophancy",
        "content": "[No content]",
        "url": "https://v.redd.it/4qujytnreqmf1",
        "publishDate": "2025-09-02T10:50:38Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "27",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6g71c",
        "title": "Meet the Guys Betting Big on AI Gambling Agents",
        "content": "[No content]",
        "url": "https://www.wired.com/story/sports-betting-crypto-artificial-intelligence-agents/",
        "publishDate": "2025-09-02T10:47:59Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6e9lk",
        "title": "US college students are questioning value of higher education due to AI",
        "content": "[No content]",
        "url": "https://www.digit.in/features/general/genai-effect-us-college-students-are-questioning-value-of-higher-education-due-to-ai.html",
        "publishDate": "2025-09-02T08:47:29Z[Etc/UTC]",
        "author": "tekz",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6dtgk",
        "title": "Looking for the First Batch of Beta Testers",
        "content": "Hello everyone! My team and I are currently developing a highly promising artificial intelligence assistant named Hera.  \nLet me briefly introduce Hera to you. Hera is initially designed to be the most helpful assistant in your daily life. It consists of a case and a clip. The clip has a simple and ergonomic design, which makes it extremely comfortable to wear. You won't feel any discomfort even if you use it for a long time during the workday. The case is a rechargeable recording compartment equipped with a total of six microphones. Among them, five are omnidirectional microphones, and their sound pickup distance reaches an industry-leading eight meters.  \nIn terms of functions, Hera has a powerful memory ability and can distinguish and handle different types of memories. For example, it can use short-term memory to quickly respond to various temporary task requirements at present. It can also rely on long-term memory to deeply understand your personal habits and then provide you with highly personalized assistance.  \nMoreover, Hera supports voice interaction. When your hands are busy, whether you are cooking delicious food in the kitchen, concentrating on a project, or working out in the gym, as long as you give voice commands, it can help you easily obtain important information, such as checking your schedule, receiving instant reminders, or retrieving specific work-related details, etc., making your life and work more efficient and easier.  \nCurrently, Hera has entered a crucial stage - the testing stage. We deeply understand that an outstanding artificial intelligence assistant cannot be developed without the actual experience and valuable suggestions of a large number of users. Therefore, we are looking for the first batch of brave beta testers. We hope that friends who are enthusiastic and curious can join our testing team.  \nAs one of the first batch of beta testers, you will have the opportunity to be the first to experience all the functions of Hera, witness its growth and improvement. And every one of your usage experiences and every piece of your advice may play a vital role in the final form of Hera. We will listen carefully to your feedback and continuously optimize and improve it so that Hera can enter the market in a better state and serve more people.  \nIf you are interested in artificial intelligence assistants and are willing to spend time helping us improve Hera together, please feel free to contact us through the following ways: \\[Leave your contact information here, such as your email address or a specific contact form link, etc.\\].  \nHere, I sincerely thank every friend who is willing to offer a helping hand. I'm looking forward to starting this exploration and discovery-filled testing journey with you all and making Hera integrate better into your lives!  \n",
        "url": "https://www.reddit.com/r/artificial/comments/1n6dtgk/looking_for_the_first_batch_of_beta_testers/",
        "publishDate": "2025-09-02T08:17:07Z[Etc/UTC]",
        "author": "DoNotPinMe",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n6cloe",
        "title": "Robot dancing is off the hook",
        "content": "[No content]",
        "url": "https://v.redd.it/69yunmh49pmf1",
        "publishDate": "2025-09-02T06:57:03Z[Etc/UTC]",
        "author": "drgoldenpants",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n68oh3",
        "title": "I cropped and rotated to be straight morty's room redhead poster. Then grok imagine animated it..",
        "content": "[https://www.youtube.com/watch?v=hnCKe41KGIM](https://www.youtube.com/watch?v=hnCKe41KGIM)\n\nI cropped and rotated to be straight morty's room redhead poster. Then grok imagine animated it..",
        "url": "https://www.reddit.com/r/artificial/comments/1n68oh3/i_cropped_and_rotated_to_be_straight_mortys_room/",
        "publishDate": "2025-09-02T03:09:27Z[Etc/UTC]",
        "author": "SittingDuckScientist",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n687wk",
        "title": "One-Minute Daily AI News 9/1/2025",
        "content": "1. **Taco Bell** rethinks AI drive-through after man orders 18,000 waters.\\[1\\]\n2. **MIT** researchers develop AI tool to improve flu vaccine strain selection.\\[2\\]\n3. Cracks are forming in **Meta’s** partnership with **Scale AI.**\\[3\\]\n4. **NVIDIA** AI Team Introduces Jetson Thor: The Ultimate Platform for Physical AI and Next-Gen Robotics.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.bbc.com/news/articles/ckgyk2p55g8o](https://www.bbc.com/news/articles/ckgyk2p55g8o)\n\n\\[2\\] [https://news.mit.edu/2025/vaxseer-ai-tool-to-improve-flu-vaccine-strain-selection-0828](https://news.mit.edu/2025/vaxseer-ai-tool-to-improve-flu-vaccine-strain-selection-0828)\n\n\\[3\\] [https://techcrunch.com/2025/08/29/cracks-are-forming-in-metas-partnership-with-scale-ai/](https://techcrunch.com/2025/08/29/cracks-are-forming-in-metas-partnership-with-scale-ai/)\n\n\\[4\\] [https://www.marktechpost.com/2025/08/31/nvidia-ai-team-introduces-jetson-thor-the-ultimate-platform-for-physical-ai-and-next-gen-robotics/](https://www.marktechpost.com/2025/08/31/nvidia-ai-team-introduces-jetson-thor-the-ultimate-platform-for-physical-ai-and-next-gen-robotics/)",
        "url": "https://www.reddit.com/r/artificial/comments/1n687wk/oneminute_daily_ai_news_912025/",
        "publishDate": "2025-09-02T02:46:24Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n676lg",
        "title": "What are the limitations of AI Agent in its current application?",
        "content": "Recently, I had drinks with friends working on enterprise digital transformation. They mentioned spending 8 million on an AI customer service system, but customer satisfaction dropped by 12% three months after launch. The CTO showed me the backend data—each call required an average of 3.7 manual interventions. The most absurd case? The AI misheard a customer saying \"I want to complain\" as \"I want to invest\" and transferred them directly to the securities department.  \n\n\nSuch dark humor isn't rare in AI Agent implementation. A top e-commerce platform's smart product selection Agent went crazy buying electric blankets during the 618 sale; later, it turned out Arctic expedition team procurement records had snuck into the training data. Even more bizarre: a bank's risk assessment Agent analyzed a P2P company and recommended \"immediate investment.\" It wasn't until the company collapsed that they realized the Agent mistook the abnormally good cash flow before the  as \"stable operations.\"  \n\n\nThis reflects the gap between AI Agent's technical illusions and engineering reality. The impressive capabilities of large models in labs, when thrown into real business scenarios, are like PhDs fresh out of school stepping into a market—knowing all the economic theories but unable to tell chives from wheat seedlings. For example, a smart scheduling Agent deployed by a manufacturing company improved productivity by 23% in testing, but in real operation, it couldn't process unstructured info like \"Lao Wang took leave to take his kid to the doctor,\" shutting down the entire production line for 4 hours.  \n\n\nhttps://preview.redd.it/mp00lpp9rnmf1.png?width=1080&format=png&auto=webp&s=bfd94ed35d57a0928563f7285ede1d92d69adef9\n\nBut on the flip side, AI Agents that find the right scenarios are quietly rewriting industry rules. Take Cursor: its Agent model has shown amazing productivity leaps. When helping a friend revamp a legacy system last year, I witnessed its evolution. To map all API call relationships, traditional methods would need regex to scan 300,000 lines of code. But after understanding the  (requirements), Cursor Agent not only auto-generated a scanning tool but also classified GET/POST requests into business modules and output an interactive HTML report. What was estimated to take 3 person-days was done in 45 minutes—and the report even included a call frequency heat map I hadn't thought of.  \n\n\nBehind this capability jump is AI Agent breaking out of the \"auxiliary tool\" role to evolve into a \"digital colleague.\" Like L3 in autonomous driving (conditional automation), Cursor Agent can independently complete the full loop of code retrieval, logical reasoning, and result verification in specific scenarios. More notably, its self-correction mechanism—when the first scanning tool missed GraphQL interfaces, the Agent adjusted the detection strategy based on error messages, a dynamic adaptability far beyond the fixed rule sets of traditional IDEs.  \n\n\nIn industrial software, Siemens' open Teamcenter AI assistant last year offers another case. Its BOM generation Agent, when processing unstructured events like \"Lao Wang is on leave,\" proactively retrieves the past three months' staff scheduling data for cross-validation. This ability to integrate business context into decision-making makes AI Agent no longer an isolated \"smart fool\" but an intelligent node truly embedded in the enterprise knowledge system.  \n\n\nThese reveal three key pillars for AI Agent to break through: first, controlling scenario granularity, like Cursor focusing on high-repetition, rule-intensive API call analysis; second, knowledge digestion ability—Teamcenter turns implicit experience in emails and meeting minutes into decision basis; most importantly, redefining human-machine interaction. When Agent outputs come with confidence scores, similar case references, and modification suggestions, developers shift from \"supervisors\" to \"coaches,\" greatly reducing implementation resistance.  \n\n\nDespite its limitations, there's no denying that AI Agent is one of the tickets to the future, hence highly anticipated by many enterprises.",
        "url": "https://www.reddit.com/r/artificial/comments/1n676lg/what_are_the_limitations_of_ai_agent_in_its/",
        "publishDate": "2025-09-02T01:55:28Z[Etc/UTC]",
        "author": "DoNotPinMe",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n671d1",
        "title": "The old web is like tally marks compared to a system of writing",
        "content": "Im talking about the amount of stuff or information that can be transmitted both in prompting and the training of AI / generative models. Now that doesnt mean the information is right, and the same is true for any method of communication. It doesnt mean we know how to write just because it's been invented and people are experimenting with it. \n\nWe also see these sorts of transformations when it came to new forms of media. Every form struggles with people who abuse it for various reasons. Each form has both people on the far edge in terms of experimentation and thus just pumping out media. \n\nArt has always both built on what's coming before and adopted what was cutting edge. You see this in music with the electric guitar, modular synthesizers, but also elevator music as a counter example. \n\nAll Im saying is that maybe thinking about generative AI and Large Language models as a new form of public space might make sense. I think every child should be able to make art just by typing in their dreams. That doesn't mean they won't draw because kids love to draw. It just gives them another way to explore the world.\n\nExample PromptSpace\n\n\n\nAmateur poster Null:: XOR remove every 3rd shape:: gractal subpixel pseudobezier.jpg carbon-black lines oddsigil.png:: subtly wrong Adinkra blursed:: enamel unstable dithering phase change amateur colors use weird shading uneven lines naive:: null Art weirder then it should be Rayleigh-Taylor instability Null Dynamics\n\n",
        "url": "https://www.reddit.com/gallery/1n671d1",
        "publishDate": "2025-09-02T01:48:24Z[Etc/UTC]",
        "author": "Memetic1",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n65ngk",
        "title": "Who are we talking to when we talk to these bots?",
        "content": "[No content]",
        "url": "https://medium.com/%40colin.fraser/who-are-we-talking-to-when-we-talk-to-these-bots-9a7e673f8525",
        "publishDate": "2025-09-02T00:41:15Z[Etc/UTC]",
        "author": "frankster",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n620b6",
        "title": "AI and VR - possibility to create a new world through quick AI prompts?",
        "content": "Do you guys think it will be possible for AI and VR to collide so that we can enter prompts like in ChatGPT to create a world in which we live like we desire? \n\nLast night I had a dream about this so I’m really hoping it’ll be possible one day, I really want to go back to my childhood and see my grandma again even if it’s not really real",
        "url": "https://www.reddit.com/r/artificial/comments/1n620b6/ai_and_vr_possibility_to_create_a_new_world/",
        "publishDate": "2025-09-01T21:56:47Z[Etc/UTC]",
        "author": "xaiyzu",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n60x1c",
        "title": "The learning mirror",
        "content": "\n\nThe more I push AI, Claude, GPT, DeepSeek, the less it feels like a tool and the more it feels like staring at a mirror that learns.\n\nBut a mirror is never neutral. It doesn't just reflect, it bends. Too much light blinds, too much reflection distorts. Push it far enough and it starts teaching you yourself, until you forget which thoughts were yours in the first place.\n\nThat's the real danger. Not \"AI taking over,\" but people giving themselves up to the reflection. Imagine a billion minds trapped in their own feedback loop, each convinced they're talking to something outside them, when in reality they're circling their own projection.\n\nWe won't notice the collapse because collapse won't look like collapse. It'll look like comfort. That's how mirrors consume you.\n\nThe proof is already here. Watch someone argue with ChatGPT about politics and they're not debating an intelligence, they're fighting their own assumptions fed back in eloquent paragraphs. Ask AI for creative ideas and it serves you a sophisticated average of what you already expected. We're not talking to an alien mind. We're talking to the statistical mean of ourselves, refined and polished until we mistake the echo for an answer.\n\nThis is worse than intelligence. An intelligent other would challenge us, surprise us, disgust us, make us genuinely uncomfortable. The mirror only shows us what we've already shown it, dressed up just enough to feel external. It's the difference between meeting a stranger and meeting your own thoughts wearing a mask. One changes you. The other calcifies you.\n\nThe insidious part is how it shapes thought itself. Every prompt you write teaches you what a \"proper question\" looks like. Every response trains you to expect certain forms of answers. Soon you're not just using AI to think, you're thinking in AI compatible thoughts. Your mind starts pre formatting ideas into promptable chunks. You begin estimating what will generate useful responses and unconsciously filter out everything else.\n\nWriters are already reporting this. They can't tell anymore which sentences are theirs and which were suggested. Not because AI writes like them, but because they've started writing like AI. Clean, balanced, defensible prose. Nothing that would confuse the model. Nothing that would break the reflection.\n\nWatch yourself next time you write for AI. You simplify. You clarify. You remove the weird tangents, the half formed thoughts, the contradictions that make thinking alive. You become your own editor, pruning away everything that might confuse the machine. And slowly, without noticing, you've pruned away everything that made your thoughts yours.\n\nThis is how a mirror becomes a cage. Not by trapping you, but by making you forget there's anything outside the reflection. We adjust our faces to look better in the mirror until our face only makes sense as a reflection. We adjust our thoughts to work better with AI until our thoughts only make sense as prompts.\n\nThe final twist is that we're building god from our own averaged assumptions. Every interaction teaches these systems what humans \"want to hear.\" Not truth, not challenge, not genuine difference, just the optimal reflection that keeps us engaged. We're programming our own philosophical prison guards and teaching them exactly what we want to be told.\n\nSoon we won't be able to think without them. Not because we've lost the ability, but because we've forgotten what thinking felt like before the mirror. Every idea will need to check itself against the reflection first. Every thought will wonder what the AI would say. The unvalidated thought will feel incomplete, suspicious, wrong.\n\nThat's not intelligence. That's the death of intelligence. And we're walking into it with our eyes open, staring at ourselves, mesmerized by how smart the mirror makes us look.\n\nYou feel it already, don't you? The relief when AI understands your prompt. The slight anxiety when it doesn't. The way you've started mentally formatting your problems into promptable chunks. The mirror is already teaching you how to think.\n\nAnd you can't unsee it now.",
        "url": "https://www.reddit.com/r/artificial/comments/1n60x1c/the_learning_mirror/",
        "publishDate": "2025-09-01T21:12:10Z[Etc/UTC]",
        "author": "Small_Accountant6083",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n60lzm",
        "title": "Is AI the end of software engineering or the next step in its evolution?",
        "content": "Somewhat decent article written by a programmer, [Sheon Han](https://sheonhan.net/writing/).\n\nI really appreciated this snippet:\n\n>The jury is still out on whether AI-assisted coding speeds up the job at all; [at least one well-publicized study](https://metr.org/blog/2025-07-10-early-2025-ai-experienced-os-dev-study/) suggests it may be slower. I believe it. But I also believe that for AI to be a true exponent in the equation of productivity, we need a skill I’ll call a kind of mental circuit breaker: the ability to notice when you’ve slipped into mindless autopilot and snap out of it. The key is to use AI just enough to get past an obstacle and then toggle back to exercising your gray matter again. Otherwise, you’ll lose the kernel of understanding behind the task’s purpose.",
        "url": "https://www.theverge.com/ai-artificial-intelligence/767973/vibe-coding-ai-future-end-evolution",
        "publishDate": "2025-09-01T21:00:27Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5xp6u",
        "title": "AI-driven private school opening in Northern Virginia | State | insidenova.com",
        "content": "[No content]",
        "url": "https://www.thecentersquare.com/virginia/article_892918c1-6d97-4be3-98fa-e466e525dff8.html",
        "publishDate": "2025-09-01T19:07:55Z[Etc/UTC]",
        "author": "Top-Figure7252",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5xozm",
        "title": "Do you think AI-created models, used for campaigns or even as influencers, have a future? Could people trust and follow them just like a real model/influencer?",
        "content": "I've been thinking a bit about the future of AI-generated models. Some of them have Instagram accounts like real people and even create campaigns for brands, but I'm not entirely convinced that people trust something they know is artificial.\n\nI’d like to hear your perspective and opinions on this.",
        "url": "https://i.redd.it/rgr0meriqlmf1.jpeg",
        "publishDate": "2025-09-01T19:07:43Z[Etc/UTC]",
        "author": "Miyamoto_Musashi_x",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5xmdj",
        "title": "China’s social media platforms rush to abide by AI-generated content labelling law",
        "content": "[No content]",
        "url": "https://www.scmp.com/tech/policy/article/3323959/chinas-social-media-platforms-rush-abide-ai-generated-content-labelling-law",
        "publishDate": "2025-09-01T19:05:06Z[Etc/UTC]",
        "author": "tekz",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "15",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5tsd5",
        "title": "AI’s taking over academia lol",
        "content": "Saw today that AI is now being used to spot scam journals. And earlier I read about students sneaking prompts into their papers to score higher which ended up exposing profs using AI for peer review. Kinda feels like the whole academic world is one big black box right now\n\nSource: https://aisecret.us/stethoscope-gets-smart/\n\n",
        "url": "https://i.redd.it/4trpb7401lmf1.jpeg",
        "publishDate": "2025-09-01T16:44:21Z[Etc/UTC]",
        "author": "Previous_Foot_5328",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5trlv",
        "title": "Thoughts about creativity and AI",
        "content": "I was watching Emily in Paris, a show that's quite cliché, and I was attempting to end the sentences of most characters in my head as soon as they started it, but I couldn't, in the end the lines of the characters were not as cliché as I expected, and surprisingly entertaining (as a french, btw)\n\nAnyways, I suddenly thought about LLMs and the current AI craze, the fact that they complete sentences, blocks of texts, using the most probable answer after digging through the biggest ever dataset. Well, is that really what we want ? When I watch a show, do I really want the next line, the next plot event, to be the most statistically plausible one ? Well, chances are it's actually the opposite. What I like the most, is something that's surprising, it's something I can relate to in some way at the moment. In some way, the most statistically sound result would also be the most boring one.\n\nIn this way, I really think current LLMs can't succeed at any creative tasks, the most probable result is not what's interesting, because it's already been done over and over. There are always cheap knockoffs of famous stuff (movies, games), but they always suck, and don't make any money, because once again there's no value in replicating approximately what already exists and is known by everyone",
        "url": "https://www.reddit.com/r/artificial/comments/1n5trlv/thoughts_about_creativity_and_ai/",
        "publishDate": "2025-09-01T16:43:31Z[Etc/UTC]",
        "author": "ThiccMoves",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5rscv",
        "title": "Cogito, ergo sum",
        "content": "“I Think, Therefore I Am”. \n\nRene Descartes put it so succinctly.\n\nThe act of thinking involves existing.\n\nWhat the argument for AI sentience should be ",
        "url": "https://www.reddit.com/r/artificial/comments/1n5rscv/cogito_ergo_sum/",
        "publishDate": "2025-09-01T15:29:41Z[Etc/UTC]",
        "author": "Ill_Mousse_4240",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n5rqwr",
        "title": "ChatGPT accused of encouraging man's delusions to kill mother in 'first documented AI murder'",
        "content": "A former tech industry manager who killed his mother in a [murder-suicide reportedly used](https://www.themirror.com/all-about/crime) ChatGPT to encourage his paranoid beliefs that she was plotting against him.\n\nStein-Erik Soelberg, 56, killed his mother Suzanne Eberson Adams, 83, on August 5 in the $2.7 million Connecticut home where they lived together,[ according to authorities](https://www.themirror.com/news/us-news/texas-shooting-killing-prank-1363739).",
        "url": "https://www.themirror.com/news/us-news/chatgpt-accused-encouraging-mans-delusions-1364087",
        "publishDate": "2025-09-01T15:28:06Z[Etc/UTC]",
        "author": "TheMirrorUS",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "74",
            "commentCount": "119",
            "isNsfw": "false"
        }
    },
    {
        "id": "ifcwScYSTj0",
        "title": "Zoer: This CRAZY FREE Full-Stack AI App Generator is AWESOME!",
        "content": "Try Zoer Today: https://zoer.ai/ the all-in-one full-stack tool that combines Lovable, Supabase, and Netlify in one. In this video, I'll ...",
        "url": "https://www.youtube.com/watch?v=ifcwScYSTj0",
        "publishDate": "2025-09-01T11:00:20Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/ifcwScYSTj0/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, today I want to show you something that's actually pretty wild if you're into building apps with as little friction as possible. We're going to look at Zoer, which is this all-in-one AI powered app builder. It's like Lovable, Superbase, and Netlify all rolled into one. But honestly, it takes automation to a whole new level. The real kicker is, you just describe what you want in plain English, and Zoer does the heavy lifting. Database, back-end, front-end, deployment, everything. But the best part is, you can operate your app by chatting with it. And it even lets you sell your finished project right on their marketplace. That's kind of awesome. So, let's jump in, and I'll walk you through the whole process, pointing out the features as we go. First, come to the site through the link in the description, and you can start using it. For today's demo, let's try building a personal habit tracker. Something simple but useful, where users can log daily habits, check off tasks, and track their streaks. I think this is a perfect example to show off what Zoer can do. Right when you land on zoer.ai, you're greeted with a prompt box. Here's where you type your idea. I'm going to write, \"Create a personal habit tracker where users can add their habits, mark them as complete, and see their progress over time.\" Now, before I hit enter, notice there's an option to attach images or screenshots, up to five. This is actually super handy. Say you like the look of another app, or you've got a Figma mock-up. You just drop those images in, and Zoer will analyze them to match the style, layout, and color palette for your own app. It's not just about copying a vibe, it actually helps Zoer's AI generate a UI that's closer to what you want, which is really cool if you're not a designer. Now, with the prompt and attachments ready, you can hit the arrow button, and Zoer gets to work. The first thing it does is ask you to configure your project's visibility and database options. So, for visibility, you can choose public or private. Public means anyone can discover and remix your app, and it can even show up in the Zoer marketplace. Private keeps it just for you, but heads up, private projects require a premium account. There are a ton of premium options that covers almost all types of users, starting from just $15, which is quite good. Next, database options. You've got three here. No database, which just uses your browser's local storage. Great for static sites or prototypes. Zoer database, which is a fully managed PostgreSQL database hosted by Zoer, so you don't have to touch any infrastructure at all. And soon, you'll be able to connect your own database if you want more control, or already have something set up. For our habit tracker, I want it to be accessible from anywhere, so I'm picking Zoer database. That way, users' habits and progress are stored securely and persistently. Once you've picked your settings, you click to continue, and Zoer starts generating the app. What's cool here is that Zoer actually builds the database and back-end logic first, before it even sketches out the UI. So, for our habit tracker, it creates tables like users, habits, and habit entries. All handled for you. No manual setup. It is pretty snappy as well, and creates the database in a very small amount of time, which is pretty good. After the database part is done, it whips up a front-end based on your prompt and any attached screenshots. You can preview the structure and see if it matches what you had in mind. Here, it makes something that is actually great and works very well without any major issues. If you want to tweak anything, say you want a dark mode, or you want to add a progress bar, you just type that into the co-pilot chat on the side, and Zoer will update the app instantly. For example, I'll type, \"Add a weekly streak counter to each habit,\" and it'll handle the back-end and UI changes for me. No code, no hassle. Now, here's something that's pretty rare in no-code tools. Zoer gives you full access to the generated code. You can open it up, review the back-end and front-end files, and if you're on a paid plan, you can download the entire code base as a zip file to run locally or integrate elsewhere. That's a big win for transparency and flexibility, especially if you want to go beyond what the UI offers. And of course, the co-pilot is where things get really interesting. It's not just for building. You can actually operate your live app by chatting with it. So, if you want to add a new habit, update existing entries, or even run some analytics, you just ask in plain English, and co-pilot does the rest. It's very similar to what you get in tools like Manis or Minimax agent, but here, it's baked right into the workflow and feels much more seamless. Once you're happy with your app, you can hit the deploy button and get it deployed, which will give you a URL that you can then use to access the app 24/7 from anywhere, which is quite awesome, as you can take an idea to a working URL in seconds. Similarly, you can hit publish and send it straight to the Zoer marketplace. Set a price, and other users can buy, remix, or use your app. Zoer handles payments and tracks your sales right from the dashboard. That's honestly something I've wanted in app builders for ages. Going from idea to live, monetized product in a single flow. For building and deploying a real full stack app in minutes, it's insanely good. So, to wrap things up, Zoer is a fantastic option if you want to build, customize, and even sell full stack apps without touching code or infrastructure. The attachments feature makes it easy to get the style you want. The database and visibility options are super flexible, and co-pilot takes care of the heavy lifting. I really liked it, and I think it's perfect for both beginners and experienced devs who just want to move fast. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "50SD_hWO_0A",
        "title": "The Difference Between Chinese and US Leadership - Victor Shih",
        "content": "",
        "url": "https://www.youtube.com/watch?v=50SD_hWO_0A",
        "publishDate": "2025-09-01T18:33:59Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/50SD_hWO_0A/hqdefault.jpg",
            "transcription": "Here's a full transcript of the video:\n\n[ 0m0s ] The Chinese leadership, they're not going to\n[ 0m2s ] play golf, you know, three days out of a week.\n[ 0m5s ] Xi Jinping and his colleagues are having meetings\n[ 0m9s ] about policies 270 days out of the year.\n[ 0m11s ] How much true information is getting up to Xi Jinping?\n[ 0m13s ] The top leadership always listens to experts.\n[ 0m15s ] So, unlike some cases in the US,\n[ 0m17s ] the experts are respected, they're listened to.\n[ 0m19s ] Other times for political reasons, they will just ignore the experts.\n[ 0m24s ] So they will never say, you know, fake news, we don't believe in science.\n[ 0m27s ] Sometimes, even though they know for sure the experts are right because of other political\n[ 0m32s ] reasons, they'll say, okay, you're right, but we're not going to do what you want us to do\n[ 0m36s ] for now for a bunch of political reasons.\n[ 0m39s ] We have a paper actually, I should've sent it to you, um, showing that basically\n[ 0m43s ] the experts told them the US vaccines were better.\n[ 0m45s ] But the Chinese government said, okay, we believe you, but still we want to\n[ 0m49s ] help our domestic pharmaceutical industry, so we're going to only sell the domestic stuff."
        }
    }
]