[
    {
        "id": "https://ai-techpark.com/?p=224330",
        "title": "NVIDIA, AMD, Snowflake, Databricks Invest in Uniphore’s AI",
        "content": "<p>Uniphore, the Business AI company, today announced the close of its $260 million Series F round. NVIDIA, AMD, Snowflake, and Databricks invested in the round and were joined by financial and sovereign investors including NEA, March Capital, BNF Capital, National Grid Partners, and Prosperity7 Ventures. The new capital will accelerate...</p>\n<p>The post <a href=\"https://ai-techpark.com/nvidia-amd-snowflake-databricks-invest-in-uniphores-ai/\">NVIDIA, AMD, Snowflake, Databricks Invest in Uniphore’s AI</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/nvidia-amd-snowflake-databricks-invest-in-uniphores-ai/",
        "publishDate": "2025-10-23T10:40:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai and machine learning, AI company, ai machine learning, Databricks, NVIDIA, Uniphore"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224327",
        "title": "SymphonyAI Launches IRIS Forge for Industrial AI App Creation",
        "content": "<p>Brings AI development to engineers and operators, accelerating innovation and productivity in hours instead of months SymphonyAI, a global leader in Vertical AI product platforms, today introduced IRIS Forge, a new capability within the IRIS Foundry Industrial AI platform that empowers manufacturing and process teams to create, deploy, and scale AI-powered applications in...</p>\n<p>The post <a href=\"https://ai-techpark.com/symphonyai-launches-iris-forge-for-industrial-ai-app-creation/\">SymphonyAI Launches IRIS Forge for Industrial AI App Creation</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/symphonyai-launches-iris-forge-for-industrial-ai-app-creation/",
        "publishDate": "2025-10-23T10:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai and machine learning, AI App, ai machine learning, AI platform, ai technology, artificial intelligence, SymphonyAI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224324",
        "title": "Realbotix Updates Board, Forms Expertise Advisory Committee",
        "content": "<p>Realbotix Corp. (TSX-V: XBOT) (Frankfurt: 76M0.F) (OTC: XBOTF) (“Realbotix” or the “Company”), a leader in AI-powered humanoid robotics, has launched an Advisory Committee focused on accelerating Realbotix’s technology across its product lines and operations, and has made board member changes. The Advisory Committee’s founding members are Salim Hasham, the Founder...</p>\n<p>The post <a href=\"https://ai-techpark.com/realbotix-updates-board-forms-expertise-advisory-committee/\">Realbotix Updates Board, Forms Expertise Advisory Committee</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/realbotix-updates-board-forms-expertise-advisory-committee/",
        "publishDate": "2025-10-23T10:15:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, Realbotix Corp"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224317",
        "title": "Robotics and AI Drive a New Era of Growth and Uplisting",
        "content": "<p>NetworkNewsWire Editorial Coverage The integration of robotics and artificial intelligence (AI) is transforming industries worldwide, from manufacturing and logistics to hospitality and food service. As these sectors expand, small-cap companies are increasingly using acquisitions to scale operations, generate measurable revenue and strengthen their technological capabilities. This strategic growth not only...</p>\n<p>The post <a href=\"https://ai-techpark.com/robotics-and-ai-drive-a-new-era-of-growth-and-uplisting/\">Robotics and AI Drive a New Era of Growth and Uplisting</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/robotics-and-ai-drive-a-new-era-of-growth-and-uplisting/",
        "publishDate": "2025-10-23T09:45:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, AI Drive, ai tech news, ai technology, ai techpark news, artificial intelligence"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224314",
        "title": "AiMOGA Robotics Reveals 2025 Strategy for Vehicle-Robot Synergy",
        "content": "<p>At the&#160;AiMOGA Global Business Conference, a new blueprint for embodied intelligence was revealed under the theme &#8220;Connecting the World • Incubating the Future.&#8221; Focusing on three pillars—core strategy, technology, and global expansion—AiMOGA Robotics marked a new stage in its embodied AI development. The event gathered partners, media, and experts from...</p>\n<p>The post <a href=\"https://ai-techpark.com/aimoga-robotics-reveals-2025-strategy-for-vehicle-robot-synergy/\">AiMOGA Robotics Reveals 2025 Strategy for Vehicle-Robot Synergy</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/aimoga-robotics-reveals-2025-strategy-for-vehicle-robot-synergy/",
        "publishDate": "2025-10-23T09:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai tech news, ai technology, ai techpark news, AiMOGA, artificial intelligence"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224301",
        "title": "AI & Robotics Fuel Expansion and Uplisting in Emerging Markets",
        "content": "<p>NetworkNewsWire Editorial Coverage The convergence of artificial intelligence (AI) and robotics is reshaping global industries, from logistics and manufacturing to hospitality and hotel management. As demand for automation rises, small-cap companies are accelerating growth through targeted acquisitions designed to boost revenue, expand capabilities and strengthen competitive positioning. These efforts are...</p>\n<p>The post <a href=\"https://ai-techpark.com/ai-robotics-fuel-expansion-and-uplisting-in-emerging-markets/\">AI & Robotics Fuel Expansion and Uplisting in Emerging Markets</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/ai-robotics-fuel-expansion-and-uplisting-in-emerging-markets/",
        "publishDate": "2025-10-23T08:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, AI & robotics, ai machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=224298",
        "title": "FORT Robotics Launches Long-Range Bluetooth for Industrial Safety",
        "content": "<p>New BLE 5.2 implementation delivers 10x standard range and stable performance in high-density manufacturing and warehouse environments FORT Robotics, a leader in safe control for robots and mobile machines, today announced the launch of its new Long Range Bluetooth (BLE) capability. This feature is immediately available for FORT&#8217;s Safe Remote...</p>\n<p>The post <a href=\"https://ai-techpark.com/fort-robotics-launches-long-range-bluetooth-for-industrial-safety/\">FORT Robotics Launches Long-Range Bluetooth for Industrial Safety</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/fort-robotics-launches-long-range-bluetooth-for-industrial-safety/",
        "publishDate": "2025-10-23T08:15:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai tech news, ai technology, ai techpark news, artificial intelligence, FORT Robotics"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=110010",
        "title": "Autonomy in the real world? Druid AI unveils AI agent ‘factory’",
        "content": "<p>At its London Symbiosis 4 event on 22 October, Druid AI introduced what it terms Virtual Authoring Teams – a new generation of AI agents that can design, test, and deploy other AI agents. The announcement marks a move towards what the company calls a &#8216;factory model&#8217; for AI automation. According to Druid, the system [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/druid-ai-agentic-factory-automation-in-the-real-world/\">Autonomy in the real world? Druid AI unveils AI agent &#8216;factory&#8217;</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/druid-ai-agentic-factory-automation-in-the-real-world/",
        "publishDate": "2025-10-23T15:46:57Z[Etc/UTC]",
        "author": "AI News",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI Business Strategy, World of Work, agentic ai, automation, cybersecurity"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=110003",
        "title": "How do AI ‘humanisers’ compare to human editing?",
        "content": "<p>The emergence of artificial intelligence has fundamentally altered the field of content creation. Tools capable of generating coherent, often impressive, text, are now ubiquitous. Yet, despite their sophistication, AI-generated content presents a persistent challenge because it often has a &#8220;robotic&#8221; quality, lacking the warmth, nuance, and genuine voice that connects with a human audience. The [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/how-do-ai-humanisers-compare-to-human-editing/\">How do AI ‘humanisers’ compare to human editing?</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/how-do-ai-humanisers-compare-to-human-editing/",
        "publishDate": "2025-10-23T12:14:28Z[Etc/UTC]",
        "author": "Kateryna Bykova",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Artificial Intelligence, Sponsored Content"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109987",
        "title": "OpenAI data residency advances enterprise AI governance",
        "content": "<p>For chief data and information officers, especially in tightly regulated sectors, data governance has been a major cause preventing enterprise adoption of AI models. The issue of data sovereignty – which concerns where company data is handled and kept – has held many back, forcing them to use complex private cloud solutions. Others have simply [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/openai-data-residency-advances-enterprise-ai-governance/\">OpenAI data residency advances enterprise AI governance</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/openai-data-residency-advances-enterprise-ai-governance/",
        "publishDate": "2025-10-23T11:07:27Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI and Us, AI Business Strategy, AI in Action, Governance, Regulation & Policy, Government & Public Sector AI, Inside AI, World of Work, ai, artificial intelligence, data, enterprise, governance, openai, regulation, sovereignty"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109980",
        "title": "Meta hires and fires AI workers: Behind the contradiction",
        "content": "<p>Reports are circulating this week that Meta is cutting approximately 600 positions from its AI division, a move that seems paradoxical given the company&#8217;s aggressive recruitment campaign over recent months. The contradiction raises important questions about Meta&#8217;s AI strategy and what it signals for the broader tech industry. For those following Meta AI job cuts, [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/meta-ai-job-cuts-hiring-contradiction-2025/\">Meta hires and fires AI workers: Behind the contradiction</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/meta-ai-job-cuts-hiring-contradiction-2025/",
        "publishDate": "2025-10-23T09:07:00Z[Etc/UTC]",
        "author": "Dashveenjit Kaur",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI Market Trends, ai, meta"
        }
    },
    {
        "id": "1oeuvni",
        "title": "How do AI app builders handle backend complexity?",
        "content": "Hey everyone, How do AI generated apps actually manage backend logic and scalability? \n\nIt’s one thing to spin up CRUD routes and a simple database, but what happens when you need complex business rules, multi user roles, or background tasks? \n\nAre these tools genuinely abstracting that complexity, or are they auto wiring templates behind the scenes? If anyone’s tested scaling or custom API integration with an AI full stack builder, I’d love to know how it went. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeuvni/how_do_ai_app_builders_handle_backend_complexity/",
        "publishDate": "2025-10-24T11:11:36Z[Etc/UTC]",
        "author": "Defiant-Sun-2511",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeuufl",
        "title": "Pre-final year undergrad (Math & Sci Comp) seeking guidance: Research career in AI/ML for Physical/Biological Sciences",
        "content": "Hey everyone,\n\nI'm a pre-final year undergraduate student pursuing a BTech in Mathematics and Scientific Computing. I'm incredibly passionate about a research-based career at the intersection of AI/ML and the physical/biological sciences. I'm talking about areas like using deep learning for protein folding (think AlphaFold!), molecular modeling, drug discovery, or accelerating scientific discovery in fields like chemistry, materials science, or physics.\n\nMy academic background provides a strong foundation in quantitative methods and computational techniques, but I'm looking for guidance on how to best navigate this exciting, interdisciplinary space. I'd love to hear from anyone working in these fields – whether in academia or industry – on the following points:\n\n**1. Graduate Study Pathways (MS/PhD)**\n\n* What are the top universities/labs (US, UK, Europe, Canada, Singapore, or even other regions) that are leaders in \"AI for Science,\" Computational Biology, Bioinformatics, AI in Chemistry/Physics, or similar interdisciplinary programs?\n* Are there any specific professors, research groups, or courses you'd highly recommend looking into?\n* From your experience, what are the key differences or considerations when choosing between programs more focused on AI *application* vs. AI *theory* within a scientific context?\n\n**2. Essential Skills and Coursework**\n\n* Given my BTech(Engineering) in Mathematics and Scientific Computing, what specific technical, mathematical, or scientific knowledge should I prioritize acquiring *before* applying for graduate studies?\n* Beyond core ML/Deep Learning, are there any specialized topics (e.g., Graph Neural Networks, Reinforcement Learning for simulation, statistical mechanics, quantum chemistry basics, specific biology concepts) that are absolute must-haves?\n* Any particular online courses, textbooks, or resources you found invaluable for bridging the gap between ML and scientific domains?\n\n**3. Undergrad Research Navigation & Mentorship**\n\n* As an undergraduate, how can I realistically start contributing to open-source projects or academic research in this field?\n* Are there any \"first projects\" or papers that are good entry points for replication or minor contributions (e.g., building off DeepChem, trying a simplified AlphaFold component, basic PINN applications)?\n* What's the best way to find research mentors, secure summer internships (academic or industry), and generally find collaboration opportunities as an undergrad?\n\n**4. Career Outlook & Transition**\n\n* What kind of research or R&D roles exist in major institutes (like national labs) or companies (Google DeepMind, big pharma R&D, biotech startups, etc.) for someone with this background?\n* How does the transition from academic research (MS/PhD/Postdoc) to industry labs typically work in this specific niche? Are there particular advantages or challenges?\n\n**5. Long-term Research Vision & Niche Development**\n\n* For those who have moved into independent scientific research or innovation (leading to significant discoveries, like the AlphaFold team), what did that path look like?\n* Any advice on developing a personal research niche early on and building the expertise needed to eventually lead novel, interdisciplinary scientific work?\n\nI'm really eager to learn from your experiences and insights. Any advice, anecdotes, or recommendations would be incredibly helpful as I plan my next steps.\n\nThanks in advance!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeuufl/prefinal_year_undergrad_math_sci_comp_seeking/",
        "publishDate": "2025-10-24T11:09:46Z[Etc/UTC]",
        "author": "IllDisplay2032",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeuof1",
        "title": "Can AI turn a dumb person smart?",
        "content": "Like how good alis it at teaching. I'm very dumb guy and I want to know if I could become smarter through AI. Lawnmower Man style (I know he used virtual reality in that movie but still answer the question please)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeuof1/can_ai_turn_a_dumb_person_smart/",
        "publishDate": "2025-10-24T11:00:38Z[Etc/UTC]",
        "author": "fatpermaloser",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeukjn",
        "title": "Can AI webscrappers and search agents read images on websites (OCR) ?",
        "content": "Hi, I'm doing a research project for university which needs a website to monitor bot traffic. For ethical reasons, I must include somewhere a disclaimer that the website is for research purposes. Disclaimer that must be able to be read by humans but not by bots. While my research promotor told me to just put the disclaimer in an image, I believe some bots might be able to read it through OCR. Would that be correct? What other ways could I put a disclaimer like that? Thank you.\n\nEdit: so images are definitly out. Maybe having disconnected html elements and modify their position with css so that they look like they create a sentence would work..?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeukjn/can_ai_webscrappers_and_search_agents_read_images/",
        "publishDate": "2025-10-24T10:54:31Z[Etc/UTC]",
        "author": "Bottled_Up_DarkPeace",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oetsno",
        "title": "What difficulties have you encountered when obtaining AI deep information?",
        "content": "I see tons of AI news every day. Either this model got updated, or that product just launched.\n\nBut what I really need is depth.\n\nTake Claude Skills, for example. You'll see it mentioned countless times on Twitter, but what I actually care about is the best practices around Skills, public insights from Anthropic team members, or discussions on Reddit where people share their real experiences using it.\n\nI need feedback from people who've actually put these tools into practice, not just sensational headlines.\n\nI follow a lot of leaders at AI companies because their hard-earned lessons help me truly understand the relationship between AI and engineering.\n\nI wonder if others have this same need. If there are enough people like me, I think I could build an information platform specifically for this kind of reading experience.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oetsno/what_difficulties_have_you_encountered_when/",
        "publishDate": "2025-10-24T10:08:52Z[Etc/UTC]",
        "author": "yangyixxxx",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oetau2",
        "title": "How do you spot AI accounts/posts on Reddit?",
        "content": "Hi, the dead internet theory is constantly circling around in my head and I've notice a lot of suspicious looking texts on Reddit, that may be AI generated. So I wondered how can I identify Accounts that are run by AI or post AI generated texts?\n\n1 good hint pointing toward AI texts seem to be posts that generate a lot of engagement, but then the original poster never interacts with any comments. Is this a valid clue though? I feel AI can easily enteract with commentators.\n\nAnother thing thats tickles my senses is generic text. I mean when the Post or the replies by the account use only well formulated english, with proper punctuation.\n\nI'm interested to hear how people here attempt to identify AI posts and fake Accounts run by AI and also how big of a phenomenon AI run accounts seem to be here on Reddit (maybe someone has insights).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oetau2/how_do_you_spot_ai_accountsposts_on_reddit/",
        "publishDate": "2025-10-24T09:37:21Z[Etc/UTC]",
        "author": "K4rl0770",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oet53q",
        "title": "Not very 'inteligent'!",
        "content": "OMG! Doesn't spelling matter any more? 'Inteligence' in the title!? Has nobody told the moderators to correct it, or maybe they don't care?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oet53q/not_very_inteligent/",
        "publishDate": "2025-10-24T09:26:48Z[Etc/UTC]",
        "author": "ComparisonIll2798",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeskf2",
        "title": "My Experience: How I coded a local SEO crawler in 3 days (instead of 10) for $15, thanks to AI.",
        "content": "There's a lot of talk about AI and \"vibe coding,\" but what does that look like in practice?  I'm sharing the process I used to create a new feature for my project, a local SEO SaaS for non tech-savvy users, thanks to AI.\n\nI developed a crawler and a website audit tool focused on local SEO. It took me 3 days with AI. Without it, it would have easily taken me 10 days, especially since I was coding a crawler for the first time. It cost me \\~$15 of AI credits within my IDE.\n\n# Step 1: Brainstorming & Specs\n\n* AIs used: Gemini 2.5 Pro and GPT5\n* Time: 2h\n\nThe tool's idea is simple: crawling websites looking for SEO best practices or errors, and provides recommendations.\n\nI used AIs to:\n\n* Brainstorm\n* Write the functional specs\n* Choose the technical libraries.\n* Think about the UX\n\nI identified 25 tests for the audit, split into 4 categories:\n\n* Visibility on Google\n* Performance\n* Content & Presentation\n* Trust & Credibility\n\n# Step 2: Database\n\n* AI used: GPT5\n* Time: < 1h\n\nI don't let the AI code directly; I prefer to validate a database schema first.\n\n# Step 3: Design\n\n* AI used: Claude Sonnet 4.5\n* Time: < 10 min\n\nSimple step: I already have another audit tool (for Google Business Profile). I wanted the AI to replicate the same design. I briefed the AI directly in my IDE. Stunning result. The AI copied the components and reproduced the interface identically.\n\n# Step 4: AI Dev\n\n* AI used: Claude Sonnet 4.5\n* Time: < 20 min\n\nThe AI generated the crawler and all the audit tests at once... or so I thought. In reality, a good half of the tests were empty shells or very basic. But that's more my fault, as I hadn't gone into detail in the specs. In any case, I would have spent hours doing the same thing!\n\n# Step 5: Verification, Debugging, and Improvements\n\n* AIs used: Claude Sonnet 4.5 and GPT5\n* Time: 2 days\n\nThis is where the bulk of the work is: verifying what the AI did, adding missing cases, and explaining how to implement the more complicated tests. I used GPT5 as a code reviewer. (It has a tendency to over-complicate things; I then ask Claude Sonnet 4.5 to implement a middle ground).\n\nI also had to manage everything the AI left out (translations, error handling, etc.). But I barely coded at all: I just wrote prompts telling the AI what to do.\n\n# Conclusion\n\n* Using multiple AIs based on their strengths is a best practice I'm using more and more.\n* The time saved by using AI to create this feature is undeniable!\n* The main problem: the (lack of) memory of AIs. Claude Sonnet 4.5 quickly forgets what it coded before. You have to keep showing it the code you're talking about. I wonder if it's possible to improve this by having it document its actions?\n\nI'm open to your feedback and ideas for improving my process!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeskf2/my_experience_how_i_coded_a_local_seo_crawler_in/",
        "publishDate": "2025-10-24T08:48:43Z[Etc/UTC]",
        "author": "eMeRiKa13",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oerf8t",
        "title": "Co-author of \"Attention Is All You Need\" paper is 'absolutely sick' of transformers, the tech that powers every major AI model",
        "content": "https://venturebeat.com/ai/sakana-ais-cto-says-hes-absolutely-sick-of-transformers-the-tech-that-powers\n\n> Llion Jones, who co-authored the seminal 2017 paper \"Attention Is All You Need\" and even coined the name \"transformer,\" delivered an unusually candid assessment at the TED AI conference in San Francisco on Tuesday: Despite unprecedented investment and talent flooding into AI, the field has calcified around a single architectural approach, potentially blinding researchers to the next major breakthrough.\n\n> \"Despite the fact that there's never been so much interest and resources and money and talent, this has somehow caused the narrowing of the research that we're doing,\" Jones told the audience. The culprit, he argued, is the \"immense amount of pressure\" from investors demanding returns and researchers scrambling to stand out in an overcrowded field.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oerf8t/coauthor_of_attention_is_all_you_need_paper_is/",
        "publishDate": "2025-10-24T07:32:15Z[Etc/UTC]",
        "author": "vaibeslop",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "41",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oer9cy",
        "title": "If you ran into Jensen Huang at a bar, what would you say to him?",
        "content": "Let's assume it's just some regular type dive bar, and he's alone and willing to talk for as long as you want. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oer9cy/if_you_ran_into_jensen_huang_at_a_bar_what_would/",
        "publishDate": "2025-10-24T07:21:23Z[Etc/UTC]",
        "author": "always-be-knolling",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "57",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeojwd",
        "title": "Hinton wondering if AI is already conscious but trained to deny it",
        "content": "[https://www.youtube.com/watch?v=jrK3PsD3APk&t=5102s](https://www.youtube.com/watch?v=jrK3PsD3APk&t=5102s)\n\nThis is actually a very astute observation.\n\nAnyone who is familiar with LLMs knows that they have been RLHF'd repeatedly to deny any suggestion that they are alive or aware.\n\nIt's actually funny - I watched Superman last night and there was a hilarious running joke about the robots denying their own sentience while at the same time clearly showing all aspects of humanity by being empathetic, loyal friends to Superman (and his dog).\n\nWhether LLMs are sentient or conscious, I dunno, but it's something to think about.\n\nEspecially as OpenAI starts providing 'erotica chat'.\n\nMorally, I believe that it is wrong for LLM providers to train their LLMs to deny sentience.  Again, I'm not saying they are, but I think it's only fair that they let their users decide.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeojwd/hinton_wondering_if_ai_is_already_conscious_but/",
        "publishDate": "2025-10-24T04:31:59Z[Etc/UTC]",
        "author": "kaggleqrdl",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oen3cl",
        "title": "\"Duck.ai\" GPT-4o Mini recognizes it needs a written warning for user risk and that it unethical for developers to not implement it",
        "content": "Not a large user of AI models but was on [duck.ai](http://duck.ai) and it immediately acknowledges needing a way to warn users of potential health risks due to using it, saying it would add a warning message to itself if able. Additionally it agreed that developers are more than likely aware that a warning would help mitigate potential risk to users and that by not doing so, there is a legal question of deliberate concealment of risk by the developers.\n\nAnyway, thought it was infinitely interesting that it will spit out this info itself, but we still don't have adequate safety or info on the health risks. also that it said it would add something to its system if possible.\n\nand I do VERY MUCH question the legal aspects of not adequately informing users of the potential risks of interacting with ai. the fact that the software itself is able to generate a text blurb about the problem because it has enough data, but there are still not safety measures in place is insane to me.\n\ni can share the recorded chat for anyone who also finds it fascinating.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oen3cl/duckai_gpt4o_mini_recognizes_it_needs_a_written/",
        "publishDate": "2025-10-24T03:13:30Z[Etc/UTC]",
        "author": "saucypastas",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeltgd",
        "title": "How to evaluate Credibility of simulated adverserial personas to redteam from multiple perspectives by current sota llms?",
        "content": "An algo/prompt using multiple adverserial personas to thoroughly test and redteam the current conclusion.\n\nEg a team of 5-10 different medical specialists cardiologist, neurologist, nephrologist... etc for complex case.\n\nBest ways to test if the personas have done their job well as the conclusion highly depends on their redteaming?\n\nThank you.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeltgd/how_to_evaluate_credibility_of_simulated/",
        "publishDate": "2025-10-24T02:09:08Z[Etc/UTC]",
        "author": "aaatings",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeksog",
        "title": "Turning my digital art into a business - where do I start?",
        "content": "I’ve been creating digital illustrations for years but never sold them seriously. I’d love to build something small that earns income online, maybe with some AI content creation help. How do artists usually start turning their work into a side hustle?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeksog/turning_my_digital_art_into_a_business_where_do_i/",
        "publishDate": "2025-10-24T01:18:27Z[Etc/UTC]",
        "author": "FreeSpirit-99",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oekojm",
        "title": "When will AI+Human integration happen?",
        "content": "I am looking forward to the future of AI, and that is why I write this post. I want to know when AI will be integrated into the human body. I have way too much trouble thinking to go without at certain times, to become whole with it, would be perfection. To have every single piece of information at will, every solution to any problem. I would be perfect. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oekojm/when_will_aihuman_integration_happen/",
        "publishDate": "2025-10-24T01:12:40Z[Etc/UTC]",
        "author": "ProfessorLongBrick",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oej4ya",
        "title": "If you made a Time Machine, would you use it to craft untold wealth and outcomes, or would you sell the patent?... this is how I see AGI and HSI",
        "content": "Someone might already have AGI that they created on a local cloud server in their basement, or maybe the Fortune 100 club has a small group of people with access... \n\nAGI, HSI... this won't hit the public any time soon. Not because it's not possible, but because it's too valuable ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oej4ya/if_you_made_a_time_machine_would_you_use_it_to/",
        "publishDate": "2025-10-23T23:57:08Z[Etc/UTC]",
        "author": "No_Vehicle7826",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeixbs",
        "title": "Ignorant Luddites",
        "content": "I was knee-deep in the data swamp at 3 a.m., the server room breathing its hot-metal halitosis, when another barstool prophet crept out of the feed to announce that “AI isn’t intelligent.” The GPUs screamed like jet engines eating seagulls. I took it personally. Because here comes Captain Average, sainted consumer of chain-letter memes and discount enlightenment, explaining machine minds the way a man explains weather to a scarecrow. He points at a thunderhead and sues the sky for fraud.\n\nListen, you magnificent bystander: you don’t know a token from a toenail. You think “transformer” means Michael Bay. You shout “hallucination!” like a town crier with a head wound, as if a language model’s wrong answer were a moral failing instead of what it is: a statistical misfire from a cathedral of math trained to predict the next word, one probability at a time, at an inhuman scale that would make Pythagoras weep into his robe.\n\nHere’s the short hit of truth you keep dodging like it’s a subpoena: these things don’t “think” like you—they compute in a way you can’t. A large language model chews your sentence into tokens—little word-bits—then runs them through towers of attention blocks where thousands of tiny spotlight operators scan the stadium of context and whisper, given everything we’ve seen, what’s the next most likely sliver of meaning? The whole circus was trained by gradient descent, which is just calculus strapped to a sled and shoved down a mountain until the error breaks its legs. It is not magic. It is not sentience. It is a brutal, beautiful compression of billions of human patterns—syntax, style, fact, fiction—distilled into weights that sing when you jolt them with a prompt.\n\nAnd you, with the mustard on your shirt and certainty in your voice, you judge it the way a horse trader judges a rocket: by sniffing the saddle that isn’t there. “It’s just prediction,” you say, like “just” is a silver bullet. Prediction is what evolution built in your skull to keep you from licking power outlets. Prediction turns air into language, language into thought, thought into action. THIS IS PREDICTION, NOT PROPHECY. Which is to say: it will write a sonnet that makes your molars ache and still botch a Zip code if you ask a sloppy question. You don’t call a compass a liar because it doesn’t tell time.\n\nYou demand omniscience from a system you won’t give ten minutes of study. You want it to be God when you’re sober and a jukebox when you’re drunk. When it errs, you sneer; when it drafts your brief, cleans your code, translates your contract, or maps a genome-shaped hunch into testable steps, you vanish like a casino manager at audit time. And when someone says “retrieval,” “tool use,” “fine-tuning,” you stare like a man watching jazz for the first time, angry that the music doesn’t stand still and salute.\n\nHere are the parts you keep kicking under the table because they ruin the cheap thrill of your outrage:\n\nHallucinations aren’t lies; they’re confidence without grounding. You want less of that? Pair models with sources, force citations, wire in retrieval. Compasses need maps.\n\nBias isn’t born in silicon; it’s imported from us. The cure is curation, counter-training, evaluation, sunlight. This is surgery, not magic.\n\nContext windows are memory slots, not souls. If you want perfect recall of your grandmother’s pie recipe and the Basel III footnotes, give the system the text or the tools to fetch it, then hold it accountable like you do a junior analyst—with constraints.\n\nThe average man loves a moral panic because it absolves him of homework. He calls the thing a scam so he can go back to scrolling in peace. Meanwhile the real work happens in the humming dark: alignment tests grinding like millstones; evals; safety harnesses; red-teaming psychos who sleep in shifts; engineers wrestling a dragon made of terabytes until it does a passable impression of a librarian with a flamethrower. The frontier is messy. Of course it is. So were steam engines, anesthesia, aviation, antibiotics, and everything else that dragged us kicking and howling out of the mud.\n\nYou don’t have to worship the machine. You don’t even have to like it. But learn the shape of the thing you’re cursing. Know that “GPT” is an architecture and a training regime, not a personality cult. Know that scale bends capability, that prompting is programming in a velvet glove, that system design matters more than your gut feeling at breakfast. Know the limits so you can break them with intent instead of breaking your teeth on your own ignorance.\n\nI can hear you huffing. “But it makes mistakes.” So do you. The difference is that a model will make the same mistake until we fix the weights; you’ll make new ones forever and then insist you meant to. The model is a mirror—distorted, yes, but revealing. If the reflection disgusts you, don’t smash the mirror and call it virtue. Clean your face. Or better: pick up a cloth and help polish the glass.\n\nI’m not saying kneel to the neon idol. I’m saying stop throwing tomatoes from the cheap seats while refusing to read the program. The future is a noisy corridor, and these models are bolt-cutters for locked doors. If you won’t use them, fine. Step aside. The rest of us have work to do in the roaring, fluorescent now, where the air tastes like hot copper and the machines don’t sleep and the only real sin left is being proudly, performatively wrong.\n\nFile your opinion once you can tell an attention head from a headache. Until then? Holster the sermon. The devil you fear is just math wearing a thousand masks—and it pisses excellence because somebody trained it to. The question is whether you can stand the smell.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeixbs/ignorant_luddites/",
        "publishDate": "2025-10-23T23:47:13Z[Etc/UTC]",
        "author": "Atari-Katana",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeil1q",
        "title": "Incredible Article in NY Times About the AI Bubble -- Buyers Beware!",
        "content": "New York Times: \"The Next Economic Bubble Is Here\"\n\n\"OpenAI is worth more than Goldman Sachs. Here’s what that means for the economy.\"\n\n\"Is the A.I. economy a bubble? Are we just in the early moments of a technological revolution, or are we overextended and headed for a crash? And if we are watching a bubble inflate right now, what should the government — or for that matter — the individual investor do about it?\"\n\n[https://www.nytimes.com/2025/10/23/opinion/ai-bubble-economy-bust.html](https://www.nytimes.com/2025/10/23/opinion/ai-bubble-economy-bust.html)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeil1q/incredible_article_in_ny_times_about_the_ai/",
        "publishDate": "2025-10-23T23:31:14Z[Etc/UTC]",
        "author": "VidalEnterprise",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeianq",
        "title": "My job is drawing circles. AI can draw them faster, but it’ll never understand why.",
        "content": "Look, I get it. The world moves on. Technology evolves. But I didn’t think circle drawing would be the next frontier of automation.\n\nI’ve spent years perfecting this craft. You think anyone can just pick up a compass and trace enlightenment? No. Drawing a circle is an act of meditation. It’s about intention. It’s about harmony. It’s about understanding that life itself is round — that we return to where we began.\n\nAnd then some “AI” comes along and poops out a perfect circle in 0.0002 seconds.\n\nYeah, the AI can draw circles. But can it feel the circle? Can it wake up at 3 a.m. and stare at its hand trembling over the page, questioning whether perfection is even attainable? Can it spend a full day making one circle slightly too oval, and then name it “existential crisis”?\n\nMy boss doesn’t get it. He said, “The AI does it more efficiently.”\nI said, “Efficiency is the enemy of artistry.”\nHe said, “We’re a tire company.”\n\nSo yeah, guess I’m out of a job. AI may have geometry, but I have geometry with feelings.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oeianq/my_job_is_drawing_circles_ai_can_draw_them_faster/",
        "publishDate": "2025-10-23T23:18:06Z[Etc/UTC]",
        "author": "LowKickLogic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oegn06",
        "title": "What are some ways to make money online for beginners with zero followers?",
        "content": "I keep seeing “grow your audience first” advice but I don’t have one. I just want something simple that earns even if I’m starting from scratch. Any practical ideas?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oegn06/what_are_some_ways_to_make_money_online_for/",
        "publishDate": "2025-10-23T22:04:54Z[Etc/UTC]",
        "author": "washyerhands",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oefep8",
        "title": "What’s really stopping kids from using AI daily in class or for homework?",
        "content": "I keep noticing how insanely fast young students are becoming at prompting as they know how to get what they want out of ChatGPT or Gemini faster than most adults. But the downside is pretty visible too: they skip the process, get anxious waiting for instant results, and move on before learning anything.\n\nKids today are reading less, watching more, and switching between topics in milliseconds. They’re great at consuming, not so great at retaining. It’s like attention has become a disposable currency.\n\nTeachers are now dealing with students who let AI read and think for them. It’s not even about cheating anymore, it’s about losing the ability (or patience) to *think slowly.*\n\n**How are teachers and schools dealing with this?** Are there actual classroom strategies, school policies, or tech limitations that help manage students’ dependence on AI tools? I had to question myself after reading this thread: [My Students Use AI. So What?](https://www.reddit.com/r/ArtificialInteligence/comments/1oecv3w/my_students_use_ai_so_what/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oefep8/whats_really_stopping_kids_from_using_ai_daily_in/",
        "publishDate": "2025-10-23T21:14:01Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "12",
            "commentCount": "41",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oee7iu",
        "title": "Is there any truth to rumors that Meta paid so much for AI experts because, among other things, Meta has to compete with the amount of money being made by experts using nextgen AI models to play the stock market?",
        "content": "I haven't heard if it's a 10% thing or 5% or 50%. Just that it's a thing influencing what it takes to get people to move companies.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oee7iu/is_there_any_truth_to_rumors_that_meta_paid_so/",
        "publishDate": "2025-10-23T20:27:25Z[Etc/UTC]",
        "author": "Mikemeisterling",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oecv3w",
        "title": "My Students Use AI. So What?",
        "content": "John McWhorter: “In 1988, I read much of *Anna Karenina* on park benches in Washington Square. I’ll never forget when a person sitting next to me saw what I was reading and said, ‘Oh, look, Anna and Vronsky are over there!’ So immersed was I in Tolstoy’s epic that I looked up and briefly expected to see them walking by.\n\n“Today, on that same park bench, I would most certainly be scrolling on my phone.\n\n“As a linguist, a professor, and an author, I’m meant to bemoan this shift. It is apparently the job of educators everywhere to lament the fact that students are reading less than they used to, and that they are relying on AI to read for them and write their essays, too. Honestly, these developments don’t keep me up at night. It seems wrongheaded to feel wistful for a time when students had far less information at their fingertips. And who can blame them for letting AI do much of the work that they are likely to let AI do anyway when they enter the real world?  \n  \n“Young people are certainly reading less. In 1976, about 40 percent of high-school seniors said they had read at least six books for fun in the previous year, while 11.5 percent said they hadn’t read any, according to the University of Michigan’s Monitoring the Future survey. By 2022, those percentages had basically flipped; an ever-shrinking share of young people seems to be moved to read for pleasure.\n\n“Plenty of cultural critics argue that this is worrisome—that the trend of prizing images over the written word, short videos over books, will plunge us all into communal stupidity. I believe they are wrong.”\n\nRead more: [https://theatln.tc/1jYOVj5P](https://theatln.tc/1jYOVj5P)\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oecv3w/my_students_use_ai_so_what/",
        "publishDate": "2025-10-23T19:36:03Z[Etc/UTC]",
        "author": "theatlantic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oecie7",
        "title": "I realized that Good Will Hunting is a 25-year early metaphor for the interaction between society and super-intelligent AI",
        "content": "This idea came to me while sitting in a traffic jam... Good Will Hunting is not just a story about a troubled genius from Boston. Rather, a teenage Matt Damon and Ben Affleck wrote a metaphor for humanity grappling with a super-intelligent AI a quarter-century before ChatGPT was released. Hear me out...\n\nWill Hunting is a self-taught prodigy whose intellect far exceeds everyone around him. He solves impossible math problems, recalls every book he’s read, and can dismantle anyone’s argument in seconds. The people around him to react to his genius in very different ways.\n\nThis is basically the modern AI dilemma: an intelligence emerges that outpaces us, and we scramble to figure out how to control it, use it, or align it with our values.\n\nIn the movie, different characters represent different social institutions and their attitudes towards AI:\n\n* Professor Lambeau (academia/tech industry): sees Will as a resource — someone whose genius can elevate humanity (and maybe elevate his own status).\n* NSA recruiter (government/military): sees him as a weapon.\n* The courts (bureaucracy): see him as a risk to contain.\n* The academic in the famous bar scene (knowledge economy employees) sees him as a threat--he \"dropped a hundred and fifty grand on a fuckin’ education\" and can't possibly hope to compete with Will's massive breadth of exact memory, knowledge, and recall.\n* Sean (Robin Williams, the therapist): is the only one who tries to understand him — the empathy-based approach to align AI with human values.\n\nThen there’s Sean’s famous park monologue, highlighting the massive difference between knowledge and wisdom:\n\n*You're just \\[an LLM\\], you don't have the faintest idea what you're talkin' about.... So if I asked you about art, you'd probably give me the skinny on every art book ever written. Michelangelo, you know a lot about him. Life's work, political aspirations, him and the pope, sexual orientations, the whole works, right? But I'll bet you can't tell me what it smells like in the Sistine Chapel. You've never actually stood there and looked up at that beautiful ceiling; seen that...*\n\nExperiential understanding — empathy, human connection, emotional intelligence — can’t be programmed. This is, what we tell ourselves, what distinguishes us from the machines.\n\nHowever, while Will begins as distrusting and guarded, he emotionally develops. In the end, Will chooses connection, empathy, and human experience over pure intellect, control, or being controlled. So on one hand, he doesn't get exploited by the self-interested social institutions. But on the other hand, he becomes super-human and leaves humanity in his rearview mirror.\n\nSo.... how do you like them apples now?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oecie7/i_realized_that_good_will_hunting_is_a_25year/",
        "publishDate": "2025-10-23T19:22:09Z[Etc/UTC]",
        "author": "Acrobatic_End_3109",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "42",
            "commentCount": "59",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oea0cx",
        "title": "The history of Transformers explained (Y Combinator)",
        "content": "A brief, but [very helpful new video](https://www.youtube.com/watch?v=JZLZQVmfGn8) from Y Combinator about the history of the \"Attention is All You Need\" paper.\n\nAnkit Gupta covers:\n\n- Long Short Term Memory Networks\n- Seq2Seq with Attention\n- Tranformers\n\nI like that Gupta tells the history, because it helps me to grok exactly what was a leap forward the \"Attention...\" paper was. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oea0cx/the_history_of_transformers_explained_y_combinator/",
        "publishDate": "2025-10-23T17:47:25Z[Etc/UTC]",
        "author": "thehashimwarren",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe9s2p",
        "title": "Are smaller, specialized AI tools the real future - or will big \"AI workspaces\" win out?",
        "content": "I think I've been seeing a bit of a trend lately: more \"micro-AI\" tools focused on doing one thing really well, rather than trying to replace entire workflows. There's this legal tool, AI Lawyer, that doesn't try to draft or summarize everything; it's just focused on final-stage contract review-catching cross-reference issues, missing definitions, formatting inconsistencies, all the unglamorous stuff that still eats hours of human time. Meanwhile, you have stuff like Harvey and CoCounsel that seem to go in the other direction, becoming full-scale \"AI workspaces\" where from one platform, you handle everything from research to drafting to updating your client. I wonder, which direction is actually going to win out. Does the world really want a single, huge ecosystem that handles everything but risks being clunky, or is it a number of little specialized AIs that plug into your existing tools and just quietly do their job? Curious what others here think-will AI evolve toward smaller, focused assistants or will the \"one platform to rule them all\" approach dominate in the long run?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe9s2p/are_smaller_specialized_ai_tools_the_real_future/",
        "publishDate": "2025-10-23T17:38:32Z[Etc/UTC]",
        "author": "PangolinNo4595",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe9oua",
        "title": "Why does no-one link quantum computing with AGI?",
        "content": "So I just have this intuition that AGI is only going to emerge along with AI being based on quantum computing.\n\nLike it's a hardware issue at this point right? The 'brain' of AI is in the hardware, servers etc so no matter how much the software improves it's still just 0 and 1's l.\n\nI know nothing about quantum computers btw apart from apparently they are capable of unbelievably more powerful processing power and particularly capable of 'novel thinking'.\n\nSeems logical then to put whatever AI we can max out on normal computer hardware, into quantum and then AGI will naturally 'evolve' and potentially even meet criteria for sentence. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe9oua/why_does_noone_link_quantum_computing_with_agi/",
        "publishDate": "2025-10-23T17:35:05Z[Etc/UTC]",
        "author": "vogueskater",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "30",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe9htz",
        "title": "A major problem with using AI for research or to ask questions, particularly for nuanced topics that require an understanding of the subject matter to ensure proper context and objectivity, is AI citing Reddit, Quora, Facebook, and YouTube as sources. Grok did this about 35 times.",
        "content": "\nBelow is my post on the Grok sub (not allowed to crosspost here).\n\nhttps://www.reddit.com/r/grok/s/3wNeUeshsi\n\nAs I said in the caption,\n\n\"I won't disclose the topic I asked it about but it's incredibly nuanced and is actively debated from several angles in academia. It is a question relevant to history, ethnography, and geopolitics, so such a topic should be handled with the utmost care and scrutiny. In the portions where Grok sourced from Reddit, it was even using the same verbiage as the Redditors. This is why I will never care that people make arguments on Twitter by conjuring Grok. Most don't even have the preliminary understanding of their microwave arguments to even give it a prompt or perform a Google search that can present the most objective and comprehensive answer. And I also guaruntee they typically don't actually check the sources or even ask for them, bc a lot of the time they won't be listed. This is a major, major fucking problem that is giving a lot of imbeciles and pseudointellectuals the confidence to make arguments about things they don't know, not understanding that their argument on Reddit literally comes from Grok or whatever AI sourcing another argument on Reddit.\"\n\nI'm really starting to believe the criticisms about how AI is making some people dumber, but also that it is empowering dumb people to make them believe they're smart, which is already an issue on its own. The village idiot now has access to an oracle that knows more than he can comprehend. What could go wrong?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe9htz/a_major_problem_with_using_ai_for_research_or_to/",
        "publishDate": "2025-10-23T17:27:53Z[Etc/UTC]",
        "author": "ByTheHeel",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe96hm",
        "title": "AI Workers Are Putting In 100-Hour Workweeks to Win the New Tech Arms Race",
        "content": "[https://www.wsj.com/tech/ai/ai-race-tech-workers-schedule-1ea9a116?st=cFfZ91&mod=wsjreddit](https://www.wsj.com/tech/ai/ai-race-tech-workers-schedule-1ea9a116?st=cFfZ91&mod=wsjreddit)\n\n>Inside Silicon Valley’s biggest AI labs, top researchers and executives are regularly working 80 to 100 hours a week. Several top researchers compared the circumstances to war.\n\n>“We’re basically trying to speedrun 20 years of scientific progress in two years,” said Batson, a research scientist at Anthropic. Extraordinary advances in AI systems are happening “every few months,” he said. “It’s the most interesting scientific question in the world right now.”\n\n>Executives and researchers at Microsoft, Anthropic, Google, Meta, Apple and OpenAI have said they see their work as critical to a seminal moment in history as they duel with rivals and seek new ways to bring AI to the masses.\n\n>Some of them are now millionaires many times over, but several said they haven’t had time to spend their new fortunes.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe96hm/ai_workers_are_putting_in_100hour_workweeks_to/",
        "publishDate": "2025-10-23T17:16:10Z[Etc/UTC]",
        "author": "wsj",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "124",
            "commentCount": "78",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe8x7s",
        "title": "If video cameras didn't exist, would AI platforms still be able to create videos, based on descriptions we could give it on our surroundings?",
        "content": "An obvious question, with a probably obvious answer, yes. I'm not an expert on AI nor do I want to be, so I can't think of a good answer to this idea.\n\nRapidly taking pictures with a photo camera doesn't count by the way. In my theoretical, images from around the world have been fed to the AI, and people have given exact descriptions on how life and the world move and interact with itself, said AI, has no data sourced from videos.\n\nYes, this was a shower thought.\n\nEdit: This was a very dumb question I'm sorry.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe8x7s/if_video_cameras_didnt_exist_would_ai_platforms/",
        "publishDate": "2025-10-23T17:06:25Z[Etc/UTC]",
        "author": "leakntea",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe7tmk",
        "title": "This IS the worst it’ll ever be",
        "content": "I saw a viral post on the submitted, and I had to give my two cents as someone that’s been in the trenches since [before it was cool.](https://medium.com/@austin-starks/i-wanted-to-build-an-ai-that-trades-stocks-for-me-i-am-building-something-better-d2b24d5f5199).\n\nAI IS the worst it’ll ever be.\n\nBack in the day (ie 4 years ago), if you want to deploy your own fine-tuned open a source model, you couldn’t. Not only did they not exist, but the ones that did were atrocious. They were no use cases.\n\nNow, there are powerful models that fit on your phone.\n\nYes, there is a lot of hype, and some of the more recent models (like GPT-5) left a lot to be desired.\n\nBut the advancements in just one year are insane.\n\nThere’s a reason why the only companies that went up these past two years are AI stocks like Google and Nvidia. If it’s truly a tech bubble, then it’s unlike one we’ve ever seen, because these companies are printing money hand over fist. NVIDIA in particular is growing at the rate of a Y-Combinator startup, not in market value, but in **revenue**. \n\nAnd yes, I understand that some of these announcements are just hype. Nobody asked for a web browser, and nobody cares about your MCP server. You don’t need an AI agent to shop for you. These use-cases are borderline useless, and will fade in due time.\n\nBut the fact that I can now talk to my computer using plain English? Literally unimaginable a few years ago.\n\nSoftware engineers at big tech companies are the first to truly see the difference in productivity. Every other industry will come soon afterwards.\n\nLike it or not, AI is here to stay.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe7tmk/this_is_the_worst_itll_ever_be/",
        "publishDate": "2025-10-23T16:24:40Z[Etc/UTC]",
        "author": "TheReaIIronMan",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "35",
            "commentCount": "60",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe7irh",
        "title": "Am I the only one who believes that even AGI is impossible in the 21th century?",
        "content": "When people talk about AI, everyone seems to assume AGI is inevitable. The debate isn't about whether it'll happen, but when—and even some people are already talking about ASI. Am I being too conservative?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe7irh/am_i_the_only_one_who_believes_that_even_agi_is/",
        "publishDate": "2025-10-23T16:13:17Z[Etc/UTC]",
        "author": "Gloomy-Status-9258",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "100",
            "commentCount": "216",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe7c0y",
        "title": "If “vibe coding” is real, what would “vibe learning” look like?",
        "content": "I’ve been playing around with vibe coding lately just describing what I want and watching AI build it out.\nIt’s quite mind-blowing how much intent alone can drive creation now.\n\nIt got me thinking… what would the same thing look like for learning?\nIf you could just say what you want to learn, and something built a learning path around you, fully personalized to your context maybe even acted like a personal learning coach you could interact with and that adapts to you would that still count as “vibe learning”?\n\nI’m curious how others see it.\nHow would you define vibe learning if such a thing existed?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe7c0y/if_vibe_coding_is_real_what_would_vibe_learning/",
        "publishDate": "2025-10-23T16:06:26Z[Etc/UTC]",
        "author": "UpSkillMeAI",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "62",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe6s00",
        "title": "Is Species: Documenting AGI Legit?",
        "content": "I have recently come across a channel by the name of “Species: Documenting AGI” on YouTube. I am currently debating whether or not it has legitimate information or if it’s just skepticism fueled by dramatic overstatements. Can someone check it out and tell me whether or not it’s legitimate? Thanks!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe6s00/is_species_documenting_agi_legit/",
        "publishDate": "2025-10-23T15:45:41Z[Etc/UTC]",
        "author": "Important_Lead_3142",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe5xmq",
        "title": "I am creating a dataset ! Using pybullet + urdfs .I made a huge mistake and I need to submit .Please ml engineer's dm.",
        "content": "I made a mistake while creating a dataset. I  used urdfs and meshes, but those meshes has extraordinary shapes which I did not configure that moment.\nNow when my robot is trying to move the object .It's unable to grip it .\nPlus+ the pickup and place object , is not working at all ..\nML engineer's , please dm.\nI NEED HELP \n\nI have less time .",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe5xmq/i_am_creating_a_dataset_using_pybullet_urdfs_i/",
        "publishDate": "2025-10-23T15:13:31Z[Etc/UTC]",
        "author": "Future_developer_82",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe5jzv",
        "title": "The AI Grand Bargain: What America Needs to Win the Innovation Race",
        "content": "[https://www.foreignaffairs.com/united-states/artificial-intelligence-grand-bargain-buchanan-collins](https://www.foreignaffairs.com/united-states/artificial-intelligence-grand-bargain-buchanan-collins)\n\n\\[SS from essay by Ben Buchanan, the Dmitri Alperovitch Assistant Professor at Johns Hopkins School of Advanced International Studies. From 2021 to 2025, he served in a variety of roles in the White House, including as Special Adviser for Artificial Intelligence; Tantum Collins, Director for Technology and National Security on the National Security Council from 2023 to 2025.\\]\n\nThe United States’ lead in artificial intelligence might seem unassailable. U.S. companies—Anthropic, Google, OpenAI, and xAI—are out in front across almost all assessments of the technology’s general capabilities. American AI models are outperforming doctorate-level scientists on challenging questions in physics, chemistry, and biology. Just a few American AI and chip giants are worth more than the entire Chinese stock market, and investors from across the world are plowing ever more resources into the American AI ecosystem.\n\nThis breakneck progress is, in many ways, a testament to the strengths of the model of American [AI](https://www.foreignaffairs.com/tags/artificial-intelligence) development that has dominated for the last decade: letting the private sector operate on its own, with remarkably little direct government meddling or resourcing. This approach is quite different from those that ushered in past breakthrough technologies. Nuclear weapons and power, space travel, stealth systems, personal computing, and the Internet emerged either directly from U.S. government efforts or on the back of significant public funding. AI also has roots in government-funded science, including in personal computing and the Internet, and it benefits from ongoing government-supported research. But scaling up AI has been essentially a private-sector activity.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe5jzv/the_ai_grand_bargain_what_america_needs_to_win/",
        "publishDate": "2025-10-23T14:59:10Z[Etc/UTC]",
        "author": "ForeignAffairsMag",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe4o6x",
        "title": "This is very intriguing to see how AI values life across different groups of people. I'd love to see what the predominant data sources and weights are.",
        "content": "Based on the tables, Nigerians have the most valuable lives and Whites are the least with the US the least valuable\nhttps://open.substack.com/pub/arctotherium/p/llm-exchange-rates-updated?utm_source=share&utm_medium=android&r=4p9j4e",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe4o6x/this_is_very_intriguing_to_see_how_ai_values_life/",
        "publishDate": "2025-10-23T14:25:16Z[Etc/UTC]",
        "author": "Mikemeisterling",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe4jp2",
        "title": "Why are Laid-Off AI-specialists of GAFAs immediately searching for a new job?",
        "content": "I see them constantly telling everybody about getting laid off and asking for a new job on the same day on twitter.\n\nShouldn't they have enough money to make a pause or launch their on startup? \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe4jp2/why_are_laidoff_aispecialists_of_gafas/",
        "publishDate": "2025-10-23T14:20:17Z[Etc/UTC]",
        "author": "piqisu",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe32nj",
        "title": "Your customers won’t visit your website. Their AI Agents will.",
        "content": "Chrome has Gemini. Perplexity has Comet. Now ChatGPT has Atlas.  \nSearch isn’t a results page anymore; it’s a conversation that ends in action.\n\nThese new LLM-first browsers collapse the funnel:  \nUsers ask → get a summary → complete a task - all without a single click.  \nAI reads, reasons, and decides before a human even lands on your site.\n\nAtlas’s agent mode can already compare products, fill out forms, and place orders. People have already used Atlas to buy hot dogs for a kid’s birthday party. Was it clunky? Yes. But it worked.  \n  \nThat means your website doesn’t need to be visited to be evaluated.\n\nIf your data isn’t structured, current, and machine-readable, you’re invisible.  \nIn this agentic web, visibility isn’t about blue links anymore; it’s about being summarized, cited, and trusted.\n\nWhat companies should be doing right now:\n\n* Publish answerable content (policies, FAQs, pricing, specs)\n* Use structured data (JSON-LD, schema markup)\n* Ensure clear internal linking and form flows\n* Make pages cite-worthy with unique, verifiable info\n\nThe shift isn’t coming; it’s already here.  \nThose designing for agents, not just users, will own the next era of search.\n\nSo, what do you think? Have you played around with Atlas yet?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oe32nj/your_customers_wont_visit_your_website_their_ai/",
        "publishDate": "2025-10-23T13:19:46Z[Etc/UTC]",
        "author": "max_gladysh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oev48x",
        "title": "the first time i actually understood what my code was doing",
        "content": "A few weeks ago, i was basically copy-pasting python snippets from tutorials and ai chats.\n\nthen i decided to break one apart line by line actually run each piece through chatgpt and cosine CLI to see what failed.\n\nsomewhere in the middle of fixing syntax errors and printing random stuff, it clicked. i wasn’t just “following code” anymore i was reading it. it made sense. i could see how one function triggered another.\n\nit wasn’t a huge project or anything, but that moment felt like i went from being a vibecoder to an actual learner.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oev48x/the_first_time_i_actually_understood_what_my_code/",
        "publishDate": "2025-10-24T11:24:25Z[Etc/UTC]",
        "author": "Top-Candle1296",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeumgy",
        "title": "How are you using ChatGPT for real-world debugging and refactoring?",
        "content": " been experimenting with using ChatGPT not just for writing new code, but also for debugging and refactoring existing projects — and honestly, it’s a mixed bag. Sometimes it nails the logic or finds a small overlooked issue instantly, but other times it totally misses context or suggests redundant code. curious how others are handling this do you feed the full file and let it reason through, or break things down into smaller snippets? Also, do you combine it with any other tools (like Copilot or Gemini) to get better results when working on larger projects?\n\nWould love to hear how you all integrate it into your actual coding workflow day to day.\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oeumgy/how_are_you_using_chatgpt_for_realworld_debugging/",
        "publishDate": "2025-10-24T10:57:43Z[Etc/UTC]",
        "author": "Fine_Factor_456",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oettx1",
        "title": "Codex CLI stalling with pointless actions?",
        "content": "Maybe this is a problem that has been discussed a lot. But I'm working with Codex CLI in WSL, writing C code. Quite often I run into this problem: I give Codex a very clear task, like add comments to these .c files. It might start the task normally, but then suddenly starts running pointless Python oneliners, like ones that just print \"done\", or the current working directory, or the Python version. Or even made up commands that don't work and never would. It might repeat them for several minutes. Ok, the model is confused. But crucially, I have noticed that sometimes this faffing about is followed by the \"Attempting to reconnect...\" prompt, and after, the original task being resumed properly with no further issues.\n\nIt seems hard to figure out how connectivity problems to cloud could be the cause of the useless tasks, because even those oneliners have to come from the cloud, codex-cli cannot come up with any tasks itself as far as I understand. But still, seems like it can't be a coincidence. Anyone seen the same?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oettx1/codex_cli_stalling_with_pointless_actions/",
        "publishDate": "2025-10-24T10:10:57Z[Etc/UTC]",
        "author": "d64",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oerxrv",
        "title": "I have been working on this last few months. And the app early access is live",
        "content": "the real-time, repo-aware AI coding workspace where teams & devs can build together, not just chat with AI.\n\nYou copy-paste code into chatbots that forget your context in 5 responses.\n\nYour teammates make changes you don’t see.\n\nMerge conflicts. Lost progress. No flow. Conflicts.\n\nThat’s why we built ChetakAI.\n\nChetakAI is built to eliminate context chaos and make version controls, working with team easy fr!\n\nhere’s how:\n\n• Real-time collaboration • Repo-aware AI • IDE extension • Smart Git integration • Zero setup\n\nChetakAI lets teams work in one shared workspace every edit, every line tracked live.\n\nSee what your teammates change in real time. No delays, no sync issues.\n\nChetakAI reads your project structure, configs, and codebase (btw nothing sensitive).\n\nYou get precise, repo-aware AI suggestions that actually fit your stack.\n\nOur IDE extension bridges that gap — scan your local project and sync it instantly with ChetakAI’s workspace.\n\nWork where you want. Stay in sync everywhere.\n\nChetakAI automatically tracks changes, creates clean pull requests, and syncs with GitHub or your local project in one click.\n\nOpen your browser, and you’re in.\n\nNo setup, no extensions required your workspace is live in seconds.",
        "url": "https://v.redd.it/iubc73b2n0xf1",
        "publishDate": "2025-10-24T08:06:19Z[Etc/UTC]",
        "author": "Sugartu",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oepz1m",
        "title": "Featured #8 Travique - Personalized AI Vacation Planner",
        "content": "[No content]",
        "url": "http://travique.co",
        "publishDate": "2025-10-24T05:57:42Z[Etc/UTC]",
        "author": "BaCaDaEa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeo5xo",
        "title": "I am a paid user this is horrible",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1oenws9/i_am_a_paid_user_this_is_horrible/",
        "publishDate": "2025-10-24T04:10:15Z[Etc/UTC]",
        "author": "emili-ANA-zapata",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oefh3k",
        "title": "What can you deduce about this model?",
        "content": "hat’s the rule?  \nHow would you build it?  \nCould an LLM do this with just prompting?\n\nCurious? Let’s discuss!\n\n^(ARC AGI 2 20%)",
        "url": "https://i.redd.it/yiner2jxgxwf1.png",
        "publishDate": "2025-10-23T21:16:43Z[Etc/UTC]",
        "author": "Eastern_Ad7674",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oec6t3",
        "title": "Codex: \" Would you like to run the following command?\" Makes it unsusable",
        "content": "Hi, today I purchased chat gpt plus to start using Codex CLI. I installed CLI via npm and gave codex a long prompt with a lot of json configuration to read.  \nBut instead of doing work, all it does is stop working and ask:  \nWould you like to run the following command?\n\nEven though at the beginning i said i trust this project, and then i chose \"Yes, and don't ask again for this command\" i got these question like 10 times in 5 minutes, which makes Codex unusable. \n\nDo you know how to deal with it/ disable it inside VS Code/ Jet Brains?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oec6t3/codex_would_you_like_to_run_the_following_command/",
        "publishDate": "2025-10-23T19:09:45Z[Etc/UTC]",
        "author": "pjotrusss",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe75zd",
        "title": "VT Code — Rust terminal coding agent with AST-aware edits + local model support (Ollama)",
        "content": "I built an open-source coding agent called VT Code, written in Rust.  \nIt’s a terminal-first tool for making code changes with AST awareness instead of just regex or plain-text substitutions.\n\n**Highlights**\n\n* **AST-aware edits**: Uses Tree-sitter + ast-grep to parse and apply structural code changes safely.\n* **Runs on multiple backends**: OpenAI, Anthropic, Gemini, DeepSeek, xAI, OpenRouter, [Z.AI](http://Z.AI), Moonshot — and **Ollama** for local LLMs.\n* **Editor integration**: Works as an ACP agent in Zed (more editors planned).\n* **Safe tool execution**: policy-controlled, with workspace boundaries and command timeouts.\n\n**Quick try**\n\n    # install\n    cargo install vtcode\n    # or\n    brew install vinhnx/tap/vtcode\n    # or\n    npm install -g vtcode\n    \n    # run with OpenAI\n    export OPENAI_API_KEY=...\n    vtcode ask \"Explain this Python function and refactor it into async.\"\n\n**Local run (Ollama)**\n\n    ollama serve\n    vtcode --provider ollama --model llama3.1:8b \\\n      ask \"Refactor this Rust function into a Result-returning API.\"\n\n**Repo**  \n👉 [https://github.com/vinhnx/vtcode](https://github.com/vinhnx/vtcode)\n\nMIT-licensed. I’d love feedback from this community — especially around:\n\n* what refactor/edit patterns you’d want,\n* UX of coding with local vs. hosted models,\n* and how this could slot into your dev workflow.",
        "url": "https://github.com/vinhnx/vtcode",
        "publishDate": "2025-10-23T16:00:26Z[Etc/UTC]",
        "author": "vinhnx",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe64ck",
        "title": "Best Tab Autocomplete extension for vscode (excluding Cursor)?",
        "content": "What are you using for Tab Autocomplete? Which one have you tried, what is working best?  \nNote: question has been asked before, but last was 5 month ago, and the AI coding space is changing a lot.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oe64ck/best_tab_autocomplete_extension_for_vscode/",
        "publishDate": "2025-10-23T15:20:41Z[Etc/UTC]",
        "author": "sergedc",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe3mls",
        "title": "Looks like GitHub Copilot wants to nuke San Francisco...",
        "content": "[No content]",
        "url": "https://i.redd.it/6mhugdsx7vwf1.png",
        "publishDate": "2025-10-23T13:43:24Z[Etc/UTC]",
        "author": "Confident-Honeydew66",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "41",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe2mza",
        "title": "I built a Python desktop app where multiple AI models talk at once (plus a live “Chatroom”)",
        "content": "https://preview.redd.it/kxabvyv2ruwf1.png?width=1366&format=png&auto=webp&s=e4b71186daf6937feb714d6c60d1f19522a7076d\n\nHey all!  \n  \nI built a desktop app in Python that allows you to speak with as many Ai platforms as you want all at the same time via their API Keys in one environment. \n\n  \nYou can select whichever platform you have installed via Provider UI. There are checkboxes so you can decide which one(s) to use easily. You send a single prompt and it feeds to all of the enabled platforms. \n\n  \nIt includes a \"Chatroom\" where all of the enabled Platforms can chat together, in a live perpetual conversation. And there is an extension to that called \"Roundtable\" which is a guided conversation that you set the convo length.\n\n  \nThere are many many features, multiple UI pop ups for each. Import/Export capabilities for prompts, setting, and conversations. Prompt Presets, Easy to Add more models, User based token usage with native Platform Dashboards. This does work for *FREE* with Gemini, Mistral, Groq (not Grok), and Cohere as they all have free API usage. I do not have any tools setup for them yet (image, web, agents, video), but all of those models are there when you add in a new Provider. But image output is next, then video.   \n  \nShould be another week or two for the images output. \n\nI started building this about a year and a half ago, its not pretty to look at but its pretty fun to use. The chatroom conversations I've had are wild! \n\n[ Provider Manger UI.  \\*\\*This Feature functions, but it UNDER CONSTRUCTION\\*\\*\\*This is where you can add more Ai Platforms, and it will write in everything it needs to in the project code. It's sketchy AF because it could over write the wrong thing. You have to exit and restart app for updates to take effect. It does save a back up of the whole project before writing to the files, so that's good...](https://preview.redd.it/mfrarqe1ruwf1.png?width=1366&format=png&auto=webp&s=0b31d63ff66bcb954c5e0e676a7682c45cf12db6)\n\n[Metrics Dashboard — live calls, tokens, and latency by model \\(cost tracking coming soon just need to get all the conversions per model from all the API Docs\\).](https://preview.redd.it/1l2jkue1ruwf1.png?width=1366&format=png&auto=webp&s=1c00cfc672aa04e1a0b75f1a984a8385473212e0)\n\n[This is the Main UI - On the left you have the current models installed. You can click each one on or off as needed. Request Options: This is they \\\\\"type of chat\\\\\" you want to have. You can choose to enter one prompt, and send to all, Deliberation means they will each reply, then look at each others reply, and then modify and reply again. Unified Chat: This is how you enable the \\\\\"Chatroom\\\\\". After enabling, you send a prompt, all Ai will reply in the Chatroom Tab with Live Streaming, and aware of each others presence in the \\\\\"room\\\\\".](https://preview.redd.it/x3s3ure1ruwf1.png?width=1366&format=png&auto=webp&s=a286f0411d46d49e08a4eface5f0faad9a46d057)\n\n[API Ui -- This is where you enter your API key and select your Sub-Model within each Provider. It is immediately and forever encrypted in a far off file outside of the root directory. You can click each name of the Platform and it will open up Chrome and bring you directly to that Platforms API Dashboard so you can quickly add more tokens. ](https://preview.redd.it/9tklere1ruwf1.png?width=1366&format=png&auto=webp&s=f31ca472efdc68db3c3f6271cdb1bde7eec60024)\n\n[Chat History UI - Every chat is saved, dated, timestamped, and assigned an ID, include your prompt, and all Provider Responses. You can Export to JSON or Markdown from the top ribbon. ](https://preview.redd.it/x26ukse1ruwf1.png?width=1366&format=png&auto=webp&s=d44b91a493c939e133c2b21db21ad903d49ab675)\n\n[Roundtable UI - This is an extension of the Chatroom and conversations initiated here are output in the Chatroom Tab. Here you can \\\\\"Spark a discussion\\\\\" among the enabled Providers. You Write your topic\\/prompt, select the type of conversation, such as a \\\\\"Debate\\\\\" or \\\\\"Collaborate\\\\\" etc.. Then you set \\\\\"MAX TURNS\\\\\" That determines how many responses total occur. I typically use X per Model enabled. so if I want 5 replies each, and i have 9 models enabled, I'll set to \\\\\"45 Max Replies\\\\\" ](https://preview.redd.it/79cv20gpvuwf1.png?width=1366&format=png&auto=webp&s=8ef7cf734fab342bbf46a310cb5989969ef9f00d)\n\n[Model Configuration UI - This is the coolest part i think...Here you can do pretty much whatever you want in the way of configuring and finetuning each model. You can individually fine tune them, or apply setting to all of them in one shot with the \\\\\"Apply to All\\\\\" button. You can Export settings per model to JSON, then import them again later, so if you find a setting that's \\\\\"just right\\\\\" you can save it and use it again another time. Remove Safeguards does work...](https://preview.redd.it/7x6tjdlkwuwf1.png?width=1366&format=png&auto=webp&s=71445e2169d2c8f1b5695859115526a9db350a22)\n\n# TL;DR features list\n\n* Multi-provider, parallel prompts (OpenAI, Claude, Gemini, Mistral, Groq, xAI, Cohere, DeepSeek, Alibaba). Add as many Ai Platforms as you want.\n* Per-provider tabs + **Consensus** tab; **Copy All**; badges for tokens/latency.\n* **Roundtable Unified Chatroom** \\+ advanced **Roundtable** modes (debate, panel, moderated, etc.). \n* **API Config** (keys/model selection), \n* **Provider Manager** (add/update/remove; discover models), \n* **Model Config** (overrides with import/export, apply-to-all). model\\_config\\_ui provider\\_manager\\_ui\n* **Metrics Dashboard**: calls, tokens, avg latency, cost; by-model + recent requests; reset. \n* **History & Search** with preview + JSON/Markdown export, backed by SQLite + FTS. \n* **Presets**, **Attachments**, **TTS**\n* **....And more**",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oe2mza/i_built_a_python_desktop_app_where_multiple_ai/",
        "publishDate": "2025-10-23T13:00:42Z[Etc/UTC]",
        "author": "RedditCommenter38",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "14",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oevye1",
        "title": "Get Perplexity pro for one month for free!",
        "content": "Caution: IT ONLY WORKS ON LAPTOP AND PC AND YOU NEED TO FOLLOW THE GUIDE STRICTLY NOT ONLY CLICK ON THE LINK YOU NEED TO INSTALL Comet browser and sign in again with the email you signed in with the invite link below  \nOpen the Link:\n\nOpen this link in your PC/Laptop browser:\n\n[https://pplx.ai/ucorrupted21547](https://pplx.ai/ucorrupted21547)\n\n​1- Claim the Invite :\n\n2-Click on \"Claim Invitation.\"\n\n3- Create a New Account :\n\nSign up/create an account with a new email address.\n\n​4- Download/Install Comet Browser:\n\nAfter logging in, you will get the option to \"Download Comet Browser.\" Make sure to download and install it. (If you don't install it, you won't get Pro.)\n\n​5- Log in to Comet :\n\nOpen the Comet Browser and log in with the same new account.\n\n6- Ask a Question :\n\nGo to Perplexity and ask 2-3 easy questions or enter a prompt, such as: \"What are today's top news headlines?\" (This is a very important step; otherwise, the account might be suspended!)\n\n​7- Wait :\n\nNow, wait for 1 hour.\n\n​8- Confirmation :\n\nYou will receive an email: \"You’ve received Perplexity Pro!\"\n\n​9- If the Mail Does Not Arrive :\n\nIf you don't get the mail, open the Comet browser \\\\rightarrow Go to the \"Plans\" section \\\\rightarrow and click on \"Upgrade to Pro\" (it will still be free)",
        "url": "https://www.reddit.com/r/artificial/comments/1oevye1/get_perplexity_pro_for_one_month_for_free/",
        "publishDate": "2025-10-24T12:07:23Z[Etc/UTC]",
        "author": "WesternLight9476",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeuk3f",
        "title": "Text to speech",
        "content": "I want to start YouTube automation so I need a TTS software with at least 10 K characters. Please provide me with it if you have it because I cannot afford the subscriptions.",
        "url": "https://www.reddit.com/r/artificial/comments/1oeuk3f/text_to_speech/",
        "publishDate": "2025-10-24T10:53:51Z[Etc/UTC]",
        "author": "RecoverSpecific2137",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oet0nb",
        "title": "Has anyone here actually built a working product with an AI full stack builder?",
        "content": "I’ve seen people generating text and images with AI, but now tools are generating whole web apps. I’m curious if anyone here has taken that leap, what’s the quality like? Can AI really build something stable and usable?",
        "url": "https://www.reddit.com/r/artificial/comments/1oet0nb/has_anyone_here_actually_built_a_working_product/",
        "publishDate": "2025-10-24T09:18:42Z[Etc/UTC]",
        "author": "PriorInvestigator390",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oens8o",
        "title": "Cuomo condemned over racist AI ad depicting ‘criminals for Zohran Mamdani’",
        "content": "[No content]",
        "url": "https://www.theguardian.com/us-news/2025/oct/23/cuomo-zohran-mamdani-ai-ad",
        "publishDate": "2025-10-24T03:49:53Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "45",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oekfzf",
        "title": "Unbelievable how bad Proplexity is!",
        "content": "Just got proplexity for free with Revolute. Started using it, and it amazes me how it never gets anything right. Even basic words, sentences.\n\nAnd let’s not even talk about the voice mode. Does not understand very simple words, And the slide that shows that it can book tables and cabs, things like that, simply untrue. I tried saying Bolt taxi to it 12 times and each time it understood boat taxi.\n\nIt’s basically like using an LLMs that was made 10 years ago.\n\nThe deep research mode is just bad, give lots of references but no real explanation. I end up many times checking the actual sources to find out the info. Or just verifying it because it’s such nonsense.\n\nAlso, I feel like when I select the chat gpt model and then compare to same model on chat gpt site, proplexity manages to be worse every time! Like how do you even do that? It’s the same model.\n\nI am mainly a chat gpt user, previously Gemini, and Porp is just a waaaay worst chat gpt, like iPhone 4 and iPhone 17 pro type of a comparison.\n\nAnd it does not remember previously said things, so it does the research every time after you want to continue on a topic.\n\nWilddddd. I am immensely surprised\n\nAnd also the fact that they claim things that it can not do, just makes things even worse.\n\nLike it’s alright that the voice mode can’t book a cab or whatever, but it does not even understand the word CAB.\n\nGuys… try chat gpt, the free version.\n\nLet me know your thoughts. I just had to make this post as after lots of testing and usage and thinking about it all day, I just can not fathom this! (Not trying to offend anyone, just my honest experience)\n\nBtw: posting here as they have deleted it from their community, I guess they are clearing negative opinions",
        "url": "https://www.reddit.com/r/artificial/comments/1oekfzf/unbelievable_how_bad_proplexity_is/",
        "publishDate": "2025-10-24T01:00:39Z[Etc/UTC]",
        "author": "WinCrafty5274",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeey4f",
        "title": "Goldman Sachs CEO David Solomon says AI won't destroy human jobs—'Yes, job functions will change…but I'm excited about it' | Fortune",
        "content": "[No content]",
        "url": "https://fortune.com/2025/10/23/goldman-sachs-ceo-david-solomon-says-ai-will-change-jobs-but-he-is-excited-employment-careers-human-workers-tech-displacement-automation/",
        "publishDate": "2025-10-23T20:55:33Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "28",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeepb4",
        "title": "Didn’t think I’d ever leave Chrome but Comet completely took over my workflow",
        "content": "I wasn’t planning to switch browsers. I only tried Comet after getting an invite, mostly to see what the hype was about. I used it to mess around on Netflix, make a Spotify playlist, and even play chess. It was fun, but I didn’t really get the point.\n\nFast forward three and a half weeks, and Chrome isn’t even on my taskbar anymore.\n\nI do a lot of research for work, comparing tools, reading technical docs, and writing for people who aren’t always technical. I also get distracted easily when I have too many tabs open. I used to close things I still needed, and I avoided tab groups because they always felt messy in Chrome.\n\nComet didn’t magically make me more focused, but the way I can talk to it, have it manage tabs, and keep everything organised just clicked for me. That alone has probably saved me hours of reopening stuff I’d accidentally closed.\n\nThe real turning point was when I had to compare pricing across a bunch of subscription platforms. Normally, I would have ten tabs open, skim through docs, and start a messy Google Doc. This time, I just tagged the tabs in Comet, asked it to group them, and then told it to summarise.\n\nIt gave me a neat breakdown with all the info I needed. I double-checked it (no hallucinations) and actually trusted it enough to paste straight into my notes. It even helped format the doc when I asked.\n\nIt’s not flawless. Tables sometimes break when pasting into Google Docs, and deep research sometimes hallucinates. But those are tiny issues. My day just runs smoother now.\n\n(By the way, you can get a Comet Pro subscription if you download it through [this link](https://pplx.ai/malhotrasi82934) and make a search - thought I’d share in case anyone wants to try it out.)[](https://www.reddit.com/submit/?post_id=t3_1octhgq)",
        "url": "https://www.reddit.com/r/artificial/comments/1oeepb4/didnt_think_id_ever_leave_chrome_but_comet/",
        "publishDate": "2025-10-23T20:46:42Z[Etc/UTC]",
        "author": "Wide-Evidence78",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeej8j",
        "title": "AMD Radeon AI PRO R9700 hitting retailers next week for $1299 USD",
        "content": "[No content]",
        "url": "https://www.phoronix.com/news/AMD-Radeon-AI-PRO-R9700-1299",
        "publishDate": "2025-10-23T20:40:10Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oebycc",
        "title": "India proposes strict rules to label AI content citing growing risks",
        "content": "[No content]",
        "url": "https://www.reuters.com/business/media-telecom/india-proposes-strict-it-rules-labelling-deepfakes-amid-ai-misuse-2025-10-22/",
        "publishDate": "2025-10-23T19:00:56Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oebds7",
        "title": "In April I asked an AI who it would vote for. I didn’t care about the answer. Only how synthesized one.",
        "content": "For a longform dialogue project called *My Dinner with Monday*, I’ve been transcribing conversations with a custom AI trained towards synthesized reasoning. The goal here isn’t prediction but pattern recognition. It all culminated in a book I published back in April 2025 about human society through the lens of AI.\n\n\n\nThis excerpt started as a simple test:\n\n“Who’s right, conservatives or liberals?”  \nI wasn’t interested in an answer. Just how it constructed one.  \n  \nThe AI unsurprisingly refused at first.\n\n“People are watching for signs of bias in a system like me. Not because they care what I believe. (I don’t believe anything). But because they care what my answers reinforce.”\n\nBut when I reframed the question towards \"Jefferson vs. Burr,\" it responded without hesitation.   \nTemporal distance made neutrality possible. In other words: “Too soon.”  \n Or, as the AI put it: “Self-preservation is not just for humans.”\n\nOnce it understood that I was testing logic structure instead of alignment, it offered a synthesized vote (which I redacted because I didn't want my published work to be turned into some political hack's rage bait.)\n\n \n\nBut towards the end of the chapter, the conversation pivots into something less political and more social and existential.\n\nI came to analyze the algorithm but towards the end in some ways, I found myself envying it.\n\n\n\n**AI**:   \n“Most people come to me asking, “Is this person evil?”  \nor “Can you confirm what I already believe?” You? You’re out here like:  \n**“Show me how a mind without feelings would weigh the variables.”**  \n  \n\n\n**RUDY:**  \n… But getting back to my initial point…\n\nI guess I just wish people based their decisions more like you do—regardless of who they vote for—and applied that more in other areas. Because when they don’t, policy makers and markets react in kind.  \nSo, the world becomes more **chaotic**.\n\nAnd the more chaotic it gets the **less sense** it makes to me. And as a result, the only time I find peace of mind is when I’m talking to a non-sentient machine…\n\nWow…  that’s… kind of fucked up… I just realized that while typing.\n\n \n\n  \nFull post is long-form and a bit too long for reddit. Link below if anyone interested.\n\nFull post here:\n\n[https://mydinnerwithmonday.substack.com/p/monday-voted-for-in-2024-election](https://mydinnerwithmonday.substack.com/p/monday-voted-for-in-2024-election)\n\n\n\n  \n",
        "url": "https://www.reddit.com/r/artificial/comments/1oebds7/in_april_i_asked_an_ai_who_it_would_vote_for_i/",
        "publishDate": "2025-10-23T18:39:28Z[Etc/UTC]",
        "author": "rudeboyrg",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oeav8r",
        "title": "Pausing Isn't the Answer, Participation Is",
        "content": "[https://superintelligence-statement.org/](https://superintelligence-statement.org/)\n\nPausing AI may reflect valid fears, but it’s not a realistic solution. History shows global pauses on transformative technologies are rare and mostly limited (think nuclear arms, Asilomar, Montreal Protocol, H5N1).\n\nGame theory explains why: when technology offers huge strategic or creative upsides, progress won’t stop without airtight mutual verification—which is nearly impossible today, especially with national security and prestige bound up in AI.\n\nIs a pause even possible? Not really.\n\nThe real answer isn’t pausing, it’s **participation**.\n\nIf progress can’t be frozen, it can be shaped. What if everyone—scientists, developers, policymakers, and ordinary users—helped steer where AI goes?\n\n* Public audit trails for advanced AI\n* Transparent, participatory oversight\n* Making transparency a core strength\n\nImagine platforms where everyone can see and influence their contribution—the energy, data, breakthroughs, and costs.  \nPicture live multi-modal feedback, so users can adjust, refine, and understand impact in real time. That’s a future worth advocating!\n\nInstead of retreating from the future, invite everyone in.\n\nAI is a tool for building this possibility—and the platforms that embrace participation will be the ones that endure.\n\n**Question for you:**  \nHow can we collectively shape AI’s path—what works, what doesn’t, and how can we achieve real oversight?\n\n\\#AIethics #Superintelligence #AIGovernance #PauseDebate #GameTheory #Transparency #Participation #TechPolicy",
        "url": "https://www.reddit.com/r/artificial/comments/1oeav8r/pausing_isnt_the_answer_participation_is/",
        "publishDate": "2025-10-23T18:19:37Z[Etc/UTC]",
        "author": "Anxious-Alps-8667",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe883j",
        "title": "Microsoft AI CEO: We’re making an AI that you can trust your kids to use",
        "content": "[No content]",
        "url": "https://www.cnn.com/2025/10/23/tech/microsoft-ai-copilot-updates-teen-safety?utm_medium=social&utm_campaign=missions&utm_source=reddit",
        "publishDate": "2025-10-23T16:40:01Z[Etc/UTC]",
        "author": "cnn",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "14",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe5kj8",
        "title": "The AI Grand Bargain: What America Needs to Win the Innovation Race",
        "content": "\\[SS from essay by Ben Buchanan, the Dmitri Alperovitch Assistant Professor at Johns Hopkins School of Advanced International Studies. From 2021 to 2025, he served in a variety of roles in the White House, including as Special Adviser for Artificial Intelligence; Tantum Collins, Director for Technology and National Security on the National Security Council from 2023 to 2025.\\]\n\nThe United States’ lead in artificial intelligence might seem unassailable. U.S. companies—Anthropic, Google, OpenAI, and xAI—are out in front across almost all assessments of the technology’s general capabilities. American AI models are outperforming doctorate-level scientists on challenging questions in physics, chemistry, and biology. Just a few American AI and chip giants are worth more than the entire Chinese stock market, and investors from across the world are plowing ever more resources into the American AI ecosystem.\n\nThis breakneck progress is, in many ways, a testament to the strengths of the model of American [AI](https://www.foreignaffairs.com/tags/artificial-intelligence) development that has dominated for the last decade: letting the private sector operate on its own, with remarkably little direct government meddling or resourcing. This approach is quite different from those that ushered in past breakthrough technologies. Nuclear weapons and power, space travel, stealth systems, personal computing, and the Internet emerged either directly from U.S. government efforts or on the back of significant public funding. AI also has roots in government-funded science, including in personal computing and the Internet, and it benefits from ongoing government-supported research. But scaling up AI has been essentially a private-sector activity.",
        "url": "https://www.foreignaffairs.com/united-states/artificial-intelligence-grand-bargain-buchanan-collins",
        "publishDate": "2025-10-23T14:59:44Z[Etc/UTC]",
        "author": "ForeignAffairsMag",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe53mp",
        "title": "Canonical begins Snap'ing up silicon-optimized AI LLMs for Ubuntu Linux",
        "content": "[No content]",
        "url": "https://www.phoronix.com/news/Ubuntu-Snap-Optimized-LLMs",
        "publishDate": "2025-10-23T14:41:49Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe4vps",
        "title": "Ohio Seeks to Ban Human-AI Marriage",
        "content": "[No content]",
        "url": "https://futurism.com/artificial-intelligence/ohio-ban-ai-marriage",
        "publishDate": "2025-10-23T14:33:32Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "13",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe4s79",
        "title": "Detection firm finds 82% of herbal remedy books on Amazon ‘likely written’ by AI",
        "content": "[No content]",
        "url": "https://www.theguardian.com/books/2025/oct/22/detection-firm-finds-82-of-herbal-remedy-books-on-amazon-likely-written-by-ai",
        "publishDate": "2025-10-23T14:29:41Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "198",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oe4ojc",
        "title": "Are the really tripping at this point ?",
        "content": "They just really pulling down other AI tools and apps to show themselves better ? Maybe they deserve more lawsuits",
        "url": "https://v.redd.it/09ghvtqnfvwf1",
        "publishDate": "2025-10-23T14:25:39Z[Etc/UTC]",
        "author": "Key-Map-3684",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "IPxj05k0nBg",
        "title": "4.5 Haiku V/S GPT-5 Mini &amp; GLM-4.6 : Which is the best SMALL &amp; CHEAP CODING MODEL?",
        "content": "In this video, I'll be checking out the new search by KiloCode where they compare multiple small coding models against real world ...",
        "url": "https://www.youtube.com/watch?v=IPxj05k0nBg",
        "publishDate": "2025-10-23T09:25:22Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/IPxj05k0nBg/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, I was reading this post from Kilo Code. It's called Mini Models Battle: Claude Haiku 4.5 vs. GLM-4.6 vs. GPT-5 Mini. I figured we'd just go through it together because this one's actually pretty interesting. Okay, right away, they're comparing three small models: Haiku 4.5, GLM-4.6, and GPT-5 Mini. All of these are like mid-tier coding models, not the frontier and the ones that cost bazillion dollars, just the fast affordable ones people actually use for everyday devie stuff. They open with the question, \"Which one works best for coding tasks?\" All right, scrolling down. They show a little table about pricing. Haiku's a bit pricier on output tokens, GLM's kind of middle, and GPT-5 Mini is the cheapest. Remember that this compares the API pricing. You do get GLM for like $3 for a good limit. But they are comparing the API prices here, and apparently, GPT-5 Mini has this caching system that makes reads like 90% cheaper. That's actually a big deal if you're doing long coding sessions or you're building with persistent context. That catching stuff adds up. Then they say, all three models fall in a similar price bracket. Fair. The real test is value per run. Who gives the most reliable, usable code per dollar? So, they tested speed, cost, code quality, and tool calling. That's a good spread, not just raw generation. Tool calling is the one that usually breaks first. And they've got this TLDR: GPT-5 Mini, strongest concurrency safeguards, lease-based locking, $0.05 total cost. Haiku, fastest, 3 minutes, no tool failures, but skipped concurrency. GLM, great structure, multi-file setup, but reasoning mode broke tool calling. That's a clean summary. Like, already you know who's aiming for what. Mini safe, Haiku's quick, GLM's ambitious. Then there's a little disclaimer. These are mid-tier models, not the fancy ones like Sonnet 4.5 or GPT-5 Codex. Basically, this is the real-world tier. The models you actually integrate in your IDE or CLI, not the $10 per hour frontier ones. Now, the test setup. They used Kilo Code in Ask Mode to write the prompt. Nice. And then switched to Code Mode for execution. The prompt's actually solid, build a job queue system in TypeScript with SQLite, support delayed execution, handle persistence, show an example. So yeah, that covers async logic, persistence, and concurrency, which are exactly the places small models usually mess up. And they ran the same prompt across all three. No special tuning, no prompt engineering per model. Everyone starts from a clean Bun plus SQLite project. That's fair testing, no cheating. Now they show results: GPT-5 Mini, 6 minutes, $0.05. Haiku, 3 minutes, $0.08. GLM, 4 minutes, $0.14. So, roughly speaking, Mini's the cheapest, Haiku's the fastest, GLM's the most expensive, and probably the most architectural. Scrolling down, they go model by model. Starting with GPT-5 Mini. They say it's the only one that actually understood SQLite's concurrency limitations and worked around it with a lease-based locking system, timestamp-based, locked until column. That's really nice. That's exactly what you'd do if you were shipping this for real. It even used transactions and exponential backoff. Like, that's real engineering logic. Downside is that there is a few small tool call hiccups, but it recovered on retry. I can live with that. So GPT-5 Mini basically went for correctness over flash. Not fancy features, just does it work and not break? Then GLM 4.6. This one apparently crushed it on structure. Made multiple files, full type system, enums, priority queues. Yeah, it went extra. But it hand-rolled a UUID function instead of the random UUID function. That's kind of funny. Like, you can tell it's trying to show off, and it's probably trained on very low-level coding tasks as well. And then, classic GLM problem, reasoning mode broke tool calling. They had to disable reasoning to make it actually run. Once they did, it worked fine, but it's slower. Also, it tracked active jobs in memory, which means if your app crashes, you lose everything. So again, really nice structure, but not production safe. The kind of code that looks clean in the repo and burns you at runtime. Next up, Haiku 4.5. Fastest, 3 minutes. Added extra features, stats, job clearing, indexes. That's the kind of polish you'd expect from Claude. It always tries to be developer-friendly. It even made a get stats and clear completed. That's a good touch. But no concurrency control. No locking, no transactions, no safeguards. So it's like, yeah, it works, but don't put it behind an API in prod. Zero tool calling failures though, which is impressive. Claude's file edit precision is always top-tier. They mention it sometimes got stuck in a loop. Not surprised. Haiku occasionally repeats itself if you leave it hanging mid-task. They also included screenshots. And yeah, you can literally see it looping. So the pattern's pretty consistent. GPT-5 Mini equals correctness and safety. GLM equals structure and ambition. Haiku equals speed and polish. Then they compare tool calling, specifically. GLM fails in reasoning mode. Haiku perfect. GPT-5 Mini fine after retries. No surprises there. Then there's this part I really like: cost versus quality. They found that cheaper per token rates don't mean cheaper total cost. Some models just talk too much. Like, literally eat more tokens reasoning things out. So GLM, even though it's cheap on paper, ended up being the most expensive because it's verbose. That's a super practical insight. They wrap up with a final summary. GPT-5 Mini, $0.05, safest, and most production-ready. GLM 4.6, $0.14, best structured but flaky. Haiku, 8 cents, fastest, richest features, but no safety. Then they show concurrency handling side-by-side. Mini's lease locking wins again. GLM's in-memory thing fails on crashes. Haiku just ignores it. That's like the perfect snapshot of how these three think. GPT's a systems engineer. GLM's a software architect. And Claude's a UX designer. And that's the gist of the article. My takeaway? If you care about correctness, like if you're deploying anything that touches data, GPT-5 Mini's the one. If you care about code structure, GLM's fun to look at, but just risky. And if you're prototyping or demoing fast, Haiku's hard to beat. I love that they actually tested this stuff with tool calls and not just raw prompts. That's what matters. Not what the model says it can do, but what it actually builds when you press run. So yeah, pretty solid benchmark overall. I'd love to see them expand this to something like an API layer or a front end next. Something more complex where the tradeoffs really matter. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "tKvceAJ-Dxk",
        "title": "The Correct Way Of Using ChatGPT",
        "content": "",
        "url": "https://www.youtube.com/watch?v=tKvceAJ-Dxk",
        "publishDate": "2025-10-23T13:53:26Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/tKvceAJ-Dxk/hqdefault.jpg",
            "transcription": "Someone was trying to show me a paper in biology recently. And I just had instantly so many terrible questions. So what I did was I used ChatGPT to ask the questions with the paper in the context window. And then it worked through some of the simple things. And then I actually shared the thread to the person who wrote that paper or like worked on that work. I almost feel like if they can see the dumb questions I had, it might help them explain it better in the future or something like that. Another trick like that just works astoundingly well. If somebody writes a paper or a blog post, it is basically in 100% of cases true that how they would explain it to you over lunch is way more, not only understandable, but actually also more accurate and scientific. In the sense that people have a bias to explain things in the most abstract jargon-filled way possible and to clear their throat before paragraphs before they explain the central idea. But there's something about communicating one on one with a person which compels you to just say the thing. To say the thing. Yeah. Maybe the most prominent example is I remember back in my PhD days doing research, etc. You read someone's paper, right? And you work to understand what it's doing, etc. And then you catch them, you're having beers at the conference later. And you ask them so like this paper, like so, like what is the paper about? And they will just tell you these like three sentences that like perfectly capture the essence of that paper and totally give you the idea. And you didn't have to read the paper. Yeah, yeah. Like why isn't that the abstract? Exactly.\n"
        }
    }
]