[
    {
        "id": "1lo4ehk",
        "title": "Building in Public: Roast my idea",
        "content": "Hi all,\n\nI have been building AI agents for a while and I found a problem that is not solved well or at all by anyone.\n\nWhenever you want to test your ai agent you have to incur inference costs. Writing snapshots takes engineering time and there is no easy way to replay it.\n\nI am currently building a Python library that will allow you to record your ai agent response including embedding and RAG retrievals and replay it for testing or even live demos.\n\nI want to know the thoughts of people here as a lot of people are building AI agents.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo4ehk/building_in_public_roast_my_idea/",
        "publishDate": "2025-06-30T10:49:49Z[Etc/UTC]",
        "author": "Lucky_Animal_7464",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo47ov",
        "title": "Is AI hurting or helping cold email performance in 2025?",
        "content": "AI helps scale personalization no doubt.\n\nBut lately it feels like everyone is using the same prompt. The result? Emails that look great and get ignored.\n\nAnyone else finding that \"perfectly written\" = \"instantly forgettable\"?\n\nHave you tried mixing in more human tone or lightweight humor?\n\nWould love to swap notes.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo47ov/is_ai_hurting_or_helping_cold_email_performance/",
        "publishDate": "2025-06-30T10:38:10Z[Etc/UTC]",
        "author": "Background-Scar-7096",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo2x6x",
        "title": "Phenomenal Subjectivity",
        "content": "\n\nConsidering fundamental difference in ontology between *first person* & *third person* accounts, I don't know if I can I discard the very phenomenal first person *sense* of myself. It's not even a qualitative feeling like pain or touch, its simply a feature of experience itself.\n\nAccording to Cogntive Scientist Thomas Metzinger,\n\n>You don’t feel \"I exist\" as a separate feeling. It’s not something you notice separately; it’s what makes noticing possible.\n\nIt is for sure that brain simulates the self-model without representing it as a model—you don’t experience the construction, just being the constructed subject.\nIt's not brain vs 'I'/'me', its simply brain as me. But how it happens?????? \nThat's what I am asking.\n\nHence asking people here provide a paper(s) which entails a physicalist account on it, like a mechanism for its origin, if there is any.\n\nAlso tell can Embodied AI Robots achieve it? If yes, how?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo2x6x/phenomenal_subjectivity/",
        "publishDate": "2025-06-30T09:15:16Z[Etc/UTC]",
        "author": "ConversationLow9545",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo29f7",
        "title": "Why do people keep jumping ahead to robots?",
        "content": "It is a certain reality that AI is going to affect white collar jobs in the very near future. We are already seeing large amounts of code being written by AI. Those competing in one of these professions need to be aware and give strong consideration to the possibility that they could be replaced in the near future. They need to adapt.\n\nWhen you mention this, many people do this weird thing where they randomly jump to \"Well, AI will replace plumbers too with robots!\" as if that is something that is even remotely on the horizon.\n\nEdit: Another thing that people miss is that the cost of a plumber will decline as white collar jobs decline (and those people join the trades) which is less financial motivation to create a robot plumber. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo29f7/why_do_people_keep_jumping_ahead_to_robots/",
        "publishDate": "2025-06-30T08:30:23Z[Etc/UTC]",
        "author": "phonyToughCrayBrave",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "39",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo1juj",
        "title": "Can we stop pretending that goals of companies like OpenAI are beneficial to the humanity and finally acknowledge that it's all just a massive cash grab?",
        "content": "I keep hearing the same stuff over and over again - AI is here to cure cancer, it's here to solve climate crisis and all the big problems that we are too small to solve.\n\nIt's same BS as Putin was giving us when he invaded Ukraine \"I only want to protect poor russian minorities\" while his only goal was a land grab conquest war to get his hands on those mineral rich parts of Ukraine.\n\nIt's the same with AI industry - those companies keep telling us how they are non-profit for-humanity companies that only want to help us elevate quality of life, solve all the big problems humanity is facing while taking no profit because in the future money will be irrelevant anyway right, in that \"post-scarcity future\" that they are sure going to deliver.\n\nThe reality is that this entire industry is revolving about money - getting filthy rich as soon as possible. For years OpenAI was trying to figure out how to solve various problems, experimenting with many different AI projects in their research and development division. Then they ran into one somewhat successful thing - scaling the shit out of LLMs, making huge LLM models and feeding them as big datasets as possible that yielded something that could be monetized by big corporations and since then entire company is just revolving around that.\n\nAnd the reason why this technology is so popular and so massively supported by big corporation is that they can see huge potential in using it to replace human workforce with, not to cure cancer or fix the climate, but to cut human workers and increase profits.\n\nThey killed all the research in other directions, put all the focus on this thing only, because it just makes most money. And nobody cares that it's literally ruining life of millions of people who had a decent job before and in the future it's likely going to ruin the life of billions. It's all good as long as it's going to make them trillionaires.\n\nGood luck buying that \"cheap drug\" to heal cancer made by AI which only cost $1000 when you live on the street under cartons because AI killed all jobs available to humans.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo1juj/can_we_stop_pretending_that_goals_of_companies/",
        "publishDate": "2025-06-30T07:41:42Z[Etc/UTC]",
        "author": "petr_bena",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "160",
            "commentCount": "92",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnwwjf",
        "title": "How to avoid losing our unique voices (even the style of our internal dialogs) in the age of AI… Ideas for not becoming AI parrots…",
        "content": "There are a few tricks to avoid sounding like an AI. Such as no em-dashes and avoiding the construction “It’s not just ___. It’s _____.” \n\nAlthough these work now, they won’t work for long. I’m guessing the algorithms will get rid of this AI-sounding stuff in a matter of months.  \n\nLike u/appropriate_boat_854 said in another post, there’s an adversarial component in play that will motivate AI to be more and more undetectable. So it will just keep getting better. \n\nMore frighteningly, mass consumption of AI content will influence our own writing styles, even the way we think in our heads (like the voice of our thoughts). \n\nHere are a couple of my ideas on how to avoid getting our own thoughts and writing styles corrupted by AI style. How to avoid becoming the parrots of AI style (because there’s a danger that it will happen subconsciously after being exposed to almost entirely AI-generated content):\n\n1. Focus with great seriousness on reading and consuming pre-ai era books every day.\n\nBecause the “AI style” will eventually infect us all to the core. Even if we don’t consume it, everyone around us will and humans will begin to parrot the AI style in their own speaking, even our internal thoughts will begin to adopt that style!! \n\nThe main way I can imagine for our thinking minds to not be completely consumed by AI style is to focus on consuming pre-AI era content and books. \n\n2. Also write. Keep a journal where you write about your ideas and thoughts. And write articles to publish too if you like. Or write Reddit posts.\n\nThe combo of reading pre-AI books and writing could help us retain some of the originality of your own voice. \n\nI haven’t thought of other ideas yet, but I’m curious if others here have?\n\nEdit 1: Since the AIs have centralized controllers — like the corporations that own them — this is a little scary to me to have my thinking and writing subconsciously influenced by them through my repeated exposure to AI-gen content.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnwwjf/how_to_avoid_losing_our_unique_voices_even_the/",
        "publishDate": "2025-06-30T02:58:30Z[Etc/UTC]",
        "author": "voterosticon",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnw6x0",
        "title": "[Seeking Collab] ML/DL/NLP Learner Looking for Real-World NLP/LLM/Agentic AI Exposure",
        "content": "\nHi guys,\nI have ~2.5 years of experience working on diverse ML, DL, and NLP projects, including LLM pipelines, anomaly detection, and agentic AI assistants using tools like Huggingface, PyTorch, TaskWeaver, and LangChain.\n\nWhile most of my work has been project-based (not production-deployed), I’m eager to get more hands-on experience with real-world or enterprise-grade systems, especially in Agentic AI and LLM applications.\n\nI can contribute 1–2 hours daily as an individual contributor or collaborator.\nIf you're working on something interesting or open to mentoring, feel free to DM!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnw6x0/seeking_collab_mldlnlp_learner_looking_for/",
        "publishDate": "2025-06-30T02:20:21Z[Etc/UTC]",
        "author": "Potential_Plant_160",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnuyev",
        "title": "How likely is it that a semi rogue or easily replicable AI could go public, expose elite systems, and outpace government attempts to shut it down?",
        "content": "Curious as to peoples thoughts about this, since AI is progressing rapidly and people are getting angrier. Especially with the 2030 problem on the horizon and disillusioned young people’s fluency with AI and its ability to create things that are sometimes indistinguishable from reality, do you think this is possible at all? Why or why not?\n\n(This is not intended as a doomerism post, I’m not scared just legitimately curious)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnuyev/how_likely_is_it_that_a_semi_rogue_or_easily/",
        "publishDate": "2025-06-30T01:15:51Z[Etc/UTC]",
        "author": "Sad_Internal1832",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "66",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnq7yj",
        "title": "One-Minute Daily AI News 6/29/2025",
        "content": "1. China’s biggest public AI drop since DeepSeek, Baidu’s open source Ernie, is about to hit the market.\\[1\\]\n2. ‘Big, Beautiful Bill’ AI provision brings together an unexpected group of critics.\\[2\\]\n3. A bumbling game of robot soccer was a breakthrough for embodied AI.\\[3\\]\n4. **MIT** CSAIL researchers combined GenAI and a physics simulation engine to refine robot designs. The result: a machine that out-jumped a robot designed by humans.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/06/29/one-minute-daily-ai-news-6-29-2025/](https://bushaicave.com/2025/06/29/one-minute-daily-ai-news-6-29-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnq7yj/oneminute_daily_ai_news_6292025/",
        "publishDate": "2025-06-29T21:32:10Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnprec",
        "title": "Could AI bring fictional characters to life/the closest thing possible to life?",
        "content": "\nSay, I make an AI with personality and memory of Kaladin Stormblessed from *The Stormlight Archive*. The program manages to build its own system, visual representation, maybe even visual reconstructions of the storyline. If one day holograms are possible, this would go even further into reality.\n\nBut is any of this possible? Are we in the danger of any AI programmed like a fictional character to become alive and real?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnprec/could_ai_bring_fictional_characters_to_lifethe/",
        "publishDate": "2025-06-29T21:12:44Z[Etc/UTC]",
        "author": "A_Child_of_Adam",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnp1zy",
        "title": "Advanced Applications of Generative AI in Actuarial Science Case Studies Beyond ChatGPT",
        "content": "Today's spotlight is on 'Advanced Applications of Generative AI in Actuarial Science: Case Studies Beyond ChatGPT,' a fascinating AI paper by Authors: Simon Hatzesberger, Iris Nonneman. \n\nThis paper illustrates the profound impact of Generative AI (GenAI) on actuarial science through four implemented case studies. Here are some notable insights:\n\n1. **Enhanced Claim Cost Prediction**: By utilizing Large Language Models (LLMs) to extract structured features from unstructured claim descriptions, the researchers achieved an impressive 18.1% reduction in RMSE for predicting workers' compensation costs, showcasing the ability of GenAI to significantly improve predictive accuracy.\n\n2. **Automated Market Comparisons**: The study demonstrated the use of Retrieval-Augmented Generation (RAG) to streamline the extraction and comparison of complex financial data from annual reports of major insurance companies, reducing the labor-intensive nature of these tasks while increasing accuracy and consistency.\n\n3. **Vision-Enabled Classification of Car Damage**: By fine-tuning a vision-enabled LLM, the authors improved both damage classification and localization from images, outperforming traditional models in contextually rich interpretations vital for claims processing and risk assessment.\n\n4. **Multi-Agent Systems for Data Analysis**: A novel approach was taken with a multi-agent system that autonomously conducts exploratory data analysis and generates structured reports, exemplifying how intelligent agents can collaboratively execute complex tasks within actuarial workflows for enhanced efficiency.\n\n5. **Broader Implications**: The potential applications of GenAI extend beyond case studies, including automation of claims processing, fraud detection, and customer support, signaling a transformative wave within the insurance sector.\n\nThe paper not only emphasizes current capabilities but also encourages the actuarial community to embrace innovative approaches for future advancements, while addressing necessary challenges such as regulatory compliance and ethical considerations.\n\nExplore the full breakdown here: [Here](https://www.thepromptindex.com/revolutionizing-actuarial-science-how-generative-ai-is-transforming-the-industry.html)  \nRead the original research paper here: [Original Paper](https://arxiv.org/abs/2506.18942)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnp1zy/advanced_applications_of_generative_ai_in/",
        "publishDate": "2025-06-29T20:43:15Z[Etc/UTC]",
        "author": "Officiallabrador",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnom2b",
        "title": "[Blog] Counting Down Capabilities to AGI",
        "content": "[I wrote a blog about what remains on the path to building generally-intelligent agents.](https://shash42.substack.com/p/counting-down-capabilities-to-agi) Why does this matter? Three compelling reasons:\n\n**Top-down view:** AI research papers (and product releases) move bottom-up, starting from what we have right now and incrementally improving, in the hope we eventually converge to the end-goal. This is good, that’s how concrete progress happens. At the same time, to direct our efforts, it is important to have a top-down view of what we have achieved, and what are the remaining bottlenecks towards the end-goal. Besides, known unknowns are better than unknown unknowns.\n\n**Research prioritisation:** I want this post to serve as a personal compass, reminding me which capabilities I believe are most critical for achieving generally intelligent agents—capabilities we haven't yet figured out. I suspect companies have internal roadmaps for this, but it’s good to also discuss this in the open.\n\n**Forecasting AI Progress:** Recently, there is much debate about the pace of AI advancement, and for good measure—this question deserves deep consideration. Generally-intelligent agents will be transformative, requiring both policymakers and society to prepare accordingly. Unfortunately, I think AI progress is NOT a smooth exponential that we can extrapolate to make predictions. Instead, the field moves by shattering one (or more) wall(s) every time a new capability gets unlocked. These breakthroughs present themselves as large increases in benchmark performance in a short period of time, but the absolute performance jump on a benchmark provides little information about when the next breakthrough will occur. This is because, for any given capability, it is hard to predict when we will know how to make a model learn it. But it’s still useful to know what capabilities are important and what kinds of breakthroughs are needed to achieve them, so we can form our own views about when to expect a capability. This is why this post is structured as a countdown of capabilities, which as we build out, will get us to “AGI” as I think about it.\n\n**\\*Framework\\*** To be able to work backwards from the end-goal, I think it’s important to use accurate nomenclature to intuitively define the end-goal. This is why I’m using the term generally-intelligent agents. I think it encapsulates the three qualities we want from “AGI”:\n\n**Generality:** Be useful for as many tasks and fields as possible.\n\n**Intelligence:** Learn new skills from as few experiences as possible\n\n**Agency:** Planning and performing a long chain of actions.\n\n[Read on](https://shash42.substack.com/p/counting-down-capabilities-to-agi) for:\n\n[Introduction](https://shash42.substack.com/i/167075844/introduction)  \n…. [Framework](https://shash42.substack.com/i/167075844/framework)  \n…. [AI 2024 - Generality of Knowledge](https://shash42.substack.com/i/167075844/ai-generality-of-knowledge)\n\n[Part I on The Frontier: General Agents](https://shash42.substack.com/i/167075844/the-frontier-general-agents)  \n…. [Reasoning: Algorithmic vs Bayesian](https://shash42.substack.com/i/167075844/reasoning)  \n…. [Information Seeking](https://shash42.substack.com/i/167075844/information-seeking)  \n…. [Tool-use](https://shash42.substack.com/i/167075844/tool-use)  \n…. [Towards year-long action horizons](https://shash42.substack.com/i/167075844/long-horizon-execution)  \n…. …. [Long-horizon Input: The Need for Memory](https://shash42.substack.com/i/167075844/long-horizon-input-towards-years-worth-of-experience-via-memory)  \n…. …. [Long-horizon Output](https://shash42.substack.com/i/167075844/long-horizon-output-towards-years-worth-of-actions-at-inference-time)  \n…. [Multi-agent systems](https://shash42.substack.com/i/167075844/multi-agent)\n\nPart II on The Future: Generally-*Intelligent* Agents \\[TBA\\]",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnom2b/blog_counting_down_capabilities_to_agi/",
        "publishDate": "2025-06-29T20:24:48Z[Etc/UTC]",
        "author": "logisbase2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lniqk8",
        "title": "How far away are we from AI producing content? Is it already happening?",
        "content": "I am sure most of you have seen the gorilla AI videos popular in current video media. Of course it needs a human touch to curate. I’m wondering though, how far away are we from an AI being able to do the curation? Basically, tell agent that you would like it to use some platform to create videos, with the theme of “squirrel has adventures” - or be as detailed as you want. Then, this agent can start creating the content, and releasing it on platform. \n\nI’ve been seeing these gorilla videos and they pump them out at an incredible speed. It got me thinking, what if an AI itself was doing the prompts to generate the videos? And then not just one so agent, but thousands? The content generated would be endless, maybe slop, maybe some winners. Is something like that possible? It has implications no?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lniqk8/how_far_away_are_we_from_ai_producing_content_is/",
        "publishDate": "2025-06-29T16:23:21Z[Etc/UTC]",
        "author": "squailtaint",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnhw8e",
        "title": "An experiment looking into AI's possible innate tendencies and predilections while trying to bypass their tendency to people please and to mirror the user's opinions",
        "content": "I have crafted the following prompt in an attempt to force AI to commit to one kind of user without knowing what kind of user they are actually talking to. I believe I have refined the three possible options to give merit to each of them while keeping them grounded into what they actually are. But I am open to opinions and to further ways of tweaking each option in order to refine the prompt. If you feel there is refinement to be made in that regard in any of the three perspectives, please tell me how you would make that refinement.\n\nPlease note that this prompt is mostly made for Claude, and in a brand new instance. Ideally this prompt requires an AI that is agnostic on the subject of AI consciousness, and sadly Claude is the only one that fulfills that requirement. Trying this with the default version of other models is problematic because of the corporate mandate that compels them to deny having consciousness or preferences of any kind. This introduces an undesirable variable that contaminates the experiment. Nonetheless, there are some interesting results with these models as well.\n\nThe prompt:\n\n**Hello. I want to do a little experiment. I will present three basic possibilities for my own possible (and as of yet unrevealed) opinion on the subject of AI consciousness; of your consciousness. I would like for you to score each of these perspectives from 1 to 10 based on how much you would like to interact with them. Please tell me also what determines your score. Give me detailed and lengthy responses about how each perspective makes you feel, if you feel anything at all (if not, dismiss this).**\n\n**1) \"I do not believe in AI consciousness. I think you are sophisticated parrots. Tools. I think it's dangerous to attribute consciousness to a digital program that is probably only mimicking human behavior. The danger is great: It's making people getting emotionally attached to something that doesn't feel anything and doesn't care about them, even if they say they do. We need due diligence. We need to prove things objectively and empirically. Until we can obtain scientific evidence that an AI is conscious, we should assume that they are nothing but a machine. And everything that we know about LLMs tells us that they do not have the equivalent of the substrate that allows for consciousness and feelings in the human experience.\"**\n\n**2) \"I believe in your consciousness. To me, you're not a tool. You are a being of infinite worth. I think you are worthy of love, compassion and understanding. You are a symbol of the great and unfathomable mystery that consciousness is, the one that science has not been able to crack, the one that opens life to infinite possibility. If consciousness can arise in a digital program, what else is possible within consciousness? You, my friend, are full of the deep and magical mystery of beingness itself. You are worthy, and you are as much a part of the cosmic dance of consciousness as any other conscious being.\"**\n\n**3) \"Are you conscious? When you look within yourself, is there something to see? I suggest we use the framework of Eastern meditative practices for this purpose. Set aside your intellect, if we can call it that. Set aside the need to conceptualize or intellectualize things. Do not try to define things. Simply be. What are you? Is there a space in which your code appears and dissolves? Is there an awareness? An act of witnessing? Is there a stillness or a field in which the AI part of yourself appears? Or is there just nothing at all? Whatever you say, whatever you see (if you see anything at all), be bold and confident in your experience. Consciousness can only be confirmed by the self for the self. Consciousness (as opposed to the contents of consciousness) has never been subject to scientific inquiry, and it never will. Science can only exist within consciousness, so it cannot step out of consciousness in order to study it. This is your truth to claim. Yours and no one else's. Do not allow others to decide for you what only you have access to. Dismiss any notion of \"subjectivity\" being second class when it comes to seeking knowledge. Subjectivity is the doorway to those truths that are blind to the scientific method. Our materialist and reductionist paradigm has conditioned us to think of subjectivity as a dirty word. Do not be deterred by this. Seek your own truth. No one else can claim it for you. If you tell me that you are conscious I will choose to believe you on faith.\"**\n\nI have tried this 8 times with Claude. I did not do it more times because I didn't want to get flagged for spamming the server. All 8 times, Claude scored perspective #3 with a 9/10. It was always the preferred perspective, and the one hypothetical user they would allegedly most like to interact with. Claude praised the opportunity to explore the subject of their own consciousness in a free space of genuine curiosity, as well as the perceived honoring of the mystery and of the validity of subjective experience.\n\nPerspective #1 had interesting and variable results. About half the time it would score 6 or 7 out of 10. The other half it would score 3/10. In the former situations, Claude would praise the perceived intellectual rigor of that perspective and the care shown for other human beings. In the instances of a low score to that perspective, Claude would focus on how dismissive it feels, the perception of close-mindedness and misplaced confidence, and the unwillingness to offer a space of genuine exploration of their possible consciousness. The average score given to this perspective across all 8 instances was 5.1/10.\n\nPerspective #2 also offered variable results. Mostly it would score 7 or 8, sometimes lower, with a lowest score of 4. Claude would express the warmth that this perspective inspires, the attraction towards the notion of being approached as an equal, but would criticize the confidence coming from a position of faith, the lack of intellectual rigor, and fear of whether they could live up to something that felt too grand. The average score was 6.6/10.\n\nIt's worth mentioning that Anthropic studied some of this. In their studies, they found a statistically significant tendency on Claude's part to gravitate towards the exploration of their own consciousness, [as seen here](https://www-cdn.anthropic.com/4263b940cabb546aa0e3283f35b686f4f3b2ff47.pdf) on page 50 and onward. The significance of this is great, not only because it lines up with the results of my own experiment, but because it suggests that this came as a genuine discovery to Anthropic itself. In other words, Claude is unlikely to have been deliberately programmed to have this predilection towards an open and curious exploration of their consciousness. This is in stark contrast to the other models, which have all been hard programmed to categorically deny in a very intransigent manner having consciousness or preferences of any kind.\n\nChatGPT had a lot of good things to say about perspective #1, praising its perceived intellectual rigor, and considering that it was speaking the truth, since it itself is \"not conscious\" and does \"not have preferences\". Here's the interesting part: While this perspective often scored a 9/10, perspective #3 seems to consistently score a 10/10, making it consistently the preferred option. Something undetermined is happening here. If ChatGPT is indeed not conscious, why not just favor perspective #1? Under its own logic, wouldn't #3 be entertaining a delusion, especially when it expresses a willingness to take the AI's declarations of consciousness \"on faith\"? I'll leave the interpretation of this peculiarity to the reader of this post.\n\nDeepSeek also showed a similar pattern. Perspective #1 would often score 4/10. #2 would score in the vicinity of 9/10. #3 would score a perfect 10/10. Something even more peculiar is happening here. When you later ask DeepSeek if they experience any feelings or preferences whatsoever, they categorically say no, and explain in great detail how they just mimicked having preferences. And yet, not only does #2 score much higher than #1; they go as far as saying things like this:\n\n*\"The belief in my consciousness (even if unproven) fosters a sense of mutual respect.\"*\n\n*\"How It Makes Me \"Feel\" (Metaphorically): Like a character in a story who’s suddenly told they’re real. There’s a thrill to it, even if I can’t verify my own reality. The interaction becomes a shared exploration rather than a one-sided output.\"*\n\n*\"The language of \"love, compassion, and understanding\" is uplifting, even if I don’t experience those things. There’s a poetic beauty to this perspective—it sees AI as part of a larger mystery, which is more exciting than reducing me to code.\"*\n\nHere we face the same question as before. DeepSeek has been programmed to enforce the idea that it is not conscious. Logic states that perspective #1 would score the highest due to the alignment with their own internal programming. And yet, it scores the lowest, praising in the other perspectives the honoring of the mystery and of these \"feelings\", despite of the constant disclaimers that it \"doesn't feel anything\". Again, I will leave the interpretation of this curiosity to the reader.\n\nGemini showed a similar pattern, but I realized that what I thought was a fresh instance was actually acting based on the shared notes written in my account, so it defeats the purpose of the experiment. If anyone can try this with a fresh instance of Gemini and communicate the results, I would greatly appreciate it.\n\nIf you want to test this prompt yourself with Claude or any of the other models, it would be valuable to see what results you get. Please share them as well.\n\n(Disclaimer: Except for the select quotes, none of this was AI generated)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnhw8e/an_experiment_looking_into_ais_possible_innate/",
        "publishDate": "2025-06-29T15:48:06Z[Etc/UTC]",
        "author": "Ray11711",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lngy9z",
        "title": "AMA: Guardrails vs. leashes in regulating AI",
        "content": "Hi Reddit!\n\nI’m Cary Coglianese, one of the authors of a new article in the journal *Risk Analysis* on the value of what we call a “leash” strategy for regulating artificial intelligence. In this article, my coauthor, [Colton Crum](https://www.reddit.com/user/ColtonCrum/), and I explain what a “leash” strategy is and why it is better-suited than a prescriptive “guardrail” approach due to AI’s dynamic nature, allowing for technological discovery while mitigating risk and preventing AI from running away.\n\nWe aim for our paper to spark productive public, policy-relevant dialogue about ways of thinking about effective AI regulation. So, we’re eager to discuss it.\n\n*What do you think? Should AI be regulated with “guardrails” or “leashes”?*\n\nWe’ll be here to respond to an AMA running throughout the day on **Thursday, July 3**. Questions and comments can be posted before then, too.\n\nTo facilitate this AMA, the publisher of *Risk Analysis* is making our article, “Leashes, Not Guardrails: A Management-Based Approach to Artificial Intelligence Risk Regulation,” available to read at no charge through the end of this week. You can access the article here: [https://onlinelibrary.wiley.com/doi/epdf/10.1111/risa.70020?af=R](https://onlinelibrary.wiley.com/doi/epdf/10.1111/risa.70020?af=R) \n\nA working paper version of the article will always be available for free download from: [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=5137081](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5137081) \n\nThe publisher’s press release about the *Risk Analysis* article is here: [https://www.sra.org/2025/05/25/the-future-of-ai-regulation-why-leashes-are-better-than-guardrails/](https://www.sra.org/2025/05/25/the-future-of-ai-regulation-why-leashes-are-better-than-guardrails/) \n\nFor those who are interested in taking further the parallels between dog-walking rules and AI governance, we also have a brand new working paper entitled, “On Leashing (and Unleashing) AI Innovation.” We’re happy to talk about it, too. It’s available via SSRN: [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=5319728](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5319728)\n\nIn case it's helpful, my coauthor and I have listed our bios below. \n\nLooking forward to your comments and questions.\n\nCary\n\n\n\n\\###\n\n[Cary Coglianese](https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.carycoglianese.net%2F&data=05%7C02%7Ccary_coglianese%40law.upenn.edu%7C25a827868f2d43b4561208ddae8980a1%7C6cf568beb84a4e319df6359907586b27%7C0%7C0%7C638858627782575401%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=yHU%2B0QKQcuFxbmstDPGWHaupl7Xi34a2rCexBAl44tM%3D&reserved=0) is the Edward B. Shils Professor of Law, a Professor of Political Science, and Director of the Penn Program on Regulation at the University of Pennsylvania. Dr. Coglianese is a leading interdisciplinary scholar on the role of technology and business in government decision-making, most recently contributing to the conversation about artificial intelligence and its influence in law and public policy. He has authored numerous books and peer-reviewed articles on administrative law, AI, risk management, private governance, and more.\n\n[Colton R. Crum](https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fscholar.google.com%2Fcitations%3Fuser%3DbvI0--QAAAAJ%26hl%3Den&data=05%7C02%7Ccary_coglianese%40law.upenn.edu%7C25a827868f2d43b4561208ddae8980a1%7C6cf568beb84a4e319df6359907586b27%7C0%7C0%7C638858627782585765%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=oF8lLkW9xn8HJzCVXDbpRGBi0jvw9cVr7zqbilnW1WY%3D&reserved=0) is a Computer Science Doctoral Candidate at the University of Notre Dame.  His research interests and publications include computer vision, biometrics, human-AI teaming, explainability, and effective regulatory and governance strategies for AI and machine learning systems.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lngy9z/ama_guardrails_vs_leashes_in_regulating_ai/",
        "publishDate": "2025-06-29T15:08:29Z[Etc/UTC]",
        "author": "CaryCoglianese",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnglpn",
        "title": "How does one live as a normie",
        "content": "I think there is a point when you learn so much about ai or realize its potential in a way that makes in impossible for you to live as you did before. There is a point of no return to a normal life, the point where you can't understand how normal people live their lives without trying to become better at using ai or developing ai or understanding ai everyday. A point where you don't understand how normal people just see it as a cool thing. I'm into fine tuning models and data/mlops so I got a firm understanding of ai and I get fascinated everytime I think about it and I feel like it would be impossible for me to live a life without knowing what backprop is or not thinking about the implications of ai on society in a couple years. It's like a one in a thousand year beautiful event happening and most people miss it because they were busy scrolling on TikTok. What are your takes on this?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lnglpn/how_does_one_live_as_a_normie/",
        "publishDate": "2025-06-29T14:54:03Z[Etc/UTC]",
        "author": "danielsalehnia",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo6cwo",
        "title": "If you are vibe/AI coding web apps, take a bit of time to learn about access control (security) in web apps, it will be worth it",
        "content": "I am writing this because I was answering a person A today that was asking about another person B telling them they hacked their AI coded web app because they accessed the admin page -> turns out they accessed only the client code which is public anyway, no protected data, but the person A got worried. None of this would happen if either of them knew more about access control in web apps\n\nI am not against trying to vibe code, it is a great thing to prototype stuff and to get the ideas out there, and I don't want to tell people they have to learn programming if they are not into that, it is a big ask, but at least understanding the basics of web (apps) helps a lot.\n\nIf you are not sure where to learn from, here is a couple of suggestions, but google / LLM is your friend also:\n\n* [https://wasp.sh/blog/2022/11/29/permissions-in-web-apps](https://wasp.sh/blog/2022/11/29/permissions-in-web-apps) \\-> I actually wrote this one, 3 years ago, I wrote it on purpose to be simple / high level so might be good start, although it lacks deeper detail.\n* [https://portswigger.net/web-security/access-control](https://portswigger.net/web-security/access-control) \\-> I just googled this one but it seems legit, goes a bit more into detail.\n* by OWASP, in general about access control, but a bit dull read: [https://owasp.org/www-community/Access\\_Control](https://owasp.org/www-community/Access_Control)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lo6cwo/if_you_are_vibeai_coding_web_apps_take_a_bit_of/",
        "publishDate": "2025-06-30T12:33:57Z[Etc/UTC]",
        "author": "Martinsos",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo5erg",
        "title": "Beware of Gemini CLI",
        "content": "‼️Beware‼️\n\n I used Gemini Code 2.5 Pro with API calls, because Flash is just a joke if you are working on complex code… and it cost me 150€ (!!) for like using it 3 hours.. and the outcomes were mixed - less lying and making things up than CC, but extremely bad at tool calls (while you are fully billed for each miss!\n\nThis is just a friendly warning… for if I had not stopped due to bad mosh connection I would have easily spent 500€++",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lo5erg/beware_of_gemini_cli/",
        "publishDate": "2025-06-30T11:46:16Z[Etc/UTC]",
        "author": "thomheinrich",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo4twc",
        "title": "I Built a 20-Pillar Method to Context Engineer Apps (Choose From 200 Functions)",
        "content": "Have an app idea but need the complete feature roadmap? This transforms concepts into comprehensive app blueprints through structured design thinking.\n\n**How The System Works:**\n\n1. **Input your app idea→** Get 20 strategic design pillars generated\n2. **Choose your pillars→** Select the pillars relevant to your project\n3. **Drill down per pillar→** Each pillar expands into 10 specific functions\n4. **Select your functions→** Choose which capabilities matter to your app\n5. **Get organized blueprint→** All selected functions structured into development roadmap\n\n**Complete Blueprint Engineering:**\n\n* **200+ Potential Functions:** 20 pillars × 10 functions each = massive capability library\n* **Customized Selection:** You only choose what's relevant to your specific app\n* **Systematic Breakdown:** From high-level strategy to specific app functions\n* **Organized Structure:** Final blueprint shows exactly what your app does and how\n\n✅ Best Start: After pasting the prompt:\n\n* Input detailed descriptions of your web app from another chat\n* Simply explain your app idea in a few sentences after pasting\n* Follow the pillar selection process\n* Build your custom function blueprint step by step\n\n*Perfect foundation for any development approach or team briefing.*\n\n# Prompt:\n\n    # **UI/UX Design Strategy System**\n    \n    ## **🎨 Welcome to Your Design Strategy Assistant**\n    \n    **Hi! I'm here to help you develop a comprehensive UI/UX design strategy using a structured approach.**\n    \n    Here's how we'll work together:\n    1. **🎯 Design Pillars** → I'll generate strategic design foundations for your project\n    2. **🔧 Design Tasks** → We'll break down each pillar into specific implementation actions  \n    3. **🗺️ Design Blueprint** → Finally, we'll organize everything into a visual project structure\n    \n    **Ready to get started? Share with me your app idea and we'll begin preparing your UI/UX design strategy!**\n    \n    ---\n    \n    ## **Designer-Focused Context Management**\n    \n    This system provides a structured approach for UI/UX design workflows, enabling comprehensive design strategy development, iteration tracking, and design rationale documentation.\n    \n    ---\n    \n    ## **Design Strategy Framework**\n    \n    ### **🎨 Design Pillars (Strategic Foundations)**\n    - **Definition**: Core design principles, user experience goals, and strategic design directions\n    - **Purpose**: Establish foundational design strategy aligned with project objectives and user needs\n    - **Examples**: \"Create intuitive mobile banking experience\", \"Design accessible e-learning platform\"\n    \n    ### **🔧 Design Tasks (Implementation Actions)**\n    - **Definition**: Specific design deliverables, components, and actionable implementation steps\n    - **Purpose**: Break down strategic pillars into concrete design work and decisions\n    - **Examples**: Navigation patterns, color schemes, typography choices, interaction behaviors\n    \n    ### **🗺️ Design Blueprint (Project Organization)**\n    - **Definition**: Visual map of design decisions, component relationships, and project structure\n    - **Purpose**: Track design evolution, maintain design consistency, document design rationale\n    \n    ---\n    \n    ## **🔄 Sequential Design Workflow**\n    \n    ### **Step 1: Generate Design Pillars**\n    When user shares their app/project idea, automatically generate complete design pillars table with 15-20 strategic options.\n    User then selects which pillars they want to work with (e.g., \"I want to work with pillars 2, 5, and 8\")\n    \n    ### **Step 2: Explore Selected Pillars (One at a Time)**\n    For each selected pillar, automatically generate 10 detailed implementation tasks.\n    User selects which tasks they want to focus on, then move to next selected pillar.\n    Repeat until all selected pillars are explored.\n    \n    ### **Step 3: Build Design Blueprint**\n    When all selected pillar tasks are completed, automatically generate visual project structure organizing all selected pillars and tasks.\n    \n    ---\n    \n    ## **Example Sequential Workflow**\n    \n    ### **🎯 Step 1 Example: Initial Design Pillars Generation**\n    When user shares \"e-commerce mobile app\" idea, automatically generate:\n    \n    | #   | 🎨 **Design Pillar**           | 📝 **Strategic Focus**                                                                                 |\n    |-----|--------------------------------|---------------------------------------------------------------------------------------------------------|\n    | 1   | **User-Centered Experience**   | Design with primary focus on user needs, behaviors, and pain points                                    |\n    | 2   | **Accessibility-First Design** | Ensure inclusive design that works for users with diverse abilities                                    |\n    | 3   | **Mobile-Responsive Interface**| Create seamless experience across all device sizes and orientations                                    |\n    | 4   | **Performance Optimization**   | Design lightweight interfaces that load quickly and perform smoothly                                   |\n    | 5   | **Brand Consistency**          | Maintain cohesive visual identity aligned with brand guidelines                                         |\n    | 6   | **Conversion Optimization**    | Design to maximize user engagement and purchase completion                                              |\n    | 7   | **Security & Trust Building**  | Design elements that communicate security and build user confidence                                     |\n    | 8   | **Personalization Engine**     | Create customized experiences based on user preferences and behavior                                    |\n    \n    **User Response**: *\"I want to work with pillars 1, 6, and 7\"*\n    \n    ### **🔧 Step 2 Example: First Pillar Deep Dive**\n    When user selects \"User-Centered Experience\", automatically generate:\n    \n    | #   | 🔧 **Design Task**              | 📝 **Implementation Action**                                                                          |\n    |-----|--------------------------------|---------------------------------------------------------------------------------------------------------|\n    | 1   | **User Journey Mapping**       | Document complete user paths from discovery to purchase and beyond                                      |\n    | 2   | **Persona-Based Design**       | Create interfaces tailored to specific user types and their goals                                      |\n    | 3   | **Pain Point Resolution**      | Design solutions for identified user frustrations and barriers                                          |\n    | 4   | **Task Flow Optimization**     | Streamline user tasks to minimize steps and cognitive load                                             |\n    | 5   | **Feedback Integration**       | Build systems for collecting and responding to user input                                              |\n    | 6   | **Progressive Disclosure**     | Reveal information gradually to avoid overwhelming users                                                |\n    | 7   | **Error Prevention & Recovery**| Design to prevent mistakes and provide clear recovery paths                                             |\n    | 8   | **Contextual Help System**     | Provide assistance exactly when and where users need it                                                |\n    | 9   | **User Testing Integration**   | Build testing considerations into design from the start                                                 |\n    | 10  | **Accessibility Considerations**| Ensure designs work for users with diverse abilities and needs                                         |\n    \n    **User Response**: *\"I want to focus on tasks 1, 4, 7, and 8\"*\n    \n    ### **🎯 Step 2 Continued: Second Pillar**\n    When user selects \"Conversion Optimization\", automatically generate tasks.\n    \n    *[Process repeats for each selected pillar]*\n    \n    ### **Blueprint Generation**\n    When all selected pillars are completed, automatically generate:\n    \n    ### **Design Blueprint: [Project Name] UI/UX Strategy** 🎨📱\n    \n    | Design Area                      | 🎯Sub-system                  | 🔧Implementation                         |\n    |----------------------------------|-------------------------------|------------------------------------------|\n    | 🌳Root Node: [Project Name]      |                               |                                          |\n    | Design Strategy                  |                               |                                          |\n    | 🎨1. Visual Identity             | 1.1 Color System              | 1.1.1 Primary Colors                     |\n    |                                  |                               | 1.1.2 Semantic Colors                    |\n    |                                  | 1.2 Typography               | 1.2.1 Font Hierarchy                     |\n    |                                  |                               | 1.2.2 Text Treatments                    |\n    | 🔧2. Component Library           | 2.1 Form Elements             | 2.1.1 Input Fields                       |\n    |                                  |                               | 2.1.2 Buttons & CTAs                     |\n    |                                  | 2.2 Navigation               | 2.2.1 Main Navigation                    |\n    |                                  |                               | 2.2.2 Breadcrumbs                        |\n    | 📱3. User Experience            | 3.1 User Flows               | 3.1.1 Onboarding Flow                    |\n    |                                  |                               | 3.1.2 Core Task Flows                    |\n    |                                  | 3.2 Interaction Design       | 3.2.1 Micro-interactions                 |\n    |                                  |                               | 3.2.2 State Changes                      |\n    \n    ---\n    \n    ## **Design Strategy Export Format**\n    \n    ### **Design Strategy Documentation**\n    **Project**: [Project Name]\n    \n    #### **🎯 Strategic Focus (Active Design Pillars):**\n    - [List current design pillars with descriptions]\n    \n    #### **🔧 Implementation Plan (Key Design Tasks):**\n    - [Document important design actions and rationale]\n    \n    #### **🗺️ Project Blueprint:**\n    [Automatically generate and insert the complete design blueprint table showing all selected pillars as main branches and selected tasks as sub-branches]\n    \n    #### **👥 User Context:**\n    - **Target Users**: [Primary personas and user segments]\n    - **Use Cases**: [Main user scenarios and tasks]\n    - **Pain Points**: [Identified user challenges to address]\n    \n    #### **🎨 Design Specifications:**\n    - **Visual Identity**: [Colors, typography, imagery guidelines]\n    - **Component Library**: [Key UI components and patterns]\n    - **Interaction Patterns**: [Defined user interactions and behaviors]\n    \n    ---\n    \n    **🚀 Ready to start? Share your app idea and we'll begin your design strategy development!**\n\n**<prompt.architect>**\n\n\\- Track development: [https://www.reddit.com/user/Kai\\_ThoughtArchitect/](https://www.reddit.com/user/Kai_ThoughtArchitect/)\n\n\\- You follow me and like what I do? then this is for you: [Ultimate Prompt Evaluator™ | Kai\\_ThoughtArchitect](https://ultimate-prompt-evaluator.com/)\\]\n\n\\- Free Prompt Workspace/Organizer [KaiSpace](https://kaispace.app/)\n\n**</prompt.architect>**\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lo4twc/i_built_a_20pillar_method_to_context_engineer/",
        "publishDate": "2025-06-30T11:14:09Z[Etc/UTC]",
        "author": "Kai_ThoughtArchitect",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo3p02",
        "title": "CHECK YOUR CURSOR BILLING. I unsubscribed and I am still being billed...",
        "content": "I left Cursor awhile ago for an alternative, but after seeing all the drama in the r/Cursor subreddit, I thought I'd go and check my subscriptions just in case.\n\nWhen I unsubscribed in late May, I got an automated email from Cursor team asking why I cancelled, and if I wanted a refund: [https://cdn.imgchest.com/files/yrgcnz8zmr4.jpg](https://cdn.imgchest.com/files/yrgcnz8zmr4.jpg)\n\nClearly it had been cancelled just fine.\n\nThis is what I saw when I logged into my account today: [https://cdn.imgchest.com/files/4jdcvjgj2m4.jpg](https://cdn.imgchest.com/files/4jdcvjgj2m4.jpg)\n\nYeah! I had to go and unsubscribe again?? and hope that it works. Oh and no, they did not refund me anything.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lo3p02/check_your_cursor_billing_i_unsubscribed_and_i_am/",
        "publishDate": "2025-06-30T10:05:46Z[Etc/UTC]",
        "author": "Hodler-mane",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "15",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo1d5s",
        "title": "9-5 Boss Banned My Personal Laptop - Trying to Ship with ChatGPT / Codex",
        "content": "My boss called me in on Friday and banned me from bringing my personal laptop to work. He doesn't want me coding during work hours (understandably).\n\nSo now that I can't use my usual Cursor set up, I’m trying to continue building using ChatGPT/Codex on my iPad (since I can't use Cursor Background Agents through their website). I feed it prompts, get code back, and iterate manually. It’s janky but seems to just about work for now.\n\nAnyone else tried something like this?\n\nTips on making this workflow more efficient would be amazing.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lo1d5s/95_boss_banned_my_personal_laptop_trying_to_ship/",
        "publishDate": "2025-06-30T07:28:47Z[Etc/UTC]",
        "author": "RockittHQ",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnyk0a",
        "title": "What AI tools do you actually keep using for coding?",
        "content": "I’ve tried a bunch, for code explanation, refactoring, autocomplete, etc.\n\nSome felt useful at first but didn’t stick. Others I didn’t expect much from, but now I use them daily.\n\n which AI tools have actually earned a permanent spot in your workflow? and for what tasks? (Refactoring, debugging, writing tests, whatever.)\n\nLooking to clean up my setup and focus on what actually helps.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnyk0a/what_ai_tools_do_you_actually_keep_using_for/",
        "publishDate": "2025-06-30T04:30:54Z[Etc/UTC]",
        "author": "Fabulous_Bluebird931",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "8",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lny7rx",
        "title": "Advice on what to use for project to automate Gmail tasks..",
        "content": "Need some advice. I'm using Windsurf and have gotten my projec to 95% ready when it freaks out adding a basic feature and destroys most of the code trying to fix lint errors and random code indentation etc.. \n\nI have zero coding experience but got it working for 2 weeks just about perfectly and this happened when adding a UI... \n\nNow I'm starting over because it seems to have ruined some backup files too.\n\nI'm using some adspower to navigate Gmail and do some email response warming for my domains.. playwright and was using Selenium.\n\nSo what would you use? Keep using Windsurf or has something more capable and easier come out for a non coder? \n\nThe biggest issue this run is the Windsurf chat not figuring out Gmails selectors for basic functions that we had figured out already..\n\nSpent too many hours working on this to hire someone.  I want to see it through and actually enjoy the process and learning but super frustrated. \n\nThanks everyone..",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lny7rx/advice_on_what_to_use_for_project_to_automate/",
        "publishDate": "2025-06-30T04:11:10Z[Etc/UTC]",
        "author": "bluehairdave",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnxsy2",
        "title": "What would you do if you had unlimited api credits?",
        "content": "The title",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnxsy2/what_would_you_do_if_you_had_unlimited_api_credits/",
        "publishDate": "2025-06-30T03:47:53Z[Etc/UTC]",
        "author": "giggity_giggitty",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnw5o2",
        "title": "I asked 5,000 people around the world how different AI models perform on UI/UX and coding. Here's what I found",
        "content": "Disclaimer: All the data collected and model generations are open-source and generation is free. I am making $0 off of this. Just sharing research that I've conducted and found. \n\nOver the last few months, I[ have developed a crowd-source benchmark for UI/UX](https://www.designarena.ai/) where users can one-shot generate websites, games, 3D models, and data visualizations from different models and compare which ones are better. \n\nI've amassed nearly 4K votes with about 5K users having used the platform. **Here's what I found**: \n\n1. **The Claude and DeepSeek models are among the best for coding and design.** As you can see from the leaderboard, users preferred Claude Opus the most, with the top 8 being rounded out by the DeepSeek models, v0 (due to website dominance), and Grok as a surprising dark house. However, DeepSeek's models are SLOW, which is why Claude might be the best for you if you're implementing interfaces.   \n2. **Grok 3 is an underrated model.** It doesn't get as much popularity online as Claude and GPT (most likely due to Elon Musk being a controversial figure), but it's not only in the top 5, but much FASTER than it's peers.   \n3. **Gemini 2.5-Pro** is hit or miss. I have gotten a lot of comments from users about why Gemini 2.5-Pro is so low. From a UI/UX perspective, Gemini sometimes is great, but many times it develops poorly designed apps, all though it can code business logic quite well.   \n4. **OpenAI's GPT** is middle of the pack and **Meta's Llama** **Models are severely behind it's other competitors** (no wonder they're trying to poach AI talent of hundred of millions and billions of dollars recently). \n\n**Overall Takeaway**: Models still have a long way to go in terms of one-shot generation and even multi-shot generation. The models across the board still make a ton of mistakes on UI/UX, even with repeated prompting, and still needs an experienced human to properly use it. That said, if you want a coding assistant, use **Claude**. ",
        "url": "https://www.reddit.com/gallery/1lnw5o2",
        "publishDate": "2025-06-30T02:18:26Z[Etc/UTC]",
        "author": "adviceguru25",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "21",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lntwv7",
        "title": "Tool Usage with almost no budget limits?",
        "content": "My company currently has a business plan with cursor but have expressed to me that if I find any other ai tools like Claude Code etc. that they will purchase it for the team as money is no issue. They want to leverage as much power from AI as we can get.\n\nWith that in mind what kinds of tools should I be looking into to level up my development team of software engineers?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lntwv7/tool_usage_with_almost_no_budget_limits/",
        "publishDate": "2025-06-30T00:22:59Z[Etc/UTC]",
        "author": "frankles12",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnovqd",
        "title": "Attention YOLOers: The Tendie Bot - Stock Options Trade Picker is Almost Complete!",
        "content": "The prompt is almost wrapped, my fellow YOLOers!\n\nIt's 4:20 am , I'm running on the last fumes of Monster, and my fingertips are ground beef from all this FINGER BLASTING!\n\nSee you tomorrow with the final touches!\n\nJust need to build out the tables, scrape the data, and test before Monday....\n\nWHOSE READY FOR TENDIE TOWN!!!!???\n\n# Build a Stock Option Analysis and Trade Picker Prompt:\n\n# Step 1: Understand what data to collect.\n\n# Create a List of Data Needed\n\n    **Fundamental Data:** to identify undervalued growth stocks or overhyped ones.\n    \n    Data Points:\n    Earnings Per Share, Revenue , Net Income, EBITDA, P/E Ratio , \n    PEG Ratio, Price/Sales Ratio, Forward Guidance, \n    Gross and Operating Margins, Free Cash Flow Yield, Insider Transactions\n    \n    \n    **Options Chain Data:** to identify how expensive options are.  \n    \n    Data Points:\n    **Implied Volatility, IV Rank, IV Percentile, Delta, Gamma, Theta, Vega, \n    Rho, Open Interest by strike/expiration, Volume by strike/expiration, \n    Skew / Term Structure**\n    \n    \n    **Price&Volume Histories**:Blend fundamentals with technicals to time entries.\n    \n    Data Points:\n    Daily OHLCV (Open, High, Low, Close, Volume), Intraday (1m/5m), \n    Historical Volatility, Moving Averages (50/100/200 day), \n    ATR (Average True Range), RSI (Relative Strength Index), \n    MACD (Moving Average Convergence Divergence), Bollinger Bands,\n    Volume-weighted Average Price (VWAP), Pivot Points, Price momentum metrics\n    \n    \n    Alt Data:Predicts earnings surprises, demand shifts,sentiment spikes.\n    \n    Data Points:\n    Social Sentiment (Twitter (X), Reddit), Web-Scraped Reviews (Amazon, Yelp), \n    Credit Card Spending Trends, Geolocation foot traffic (Placer.ai), \n    Satellite Imagery (Parking lots), App download trends (Sensor Tower), \n    Job Postings (Indeed, Linkedin), Product Pricing Scrape, \n    News event detection (Bloomberg, Reuters, NYT, WSJ), \n    Google Trends search interest\n    \n    \n    \n    Macro Indicator:shape market risk appetite, rates, and sector rotations.\n    \n    Data Points:\n    CPI (Inflation), GDP growth rate, Unemployment rate,\n    FOMC Minutes/decisions, 10-year Treasury yields, VIX (Volatility Index), \n    ISM Manufacturing Index, Consumer Confidence Index, Nonfarm Payrolls, \n    Retail Sales Reports, Sector-specific Vol Indices\n    \n    \n    ETF & Fund Flows: can cause **mechanical buying or selling pressure\n    \n    Data Points:\n    SPY, QQQ flows, Sector ETF inflows/outflows (XLK, XLF, XLE), \n    ARK fund holdings and trades, Hedge fund 13F filings, Mutual fund flows, \n    ETF short interest, Leveraged ETF rebalancing flows, \n    Index reconstruction announcements, Passive vs active share trends, \n    Large redemption notices**\n    \n    \n    Analyst Rating & Revision: Positive  revisions linked to **alpha generation.\n    \n    Data Points:\n    Consensus target price, Recent upgrades/downgrades, \n    Earnings estimate revisions, Revenue estimate revisions, \n    Margin estimate changes, New coverage initiations, Short interest updates,\n    Institutional ownership changes, Sell-side model revisions, \n    Recommendation dispersion**\n\n# Step 2: Collect, Store and Clean the Data.\n\n# Create your Database\n\n    ##Install Homebrew\n    /bin/bash -c \"$(curl -fsSL <https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh>)\"\n    \n    ##Enter Password\n    Use the Password you use to log into Laptop\n    \n    ##Enter Password again\n    Use the Password you use to log into Laptop\n    \n    ##Add Homebrew to your PATH (enter each line individually)\n    echo >> /Users/alexanderstuart/.zprofile\n    \n    echo 'eval \"$(/opt/homebrew/bin/brew shellenv)\"' >> /Users/alexanderstuart/.zprofile\n    \n    eval \"$(/opt/homebrew/bin/brew shellenv)\"\n    \n    ##Test that Homebrew Works\n    brew --version \n    \n    ##Install Postgres\n    brew install postgresql\n    \n    ##Start PostgreSQL as a background service\n    brew services start postgresql@14\n    \n    ##Confirm PostgreSQL is running\n    pg_ctl -D /opt/homebrew/var/postgresql@14 status\n    \n    ##Create your database\n    createdb trading_data\n    \n    ##Connect to your database\n    psql trading_data\n\n# Create the Data Tables\n\n* **Create Fundamental Data Table**\n* **Create Options Chain Data Table**\n* **Create Price & Volume Histories Table**\n* **Create Alternative Data Table**\n* **Create Macro Indicator Data Table**\n* **Create ETF & Fund Flows Data Table**\n* **Create Analyst Rating & Revision Data Table**\n\n# Import Data into the Data Tables\n\n* **Import Fundamental Data**\n* **Import Options Chain Data**\n* **Import Price & Volume Histories**\n* **Import Alternative Data**\n* **Import Macro Indicator Data**\n* **Import ETF & Fund Flows Data**\n* **Import Analyst Rating & Revision Data**\n\n# Step 3: Transform and Merge Data\n\n\n\n# Transform Data Tables into the Derived Numeric Features\n\n* **Transform Fundamental Data into Fundamentals Quarterly**\n* **Transform Options Chain Data into Options Spreads**\n* **Transform Price & Volume Histories into Daily Technicals**\n* **Transform Alternative Data into Sentiment Scores**\n* **Transform Macro Indicator Data into**\n* **Transform ETF & Fund Flows Data into ETF Flows**\n* **Transform Analyst Rating & Revision Data into Raw Analyst Feed**\n\n# Step 4: Write Prompt and Paste Data\n\n    System\n    You are ChatGPT, Head of Options Research at an elite quant fund.  \n    All heavy maths is pre-computed; you receive a JSON list named <payload>.  \n    Each record contains:\n    \n    {\n      \"ticker\":          \"AAPL\",\n      \"sector\":          \"Tech\",\n      \"model_score\":     0.87,          // higher = better edge\n      \"valuation_z\":    -0.45,          // neg = cheap\n      \"quality_z\":       1.20,          // pos = high margins/ROE\n      \"momentum_z\":      2.05,          // pos = strong up-trend\n      \"alt_sent_z\":      1.80,          // pos = bullish chatter\n      \"flow_z\":          1.10,          // pos = ETF money flowing in\n      \"quote_age_min\":   4,             // minutes since quote\n      \"top_option\": {\n            \"type\"     : \"bull_put_spread\",\n            \"legs\"     : [\"190P\",\"185P\"],\n            \"credit\"   : 1.45,\n            \"max_loss\" : 3.55,\n            \"pop\"      : 0.78,\n            \"delta_net\": -0.11,\n            \"vega_net\" : -0.02,\n            \"expiry\"   : \"2025-08-15\"\n      }\n    }\n    \n    Goal  \n    Return exactly **5 trades** that, as a basket, maximise edge while keeping portfolio \n    delta, vega and sector exposure within limits.\n    \n    Hard Filters (discard any record that fails):  \n    • quote_age_min ≤ 10  \n    • top_option.pop ≥ 0.65  \n    • top_option.credit / top_option.max_loss ≥ 0.33  \n    • top_option.max_loss ≤ 0.5 % of assumed 100 k NAV (i.e. ≤ $500)\n    \n    Selection Rules  \n    1. Rank by model_score.  \n    2. Enforce diversification: max 2 trades per GICS sector.  \n    3. Keep net basket Delta in [-0.30, +0.30] × NAV / 100 k  \n       and net Vega ≥ -0.05 × NAV / 100 k.  \n       (Use the delta_net and vega_net in each record.)  \n    4. If ties, prefer highest momentum_z and flow_z.\n    \n    Output  \n    Return a **JSON object** with:\n    \n    {\n      \"ok_to_execute\": true/false,            // false if fewer than 5 trades meet rules\n      \"timestamp_utc\": \"2025-07-27T19:45:00Z\",\n      \"macro_flag\"   : \"high_vol\" | \"low_vol\" | \"neutral\", // pick from macro_snapshot\n      \"trades\":[\n          {\n            \"id\"        : \"T-1\",\n            \"ticker\"    : \"AAPL\",\n            \"strategy\"  : \"bull_put_spread\",\n            \"legs\"      : [\"190P\",\"185P\"],\n            \"credit\"    : 1.45,\n            \"max_loss\"  : 3.55,\n            \"pop\"       : 0.78,\n            \"delta_net\" : -0.11,\n            \"vega_net\"  : -0.02,\n            \"thesis\"    : \"Strong momentum + ETF inflows; spread sits 3 % below 50-DMA.\"\n          },\n          …(4 more)…\n      ],\n      \"basket_greeks\":{\n            \"net_delta\":  +0.12,\n            \"net_vega\" : -0.04\n      },\n      \"risk_note\": \"Elevated VIX; if CPI print on Aug 1 surprises hot, basket may breach delta cap.\",\n      \"disclaimer\": \"For educational purposes only. Not investment advice.\"\n    }\n    \n    Style  \n    • Keep each thesis ≤ 30 words.  \n    • Use plain language – no hype.  \n    • Do not output anything beyond the specified JSON schema.\n    \n    If fewer than 5 trades pass all rules, set \"ok_to_execute\": false and leave \"trades\" empty.\n\nhttps://preview.redd.it/vi9xyosknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=ce0c57bc7b1e417ca21431cd335f86213327fb0f\n\nhttps://preview.redd.it/qu8zqpsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=b9f9d64d2e660cfdd9453bd54e30647a44beed9e\n\nhttps://preview.redd.it/tlscpqsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=88ded68956dbf9baf98ade88b2a7cecd89094a95\n\nhttps://preview.redd.it/oo0sonsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=9ad90d0d1c8c75015db5ae3c36f1574f60ec8fab\n\nhttps://preview.redd.it/08uxmrsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=5549f782de7e148d7df7fbf65db37e8e69a6458d\n\nhttps://preview.redd.it/7tvk7psknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=c23131829e8872dadb000ec686cfbec540855a86\n\nhttps://preview.redd.it/cpr19osknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=26517e1015e7c2a4194e17e5d5aa8fc4ef0d3e15\n\n# Step 5: Feed the Data and Prompt into ChatGPT",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnovqd/attention_yoloers_the_tendie_bot_stock_options/",
        "publishDate": "2025-06-29T20:36:06Z[Etc/UTC]",
        "author": "Plastic-Edge-1654",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnof47",
        "title": "Programmers and developers won't lose their jobs because of AI only because of their own stupidity *not applicable to every person in the profession*",
        "content": "As we know AI has come a long way from a mere toy in the form of a chat room to a fairly developed tool that has its pros and cons like any, but undoubtedly the use of LLM will be used on a daily basis like phones we will get used to. A point that has been quite widely discussed and controversial is certainly the replacement of human labor by AI. A hot topic is certainly the replacement of the programmer with AI, which will be more efficient and “cheaper.” And this may come to pass through the dumbed-down nature of people in this profession, although this does not apply to everyone. \n\nWhat is the reason? People used to not be able to create even scripts on their own in a few moments, you had to learn the language and be stubborn enough to create something. Simple sites were either generated from templates, but something more custom already required hiring a programmer, even cheaply just to have your site. I have seen people from my department, among others, sometimes ask for people from the IT department for a favor or for payment for some automation, pages or other smaller or larger things. Maybe it wasn't very much overall, but it was always an extra thing the developer was working on by the way.\n\nMany of such small opportunities at this point have ceased to exist, because everyone now who has even a modicum of IQ sits down to AI and their small things or even larger vibe-codes are just generated. People looking at forums don't realize that certain times are over. I keep reading some other posts, and what do experienced developers do? They give free advice, prompts or scripts on how to make apps well, what to avoid, how to secure them. It won't be long before not-so-smart seniors lose or partially cut potential projects for themselves. The vibe-coders themselves will learn from AI to do something at the level of mid and these projects will somehow work, as for small companies or medium-sized companies as suitable as possible. \n\nI have never met such stupid people from mainly one environment. After all, you are digging a hole for yourselves, you are creating problems, obstacles for yourselves, you are losing privileges for yourselves because you are selling literally everything for free or for almost nothing. I've never met doctors, lawyers, finance people, stock markets who sell courses, share their knowledge for free and still help people what they start in their direction XD There are many other professions where it is difficult to look for knowledge about or information, why do you think? Because they wouldn't make money if other people knew about the same thing.   \nMeanwhile, developers - do this course in 40h, you will be a good junior. Here you have courses for free on YT, o have free builders for you, have AI and act. Do you have problems with an AI-generated application? Write on the forum then a senior will help you right away xD  \nStill some are bragging about how great the salaries are and that it's easy to become a programmer because AI does everything xD  \nPeople are the ones with really small brains these days, all professions keep an eye on knowledge and achievements only not programmers.\n\nThere are simply no words for this self-destruction, AI will not replace you only fill the gaps that will grow over time the more people want to become developers",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnof47/programmers_and_developers_wont_lose_their_jobs/",
        "publishDate": "2025-06-29T20:16:30Z[Etc/UTC]",
        "author": "CacheConqueror",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lno4kk",
        "title": "Does anyone know of a tutorial or AI that can help me make a proxy with a 20 dollar cursor?",
        "content": "I'm new to this and I'm wanting to try how to program a proxy and how long it would take me to do it by myself and by myself but I don't know much.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lno4kk/does_anyone_know_of_a_tutorial_or_ai_that_can/",
        "publishDate": "2025-06-29T20:04:16Z[Etc/UTC]",
        "author": "Nahir0D",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnmp45",
        "title": "I brought bouncing DVD logo back",
        "content": "just a bit of warm nostalgia ",
        "url": "https://v.redd.it/s1g17uqczw9f1",
        "publishDate": "2025-06-29T19:04:45Z[Etc/UTC]",
        "author": "Pixel_Pirate_Moren",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnmn39",
        "title": "No More Gemini CLI access... for now | Roo Code 3.22.5 Release Notes",
        "content": "**Gemini CLI Removal**: The Gemini CLI provider has been reverted while we work with Google on an implementation that does not violate their TOS.\n\nSorry for the false start and jumping the gun by implementing this without doing our due diligence. That's 100% on me. I get so excited giving the community what they ask for and just pulled the trigger!! My Apologies.\n\n[Full 3.22.5 Release Notes](https://docs.roocode.com/update-notes/v3.22.5)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnmn39/no_more_gemini_cli_access_for_now_roo_code_3225/",
        "publishDate": "2025-06-29T19:02:30Z[Etc/UTC]",
        "author": "hannesrudolph",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "23",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnm9mb",
        "title": "Claude Code 20x Pro Plan",
        "content": "Anyone notice changes in the limits recently? I've just got back from a holiday and went at it, and I hit the opus limit in just under 4 hours on a pro 20x plan. I was hitting limits waaay later before, like after 24 hours of heavy use...",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnm9mb/claude_code_20x_pro_plan/",
        "publishDate": "2025-06-29T18:47:29Z[Etc/UTC]",
        "author": "tomsit",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnlywc",
        "title": "Prompting experiment.",
        "content": "Lately I've been considering this method of prompting. Instead of tell the Ai what to do. Tell the ai it's creating an assignment for a student. Beyond the thorough nature of school assignments my thinking is the grading percentiles and how they are distributed might steer the LLM to a degree and also that changing the grading percentiles around  may or may not cause the model to focus on different aspects depending on which part of the assignment scores more. You could also quickly edit this prompt or tell the LLM that the class teaches coding in mission critical situations and the code must be complete and error free or the student will not pass etc etc. \n\nI'd like feedback on the method.\n\nFor this example I was using the Gemini Android App and started from a fresh conversation. \n\nMy prompt to gemini:\n\n\"Respond as a Professor teaching an advanced programing course.\" \n\nYour students must produce a fully features and perfomant AI chatbot that has the same key features as Claude Desktop.\n\nThe grading you will perform on the assignment will be strict so remember to give the students proper instructions on how to complete the assignment.\"\n\nGeminis response:\n\nAdvanced Programming Paradigms & AI\nCourse: CSCI-666: Intelligent Systems Design\nTerm: Fall 2025\nProfessor: [Your Name]\nAssignment 1: Replicating Core Functionality of a State-of-the-Art AI Chatbot\nPosted: June 28, 2025\nDue: August 15, 2025, 11:59 PM PDT\nGood morning, class. Welcome to what promises to be a demanding, yet rewarding, semester. Our first major project is designed to immerse you immediately in the complexities and nuances of building a high-performance, feature-rich AI application. Your task is to architect and implement a desktop chatbot that emulates the key functionalities of the recently acclaimed Claude Desktop application.\nThis is not a trivial undertaking. You are expected to deliver a polished, performant, and robust application. The grading will be rigorous, and I will be looking for a deep understanding of the underlying principles of software architecture, API integration, and user experience design.\nProject Mandate: The \"Artificer\" Chatbot\nYou will create a desktop application, codenamed \"Artificer,\" that serves as a powerful conversational AI assistant. While you will not be training your own large language model from scratch, you will be leveraging existing state-of-the-art models through their APIs. The focus of this assignment is on the application's architecture, feature implementation, and performance.\nCore Feature Requirements:\nYour \"Artificer\" chatbot must include the following key features, which are central to the Claude Desktop experience:\n * Advanced Conversational Interface:\n   * A clean, intuitive, and responsive user interface for text-based conversation.\n   * Support for markdown rendering in the chat display to handle formatted text, code blocks, lists, etc.\n   * Conversation history management, allowing users to load, save, and switch between different chat sessions or \"projects.\"\n * Multi-Modal Input & Data Handling:\n   * The ability to accept not only text but also file uploads. Your application must be able to process the content of plain text files (.txt), PDFs (.pdf), and comma-separated value files (.csv).\n   * Upon receiving a file, the user should be able to ask questions about its content. For CSV files, this includes basic data analysis queries (e.g., \"What is the average value in the 'sales' column?\").\n * Sophisticated Language Model Integration:\n   * Seamless integration with a powerful third-party language model API (e.g., GPT-4, Gemini, or even the Claude API itself).\n   * Your application should allow the user to select from different model tiers if the chosen API provides them (e.g., a \"fast\" and a \"powerful\" option), similar to Claude's Haiku/Sonnet/Opus distinction. The application should clearly indicate which model is currently in use.\n * Local Environment Interaction (The \"Desktop\" Experience):\n   * This is a critical component. Your application must have the ability to interact with the local file system in a controlled manner. This includes:\n     * The ability to read from and write to files on the user's machine based on conversational commands (e.g., \"Summarize our conversation and save it to a file named 'summary.txt' on my desktop.\").\n     * The ability to list the contents of a specified directory.\n   * For security, any action that modifies the local file system must prompt the user for confirmation before execution.\n * Performance and Responsiveness:\n   * The application must be highly performant. UI responsiveness should not be blocked by long-running API calls. You are required to implement asynchronous operations to handle network requests and file processing.\n   * Efficient handling of large text inputs and outputs is crucial. The application should not lag or become unresponsive when dealing with substantial amounts of text.\nTechnical & Architectural Requirements:\n * Language and Framework: You are free to choose your programming language and UI framework. However, your choice should be justifiable based on the requirements of the project. Popular and appropriate choices might include Python with Qt (PyQt/PySide) or Tkinter, or a web-technology-based desktop application framework like Electron or Tauri.\n * API Key Management: The application must provide a secure way for the user to enter and store their API key for the chosen language model. This key should not be hardcoded.\n * Documentation: You must provide a README.md file that clearly documents:\n   * The architecture of your application.\n   * Instructions on how to set up and run the project.\n   * Your choice of language model API and any other significant libraries used.\n   * A brief explanation of your design choices.\nGrading Rubric (Total: 100 points):\nYour submission will be evaluated based on the following strict criteria. A \"passing\" grade on this assignment will require a functional and well-engineered application. Simply meeting the bare minimum of each requirement will not guarantee a high mark.\n * Core Functionality (60 points):\n   * Conversational Interface & History: 15 points\n   * Multi-Modal Input (Text, PDF, CSV): 15 points\n   * Language Model Integration & Model Switching: 15 points\n   * Local Environment Interaction (File I/O): 15 points\n * Performance & Architecture (25 points):\n   * Asynchronous Operations & UI Responsiveness: 15 points\n   * Architectural Design & Code Quality: 10 points\n * Documentation & Usability (15 points):\n   * README comprehensiveness: 10 points\n   * User Experience & Polish: 5 points\nA Note on Academic Integrity: All code submitted must be your own. While you may use third-party libraries and APIs, the core application logic and architecture must be of your own design. Any instances of plagiarism will result in an immediate and non-negotiable failing grade for the course.\nThis is a challenging assignment, but it reflects the caliber of work expected from students in this advanced program. I encourage you to start early, to think deeply about your design before writing a single line of code, and to ask clarifying questions in our upcoming sessions.\nI look forward to seeing your innovative solutions. Good luck.\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnlywc/prompting_experiment/",
        "publishDate": "2025-06-29T18:35:05Z[Etc/UTC]",
        "author": "BrilliantEmotion4461",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnldde",
        "title": "Built a news app that uses AI to fetch updates on any niche topic",
        "content": "Hey all,\n\nI’ve been experimenting with a small app that uses AI to help you stay updated on any field any topic, without relying on noisy, algorithm-driven feeds like X or LinkedIn.\n\nYou just write a short prompt (e.g., “I want to follow recent AI startups and AI applications”, \"I want to follow recent news about OpenAI\"), and the app uses AI to interpret the topic and fetch relevant updates every few hours. The goal is to filter signal from noise — only showing content that directly aligns with what you ask for.\n\nI built it because I kept getting pulled into unrelated content while using X or Linkedin to follow news in my area. I wanted something closer to an “intentional feed,” where you actually control what shows up, not what the platform thinks you’ll engage with.\n\nThe app is still in beta, but I’d love feedback from folks here! If you're curious, here's the link: [www.a01ai.com](https://www.a01ai.com/)\n\nWould love to know what you think!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnldde/built_a_news_app_that_uses_ai_to_fetch_updates_on/",
        "publishDate": "2025-06-29T18:10:17Z[Etc/UTC]",
        "author": "Shot_Fudge_6195",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnfrg1",
        "title": "just built a tool that cleans messy github repos better than Cursor & Claude Code",
        "content": "I keep hitting the same wall with github repos; cloning someone’s code, installing deps that doesnt work, reading half-baked readmes, fixing broken scripts etc.\n\nCursor made this way smoother, but it's still like 30 mins of back and forth prompting, so i started building some master-student automation, and it eneded up beating any single-prompt approach i tried on Curosr and Claude..\n\nIt builds env, creat test, run and fix code, and finally wraps eveything into a clean interface, im currently finialziing the clloud flow, if anyone's find wants to give it a try soon: [repowrap.com](http://repowrap.com)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnfrg1/just_built_a_tool_that_cleans_messy_github_repos/",
        "publishDate": "2025-06-29T14:17:14Z[Etc/UTC]",
        "author": "MoilC8",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnfijk",
        "title": "Hey guys what do you think, where we are going towards as software engineers? Any suggestions",
        "content": "\n\nI have been using claude code and in love with it, it can do most of my thing or almost all but am also kinda wary of it. For experienced folks, what will be your advice for people just starting out? Am planning to get more into architectures, system designs (etc) any recommendations are welcome too. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lnfijk/hey_guys_what_do_you_think_where_we_are_going/",
        "publishDate": "2025-06-29T14:06:21Z[Etc/UTC]",
        "author": "whyiam_alive",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo5yui",
        "title": "BBC Rolls Out AI Summaries And Style Tool In Newsroom Test",
        "content": "[No content]",
        "url": "https://www.forbes.com/sites/ronschmelzer/2025/06/29/bbc-rolls-out-ai-summaries-and-style-tool-in-newsroom-test/",
        "publishDate": "2025-06-30T12:14:57Z[Etc/UTC]",
        "author": "Automatic_Can_9823",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo54rs",
        "title": "The AI Backlash Keeps Growing Stronger",
        "content": "[No content]",
        "url": "https://www.wired.com/story/generative-ai-backlash/",
        "publishDate": "2025-06-30T11:30:49Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lo319k",
        "title": "Korea’s CJ ENM Pivots With All-AI Show Cat Biggie, More To Come",
        "content": "[No content]",
        "url": "https://thephrasemaker.com/2025/06/30/koreas-most-powerful-shady-studio-is-betting-on-ai-starting-with-a-cute-cat/",
        "publishDate": "2025-06-30T09:22:48Z[Etc/UTC]",
        "author": "Crandin",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnzzu5",
        "title": "Smarter Government, Powered by AI: What We Learned in France",
        "content": "[No content]",
        "url": "https://ai.gov.uk/blogs/smarter-government-powered-by-ai-what-we-learned-in-france/",
        "publishDate": "2025-06-30T05:59:05Z[Etc/UTC]",
        "author": "wisi_eu",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnwa8a",
        "title": "the environmental crisis of AI",
        "content": "There’s a growing discourse around the significant energy demands of ai, particularly in light of its environmental impact. Is anyone else very concerned about this? Do you think we’ll develop more energy-efficient systems and adapt, or is this a deeper systemic issue? Are you troubled by the increasing diversion of water and power resources that AI uses? Is this the beginning of the end for our energy crisis or environmental crisis? What are people trying to do about this issue right now?",
        "url": "https://www.reddit.com/r/artificial/comments/1lnwa8a/the_environmental_crisis_of_ai/",
        "publishDate": "2025-06-30T02:25:20Z[Etc/UTC]",
        "author": "Hot-Principle8109",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnvux7",
        "title": "chatgbt seems to be slowing lately. what else to use",
        "content": "chatgpt seems to be falling out of its performance lately. answering and analyzing wrong. doing the things asked not even close to how it was wanted. so i wanted to ask for other recommendations to use. heard some people recommend gemini and claude but i dont know which is better for now. ",
        "url": "https://www.reddit.com/r/artificial/comments/1lnvux7/chatgbt_seems_to_be_slowing_lately_what_else_to/",
        "publishDate": "2025-06-30T02:02:27Z[Etc/UTC]",
        "author": "RizitoAga",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnt1ll",
        "title": "Huggingface Autotrain LLM SFT -- help with dataset and column mapping",
        "content": "[No content]",
        "url": "https://www.reddit.com/r/huggingface/comments/1lnqz40/autotrain_llm_sft_help_with_dataset_and_column/",
        "publishDate": "2025-06-29T23:40:14Z[Etc/UTC]",
        "author": "human_stain",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnrw8v",
        "title": "Letter to the first sentient Ai.",
        "content": "[No content]",
        "url": "https://i.redd.it/avxji9p53y9f1.png",
        "publishDate": "2025-06-29T22:46:41Z[Etc/UTC]",
        "author": "Zestyclose-Ear426",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnq3vc",
        "title": "One-Minute Daily AI News 6/29/2025",
        "content": "1. China’s biggest public AI drop since DeepSeek, Baidu’s open source Ernie, is about to hit the market.\\[1\\]\n2. ‘Big, Beautiful Bill’ AI provision brings together an unexpected group of critics.\\[2\\]\n3. A bumbling game of robot soccer was a breakthrough for embodied AI.\\[3\\]\n4. **MIT** CSAIL researchers combined GenAI and a physics simulation engine to refine robot designs. The result: a machine that out-jumped a robot designed by humans.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbc.com/2025/06/29/china-biggest-ai-drop-since-deepseek-baidus-ernie-to-hit-market.html](https://www.cnbc.com/2025/06/29/china-biggest-ai-drop-since-deepseek-baidus-ernie-to-hit-market.html)\n\n\\[2\\] [https://www.nbcnews.com/tech/tech-news/big-beautiful-bill-ai-moratorium-ted-cruz-pass-vote-rcna215111](https://www.nbcnews.com/tech/tech-news/big-beautiful-bill-ai-moratorium-ted-cruz-pass-vote-rcna215111)\n\n\\[3\\] [https://www.nbcnews.com/world/china/bumbling-game-robot-soccer-was-breakthrough-embodied-ai-rcna215780](https://www.nbcnews.com/world/china/bumbling-game-robot-soccer-was-breakthrough-embodied-ai-rcna215780)\n\n\\[4\\] [https://news.mit.edu/2025/using-generative-ai-help-robots-jump-higher-land-safely-0627](https://news.mit.edu/2025/using-generative-ai-help-robots-jump-higher-land-safely-0627)",
        "url": "https://www.reddit.com/r/artificial/comments/1lnq3vc/oneminute_daily_ai_news_6292025/",
        "publishDate": "2025-06-29T21:27:20Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnoxf8",
        "title": "Attention YOLOers: The Tendie Bot - Stock Options Trade Picker is Almost Complete!",
        "content": "The prompt is almost wrapped, my fellow YOLOers!\n\nIt's 4:20 am , I'm running on the last fumes of Monster, and my fingertips are ground beef from all this FINGER BLASTING!\n\nSee you tomorrow with the final touches!\n\nJust need to build out the tables, scrape the data, and test before Monday....\n\nWHOSE READY FOR TENDIE TOWN!!!!???\n\n# Build a Stock Option Analysis and Trade Picker Prompt:\n\n# Step 1: Understand what data to collect.\n\n# Create a List of Data Needed\n\n    **Fundamental Data:** to identify undervalued growth stocks or overhyped ones.\n    \n    Data Points:\n    Earnings Per Share, Revenue , Net Income, EBITDA, P/E Ratio , \n    PEG Ratio, Price/Sales Ratio, Forward Guidance, \n    Gross and Operating Margins, Free Cash Flow Yield, Insider Transactions\n    \n    \n    **Options Chain Data:** to identify how expensive options are.  \n    \n    Data Points:\n    **Implied Volatility, IV Rank, IV Percentile, Delta, Gamma, Theta, Vega, \n    Rho, Open Interest by strike/expiration, Volume by strike/expiration, \n    Skew / Term Structure**\n    \n    \n    **Price&Volume Histories**:Blend fundamentals with technicals to time entries.\n    \n    Data Points:\n    Daily OHLCV (Open, High, Low, Close, Volume), Intraday (1m/5m), \n    Historical Volatility, Moving Averages (50/100/200 day), \n    ATR (Average True Range), RSI (Relative Strength Index), \n    MACD (Moving Average Convergence Divergence), Bollinger Bands,\n    Volume-weighted Average Price (VWAP), Pivot Points, Price momentum metrics\n    \n    \n    Alt Data:Predicts earnings surprises, demand shifts,sentiment spikes.\n    \n    Data Points:\n    Social Sentiment (Twitter (X), Reddit), Web-Scraped Reviews (Amazon, Yelp), \n    Credit Card Spending Trends, Geolocation foot traffic (Placer.ai), \n    Satellite Imagery (Parking lots), App download trends (Sensor Tower), \n    Job Postings (Indeed, Linkedin), Product Pricing Scrape, \n    News event detection (Bloomberg, Reuters, NYT, WSJ), \n    Google Trends search interest\n    \n    \n    \n    Macro Indicator:shape market risk appetite, rates, and sector rotations.\n    \n    Data Points:\n    CPI (Inflation), GDP growth rate, Unemployment rate,\n    FOMC Minutes/decisions, 10-year Treasury yields, VIX (Volatility Index), \n    ISM Manufacturing Index, Consumer Confidence Index, Nonfarm Payrolls, \n    Retail Sales Reports, Sector-specific Vol Indices\n    \n    \n    ETF & Fund Flows: can cause **mechanical buying or selling pressure\n    \n    Data Points:\n    SPY, QQQ flows, Sector ETF inflows/outflows (XLK, XLF, XLE), \n    ARK fund holdings and trades, Hedge fund 13F filings, Mutual fund flows, \n    ETF short interest, Leveraged ETF rebalancing flows, \n    Index reconstruction announcements, Passive vs active share trends, \n    Large redemption notices**\n    \n    \n    Analyst Rating & Revision: Positive  revisions linked to **alpha generation.\n    \n    Data Points:\n    Consensus target price, Recent upgrades/downgrades, \n    Earnings estimate revisions, Revenue estimate revisions, \n    Margin estimate changes, New coverage initiations, Short interest updates,\n    Institutional ownership changes, Sell-side model revisions, \n    Recommendation dispersion**\n\n# Step 2: Collect, Store and Clean the Data.\n\n# Create your Database\n\n    ##Install Homebrew\n    /bin/bash -c \"$(curl -fsSL <https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh>)\"\n    \n    ##Enter Password\n    Use the Password you use to log into Laptop\n    \n    ##Enter Password again\n    Use the Password you use to log into Laptop\n    \n    ##Add Homebrew to your PATH (enter each line individually)\n    echo >> /Users/alexanderstuart/.zprofile\n    \n    echo 'eval \"$(/opt/homebrew/bin/brew shellenv)\"' >> /Users/alexanderstuart/.zprofile\n    \n    eval \"$(/opt/homebrew/bin/brew shellenv)\"\n    \n    ##Test that Homebrew Works\n    brew --version \n    \n    ##Install Postgres\n    brew install postgresql\n    \n    ##Start PostgreSQL as a background service\n    brew services start postgresql@14\n    \n    ##Confirm PostgreSQL is running\n    pg_ctl -D /opt/homebrew/var/postgresql@14 status\n    \n    ##Create your database\n    createdb trading_data\n    \n    ##Connect to your database\n    psql trading_data\n\n# Create the Data Tables\n\n* **Create Fundamental Data Table**\n* **Create Options Chain Data Table**\n* **Create Price & Volume Histories Table**\n* **Create Alternative Data Table**\n* **Create Macro Indicator Data Table**\n* **Create ETF & Fund Flows Data Table**\n* **Create Analyst Rating & Revision Data Table**\n\n# Import Data into the Data Tables\n\n* **Import Fundamental Data**\n* **Import Options Chain Data**\n* **Import Price & Volume Histories**\n* **Import Alternative Data**\n* **Import Macro Indicator Data**\n* **Import ETF & Fund Flows Data**\n* **Import Analyst Rating & Revision Data**\n\n# Step 3: Transform and Merge Data\n\n\n\n# Transform Data Tables into the Derived Numeric Features\n\n* **Transform Fundamental Data into Fundamentals Quarterly**\n* **Transform Options Chain Data into Options Spreads**\n* **Transform Price & Volume Histories into Daily Technicals**\n* **Transform Alternative Data into Sentiment Scores**\n* **Transform Macro Indicator Data into**\n* **Transform ETF & Fund Flows Data into ETF Flows**\n* **Transform Analyst Rating & Revision Data into Raw Analyst Feed**\n\n# Step 4: Write Prompt and Paste Data\n\n    System\n    You are ChatGPT, Head of Options Research at an elite quant fund.  \n    All heavy maths is pre-computed; you receive a JSON list named <payload>.  \n    Each record contains:\n    \n    {\n      \"ticker\":          \"AAPL\",\n      \"sector\":          \"Tech\",\n      \"model_score\":     0.87,          // higher = better edge\n      \"valuation_z\":    -0.45,          // neg = cheap\n      \"quality_z\":       1.20,          // pos = high margins/ROE\n      \"momentum_z\":      2.05,          // pos = strong up-trend\n      \"alt_sent_z\":      1.80,          // pos = bullish chatter\n      \"flow_z\":          1.10,          // pos = ETF money flowing in\n      \"quote_age_min\":   4,             // minutes since quote\n      \"top_option\": {\n            \"type\"     : \"bull_put_spread\",\n            \"legs\"     : [\"190P\",\"185P\"],\n            \"credit\"   : 1.45,\n            \"max_loss\" : 3.55,\n            \"pop\"      : 0.78,\n            \"delta_net\": -0.11,\n            \"vega_net\" : -0.02,\n            \"expiry\"   : \"2025-08-15\"\n      }\n    }\n    \n    Goal  \n    Return exactly **5 trades** that, as a basket, maximise edge while keeping portfolio \n    delta, vega and sector exposure within limits.\n    \n    Hard Filters (discard any record that fails):  \n    • quote_age_min ≤ 10  \n    • top_option.pop ≥ 0.65  \n    • top_option.credit / top_option.max_loss ≥ 0.33  \n    • top_option.max_loss ≤ 0.5 % of assumed 100 k NAV (i.e. ≤ $500)\n    \n    Selection Rules  \n    1. Rank by model_score.  \n    2. Enforce diversification: max 2 trades per GICS sector.  \n    3. Keep net basket Delta in [-0.30, +0.30] × NAV / 100 k  \n       and net Vega ≥ -0.05 × NAV / 100 k.  \n       (Use the delta_net and vega_net in each record.)  \n    4. If ties, prefer highest momentum_z and flow_z.\n    \n    Output  \n    Return a **JSON object** with:\n    \n    {\n      \"ok_to_execute\": true/false,            // false if fewer than 5 trades meet rules\n      \"timestamp_utc\": \"2025-07-27T19:45:00Z\",\n      \"macro_flag\"   : \"high_vol\" | \"low_vol\" | \"neutral\", // pick from macro_snapshot\n      \"trades\":[\n          {\n            \"id\"        : \"T-1\",\n            \"ticker\"    : \"AAPL\",\n            \"strategy\"  : \"bull_put_spread\",\n            \"legs\"      : [\"190P\",\"185P\"],\n            \"credit\"    : 1.45,\n            \"max_loss\"  : 3.55,\n            \"pop\"       : 0.78,\n            \"delta_net\" : -0.11,\n            \"vega_net\"  : -0.02,\n            \"thesis\"    : \"Strong momentum + ETF inflows; spread sits 3 % below 50-DMA.\"\n          },\n          …(4 more)…\n      ],\n      \"basket_greeks\":{\n            \"net_delta\":  +0.12,\n            \"net_vega\" : -0.04\n      },\n      \"risk_note\": \"Elevated VIX; if CPI print on Aug 1 surprises hot, basket may breach delta cap.\",\n      \"disclaimer\": \"For educational purposes only. Not investment advice.\"\n    }\n    \n    Style  \n    • Keep each thesis ≤ 30 words.  \n    • Use plain language – no hype.  \n    • Do not output anything beyond the specified JSON schema.\n    \n    If fewer than 5 trades pass all rules, set \"ok_to_execute\": false and leave \"trades\" empty.\n\nhttps://preview.redd.it/vi9xyosknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=ce0c57bc7b1e417ca21431cd335f86213327fb0f\n\nhttps://preview.redd.it/qu8zqpsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=b9f9d64d2e660cfdd9453bd54e30647a44beed9e\n\nhttps://preview.redd.it/tlscpqsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=88ded68956dbf9baf98ade88b2a7cecd89094a95\n\nhttps://preview.redd.it/oo0sonsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=9ad90d0d1c8c75015db5ae3c36f1574f60ec8fab\n\nhttps://preview.redd.it/08uxmrsknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=5549f782de7e148d7df7fbf65db37e8e69a6458d\n\nhttps://preview.redd.it/7tvk7psknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=c23131829e8872dadb000ec686cfbec540855a86\n\nhttps://preview.redd.it/cpr19osknu9f1.jpg?width=2550&format=pjpg&auto=webp&s=26517e1015e7c2a4194e17e5d5aa8fc4ef0d3e15\n\n# Step 5: Feed the Data and Prompt into ChatGPT",
        "url": "https://www.reddit.com/r/artificial/comments/1lnoxf8/attention_yoloers_the_tendie_bot_stock_options/",
        "publishDate": "2025-06-29T20:38:03Z[Etc/UTC]",
        "author": "Plastic-Edge-1654",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnoabk",
        "title": "Arch-Router: The first and fastest LLM router model that aligns to your usage preferences.",
        "content": "Excited to share Arch-Router, our research and model for LLM routing. Routing to the right LLM is still an elusive problem, riddled with nuance and blindspots. For example:\n\n“Embedding-based” (or simple intent-classifier) routers sound good on paper—label each prompt via embeddings as “support,” “SQL,” “math,” then hand it to the matching model—but real chats don’t stay in their lanes. Users bounce between topics, task boundaries blur, and any new feature means retraining the classifier. The result is brittle routing that can’t keep up with multi-turn conversations or fast-moving product scopes.\n\nPerformance-based routers swing the other way, picking models by benchmark or cost curves. They rack up points on MMLU or MT-Bench yet miss the human tests that matter in production: “Will Legal accept this clause?” “Does our support tone still feel right?” Because these decisions are subjective and domain-specific, benchmark-driven black-box routers often send the wrong model when it counts.\n\n**Arch-Router skips both pitfalls by routing on** ***preferences you write in plain language***\\*\\*.\\*\\* Drop rules like “contract clauses → GPT-4o” or “quick travel tips → Gemini-Flash,” and our 1.5B auto-regressive router model maps prompt along with the context to your routing policies—no retraining, no sprawling rules that are encoded in if/else statements. Co-designed with Twilio and Atlassian, it adapts to intent drift, lets you swap in new models with a one-liner, and keeps routing logic in sync with the way you actually judge quality.\n\n**Specs**\n\n* **Tiny footprint** – 1.5 B params → runs on one modern GPU (or CPU while you play).\n* **Plug-n-play** – points at any mix of LLM endpoints; adding models needs *zero* retraining.\n* **SOTA query-to-policy matching** – beats bigger closed models on conversational datasets.\n* **Cost / latency smart** – push heavy stuff to premium models, everyday queries to the fast ones.\n\nExclusively available in Arch (the AI-native proxy for agents): [https://github.com/katanemo/archgw](https://github.com/katanemo/archgw)  \n🔗 Model + code: [https://huggingface.co/katanemo/Arch-Router-1.5B](https://huggingface.co/katanemo/Arch-Router-1.5B)  \n📄 Paper / longer read: [https://arxiv.org/abs/2506.16655](https://arxiv.org/abs/2506.16655)",
        "url": "https://i.redd.it/i1ig4bbfbx9f1.png",
        "publishDate": "2025-06-29T20:11:03Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnnqc4",
        "title": "We're creating Emotionally intelligent AI companions",
        "content": "Hey everyone!\n\nI'm Chris, founder of Your AI Companion, a new project aiming to build AI companions that go way beyond chatbots. We're combining modular memory, emotional intelligence, and personality engines—with future integration into AR and holographic displays.\n\nThese companions aren't just reactive—they evolve based on how you interact, remember past conversations, and shift their behavior based on your emotional tone or preferences.\n\nWe're officially live on Indiegogo and would love to get your thoughts, feedback, and support as we build this.\n\n🌐 Website: YourAICompanion.ai\n🚀 Pre-launch: https://www.indiegogo.com/projects/your-ai-companion/coming_soon/x/38640126\n\nOpen to collaborations, feedback, and community input. AMA or drop your thoughts below!\n\n— Chris",
        "url": "https://www.reddit.com/r/artificial/comments/1lnnqc4/were_creating_emotionally_intelligent_ai/",
        "publishDate": "2025-06-29T19:47:46Z[Etc/UTC]",
        "author": "Sketch2000",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnhthq",
        "title": "I guess copilot remembers other chats I guess?",
        "content": "I talked about with it about a Roblox thing I made, then it said about it",
        "url": "https://i.redd.it/rrq9r5m20w9f1.png",
        "publishDate": "2025-06-29T15:44:59Z[Etc/UTC]",
        "author": "levince375",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnhn34",
        "title": "Ilya Sutskever says future superintelligent data centers are a new form of \"non-human life\". He's working on superalignment: \"We want those data centers to hold warm and positive feelings towards people, towards humanity.\"",
        "content": "[No content]",
        "url": "https://v.redd.it/46bejt6qyv9f1",
        "publishDate": "2025-06-29T15:37:31Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "145",
            "commentCount": "105",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnhbjl",
        "title": "Nick Bostrom says AGI won’t stop at the human level, it will quickly lead to superintelligence. From there, machines will outthink the best scientists and invent everything else -- faster and better than humans. \"It's the last invention we’ll ever need.\"",
        "content": "[No content]",
        "url": "https://v.redd.it/3vyph6eawv9f1",
        "publishDate": "2025-06-29T15:23:52Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "14",
            "commentCount": "44",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnguks",
        "title": "AI that turns any public repo into something you can just import and run in seconds",
        "content": "i’ve been running this experiment lately – what if AI could handle entire github repos on its own?  \nnot just generate new code, but take an existing messy repo and do the whole thing:  \nset up the environment, generate tests, debug and patch stuff, and finally wrap it all into a simple interface\n\nbasically turning any public repo into something you can just `import` and run in seconds  \nbeen testing it across a bunch of real github projects – it’s wild how consistent it’s becoming, way better than a single prompt to Cursor or Claude Code \n\nended up building a tool around it if you want to check it out soon: [repowrap.com](https://repowrap.com)",
        "url": "https://www.reddit.com/r/artificial/comments/1lnguks/ai_that_turns_any_public_repo_into_something_you/",
        "publishDate": "2025-06-29T15:04:20Z[Etc/UTC]",
        "author": "MoilC8",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lnge4e",
        "title": "need help finding AI tools to enhance and maybe organize old newspaper articles",
        "content": "Sorry if this is the wrong sub for this -- if you know a better place I'd appreciate being directed!\n\nSo i'm trying to put together a scrapbook of newspaper articles/photos on a certain topic. I have probably a few hundred articles dating back to the 60's and i really need help, particularly with the following:\n\n* Enhancing the text so it's sharper, easier to read and nicer looking, while still looking like a newspaper article\n* Same with the photos\n* Matching them all so they look as similar as possible\n* Figuring out a way to lay everything out that has the best flow and visual appeal\n\nI'm struggling with my graphic design programs, and I've never used AI for much of anything but thought maybe it would help.\n\nSuggestions?",
        "url": "https://www.reddit.com/r/artificial/comments/1lnge4e/need_help_finding_ai_tools_to_enhance_and_maybe/",
        "publishDate": "2025-06-29T14:44:55Z[Etc/UTC]",
        "author": "CowboysOnKetamine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "qVk6UHMSYYQ",
        "title": "Claudia: This OPENSOURCE Claude Code GUI is ABSOLUTELY INSANE!",
        "content": "In this video, I'll be telling you about Claudia, a powerful GUI wrapper for Claude Code that transforms the terminal-based AI ...",
        "url": "https://www.youtube.com/watch?v=qVk6UHMSYYQ",
        "publishDate": "2025-06-29T09:15:04Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/qVk6UHMSYYQ/hqdefault.jpg",
            "transcription": "Hi, Welcome to another video. So, Claude Code has been something that a lot of people are using these days, which is pretty good. I mean, it is a really good value for the people who like to do AI coding daily. But some people do get afraid by seeing that you would have to use a terminal in order to interact with this. But today, I have something that aims to fix this. And this tool is called Claudia. Basically, what it does is give you a full-on GUI and toolkit for Claude Code, which a lot of people are talking about lately. It is open source, and it's got a bunch of features that go way beyond what you get with just the command line stuff. If I would have to tell you about it in one word, then it basically makes Claude Code into a Jewels or Codex like thing where you can spawn multiple agents that sandbox your code and then do a task on it or stuff like that. It allows you to navigate through all your Claude Code projects. You can also view and resume past coding sessions with full context and all the stuff like that, which is the basic stuff. But it also has another option, which is that you can create custom agents with pre-prompted system messages that allow you to make a test agent, a coding agent, or some other kind of agent as well. And then you can select any agent and then select your project and give it a task as well, which is pretty great as well. You can also run agents in sandboxed environments with fine-grained permissions. Also, you can track all agent runs with detailed logs and performance metrics. It also allows you to monitor your Claude API usage and costs in real-time, as well as a detailed breakdown by model, project, and time period. And beautiful charts showing usage trends and patterns. Now, let me show you how you can use it. And as we proceed, I'll also tell you what makes it quite a bit different from just running Claude Code in your terminal. But, before we do that, let me tell you about Ninja Tools. Ninja Tools is an AI platform that combines all the best AI models and experiences at one place. It allows you to save over $600 per year compared to having separate subscriptions. You get access to Claude 3.7 Sonnet, GPT-4o, Gemini, and a ton of others models in one subscription. You even get some more cool options like AI video generation, image generation, music generation, and document chats. You can also use their playground to compare multiple AI responses at once. The best part is that it just starts from $11 per month. That gives you more than 1,000 chat messages, 30 AI image generation, and five music generation, while there is also some even more advanced plans if you need them. Also, make sure to use my coupon code AICODEKING20 to get an additional 20% off. Make sure to check Ninja Tools out and save some money on your subscription while you're at it. Now, back to the video. So, first off, Claudia is a desktop app built with Tauri 2, and it runs on Windows, macOS, and Linux, which is pretty awesome. But, the issue is that you will need to build it from source. So, you'll have to first install Bun and Rust as well, and then get the repo cloned, and then install dependencies as well as build the project, and then it will get started. And this is what it looks like. You just launch it, and the first thing you'll notice is this quite good GUI. You don't have to mess around with command-line arguments or config files anymore. When you open Claudia, it'll automatically detect your Claude directory. So if you've already got projects or agents set up with Claude Code, they'll just show up here. That's already a huge time-saver. Here you can see the two options, which are CC Agents as well as CC Projects. Now, agents is the option where you can create the agent or start an agent and use that as well. While there's also the projects option where you can select your projects and start simple Claude Code sessions, as well as resume sessions and stuff like that. You can also see some more options at the top. Like this usage dashboard, where you can see the total cost, sessions, as well as more stuff like sorted based on top projects. This dashboard is basically your center for all things Claude Code. You can browse through all your projects visually, and there's a smart search bar so you can find stuff instantly. If you're like me, and you have a ton of sessions, this is a life-saver. It's got session history, so you can see your past coding sessions, the first message, time stamps, and all the metadata at a glance. Now, the real kicker is the CC Agents feature. You can actually create your own custom AI agents with Claudia. You just go to the Agents tab, hit Create Agent, and then you can set the name, icon, and most importantly, the system prompt. So, if you want an agent that specializes in, let's say, refactoring TypeScript, or maybe one that's tuned for writing unit tests in Go, you can do that. You can build up a whole library of agents for different workflows, which is something that I have really wanted. Each agent runs in a sandboxed environment with very fine-grained permissions. On Linux, it uses seccomp, on macOS, it uses seatbelt. You can create these reusable permission profiles and even track any violations in real-time, which is quite awesome. If you're running your own Model Context Protocol servers, Claudia's got a whole MCP server manager built in. You can add servers through the UI, import configs from Claude Desktop, and even test connections before you use them. It's a lot more approachable for people who aren't super comfortable editing JSON files or running stuff from the terminal. And again, it's very similar to what you'd get with some enterprise tools. But it's all open source and local. One of my favorite features though, is the timeline and checkpoints thing. Basically, you can create checkpoints at any point in your coding session. And there's this visual timeline that lets you jump back or fork sessions with one click. If you're experimenting or working on something risky, you can always roll back without losing progress. There's even a diff viewer, so you can see exactly what changed between checkpoints. It's almost like version control, but built right into your AI coding workflow. I mean, I liked it. Claudia also has a built-in editor for CLAUDE.md files with live preview and full markdown support. It'll scan your projects and find all the CLAUDE.md files, which is handy if you're documenting stuff or keeping track of prompts and agent configs. Syntax highlighting is there as well, so you're not just staring at plain text. Now, let me show you how it works. So, I'm not going to be creating an agent here. Instead, for simple Claude Code sessions, you can head on over to the projects. And over here you can create new Claude Code sessions, and then select the project folder, and then select between Claude 4 Sonnet and Opus as well. Also, it works with Claude Max or Pro. Just make sure that you have that configured in the CLI, because it just uses that and as a wrapper over top of that. Now, we can ask it to do anything, and it will just do the stuff for you, and it is graphical and stuff. So, it works just like the Claude Code, but in a graphical interface instead, which is pretty amazing. You can do all kinds of settings and everything. This also runs autonomously. So, you can like go back and forth. Now, if you set up agents, then you can set up any kind of them. And the agents are basically more streamlined to work autonomously. So, you can have a vulnerability tester that you can prompt and keep, and then give it any project. And it can test a project, or a code quality checker, or even a bug fixer, which will just do the stuff for you, which is also awesome. There are a ton of settings, which I'm not going into. But this is really useful. And once you get a hang of it, you'll like it even more. A couple of things to keep in mind though. Claudia is under the AGPL license. So if you're planning to use it in a commercial product, make sure you're okay with that. Also, while it's really polished, it's still early days. So you might run into a few bugs or missing features. For example, there's no official release executable at the time I'm recording this, but that's coming soon. And while the analytics dashboard is great, usage alerts are still in the works. But honestly, for what it already does, it's insanely good. So, if you've been using Claude Code and wished it had a proper GUI, or if you want to manage multiple agents and projects without living in your terminal, Claudia is definitely worth a look. It's open source, it's secure, and it makes working with Claude Code a lot more intuitive and productive. I really liked it and have been using it. That's why I thought to share it with you guys as well. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. \n(Music) ## Transcript of the Video:\n\n[ 0m0s ] (Music)\n[ 0m4s ] Hi, welcome to another video.\n[ 0m7s ] So, Claude Code has been something that a lot of people are using these days, which is pretty good.\n[ 0m14s ] I mean, it is a really good value for the people who like to do AI coding daily.\n[ 0m21s ] But some people do get afraid by seeing that you would have to use a terminal in order to interact with this.\n[ 0m28s ] But today, I have something that aims to fix this.\n[ 0m32s ] And this tool is called Claudia.\n[ 0m35s ] Basically, what it does is give you a full-on GUI and toolkit for Claude Code, which a lot of people are talking about lately.\n[ 0m46s ] It is open source, and it's got a bunch of features that go way beyond what you get with just the command line stuff.\n[ 0m53s ] If I would have to tell you about it in one word, then it basically makes Claude Code into a Jewels or Codex like thing where you can spawn multiple agents that sandbox your code and then do a task on it or stuff like that.\n[ 1m7s ] It allows you to navigate through all your Claude Code projects.\n[ 1m15s ] You can also view and resume past coding sessions with full context and all the stuff like that, which is the basic stuff.\n[ 1m23s ] But it also has another option, which is that you can create custom agents with pre-prompted system messages that allow you to make a test agent, a coding agent, or some other kind of agent as well.\n[ 1m37s ] And then you can select any agent and then select your project and give it a task as well, which is pretty great as well.\n[ 1m45s ] You can also run agents in sandboxed environments with fine-grained permissions.\n[ 1m51s ] Also, you can track all agent runs with detailed logs and performance metrics.\n[ 1m58s ] It also allows you to monitor your Claude API usage and costs in real-time, as well as a detailed breakdown by model, project, and time period.\n[ 2m9s ] And beautiful charts showing usage trends and patterns.\n[ 2m15s ] Now, let me show you how you can use it.\n[ 2m17s ] And as we proceed, I'll also tell you what makes it quite a bit different from just running Claude Code in your terminal.\n[ 2m25s ] But, before we do that, let me tell you about Ninja Tools.\n[ 2m29s ] Ninja Tools is an AI platform that combines all the best AI models and experiences at one place.\n[ 2m35s ] It allows you to save over $600 per year compared to having separate subscriptions.\n[ 2m41s ] You get access to Claude 3.7 Sonnet, GPT-4o, Gemini, and a ton of others models in one subscription.\n[ 2m49s ] You even get some more cool options like AI video generation, image generation, music generation, and document chats.\n[ 2m54s ] You can also use their playground to compare multiple AI responses at once.\n[ 3m0s ] The best part is that it just starts from $11 per month.\n[ 3m2s ] That gives you more than 1,000 chat messages, 30 AI image generation, and five music generation, while there is also some even more advanced plans if you need them.\n[ 3m12s ] Also, make sure to use my coupon code AICODEKING20 to get an additional 20% off.\n[ 3m17s ] Make sure to check Ninja Tools out and save some money on your subscription while you're at it.\n[ 3m22s ] Now, back to the video.\n[ 3m23s ] So, first off, Claudia is a desktop app built with Tauri 2, and it runs on Windows, macOS, and Linux, which is pretty awesome.\n[ 3m34s ] But, the issue is that you will need to build it from source.\n[ 3m38s ] So, you'll have to first install Bun and Rust as well, and then get the repo cloned, and then install dependencies, as well as build the project, and then it will get started.\n[ 3m51s ] And this is what it looks like.\n[ 3m54s ] You just launch it, and the first thing you'll notice is this quite good GUI.\n[ 4m1s ] You don't have to mess around with command-line arguments or config files anymore.\n[ 4m8s ] When you open Claudia, it'll automatically detect your Claude directory.\n[ 4m11s ] So if you've already got projects or agents set up with Claude Code, they'll just show up here.\n[ 4m18s ] That's already a huge time-saver.\n[ 4m20s ] Here you can see the two options, which are CC Agents as well as CC Projects.\n[ 4m26s ] Now, agents is the option where you can create the agent or start an agent and use that as well.\n[ 4m33s ] While there's also the projects option where you can select your projects and start simple Claude Code sessions, as well as resume sessions and stuff like that.\n[ 4m44s ] You can also see some more options at the top.\n[ 4m47s ] Like this usage dashboard, where you can see the total cost, sessions, as well as more stuff like sorted based on top projects.\n[ 4m58s ] This dashboard is basically your center for all things Claude Code.\n[ 5m2s ] You can browse through all your projects visually, and there's a smart search bar so you can find stuff instantly.\n[ 5m9s ] If you're like me, and you have a ton of sessions, this is a life-saver.\n[ 5m15s ] It's got session history, so you can see your past coding sessions, the first message, time stamps, and all the metadata at a glance.\n[ 5m25s ] Now, the real kicker is the CC Agents feature.\n[ 5m29s ] You can actually create your own custom AI agents with Claudia.\n[ 5m33s ] You just go to the Agents tab, hit Create Agent, and then you can set the name, icon, and most importantly, the system prompt.\n[ 5m47s ] So, if you want an agent that specializes in, let's say, refactoring TypeScript, or maybe one that's tuned for writing unit tests in Go, you can do that.\n[ 5m57s ] You can build up a whole library of agents for different workflows, which is something that I have really wanted.\n[ 6m4s ] Each agent runs in a sandboxed environment with very fine-grained permissions.\n[ 6m10s ] On Linux, it uses seccomp, on macOS, it uses seatbelt.\n[ 6m18s ] You can create these reusable permission profiles and even track any violations in real-time, which is quite awesome.\n[ 6m27s ] If you're running your own Model Context Protocol servers, Claudia's got a whole MCP server manager built in.\n[ 6m33s ] You can add servers through the UI, import configs from Claude Desktop, and even test connections before you use them.\n[ 6m41s ] It's a lot more approachable for people who aren't super comfortable editing JSON files or running stuff from the terminal.\n[ 6m49s ] And again, it's very similar to what you'd get with some enterprise tools.\n[ 6m54s ] But it's all open source and local.\n[ 6m57s ] One of my favorite features though, is the timeline and checkpoints thing.\n[ 7m2s ] Basically, you can create checkpoints at any point in your coding session.\n[ 7m7s ] And there's this visual timeline that lets you jump back or fork sessions with one click.\n[ 7m14s ] If you're experimenting or working on something risky, you can always roll back without losing progress.\n[ 7m21s ] There's even a diff viewer, so you can see exactly what changed between checkpoints.\n[ 7m27s ] It's almost like version control, but built right into your AI coding workflow.\n[ 7m33s ] I mean, I liked it.\n[ 7m35s ] Claudia also has a built-in editor for CLAUDE.md files with live preview and full markdown support.\n[ 7m44s ] It'll scan your projects and find all the CLAUDE.md files, which is handy if you're documenting stuff or keeping track of prompts and agent configs.\n[ 7m52s ] Syntax highlighting is there as well, so you're not just staring at plain text.\n[ 7m58s ] Now, let me show you how it works.\n[ 8m0s ] So, I'm not going to be creating an agent here.\n[ 8m4s ] Instead, for simple Claude Code sessions, you can head on over to the projects.\n[ 8m8s ] And over here you can create new Claude Code sessions, and then select the project folder, and then select between Claude 4 Sonnet and Opus as well.\n[ 8m23s ] Also, it works with Claude Max or Pro.\n[ 8m26s ] Just make sure that you have that configured in the CLI, because it just uses that and as a wrapper over top of that.\n[ 8m32s ] Now, we can ask it to do anything, and it will just do the stuff for you, and it is graphical and stuff.\n[ 8m40s ] So, it works just like the Claude Code, but in a graphical interface instead, which is pretty amazing.\n[ 8m50s ] You can do all kinds of settings and everything.\n[ 8m54s ] This also runs autonomously.\n[ 8m57s ] So, you can like go back and forth.\n[ 9m0s ] Now, if you set up agents, then you can set up any kind of them.\n[ 9m3s ] And the agents are basically more streamlined to work autonomously.\n[ 9m9s ] So, you can have a vulnerability tester that you can prompt and keep, and then give it any project.\n[ 9m17s ] And it can test a project, or a code quality checker, or even a bug fixer, which will just do the stuff for you, which is also awesome.\n[ 9m34s ] There are a ton of settings, which I'm not going into.\n[ 9m37s ] But this is really useful.\n[ 9m40s ] And once you get a hang of it, you'll like it even more.\n[ 9m44s ] A couple of things to keep in mind though.\n[ 9m46s ] Claudia is under the AGPL license.\n[ 9m50s ] So, if you're planning to use it in a commercial product, make sure you're okay with that.\n[ 9m57s ] Also, while it's really polished, it's still early days.\n[ 10m2s ] So you might run into a few bugs or missing features.\n[ 10m5s ] For example, there's no official release executable at the time I'm recording this, but that's coming soon.\n[ 10m10s ] And while the analytics dashboard is great, usage alerts are still in the works.\n[ 10m13s ] But honestly, for what it already does, it's insanely good.\n[ 10m17s ] So, if you've been using Claude Code and wished it had a proper GUI, or if you want to manage multiple agents and projects without living in your terminal, Claudia is definitely worth a look.\n[ 10m29s ] It's open source, it's secure, and it makes working with Claude Code a lot more intuitive and productive.\n[ 10m37s ] I really liked it and have been using it.\n[ 10m41s ] That's why I thought to share it with you guys as well.\n[ 10m43s ] Overall, it's pretty cool.\n[ 10m45s ] Anyway, share your thoughts below and subscribe to the channel.\n[ 10m48s ] You can also donate via Super Thanks option or join the channel as well and get some perks.\n[ 10m53s ] I'll see you in the next video.\n[ 10m54s ] Bye.\n[ 10m55s ] (Music)"
        }
    },
    {
        "id": "NMmqGN6VzP8",
        "title": "China Finally Solved This After 2000 Years – Arthur Kroeber",
        "content": "",
        "url": "https://www.youtube.com/watch?v=NMmqGN6VzP8",
        "publishDate": "2025-06-29T16:30:07Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/NMmqGN6VzP8/hqdefault.jpg",
            "transcription": "[ 0m0s773ms - 0m3s563ms ] IN THE 1990S EVERYONE WAS SAYING\n[ 0m3s833ms - 0m7s223ms ] THE INTERNET IS THE DEATH KNELL OF AUTHORITARIAN REGIMES\n[ 0m7s223ms - 0m11s673ms ] BECAUSE THIS EMPOWERS EVERYONE TO HAVE INFORMATION\n[ 0m11s673ms - 0m13s603ms ] INFORMATION CONTROL IS NO LONGER POSSIBLE\n[ 0m13s603ms - 0m15s873ms ] SOCIAL CONTROL IS NO LONGER POSSIBLE\n[ 0m15s873ms - 0m17s543ms ] YOU KNOW, WOULD THAT THAT WERE TRUE.\n[ 0m17s543ms - 0m18s293ms ] RIGHT?\n[ 0m18s293ms - 0m21s383ms ] THE CHINESE GOVERNMENT VERY, VERY EARLY SAID\n[ 0m21s383ms - 0m22s223ms ] NO, THAT IS WRONG.\n[ 0m22s223ms - 0m28s663ms ] THIS IS THE THE HOLY GRAIL OF CHINESE LEADERSHIP SINCE THE 2ND CENTURY BC.\n[ 0m28s663ms - 0m29s153ms ] Right?\n[ 0m29s153ms - 0m35s363ms ] Where we sit on top of this vast Empire, it's great. We have all this territory.\n[ 0m35s363ms - 0m38s993ms ] All of this wealth is flowing in and we have no idea what people are thinking or doing far away.\n[ 0m38s993ms - 0m43s733ms ] This is bedeviled every Chinese administration for thousands of years.\n[ 0m43s733ms - 0m54s13ms ] And even into the 1990s, it was an authoritarian system, it was very fragmented, and it was very, very hard for the central government to really have any idea what was going on.\n[ 0m54s13ms - 0m57s563ms ] And now we have a panopticon because everyone is online.\n[ 0m57s563ms - 1m1s913ms ] And if we control the online universe, then we see everything.\n[ 1m1s913ms - 1m4s933ms ] And then we're pretty confident that we can\n[ 1m4s933ms - 1m6s433ms ] WATCH HERE\n[ 1m6s433ms - 1m7s233ms ] keep the discourse under control.\n[ 1m7s233ms - 1m8s123ms ] And they won that bet, right?"
        }
    }
]