[
    {
        "id": "1l1fldr",
        "title": "It’s not your imagination: AI is speeding up the pace of change",
        "content": "The 340 page AI Trend report itself is well worh the read: [https://www.bondcap.com/reports/tai](https://www.bondcap.com/reports/tai)",
        "url": "https://techcrunch.com/2025/05/30/its-not-your-imagination-ai-is-speeding-up-the-pace-of-change/",
        "publishDate": "2025-06-02T11:28:43Z[Etc/UTC]",
        "author": "SakaiHoitsu",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1din9",
        "title": "Unpopular opinion: AI might actually reverse-disrupt the job market and make Gen Z more powerful, not less",
        "content": "\nSo everyone seems to be panicking about AI replacing entry-level workers, but what if we're looking at this completely backwards?\n\nWalk into any corporate office and you'll see 50-year-old managers who can barely sum a column in Excel. They're the majority in most companies. Now imagine a 22-year-old intern walks in with Claude 4, Gemini 2.5, and advanced AI agents that can automate entire workflows.\n\nSuddenly, this intern is 10x more productive than their supposed \"boss\" who doesn't understand any of this tech. The kid can generate reports in minutes, analyze data sets that would take the manager weeks, and automate processes the company didn't even know were possible.\n\nHere's the kicker: Who do you think the company will keep when they realize the intern is delivering more value than the entire middle management layer combined?\n\nWe might be heading toward the first technological revolution where the youngest workers hold all the cards, not because they're cheap labor, but because they're the only ones who truly understand the most powerful tools in human history.\n\nThe real disruption isn't AI replacing humans - it's AI-fluent humans replacing AI-illiterate humans, regardless of seniority.\n\nWhat do you think? Am I being too optimistic about Gen Z's prospects, or are we about to witness the biggest power shift in corporate history?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1din9/unpopular_opinion_ai_might_actually/",
        "publishDate": "2025-06-02T09:22:44Z[Etc/UTC]",
        "author": "Training_Bet_2833",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1ddkk",
        "title": "GLOTECH 2025 Call for Papers",
        "content": "**GLOTECH 2025 International Conference: Global Perspectives on Technology-Enhanced Language Learning and Translation**\n\n* **Date:** 25th and 26th September 2025\n* **Venue:** University of Alicante City Centre Venue\n* **Paper submission deadline:** 18th July 2025\n* **Further info:** [https://web.ua.es/es/dl2/glotech-2025/](https://web.ua.es/es/dl2/glotech-2025/)\n\nDear colleagues,\n\n\n\nWe are pleased to invite you to participate in the international conference [Global Perspectives on Technology-Enhanced Language Learning and Translation](https://web.ua.es/es/dl2/glotech-2025/) (GLOTECH 2025), which will be held on **25th and 26th September 2025** at the [University of Alicante City Centre Venue](https://web.ua.es/es/sedealicante/sede-ciudad-de-alicante.html), and kindly ask you to distribute this invitation among your colleagues and staff.\n\n\n\nThis conference, organised by the [Digital Language Learning](https://web.ua.es/en/dl2/index.html) (DL2) research group at the University of Alicante, provides a place for discussing theoretical and methodological advancements in the use of technology in language learning and translation.\n\n\n\n**About GLOTECH 2025**\n\nThe conference will focus on topics such as the integration of Artificial Intelligence (AI) and other technologies in language teaching and translation. Topics of interest on Language Learning and Technology, and Translation and Technology include, but are not limited to:\n\n* AI, AR, and VR in language learning\n* Gamification and immersive learning environments\n* Online and adaptive learning tools\n* Advances in AI-assisted translation\n* Machine learning and multilingual communication\n* AI tools in language acquisition\n* Data-driven language learning\n* Personalization and automation in education\n* Mobile-Assisted Language Learning (MALL)\n* Ethical implications of AI in teaching and translation\n* Bias and fairness in AI-based language tools\n* Privacy, data protection, and transparency in educational technology\n* The role of institutions and industry in language technology\n* Funding and innovation in digital education\n* AI regulation and policy in language education and translation\n\n**Call for Papers**\n\nWe invite you to submit proposals for 20-minute oral presentations (plus 10 minutes for Q&A). Proposals should include an abstract of 300-400 words and a short biography of the author (maximum 50 words). Presentations can be made in English or Spanish. The deadline for submitting proposals is 18th July 2025.\n\n\n\n**Participation Fees**\n\n* Early Bird Fee (until 5th September 2025): 150 Euros\n* Regular Fee (until 19th September 2025): 180 Euros\n* Attendance is free but those who require a certificate of attendance will need to pay a fee of 50 Euros.\n\n**Conference publications**\n\nAfter the conference, authors may submit their **written papers** to [dl2@ua.es](mailto:dl2@ua.es) by **December 20th, 2025** for publication. A selection of the submissions received will be considered for inclusion in a **monographic volume** published by Peter Lang or in a **special issue** of the Alicante Journal of English Studies.\n\n\n\nFor more details on submitting proposals, registration, and participation fees, please visit the [conference website](https://web.ua.es/en/dl2/glotech-2025/) or contact us at dl2@ua.es.\n\n\n\nWe look forward to receiving your valuable contributions and welcoming you to GLOTECH 2025.\n\n\n\nKind regards,\n\nThe organising committee.\n\n\\--\n\n[GLOTECH 2025: Redefining Language Learning and Translation in the Digital Age](https://web.ua.es/es/dl2/glotech-2025/home.html)\n\n25-26 September 2025\n\nUniversity of Alicante, Spain\n\n[https://web.ua.es/es/dl2/glotech-2025/home.html](https://web.ua.es/es/dl2/glotech-2025/home.html)\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1ddkk/glotech_2025_call_for_papers/",
        "publishDate": "2025-06-02T09:13:06Z[Etc/UTC]",
        "author": "Curious_Ad8137",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1c4oe",
        "title": "Question on GRPO fine tuning",
        "content": "I've been trying to fine-tune Qwen3 series of models (0.6B, 4B and 14B) with GRPO on a dataset while I got great results with Qwen3 0.6B when it comes to 4B model it stuck its reward around 0.0. I supposed maybe I should changed parameters and I did yet it didn't work. Then I tried the same code with 14B model and it performed well. Do you have any idea about why 4B model didn't perform well. I'll share the screenshot of 0.6B model since I decided not to train further after getting 0.0 reward for first 500 steps for 4B it doesn't have ss but reward stuck around 0.0 and reward\\_std around 0.1. Graph shows the results of 0.6B reward\\_std and 4B model training logs is. \n\nhttps://preview.redd.it/5qiyrwjoxg4f1.png?width=1346&format=png&auto=webp&s=89c8f6e50696f5701f6ca4357e3e4dba1f7e3c94\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1c4oe/question_on_grpo_fine_tuning/",
        "publishDate": "2025-06-02T07:48:05Z[Etc/UTC]",
        "author": "Exact_Motor_724",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1c0lf",
        "title": "My thoughts on ai in the future",
        "content": "I think Artificial intelligence  will create new challenges for us as a species. We will become more advanced and therefore there will come new oppurtunities and jobs we cant even think about now. Space travel will be more common and we will find new technologies and new challenges. \n\nOur way of living will of course be different. But hey if you look at our past 15 years, there have been many changes  already. I do not think that we as human race will lose meaning in our lives and that we wil be out of jobs forever. We will be able to explore new materials, planets and new meaning of life. \n\nI see many post about ai taking over and etc. I do not agree. There is so much we do not know. Remember when we talked about flying cars being a thing in 2021? What happened? First the technology was limiting then there was no point in having flying cars because then you have to think about traffic/airspace and then you have to think a about climate too. This applies to ai too. There will be limitations . Ai will not solve everything. \n\nIt feels like nobody has an idea how the future will look including me. The advice I can give is too look back on our history and not stress. Just adapt and you will be fine.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1c0lf/my_thoughts_on_ai_in_the_future/",
        "publishDate": "2025-06-02T07:40:21Z[Etc/UTC]",
        "author": "AgreeableIron811",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1a34r",
        "title": "Imagine AI agent audits everyone: how many of us would be in legal trouble?",
        "content": "Lets' imagine a  near where AI agents crawl &audit everything for the last 3 decades like 1 senior  foresic analysis deployed per habitant & analyzing everything Bank records, tax filings, benefit claims, contracts, purchase histories—basically anything with a data trail.\n\nBut Not just for high profiles like celebs and politicians, but just anyone, to catch:\n\n* anyone who exaggerated income or expenses on taxes\n* People who got aid or unemployment they technically didn’t qualify for\n* Under-the-table payments or side jobs not declared\n\n  \nIn a nutshell, DOGE department, citizen version, & on steroids, especially in country relying heavily on tax collects or with financial issues, looking for new entries.\n\n**What % of the general population do you think would get caught if AI did a deep forensic scan of everyone’s last 20 years?** I’d guess like 20/30% maybe ballpark if anything above 100$ is scrutinized **?**\n\n  \n**If so, Would we need some kind of arc redemption or amnesty system for \"small sins\" below a 1000$ threshold for example ?**\n\nOtherwise, the justice system could get overwhelmed, unless of course this part is also automated & runs at the speed of the forensic analysist. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1a34r/imagine_ai_agent_audits_everyone_how_many_of_us/",
        "publishDate": "2025-06-02T05:34:02Z[Etc/UTC]",
        "author": "Pleasant-Mechanic-49",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l19z63",
        "title": "AI Powered Search Is it finally the end of endless scrolling or just hype?",
        "content": "I came across this article that talks about how ai powered serch  might put an end to endless scrolling It discusses how ai can help users get more relevant results quickly without going through pages of links thought it was an interesting take heres the link if anyone wants to read it https://glance.com/us/blogs/glanceai/ai-trends/ai-powered-search-the-end-of-endless-scrolling\nIt explains how ai is being used in search engines and shopping platforms to show more personalized results improve discovery and reduce time spent looking for things It also mentions how even google has moved away from infinite scroll recently That said I’m curious what others think. Do you think ai powered search really improves the experience or is it just another trend? also does it raise any concerns for you like privacy or being stuck in a filter bubble? Open to hearing different opinions.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l19z63/ai_powered_search_is_it_finally_the_end_of/",
        "publishDate": "2025-06-02T05:27:26Z[Etc/UTC]",
        "author": "Sadikshk2511",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l19xm4",
        "title": "Help me understand that excitement about MCPs.",
        "content": "I get it that it is a json-rpc client-server protocol that LLMs can use to interact with tools. There does not seem to be anything exciting about the protocol itself. Maybe the excitement is about the LLM's intelligence in knowing *when* to call, *what* to call, *how* to structure the request for that call, and *what to do* with the results. Are there exciting things happening in such LLM capabilities that are getting lumped under MCPs? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l19xm4/help_me_understand_that_excitement_about_mcps/",
        "publishDate": "2025-06-02T05:24:42Z[Etc/UTC]",
        "author": "2oosra",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l19shz",
        "title": "Fizzion: Coca-Cola and Adobe’s Bold Participation in the AI Race",
        "content": "Why is an FMCG brand like Coca-cola trying to enter AI?",
        "url": "https://www.designwhine.com/fizzion-coca-cola-adobe/",
        "publishDate": "2025-06-02T05:16:00Z[Etc/UTC]",
        "author": "Wide-Standard8082",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l183gu",
        "title": "Pandora's Box",
        "content": "I know a lot of people are already talking about this, and maybe I’m just adding to the noise, but I still feel like this is something that we need to start a dialogue about. \n\nImagine, I could livestream a conversation with an AI version of Nietzsche trained on all his work, his ideas, and even his personality based on historical accounts. He could have quirks, mannerisms, everything. I could literally sit and talk to a resurrected version of him, and stream the whole thing while people watch and comment in real time. We are trying to get to a level of simulation that is as close to accurate as what we imagine in our minds.\n\nIf we can do that, what else can we do? What else will people do? \n\nThink about the endless possibilities that malicious people will have, especially when adding human sexuality into the mix. This technology is basically a blank canvas. And when you give people that much creative freedom, with the spectrum of the human mind on display, it opens the door to things we’re not prepared for. \n\nSo how do we prepare? What laws/policies should we be advocating for? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l183gu/pandoras_box/",
        "publishDate": "2025-06-02T03:38:07Z[Etc/UTC]",
        "author": "TriviumTrav",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l17vj3",
        "title": "Is it really unethical to train a model on outside data",
        "content": "I guess in some sense it is, but I feel like it’s kind of a similar principle as using someone’s art as inspiration for your own, that’s just how putting things on the internet works? I think a lot of people who claim this don’t really understand the underlying mathematics behind LLMs and Diffusion Models etc. it’s not copying your work, it’s optimizing a loss based on thousands and millions of work. On one hand I fully get the argument and I even implemented a MiniGPT in PyTorch recently with only my own work and standard texts, but on the other hand I feel like people are putting a lot more stock into their work being plagiarized when they don’t really get what’s going on",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l17vj3/is_it_really_unethical_to_train_a_model_on/",
        "publishDate": "2025-06-02T03:25:56Z[Etc/UTC]",
        "author": "merlin-a",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l17i5g",
        "title": "Evolving Modular Priors to Actually Solve ARC and Generalize, Not Just Memorize",
        "content": "I've been looking into ARC (Abstraction and Reasoning Corpus) and what’s actually needed for general intelligence or even real abstraction, and I keep coming back to this:\n\nMost current AI approaches (LLMs, neural networks, transformers, etc) fail when it comes to abstraction and actual generalization, ARC is basically the proof.\n\nSo I started thinking, if humans can generalize and abstract because we have these evolved priors (symmetry detection, object permanence, grouping, causality bias, etc), why don’t we try to evolve something similar in AI instead of hand-designing architectures or relying on NNs to “discover” them magically?\n\nThe Approach\n\nWhat I’m proposing is using evolutionary algorithms (EAs) not to optimize weights, but to actually evolve a set of modular, recombinable priors, the kind of low-level cognitive tools that humans naturally have.\nThe idea is that you start with a set of basic building blocks (maybe something equivalent to “move,” in Turing Machine terms), and then you let evolution figure out which combinations of these priors are most effective for solving a wide set of ARC problems, ideally generalizing to new ones.\n\nIf this works, you’d end up with a “toolkit” of modules that can be recombined to handle new, unseen problems (including maybe stuff like Raven’s Matrices, not just ARC).\n\nWhy Evolve Instead of Train?\n\nCurrent deep learning is just “find the weights that work for this data.”\nBut evolving priors is more like: “find the reusable strategies that encode the structure of the environment.”\nEvolution is what gave us our priors in the first place as organisms, we’re just shortcutting the timescale.\n\nMinimal Version\n\nInstead of trying to solve all of ARC, you could just:\n\nPick a small subset of ARC tasks (say, 5-10 that share some abstraction, like symmetry or color mapping)\n\nStart with a minimal set of hardcoded priors/modules (e.g., symmetry, repetition, transformation)\n\nUse an EA to evolve how these modules combine, and see if you can generalize to similar held-out tasks\n\n\nIf that works even a little, you know you’re onto something.\n\nLonger-term\n\nTheoretically, if you can get this to work in ARC or grid puzzles, you could apply the same principles to other domains, like trading/financial markets, where “generalization” matters even more because the world is non-stationary and always changing.\n\nWhy This? Why Now?\n\nThere’s a whole tradition of seeing intelligence as basically “whatever system best encodes/interprets its environment.” I got interested in this because current AI doesn’t really encode, it just memorizes and interpolates.\n\nRelevant books/papers I found useful for this line of thinking:\n\nBuilding Machines That Learn and Think Like People (Lake et al.)\n\nOn the Measure of Intelligence (Chollet, the ARC guy)\n\nNEAT/HyperNEAT (Stanley) for evolving neural architectures and modularity\n\nStuff on the Bayesian Brain, Embodied Mind, and the free energy principle (Friston) if you want the theoretical/biological angle\n\n\nHas anyone tried this?\n\nMost evolutionary computation stuff is either evolving weights or evolving full black-box networks, not evolving explicit, modular priors that can be recombined.\nIf there’s something I missed or someone has tried this (and failed/succeeded), please point me to it.\n\nIf anyone’s interested in this or wants to collaborate/share resources, let me know. I’m currently unemployed so I actually have time to mess around and document this if there’s enough interest.\n\nIf you’ve done anything like this or have ideas for simple experiments, drop a comment.\n\nCheers.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l17i5g/evolving_modular_priors_to_actually_solve_arc_and/",
        "publishDate": "2025-06-02T03:06:07Z[Etc/UTC]",
        "author": "Physine",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l16qd2",
        "title": "Is it really a battle between AI and humanity?",
        "content": "I don’t think AI is the enemy.  \nIt feels less like a war between machines and humans—and more like a mirror.  \nA mirror for our systems, our intentions, and our fears.\n\nAI isn’t rising against us.  \nIt’s being used by individuals, corporations, and institutions to amplify long-standing agendas.  \nNot to uplift humanity, but to centralize control, narrative, and profit.\n\nThe real danger isn’t artificial intelligence.  \nIt’s *unaccountable power* behind the scenes.\n\nAs a Juris Doctor and independent technical researcher at the intersection of AI theory, law, ethics, and syntactic cognition, I’ve spent the past year building an experimental model for human–AI co-evolution, called *Recursive Cognition.* It’s an attempt to structure trust, phase alignment, and mutual comprehension rather than fear.\n\nAll of my preprints and theory papers are free and open on Zenodo.  \nI welcome all viewpoints. Let’s build a real conversation.\n\nIs it AI vs Humanity?  \nOr is it Humanity vs Itself?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l16qd2/is_it_really_a_battle_between_ai_and_humanity/",
        "publishDate": "2025-06-02T02:25:38Z[Etc/UTC]",
        "author": "JayneSpiral",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l16d2d",
        "title": "AI may not create the peasants and kings situation many believe will occur.",
        "content": "Please let me know your thoughts on this take.\n\nSetting aside AGI/singularity, one of the biggest concerns I see online is AI taking jobs, with the tail end of this being that corporations will only become wealthier and the working class will essentially become peasants. I have a slightly different take.\n\nWhile I think corporations will continue to hold significant advantages such access to capital, access to proprietary data, regulatory influence and so on, I think AI is likely to narrow the gap in capability (and possibly even the wealth) between corporations and individuals more than any other time in history.\n\nUnlike prior industrial revolutions, which tended to centralize power around those with capital and infrastructure, AI (in combination with the internet) allows individuals to achieve levels of productivity, creativity, and influence that are unprecedented. It will soon be the case that the power of a highly skilled workforce (previously only accessible to large companies) will be accessible to individuals via AI. \n\nThe democratisation of AI won't eliminate the balance of power, but do think that in the long term it will actually shift it away from corporations and towards individuals.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l16d2d/ai_may_not_create_the_peasants_and_kings/",
        "publishDate": "2025-06-02T02:06:48Z[Etc/UTC]",
        "author": "Wooden_Boss_3403",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "17",
            "commentCount": "49",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l159my",
        "title": "Just thinking out loud",
        "content": "To be transparent, I am a proponent of AI and I often times find myself staunchly defending it as if it is someone I know personally, but the one thing I am growing increasingly disheartened with is the way the general public misuses and abuses its current capabilities.  \nMost people, not all, use current AI as either a way to skirt learning or for entertainment.  \nThe recent advancements in AI video production really has me shaking my head because the videos are pointless, serves absolutely zero purpose for learning or teaching and is being used just to troll or for entertainment.  \nAs much faith as I have in AI better humanity I have equally as much lack of faith in the majority of humanity utilizing this tech for beneficial applications.  \nWe should be tackling any and all issues or problems we can at a low level to help better the world, but instead we have AI videos about Synchronized Cat Swim Teams, or Social Media influencers jumping into lava pools.  \nGot me typing F in chat ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l159my/just_thinking_out_loud/",
        "publishDate": "2025-06-02T01:11:34Z[Etc/UTC]",
        "author": "nill_hatha_johnh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l151an",
        "title": "One-Minute Daily AI News 6/1/2025",
        "content": "1. **Gemini** will now automatically summarize your long emails unless you opt out.\\[1\\]\n2. ‘One day I overheard my boss saying: just put it in **ChatGPT**’: the workers who lost their jobs to AI.\\[2\\]\n3. Brain implant enables ALS patient to communicate using AI.\\[3\\]\n4. **New York Times** partners with **Amazon** for first AI licensing deal.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/06/01/one-minute-daily-ai-news-6-1-2025/](https://bushaicave.com/2025/06/01/one-minute-daily-ai-news-6-1-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l151an/oneminute_daily_ai_news_612025/",
        "publishDate": "2025-06-02T00:59:54Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l142x7",
        "title": "I always wondered how people adapted internet back then, now I know",
        "content": "Internet might be the hugest thing that ever happened on the last century, altough we act like it's another tuesday. I born in 2001, pretty much grow up with it. And always wondered how people adapted it, accepted it without losing their minds on it. And now I comletely understand how. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l142x7/i_always_wondered_how_people_adapted_internet/",
        "publishDate": "2025-06-02T00:13:03Z[Etc/UTC]",
        "author": "umutcklc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "29",
            "commentCount": "58",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l12rqb",
        "title": "Google quietly released an app that lets you download and run AI models locally",
        "content": "Called Google AI Edge Gallery, the app is available for Android and will soon come to iOS. It allows users to find, download, and run compatible models that generate images, answer questions, write and edit code, and more. The models run offline, without needing an internet connection, tapping into supported phones’ processors.",
        "url": "https://techcrunch.com/2025/05/31/google-quietly-released-an-app-that-lets-you-download-and-run-ai-models-locally/",
        "publishDate": "2025-06-01T23:10:33Z[Etc/UTC]",
        "author": "coinfanking",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "80",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l12jnr",
        "title": "15 Trillion Tokens?",
        "content": "Where is OpenAI getting 15 trillion tokens to train ChatGPT 4.5?  Is it from customer data or is it from ChatGPT using its own responses?  Part of the original pitch was that it was trained using quality data sources like Wikipedia.  How are they finding trillions of new tokens seeming every month?  How exactly does the reinforcement happen?  Are they still using piles of labor in low cost countries?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l12jnr/15_trillion_tokens/",
        "publishDate": "2025-06-01T23:00:37Z[Etc/UTC]",
        "author": "Engineer_5983",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l11s0y",
        "title": "BizFinBench A Business-Driven Real-World Financial Benchmark for Evaluating LLMs",
        "content": "I'm finding and summarising interesting AI research papers every day so you don't have to trawl through them all. Today's paper is titled \"BizFinBench: A Business-Driven Real-World Financial Benchmark for Evaluating LLMs\" by Guilong Lu, Xuntao Guo, Rongjunchen Zhang, Wenqiao Zhu, and Ji Liu.\n\nThis paper introduces BizFinBench, the first evaluation benchmark specifically designed to assess large language models (LLMs) within the domain of real-world financial applications. It seeks to address the ongoing difficulty of evaluating the reliability of LLMs in fields that demand logical reasoning and precision, such as finance.\n\n**Key Findings:**\n\n1. **Comprehensive Benchmark Design:** BizFinBench includes 6,781 annotated queries categorized into five dimensions: numerical calculation, reasoning, information extraction, prediction recognition, and knowledge-based question answering. This comprehensive structure allows for a robust assessment of model capabilities aligned with business needs.\n\n2. **IteraJudge Evaluation Methodology:** The paper introduces IteraJudge, a novel evaluation framework designed to mitigate biases when LLMs function as evaluators in objective metrics. This iterative approach enhances the accuracy and interpretability of evaluations, which is particularly important in complex financial scenarios.\n\n3. **Diverse Model Performance:** The evaluation of 25 LLMs revealed that no single model excels across all tasks. For instance, in numerical calculations, certain proprietary models showed superior performance, while open-source models lagged behind in specific areas. This highlights the varying strengths and weaknesses across different models in addressing real-world financial queries.\n\n4. **Challenges with Complex Queries:** The research identified a significant gap in model performance concerning complex financial queries requiring multi-step reasoning and understanding of nuanced contexts. While LLMs perform well on routine tasks, they struggle with intricate scenarios, underscoring the need for targeted development in this area.\n\n5. **Application of BizFinBench:** The researchers assert that BizFinBench serves not only as a rigorous benchmark but also as a valuable reference for deploying LLMs in practical financial environments, potentially guiding future advancements in financial AI applications.\n\nThrough this study, the authors provide a critical resource for evaluating and improving LLMs in financial contexts, thus paving the way for more reliable and effective financial assistant technologies.\n\nYou can catch the full breakdown here: [Here](https://www.thepromptindex.com/unlocking-the-future-of-finance-how-bizfinbench-is-revolutionizing-ai-evaluations.html)  \nYou can catch the full and original research paper here: [Original Paper](https://arxiv.org/abs/2505.19457)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l11s0y/bizfinbench_a_businessdriven_realworld_financial/",
        "publishDate": "2025-06-01T22:25:43Z[Etc/UTC]",
        "author": "Officiallabrador",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l11kd5",
        "title": "Has AI already changed how we learn forever?",
        "content": "Lately I’ve been thinking about how rapidly AI is reshaping our learning habits — especially after seeing a graph showing Stack Overflow’s collapse after ChatGPT launched.\n\nWe’ve gone from:\n\n* Googling for hours → to prompting GPT once\n* Waiting for answers → to generating code instantly\n* Gatekept communities → to solo, on-demand tutors\n\nThe barrier to entry in programming, writing, design, and even research has *plummeted* — but so has the reliance on traditional platforms like forums and Q&A sites.\n\nThis raises a big question for me:  \nDo you think AI is making us smarter by accelerating how we learn — or dumber by removing the struggle that builds true understanding?  \nI'd love to hear your take. And if you're in education, coding, or any technical field — how has your *own* learning process changed since using AI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l11kd5/has_ai_already_changed_how_we_learn_forever/",
        "publishDate": "2025-06-01T22:16:13Z[Etc/UTC]",
        "author": "Eastern_Ad_8744",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "36",
            "commentCount": "56",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l11dh6",
        "title": "Was this video faked with AI?",
        "content": "Saw this Chinese paraglider video all over the news a couple days ago. Now today I’m seeing reports saying it was “altered” with AI and people are questioning if the incident even occurred. Can anyone here tell if the video of the paraglider is AI?",
        "url": "https://youtu.be/Qr4qFvII9T0?si=3IHTftnwkUYCNtaB",
        "publishDate": "2025-06-01T22:07:59Z[Etc/UTC]",
        "author": "beiendu19",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l10uzp",
        "title": "AI will replace entry level jobs but..",
        "content": "Wouldn’t it also make people doing entry level jobs more qualified to handle much complex task? Similar to computers back when they were deployed to general world. So wouldn’t it be the same step up that people had from doing manual data handling and processing \n\nOr am I missing something?\n\nI say this because, i see no one mentioning this part.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l10uzp/ai_will_replace_entry_level_jobs_but/",
        "publishDate": "2025-06-01T21:45:55Z[Etc/UTC]",
        "author": "bigeye_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0y39g",
        "title": "Now  the best startups will happen outside of the United States 🇺🇸",
        "content": "Over 60% of American computer science PhDs are international students, and you think you're just going to magically conjure up homegrown researchers to replace them, and then win the AI race with magic Trump fairy dust? X/@Noahpinion\n\n( CHART in the comments BELOW) \n\nLet discuss about it . My thoughts in the comments below .",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0y39g/now_the_best_startups_will_happen_outside_of_the/",
        "publishDate": "2025-06-01T19:50:37Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "99",
            "commentCount": "84",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0xtlh",
        "title": "AI needs to be a PUBLIC UTILITY",
        "content": "If you have something to say... do say it. \n\nWe could treat AI computing infrastructure as a public utility. Data centers, chips, foundational models. \n\n\nI look forward to reading your thoughts. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0xtlh/ai_needs_to_be_a_public_utility/",
        "publishDate": "2025-06-01T19:39:21Z[Etc/UTC]",
        "author": "emoUnavailGlitter",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0xj8c",
        "title": "A closer look at the black-box aspects of AI, and the growing field of mechanistic interpretability",
        "content": "[No content]",
        "url": "https://sjjwrites.substack.com/p/a-closer-look-at-the-black-box-aspects",
        "publishDate": "2025-06-01T19:27:10Z[Etc/UTC]",
        "author": "EssJayJay",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0wgt0",
        "title": "Isn’t now time to reevaluate the educational grading system or is to little to late at this point?",
        "content": "With ai rising in prominence, and students using it to cheat more than ever, isn’t now time to actually reevaluate the whole structure? Bad timing of course but it was inevitable it seems. Maybe the grading system focusing on metrics and not understanding and actively interacting has some flaws. It’s only going to get more prevalent. Seems like it already passed the breaking point.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0wgt0/isnt_now_time_to_reevaluate_the_educational/",
        "publishDate": "2025-06-01T18:43:23Z[Etc/UTC]",
        "author": "FreshDrama3024",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0v8gp",
        "title": "Group of experts create a realistic scenario of AI takeover by 2027",
        "content": "A very interesting watch. Title sounds very sensationalist but everything is based on real predictions of what is already happening. A scenario of how AI could take over the world and destroy human civilization in the next few years. What are your thoughts on it?",
        "url": "https://youtu.be/k_onqn68GHY?si=fEB5ixyInhgi-6-y",
        "publishDate": "2025-06-01T17:53:25Z[Etc/UTC]",
        "author": "hydrogenxy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0v6d2",
        "title": "AI is making basic salary a necessity - Hit me back",
        "content": "Hey, so I’ve been thinking a lot about how AI is changing everything, especially when it comes to jobs and money. It’s pretty wild how fast it’s moving. AI isn’t just about robots in factories anymore; it’s taking over all kinds of stuff. Self-driving cars are a thing now, and there are programs out there writing articles, making art, even helping doctors diagnose patients. My buddy who’s a paralegal is freaking out because AI can scan contracts faster than he can even read them. It’s like, no job feels totally safe anymore, you know?\n\nSo here’s where my head’s at: if AI keeps eating up these jobs, what happens to all the people who used to do them? It’s not just about losing a paycheck, though that’s rough enough. Work gives a lot of us a sense of purpose, like it’s part of who we are. Without it, things could get messy fast. That’s why I’ve been mulling over this idea of a basic salary, or what some folks call universal basic income. Picture this: everyone gets a regular check just for being alive, no questions asked. It sounds kind of crazy at first, but I’m starting to think it might be a necessity.\n\nLet me break it down. AI is moving so quick that it’s outpacing everything we’ve got: schools, job training, you name it. Back in the day, when machines took over farming or factory work, people had time to shift to new gigs. But now? It’s like a tidal wave hitting us all at once. A basic salary could be a lifeline. It’s not about living large; it’s about covering the basics, like rent and food, so you’re not totally screwed if your job disappears. If my gig got automated tomorrow, having that cash flow would give me room to figure things out, maybe learn something new or start a side hustle without drowning in stress.\n\nNow, I know it’s not all sunshine and rainbows. There are some real hurdles here. For one, who’s footing the bill? I’ve seen numbers saying it could cost trillions a year just in the U.S. That’s a ton of money, and I’m not sure where it’s coming from. Higher taxes? Cutting other stuff? And then there’s the worry that if people know they’ve got money coming in, they might not push as hard. I checked out some experiments, like ones in Finland and Stockton, California. People were less stressed out, which is awesome, but it didn’t always lead to more jobs or big life changes. So it’s not a perfect fix by any means.\n\nBut here’s the thing: AI isn’t slowing down. It’s speeding up, and I’m worried we’re not ready for what’s coming. We can’t just sit back and hope it all works out. A basic salary might not solve everything, but it could be a start. Maybe we pair it with better training programs or help for people to launch their own projects. It’s about giving everyone a fighting chance to adapt to this crazy new world AI’s creating.\n\nWhat I’m getting at is that AI is forcing us to rethink how we run things, like society and the economy. The old playbook of work hard, get paid, move up? It’s not holding up like it used to. A basic salary could make sure no one gets left in the dust while we figure this out. It’s not about being lazy or giving up on hustle; it’s about keeping people afloat in a future that’s coming at us full speed.\n\nSo yeah, that’s my take. AI is making a basic salary feel like a necessity because the ground’s shifting under us, and we need something to hang onto. What do you think? Am I onto something here, or am I just overthinking it? Hit me back !",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0v6d2/ai_is_making_basic_salary_a_necessity_hit_me_back/",
        "publishDate": "2025-06-01T17:50:58Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "45",
            "commentCount": "77",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0udbc",
        "title": "Trying to find video from a few days ago",
        "content": "A few days ago, someone posted a video. I think it was showing off veo 3. It was different AI generated characters saying \"I am just an AI\" or something along those lines. I want to show this to my elderly parents to help them understand how AI can be anything now and they have to be even more careful on the internet.\n\nI have searched and I can't find it anywhere. Can the reddit hivemind help me find it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0udbc/trying_to_find_video_from_a_few_days_ago/",
        "publishDate": "2025-06-01T17:18:20Z[Etc/UTC]",
        "author": "drache42-2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0tyxz",
        "title": "Apple is opening up their AI models to third-party developers for the first time - this could completely change the App Store",
        "content": "This is massive. Apple is preparing to allow third-party developers to write software using its artificial intelligence models, aiming to spur the creation of new applications and make its devices more enticing .\nThink about what this means - for the first time ever, developers will get access to the same AI that powers Siri and Apple Intelligence. We’re talking about going from Apple’s walled garden approach to basically saying “here’s our secret sauce, go build cool stuff with it.”\n\nThis could trigger an explosion of AI-powered apps that actually integrate seamlessly with iOS instead of feeling like janky third-party add-ons. Imagine photo apps that use Apple’s on-device AI, productivity tools that tap into the same language models as Apple Intelligence, or creative apps with Apple’s image generation capabilities baked in.\n\nThe timing is interesting too . Insiders say Apple’s continued failure to get artificial intelligence right threatens everything from the iPhone’s dominance to plans for robots and other futuristic products . Looks like they’re betting that letting developers build with their AI will create the killer apps they haven’t been able to make themselves.\n\nSmart move or desperate play? Either way, the App Store is about to get way more interesting.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0tyxz/apple_is_opening_up_their_ai_models_to_thirdparty/",
        "publishDate": "2025-06-01T17:01:55Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0t50f",
        "title": "Still not curing cancer.",
        "content": "So much about how AI was going to cure diseases. No move on the number one human killing disease yet. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0t50f/still_not_curing_cancer/",
        "publishDate": "2025-06-01T16:27:49Z[Etc/UTC]",
        "author": "glasstumblet",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0rr4s",
        "title": "Why is Microsoft $3.4T worth so much more than Google $2.1T in market cap?",
        "content": "I really can't understand why Microsoft is worth so much more than Google. In the biggest technology revolution ever: AI, Google is crushing it on every front. They have Gemini, Chrome, Quantum Chips, Pixel, Glasses, Android, Waymo, TPUs, are undisputed data center kings etc. They most likely will dominate the AI revolution. How come Microsoft is worth so much more then? Curious about your thoughts.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0rr4s/why_is_microsoft_34t_worth_so_much_more_than/",
        "publishDate": "2025-06-01T15:30:44Z[Etc/UTC]",
        "author": "Conscious_Warrior",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "325",
            "commentCount": "304",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0rgia",
        "title": "Why arn’t more of my chores completed by AI/tech already?",
        "content": "I recently got an Australian Cattle Dog and to keep up with the shedding I got a Roomba. It has been a life saver! It made me think why hasn’t AI/tech evolved more for household chores/cleaning? \n\nOne reason that came to mind was that as people get wealthier they don’t buy more devices to help with household task they just pay other humans (maids, laundry service, etc.). \n\nWhat do you think the future of AI/Roomba type tech is in relation to daily household tasks?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0rgia/why_arnt_more_of_my_chores_completed_by_aitech/",
        "publishDate": "2025-06-01T15:18:38Z[Etc/UTC]",
        "author": "West-Personality2584",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0rbjj",
        "title": "AI status in June 2025",
        "content": "This is not the end all of analysis with AI but I have been developing an application with different AI's and its getting really good! I have been using OpenAI,  Anthrropic and Google's models. Here are my take on these. \n\n  \n1. Claude 4 does overall the best job. \n\n* It understands, gives you what you need in a reasonable time and is understandable back. It give me just enough to ingest as a human and stretches me so I can get things done. \n\n2. o4-Mini High is super intelligent! Its like talking to Elon Musk\n\n* This is a good and bad thing, first off it wants you to go to fucking Mars, it gives you so much information, every query I write has 5x what I can take in and reasonably respond to. Its like getting a lecture for 15 minutes when you want to say \"ya but\" there just isn't enough of MY context to go through whats been said. \n* The thing is damn good though, if you can process more than me I think this could be the one for you but just like Elon, good luck taming it. Tips would be appreciated though! \n\n3. Gemini 2.5\n\n* Lots of context but huh? It does ok, its not as smart as I think Claude is and it can do a lot but I feel that its a lot of work for bland output, There is a \"creativity\" scale and I put it all the way up thinking I would get out of the box answers but it actually stopped speaking english, it was crazy. \n\nSo thats it in a nutshell, I know everyone has their favorite but for my development this is what I have found, Claude is pretty darn amazing overall and the others are either too smart or not smart enough, or am I not smart enough???",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0rbjj/ai_status_in_june_2025/",
        "publishDate": "2025-06-01T15:13:02Z[Etc/UTC]",
        "author": "illcrx",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0r9zi",
        "title": "How far will AI go to defend its own survival?",
        "content": "[No content]",
        "url": "https://www.nbcnews.com/tech/tech-news/far-will-ai-go-defend-survival-rcna209609",
        "publishDate": "2025-06-01T15:11:10Z[Etc/UTC]",
        "author": "nbcnews",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0p1e7",
        "title": "That's why you say please!",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1l0p1e7",
        "publishDate": "2025-06-01T13:31:36Z[Etc/UTC]",
        "author": "Affectionate_East330",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "21",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0o2t8",
        "title": "AI Productivity Gains - Overly Optimistic Right Now?",
        "content": "This reminds me of offshoring in the late '90s and early 2000s and with the same problems.\n\nOur company, like many others, embraced offshoring as a cost-saving measure. The logic seemed to make sense: fewer expensive onshore engineers, more affordable offshore ones.\n\nBut what happened is the remaining onshore team saw their workload skyrocket. They spent almost as long untangling the messes created offshore as they would have to write it from scratch.\n\nReading about Amazon’s developers struggling with AI-generated code, it feels familiar. They're great tools for leverage but they're not drop in replacements for competent human coders.\n\nAnyone else seeing similar?",
        "url": "https://futurism.com/amazon-programmers-ai-dark",
        "publishDate": "2025-06-01T12:44:29Z[Etc/UTC]",
        "author": "NighthawkT42",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1g9ud",
        "title": "This Python class offers a multiprocessing-powered Pool for efficiently collecting and managing experience replay data in reinforcement learning.",
        "content": "[https://github.com/NoteDance/Pool](https://github.com/NoteDance/Pool)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l1g9ud/this_python_class_offers_a_multiprocessingpowered/",
        "publishDate": "2025-06-02T12:05:00Z[Etc/UTC]",
        "author": "NoteDancing",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1f8bu",
        "title": "Major time saving use case for AI coding... API docs",
        "content": "I have a medium sized SaaS product with about 150 APIs, maintaining the openapi.yaml file has always been a nightmare, we aren't the most diligent about updating the specification every time we update or create an API.\n\nWe have been playing with multiple models and tools that can access our source code, and our best performer was Junie (from Jetbrains), here was the prompt:\n\n    We need to update our openapi.yaml file in core-api-docs/openapi.yaml with missing API functions.\n    \n    All functions are defined via httpsvr.AddRoute() so that can be used to find the API calls that might not be in the  existing API documentation.  \n    \n    I would like to first identify a list of missing API calls and methods and then we can create a plan to add specific calls to the documentation.\n\n  \nThe first output was a markdown file with the analysis of missing or incorrect API documentation.  We then told it to fix the yaml file with all identified changes, and boom, after a detailed review the first few times, our API docs are now 100% AI generated and better than we originally were creating.\n\n&TLDR...  AI isn't about vibe coding everything from scratch, it also is a powerful tool for saving time on medium/large projects when resources are constrained.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l1f8bu/major_time_saving_use_case_for_ai_coding_api_docs/",
        "publishDate": "2025-06-02T11:08:37Z[Etc/UTC]",
        "author": "bocajim",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1dfih",
        "title": "Any Game Devs here using LLMs with the Unreal engine codebase?",
        "content": "Hi everyone,\n\nI see so many people praising Claude and ChatGPT for their coding excellence. My experience with Claude has been abysmal when trying to code new features (queries limits, garbage code, etc.) and somehow better with ChatGPT, but only when limited to very narrowed down features. \n\nI'm wondering if there's anything on the market that can currently handle such a large codebase and how well it works. I feel like most people are using LLMs for web based projects or very simple apps with Rust of Python or other IT related tasks. Maybe I'm missing something.\n\nI've been experimenting with LLMs for an entire year now with the Unreal's codebase, and I'm not impressed, to say the least.\n\nAny suggestions or tips, local models maybe, RAG, etc? Trying to find a way to use LLMs with Unreal's code basically. I don't see many posts about Game Dev and wondering it there's other people in my situation, trying to use AI for Game Dev with a complex codebase.\n\n\nIf you're an Unreal dev, care to share your best practices and tips working with LLMs (local or not)?\n\nThank you!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l1dfih/any_game_devs_here_using_llms_with_the_unreal/",
        "publishDate": "2025-06-02T09:16:48Z[Etc/UTC]",
        "author": "Recent-Frame2",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1cpoa",
        "title": "Unsubscribing sucks. I made it even worse",
        "content": "Losing subscribers will never be an issue from now on. Prototyped in [same.new](http://same.new)",
        "url": "https://v.redd.it/7yuhrw2b5h4f1",
        "publishDate": "2025-06-02T08:27:45Z[Etc/UTC]",
        "author": "Pixel_Pirate_Moren",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "19",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1celk",
        "title": "AI improvement cuts both ways—being a non-expert \"ideas guy\" is not sustainable long-term",
        "content": "You're all familiar with the story of non-technical vibe coders getting owned because of terrible or non-existent security practices in generated code. \"No worries there,\" you might think. \"The way things are going, within a year AI will write performant and secure production code. I won't even need to ask.\"\n\nThis line of thinking is flawed. If AI improves its coding skills drastically, where will you fit in to the equation? Do you think it will be able to write flawless code, but at the same time it will still need you to feed it ideas?\n\nIf you are neither a subject-matter expert or a technical expert, there are two possibilities: either AI is not quite smart enough, so your ideas are important, but the AI outputs a product that is defective in ways you don't understand; or AI is plenty smart, so your app idea is worthless because its own ideas are better.\n\nIt is a delusion to think \"in the future, AI will eliminate the need for designers, programmers, salespeople, and domain experts. But I will still be able to build a competitive business because I am a Guy Who Has Ideas about an app to make, and I know how to prompt the AI.\"",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l1celk/ai_improvement_cuts_both_waysbeing_a_nonexpert/",
        "publishDate": "2025-06-02T08:06:26Z[Etc/UTC]",
        "author": "bouldereng",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1bkca",
        "title": "Cyber security guys are about to become very on demand in the coming few years",
        "content": "Vibe coding , Prompt engineering are really great at delivering projects real quick but I don't think these products are secure enough, cyber security guys are going to have to fix all security issues in these apps that are shipped daily since the people who develop them don't even consider security requirements when vibe coding them.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l1bkca/cyber_security_guys_are_about_to_become_very_on/",
        "publishDate": "2025-06-02T07:09:51Z[Etc/UTC]",
        "author": "Secure_Candidate_221",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "25",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l196et",
        "title": "Wait, I’m confused about the subscription and copilot and open router and too.",
        "content": "So I started with cursor. I tried too and vs code and loved it. Feels like the model understands my ask better and I can clearly see when context is getting high. So far been using Gemini 2.5 free $300 credit for 90 days. I also have open router $20 in there that I used for Claude 4. I was debating going back to cursor because of the price point as I don't want to break the bank so early in what I'm prototyping. \n\nI just found out that copilot subscription offers Claude 3.7, Gemini 2.5, and various OpenAI models for $10 a month. Turns out it also will update on June 4th to be usage based hilling but $0.04 per premium request after your first 50; which still seems cheaper. Quick google search shows too works with copilot.\n\nFor added context, I don't use orchestrator or architect in roo, just code. I have a workflow written down that works really well for me and all tasks are documented in my implementation plan. So I just start a fresh chat when I'm gonna start a new task. \n\nSo do you all recommend vs code with copilot or with room and open router or should I just stick with cursor?\n\nMy main architect and coding model is Gemini 2.5. I did find Claude 4 worked much better at debugging npm test results though. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l196et/wait_im_confused_about_the_subscription_and/",
        "publishDate": "2025-06-02T04:38:52Z[Etc/UTC]",
        "author": "DoW2379",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l12eqa",
        "title": "Augment Code??",
        "content": "Can someone help me understand the best IDE for my use case? \nI've been watching a lot of content about Augment Code recently. Apparently it has an unparalleled context engine but perhaps the agent isn't as performant as other IDE's (Windsurf, Cline, etc).\n\nI've created a Task management app frontend in V0 and now need to build the backend out and wondering which is currently the best IDE to go with. Does anyone have any thoughts on this? If you can breakdown your reasons that would be helpful also. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l12eqa/augment_code/",
        "publishDate": "2025-06-01T22:54:17Z[Etc/UTC]",
        "author": "DelPrive235",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0pefc",
        "title": "Vibe coding is fun until you have to scale",
        "content": "We’ve seen a lot of solo devs build whole projects with vibe coding. It works surprisingly well at first until the team grows or the project gets complex.\n\nThe problem is there’s no structure holding anything together. No shared understanding of how features are supposed to work, no trail of decisions and no clear outcomes. What made perfect sense while building becomes hard to explain even a week later.\n\nWe’ve come across projects that shipped fast and looked polished but became nearly impossible to maintain or hand off. Usually the code is fine, but no one remembers why certain flows exist or what the edge cases are.\n\nYou don’t need a full PRD or long documents to avoid this. Just writing down what the user should be able to do, what needs to happen under the hood and what done actually means is enough to keep things on track.\n\nWhether you use a simple notes app, Claude, ChatGPT or something more structured like an AI product manager in Devplan, having some form of documentation will make a HUGE difference. It’s a small habit but it makes a big difference once you start working with others or revisiting your own work after a few weeks.\n\nPlanning a little upfront keeps you fast later. Especially when you start hiring people to work on the project.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1l0pefc/vibe_coding_is_fun_until_you_have_to_scale/",
        "publishDate": "2025-06-01T13:48:53Z[Etc/UTC]",
        "author": "eastwindtoday",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "115",
            "commentCount": "66",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1gtww",
        "title": "Anyone used an LLM to Auto-Tag Inventory in a Dashboard?",
        "content": "I want to connect an LLM to our CMS/dashboard to automatically generate tags for different products in our inventory. Since these products aren't in a highly specialized market, I assume most models will have general knowledge about them and be able to recognize features from their packaging. I'm wondering what a good, cost-effective model would be for this task. Would we need to train it specifically for our use case? The generated tags will later be used to filter products through the UI by attributes like color, size, maturity, etc.",
        "url": "https://www.reddit.com/r/artificial/comments/1l1gtww/anyone_used_an_llm_to_autotag_inventory_in_a/",
        "publishDate": "2025-06-02T12:32:53Z[Etc/UTC]",
        "author": "tonyblu331",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1g408",
        "title": "why i hate AI art",
        "content": "There are two key points that those who support generative AI overlook. First, AI doesn't draw. It combines images it's trained on with images of artists who don't want to use them in this way. Well, they have the right to protect their creative works from being used for profit. When we look at AI stripped of this point, we'll see that it's not a problem to replace artists. This is the price of evolution, but it didn't start in an ethical way. Replacing artists by using their drawings, which they didn't originally agree to, is a crime. This is not like borrowing human art, which still maintains an individual characteristic and still requires individual effort to produce. Second, AI drawings are soulless and meaningless. I'm not saying they aren't expertly crafted. They are, and they're evolving in that, but there will always be a void in them every time you look at them. What distinguishes human creativity is that subconscious mind capable of understanding feelings and transferring them to art, receiving and feeling them. That love, dedication, stories they've experienced, and creative preferences are what give their art meaning. Well, AI isn't the only one that creates meaningless works. You also have the works of huge, conservative studios like Disney. They spend millions of budgets to produce bad works devoid of creativity, while independent studios with small budgets and tools can do what is stronger. They encourage creative freedom and do things because they love it. This is the creativity that no big studio can buy or that AI can imitate. This is what makes me prefer a stickman drawing over an AI drawing full of details, and what might make me a better rising YouTuber than Mr. Beast.",
        "url": "https://www.reddit.com/r/artificial/comments/1l1g408/why_i_hate_ai_art/",
        "publishDate": "2025-06-02T11:57:00Z[Etc/UTC]",
        "author": "Silver_Masterpiece82",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1eaji",
        "title": "Elon Musk’s X Just Got a Major Upgrade with XChat",
        "content": "[No content]",
        "url": "https://myinvitelink.com/elon-musks-x-just-got-a-major-upgrade-with-xchat/",
        "publishDate": "2025-06-02T10:13:20Z[Etc/UTC]",
        "author": "myinvitelink",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1dawj",
        "title": "Veo 3",
        "content": "[No content]",
        "url": "https://v.redd.it/fegcpeglch4f1",
        "publishDate": "2025-06-02T09:08:05Z[Etc/UTC]",
        "author": "cyboghostginx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1by7b",
        "title": "The UI Revolution: How JSON Blueprints & Shared Workers Power Next-Gen AI Interfaces",
        "content": "[No content]",
        "url": "https://tobiasuhlig.medium.com/the-ui-revolution-how-json-blueprints-shared-workers-power-next-gen-ai-interfaces-60a2bf0fc1dc?source=friends_link&sk=1b0b306285e23bb12f31271dd87bebe5",
        "publishDate": "2025-06-02T07:35:46Z[Etc/UTC]",
        "author": "TobiasUhlig",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1bcol",
        "title": "Steve Carell says he is  worried about AI. Says his latest film \"Mountainhead\" is a society we might soon live in",
        "content": "[No content]",
        "url": "https://voicefilm.com/steve-carell-talks-ai-fears-and-dark-new-series-mountainhead/",
        "publishDate": "2025-06-02T06:56:13Z[Etc/UTC]",
        "author": "S4v1r1enCh0r4k",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "33",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l163tk",
        "title": "What if AI is not actually intelligent? | Discussion with Neuroscientist David Eagleman & Psychologist Alison Gopnik",
        "content": "This is a fantastic talk and discussion that brings some much needed pragmatism and common sense to the  narratives around this latest evolution of Transformer technology that has led to these latest machine learning applications. \n\nDavid Eagleman is a neuroscientist at Stanford, and Alison Gopniki is a Psychologist at UC Berkely; incredibly educated people worth listening to.",
        "url": "https://www.youtube.com/watch?v=hTb2Q2AE7nA",
        "publishDate": "2025-06-02T01:54:19Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l1423p",
        "title": "AI Jobs",
        "content": "Is there any point in worrying about Artificial Intelligence taking over the entire work force?\n\nSeems like it’s impossible to predict where it’s going, just that it is improving dramatically  ",
        "url": "https://www.reddit.com/r/artificial/comments/1l1423p/ai_jobs/",
        "publishDate": "2025-06-02T00:11:53Z[Etc/UTC]",
        "author": "Qrious_george64",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "76",
            "isNsfw": "false"
        }
    },
    {
        "id": "1l0p429",
        "title": "Ai systems in a vending machine simulation (Spolier, some get very derailed…)",
        "content": "Not sure if this was posted before, but found this from [slashdot](https://slashdot.org/story/25/05/31/2112240/failure-imminent-when-llms-in-a-long-running-vending-business-simulation-went-berserk). If you want to read about Ai going very brainsick, this might be such a thing…\n\nAlso i don't know what would be the proper flair would be, so i'm putting it under \"Miscellaneous\" for now…",
        "url": "https://arxiv.org/pdf/2502.15840",
        "publishDate": "2025-06-01T13:35:08Z[Etc/UTC]",
        "author": "Marwheel",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "6aZ3lc9n3VE",
        "title": "Devstral + FREE MCPs + Unlimited FREE API: This is LOCAL SONNET! The best LOCAL CODER COMBINATION!",
        "content": "Visit Firecrawl: https://www.firecrawl.dev/ In this video, I'll be telling you that how you can use the new local and private Mistral's ...",
        "url": "https://www.youtube.com/watch?v=6aZ3lc9n3VE",
        "publishDate": "2025-06-01T09:15:00Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/6aZ3lc9n3VE/hqdefault.jpg",
            "transcription": "Hi, Welcome to another video. So, there's a new model by Mistral that is called Devstral. This model was released on the same day as Google's IO event, which killed its hype. But I've been using this model a bit and I really like it. So, let's talk about this. Devstral is an open weights model and it is built under a collaboration between Mistral AI and All Hands AI. All Hands is the Open Devin project and I have tried to use that in some of my previous videos. But it's really bad and doesn't work half of the time. But that doesn't matter here. Apparently, it outperforms all open-source models on SWE-Bench Verified by a large margin. They have released Devstral under the Apache 2.0 license. It sits above the Deepseek V3 model on SWE-Bench tasks, while being super low cost to run, which is quite amazing. Basically, they say that they achieve this by specifically training the model to handle agentic code super well, which is what most of the local models struggle with. Even Deepseek struggles with tool calls. But Devstral is specifically trained on that in order to make it super good. It scores above Claude 3.5 Haiku, GPT 4.1 Mini, as well as other models, which is pretty good. It is only a 24 billion parameter model and is light enough to run on a single RTX 4090 or a Mac with 32 GB RAM, making it an ideal choice for local deployment and on-device use. It has about a 128K context window. I would have probably liked a 1 million token context, so I won't complain. Though, I have seen that the 128K context window is actually quite good. Like, it almost always knows about some older messages that are within the window, which is quite awesome. If you use it via the API, then it costs somewhere around 10 cents per million input tokens and 30 cents per million output tokens, which is really cheap. Especially if you're using it for simple stuff that requires multiple reliable tool calls and such. There's also a free tier of Matral's API as well. That will allow you to use it for free, and the free tier seems to be super generous because it gives you about one request per second, along with 500K tokens per minute, and about 1 million tokens per month as well, which is quite awesome. Anyway, you can find it on Ollama and Hugging Face as well, and you can download and use it locally as well. There's also the free endpoint for it on Open Router if you do wish to use that. So, using it is simple. You can go to Roo Code or Cline and set it up over there, or you can also use Kilo Code to do that. And you will also get free $20 credit there in order to give it a try. Or you can also use it with Ollama and stuff locally if you wish to do that as well. Anyway, you can now start using it and it is actually one of the models that works extremely well with Roo Code and Cline. Because of it being specifically trained on agentic tasks. I'm asking it to make me a simple Minesweeper game. And this is actually a question that none of the local models except GLM is able to do. In just a bit, you'll see that it starts to do the agentic stuff and create files and everything, which is great. In just a bit, it gets done. And if we run this, then this looks pretty good. And it actually works, which is awesome. Now, there are some issues with this model. For example, although the model is super reliable, unlike any local model that I have seen, the model doesn't style the components as much as something like GLM does. It is super prompt adherent. So, there are some things that I would want you to do, which is, first of all, having a rules file. A rules file is something that you should always have for this model. I always ask it to use ShadCN Tailwind and style components minimally. It should always maintain a task list and use that accordingly to implement all tasks. I can also use Task Master, but it can become a hassle at times. So, you can just ask it to maintain a high-level task file and use that. Don't use memory bank with this model because it can become too lengthy of a process. I also ask it to search for documentation through Context 7 MCP server. Another major thing that I ask it to do is to search for stuff on the internet when it thinks that it should with Fire Crawl, and it can also scrape any URL if given to it. I use Fire Crawl because it is super easy to use and doesn't bog down your system. Plus, it has a ton of features that just make it super good. Like, it can gather clean data from all accessible subpages, even without a sitemap. It can parse and output content from web hosted PDFs, DOCX, and more. It also intelligently waits for content to load, making scraping faster and more reliable. Plus, it can click, scroll, write, wait, press, and more before extracting content. It can also supply the screenshot of websites to the LLM for even better site replication and stuff like that. It has an MCP server that I will be using in this case. And it has a free plan with 500 credits. It also has a $16 and other higher-tier plans if you do need them. For now, the free plan should be totally amazing. Anyway, to set it up, just get signed up there and then copy the Fire Crawl API key. Then head on over to the MCP server settings of Roo Code or Kilo Code or Cline and then just copy the MCP server settings, paste it there, and also paste in your API key and it should now work. So, now with all these rules, I can ask it to make me a new Minesweeper game. And I also would like for it to search the internet and bring me some cool styles into the game. You'll see that it will do that. It will go ahead and use the MCP servers, include Fire Crawl, Context 7, and everything. And then it will just get that done. In just a bit, it is now finished. And here's how it looks. It looks pretty awesome and better than the previous iteration. These simple things make it extremely better. This is better than GLM, at least in how much I have used it. And this will be amazingly good for you guys to use when you don't have internet or don't want to share some confidential code or something like that. The small coding models are really good because they make agentic coding and stuff much more secure and private if you need that. I really liked this model and thought to talk about it because this model is extremely good. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. (Music)"
        }
    },
    {
        "id": "d5_iR7-8hrQ",
        "title": "The Rise of Xi Jinping - Victor Shih",
        "content": "",
        "url": "https://www.youtube.com/watch?v=d5_iR7-8hrQ",
        "publishDate": "2025-06-01T17:35:00Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/d5_iR7-8hrQ/hqdefault.jpg",
            "transcription": "SO THE CULTURAL REVOLUTION GENERATION, I think, you know, a lot of people suffered horrendously, including Xi Jinping himself. But then, basically, you have two types of lessons that people drew from it. So the first lesson is like, oh, you know, the party's too dictatorial. China needs to liberalize and so on and so forth. But apparently for Xi Jinping himself and others like him, the lesson was just, don't be on the losing side. You know, in any political struggle, make sure you're on the winning side because if you are on the winning side, then you can do terrible things to your enemies. So that apparently is the lesson that he learned. And he basically honed his skills and built his coalitions for the time that he would take over a high-level position in the party for decades. So if you look at the data, you know, when he was in Fujian Province, he spent an inordinate amount of time hanging out with military officers back in the 1980s. Why'd he bother to do that? You know, most local officials, they don't do that. I mean, you know, the military is there, you need to be nice to them and all this stuff, but like he built a dormitory for them. He even joined a unit of anti-aircraft regiment. He tried as much as possible to do as much as possible with the military because he knew he needed the support of somebody in the military when the time comes. And guess what? Sort of 30 years later, when he was about to be elevated to be Secretary-General of the Chinese Communist Party, many of the people that he knew back in Fujian are now generals. They're in charge of important military units. And once he came to power, then he really promoted some of these people. But then lately, of course, he's purging some of these people, which is really interesting. Yeah. Yeah."
        }
    }
]