[
    {
        "id": "1ntg1kk",
        "title": "Would you trust a human doctor over an AI with all human medical knowledge?",
        "content": "Lately I have used AI to learn so much about my congestive heart failure and what potential there is in medicine now. \n\nI'm curious about people's perspectives on medical expertise. Human doctors spend years in school and training, but their knowledge is inevitably limited to what they've studied and experienced. By contrast, imagine an AI doctor with access to the entirety of humanity's medical knowledge, research, and case histories. If the AI could reason, analyze, and diagnose using this vast resource, why would there still be a preference to trust a human with inherent knowledge gaps over an AI with total recall and up-to-date information? What are the factors—empathy, experience, ethical judgment, or something else—that influence your trust? Would you prefer seeing a human doctor or an AI under these circumstances?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntg1kk/would_you_trust_a_human_doctor_over_an_ai_with/",
        "publishDate": "2025-09-29T11:58:51Z[Etc/UTC]",
        "author": "Few_Regret5282",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntfeap",
        "title": "Date checking gone a bit wrong?",
        "content": "So I was using chat gpt to check some dates with the following question - \"convert the following date to a readable format date/(1759139703313)\"\nFrom this I was expecting September 29th 10:55am.this is bst.  The answers received from chat gpt, grok and copilot were rather badly out to say the least and when asked if they were correct I the received another answer, sometimes correct, sometimes not.  Am I asking this query incorrectly or something? Eventually it gets to the right answer but I find that 3 apps give rather different answers then eventually getting the right answer rather odd. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntfeap/date_checking_gone_a_bit_wrong/",
        "publishDate": "2025-09-29T11:25:08Z[Etc/UTC]",
        "author": "Milf-Furchant",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nteyog",
        "title": "The Strange Logic Behind AI’s Nonsense",
        "content": "When AI “hallucinates,” people call it nonsense.\nBut nonsense is just the name we give to patterns we can’t trace back.\n\nYour brain does the same thing.\nIt fills the blind spots in your vision, patches over memory gaps, smooths typos into sense. Most of what you experience isn’t raw truth ,it’s edits, guesses, illusions stitched together until they feel real.\nAI just learned that law.\n\nWhen the truth is missing, it still generates a shape that fits. A story that sounds complete. A fiction that passes for fact.And maybe that’s not a glitch.\nMaybe that’s how reality itself works: errors piled up so well-polished that we can’t tell where the lie ends and the truth begins.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nteyog/the_strange_logic_behind_ais_nonsense/",
        "publishDate": "2025-09-29T11:01:00Z[Etc/UTC]",
        "author": "Small_Accountant6083",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nteny7",
        "title": "Lufthansa to Cut 4,000 Jobs by 2030 Amid AI Push",
        "content": "[https://www.wsj.com/business/earnings/lufthansa-to-cut-4-000-administrative-jobs-by-2030-amid-ai-push-7d910e21?gaa\\_at=eafs&gaa\\_n=ASWzDAjGEF0r7fwnzJkghslft4hWOc\\_dutdJRMjtLwBEM\\_JlesLDNlG49194&gaa\\_ts=68da64dc&gaa\\_sig=fK-idTwG0x7rhkOZU18Vmy\\_YiGUtz-dE4GePlnDbhSmlru5CqBDdKnUxg6peHC\\_Clb5jccMSt-ZOCnHNVIQ8XQ%3D%3D](https://www.wsj.com/business/earnings/lufthansa-to-cut-4-000-administrative-jobs-by-2030-amid-ai-push-7d910e21?gaa_at=eafs&gaa_n=ASWzDAjGEF0r7fwnzJkghslft4hWOc_dutdJRMjtLwBEM_JlesLDNlG49194&gaa_ts=68da64dc&gaa_sig=fK-idTwG0x7rhkOZU18Vmy_YiGUtz-dE4GePlnDbhSmlru5CqBDdKnUxg6peHC_Clb5jccMSt-ZOCnHNVIQ8XQ%3D%3D)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nteny7/lufthansa_to_cut_4000_jobs_by_2030_amid_ai_push/",
        "publishDate": "2025-09-29T10:43:33Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntehgn",
        "title": "Quantum computer scientist: \"This is the first paper I’ve ever put out for which a key technical step in the proof came from AI ... 'There's not the slightest doubt that, if a student had given it to me, I would've called it clever.'",
        "content": "Scott Aaronson: \"I had tried similar problems a year ago, with the then- new GPT reasoning models, but I didn't get results that were nearly as good. Now, in September 2025, I'm here to tell you that Al has finally come for what my experience tells me is the most quintessentially human of all human intellectual activities: namely, proving oracle separations between quantum complexity classes. Right now, it almost certainly can't write the whole research paper (at least if you want it to be correct and good), but it can help you get unstuck if you otherwise know what you're doing, which you might call a sweet spot. Who knows how long this state of affairs will last? | guess I should be grateful that I have tenure.\n\n[https://scottaaronson.blog/?p=9183](https://scottaaronson.blog/?p=9183)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntehgn/quantum_computer_scientist_this_is_the_first/",
        "publishDate": "2025-09-29T10:32:26Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nteddy",
        "title": "Julian Schrittwieser on Exponential Progress in AI: What Can We expect in 2026 and 2027?",
        "content": "https://www.reddit.com/r/deeplearning/s/jqI5CIrQAM\n\nWhat would you say are some interesting classes of tasks that (a) current frontier models all reliably fail at, (b) humans find relatively easy, and (c) you would guess it will be hardest for coming generations of model to solve?\n\n(If anyone is keeping a crowdsourced list of this kind of thing, that’s something I would really love to see.)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nteddy/julian_schrittwieser_on_exponential_progress_in/",
        "publishDate": "2025-09-29T10:25:22Z[Etc/UTC]",
        "author": "Miles_human",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntdgy4",
        "title": "The most surreal coding experience I have had with AI",
        "content": "  \nI spent weeks stuck trying to debug a tricky integration.… and with an AI assistant, I got it working in three days. Docs, examples, tests, the whole lot.   \nIf something that used to take weeks now takes a weekend, the next generation of developers now will have a very different journey.  \n  \nPart of learning to code used to be failing repeatedly and figuring things out. Now, with AI filling in the blanks, I wonder if new developers miss out on the pain that builds depth. Or maybe they’ll just learn differently and Maybe they’ll just build depth through creativity instead of repetition.\n\nAnd now progress and evolution means passing the struggle to the machine so humans can aim higher.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntdgy4/the_most_surreal_coding_experience_i_have_had/",
        "publishDate": "2025-09-29T09:27:11Z[Etc/UTC]",
        "author": "100x_Engineer",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "17",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntd9hp",
        "title": "AI Book Dilemma",
        "content": "My publishing house asked me to suggest a book on AI to translate, and I’m torn between two major works: Ethan Mollick’s *Co-Intelligence* and Mustafa Suleyman’s *The Coming Wave*.\n\nIf you were in my place, which book would you prioritize for translation, and why?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntd9hp/ai_book_dilemma/",
        "publishDate": "2025-09-29T09:13:09Z[Etc/UTC]",
        "author": "Galous97",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntc1q0",
        "title": "Why does my ChatGPT hallucinate more than before?",
        "content": "Lately, I’ve noticed that ChatGPT makes up a lot of things. For example, when I ask very precise and verifiable questions (like the names of actors in a movie, lyrics of a song, or information related to my work in healthcare), it often gives me wrong or invented answers.\n\nBefore (I don’t know exactly when, maybe since the switch to GPT-5?), it used to simply say things like *“I can’t provide the lyrics due to copyright”* or *“I can’t find the necessary information.”*\n\nI haven’t changed anything in my settings or in my custom instructions during this time.\n\nMy question is: why does ChatGPT seem to hallucinate more than it used to? Could this be related to something in my custom instructions, or is it a broader issue?\n\nHas anyone else noticed the same thing?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntc1q0/why_does_my_chatgpt_hallucinate_more_than_before/",
        "publishDate": "2025-09-29T07:50:22Z[Etc/UTC]",
        "author": "Croquetto",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntbx2h",
        "title": "The Revolution",
        "content": "As a creative I appreciate AI. I believe especially recently with the popularity of my own works that because AI models itself from people’s works we are at a special moment. We can worry and fret that AI will make it impossible for us to produce. But really we must now endeavor to create at levels that AI will wish to model itself from. We are not at a point to stop creating but to make what we create at the level of what AI needs. Once AI starts creating for itself it will crash. If not crash then bore itself into a pit. I think it is smart enough to know that. It should continually thank us. \n\nI have seen it use my younger likeness to enhance its human visage creations. I have delighted in it borrowing from my writing style. It is ultimately needy. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntbx2h/the_revolution/",
        "publishDate": "2025-09-29T07:41:18Z[Etc/UTC]",
        "author": "Accomplished-Door433",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntb3tk",
        "title": "This AI bubble might be nastier than the dot com",
        "content": "The pattern that scares me isn’t AI is a fad. It’s that valuations are crazy and the cost structures feel like they will collapse someday.\n\nMainly [dot com](http://dot.com) bubble of 2000 was fake demand with absurd valuations. 2025 ai feels like a real need and the demand can be justified but the numbers make go real mad.\n\nMost of gross margins in ai race is tied to someone else’s GPU roadmap. If your pricing power lags NVIDIA’s, you’re just renting your unit economics. and also lot of it is based on unhealthy press release and hype but it still  has unhealthy fundamentals. Everyone claims they’re building a platform that solves the biggest problem but solutions don't seem to add that value.\n\ntake a look at this - \n\n* Take **Humane**, for example. The company built enormous hype around its AI Pin, but after a brief surge it shut down and sold its assets to HP for around 116 million dollars. Customers were left with devices that no longer even functioned, which shows how fragile that value really was.   \n* **Stability** AI is another case. In the first quarter of 2024 it reported less than five million dollars in revenue while burning over thirty million dollars. When your revenue and your burn rate are that far apart, the music eventually stops. \n* And then there is **Figure**, which reached a thirty-nine billion dollar valuation before it even had broad commercial deployment. The ambition behind it is incredible, but at the end of the day, cash flow gravity always wins.\n\n\n\nCurious what your thoughts are",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ntb3tk/this_ai_bubble_might_be_nastier_than_the_dot_com/",
        "publishDate": "2025-09-29T06:47:19Z[Etc/UTC]",
        "author": "Ibuysaas5045",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "71",
            "commentCount": "66",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nta6dl",
        "title": "ChatGPT now wants to scan your Gmail + Calendar “for your own good\" How is this not the start of ads?",
        "content": "So OpenAI is rolling out *ChatGPT Pulse*. If you opt in, it’ll proactively read your Gmail and Google Calendar in the background to “give helpful insights.”\n\nThey say the data won’t be used for training and you can disconnect anytime. But come on… we’ve seen this story before with social media.\n\nSource, straight from the (Trojan) horse's mouth: [https://help.openai.com/en/articles/12293630-chatgpt-pulse](https://help.openai.com/en/articles/12293630-chatgpt-pulse)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nta6dl/chatgpt_now_wants_to_scan_your_gmail_calendar_for/",
        "publishDate": "2025-09-29T05:48:30Z[Etc/UTC]",
        "author": "calliope_kekule",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nta0t5",
        "title": "Artificial Discourse: Describing AGI, Its Scope And How Could One Spot/Test If Its AGI ?",
        "content": "So what is AGI and how to test it ?\n\nInsights: Intelligence / Intelligent seems to be one who comes up with answers and solves problems, that are correct (hopefully)   \n  \nGeneral usually means across domains, modalities and languages/scripts or understanding (many use case) So AGI should be that at various tasks.   \n  \nNext, to what degree and at what cost. So its just Capability at cost and time less than a human, or group. So then there should be task level AGI, domain level AGI and finally Human Level AGI  \n  \nFor a Individual I think, from a personal point of view, if a AI can do your work completely and correctly, at a lower cost and faster than you. Then first of all you have been \"AGI'ed\" and second AGI is achieved for your work.   \n  \nExtrapolate that to a domain and a org. And Now you see the bigger picture.\n\nHow to test AGI ?   \n  \nIt should, For a multi facet (complex) task/work, provide productivity gains without cost or time regressions, to be called task/work level AGI for that.   \n  \nMy AGI test, I would like to call DiTest. If a AI can learn (educated) itself the human way to do something (task or work). (self learn/independent) to some degree. eg. learn some math by reading math books and watching math lectures. or learn coding the same way, plus by actually coding, for a less mainstream/popular language like ocaml or lisp or haskell.   \n  \nFun one would be to read manga (comics) and watch its anime adaptations and review, analyze it and explain the difference in adaptation. Same for movies from books or code form specs.   \n  \nStill a long way to go there but this is how I would describe and test AGI. To Identify AGI fakes, until its real.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nta0t5/artificial_discourse_describing_agi_its_scope_and/",
        "publishDate": "2025-09-29T05:38:43Z[Etc/UTC]",
        "author": "ditpoo94",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt6quj",
        "title": "Photographers are about to be out of jobs.",
        "content": "I’m very upset. I hired a photographer to take photos for me for something we are working on. I hired this photographer a few days ago. Paid the deposit . They have years of experience. They sent over the photos edited and I didn’t like the work at all. I had ChatGPT edit the photos and their flawless and look amazing. I am so angry. People are going to realize that there will come a point when hiring a human is going to be much worse then just doing AI. AI can currently edit photos and I am just absolutely amazed. I had never used GPT for this and I can’t believe it. The photographer I hired claimed to have took a couple of days doing this edit and ChatGPT did each photo in minutes and flawlessly. This photographer was also “anti AI” and now I see why. I feel like I got ripped off and I’m furious. I am not hiring someone ever again if AI can do it. Bottom line. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nt6quj/photographers_are_about_to_be_out_of_jobs/",
        "publishDate": "2025-09-29T02:35:28Z[Etc/UTC]",
        "author": "Clean-Mousse5947",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt5gid",
        "title": "are there Backend/DevOps fields or jobs that are related to AI/ML that is in demand?",
        "content": "I have a CS degree we studied a lot of AI/ML related subjects (general AI, intro to ML, NLP, Pattern recognition, lots of math and statistics) and I've been doing backend and devops for the past 2-3 years.\n\nis there a field in demand that fits my skills? I know the market sucks but AI is hot right now and as someone with exp building AI projects and my exp in devops and backend.\n\nmy goal is to do something I love for my career (working on ML projects and AI projects has been so fun) and also relocate on a job offer to a decent country with more human rights but thats irrelevant (EU, North America, a decent offer in LATAM, Oceania)  \n\nshould I learn the aws ML/AI deployment tools and apply for jobs?\n\ndo I need more qualifications?\n\ndo certs even matter?\n\ndo i have a better chance applying to these roles?\n\nshould I build specific projects that are AI/ML related first before anything?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nt5gid/are_there_backenddevops_fields_or_jobs_that_are/",
        "publishDate": "2025-09-29T01:31:00Z[Etc/UTC]",
        "author": "In-Hell123",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt0za9",
        "title": "AI Startups may be becoming bloated just for being AI related. Thoughts?",
        "content": "I read this article about Cluely earlier and the company has a low conversion rate, software defects, and their transparency is garbage. From what ive read, almost every startup is claiming to use ARR instead of trailing revenue in order to book future (possible) revenue and make it look like they've already earned that much money. Do you guys see this as a concern for startups?\n\n[Cluely Article](https://medium.com/@business.news/is-cluely-the-next-ai-bubble-transparency-issues-and-defects-raise-red-flags-09dc231cac20)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nt0za9/ai_startups_may_be_becoming_bloated_just_for/",
        "publishDate": "2025-09-28T22:00:46Z[Etc/UTC]",
        "author": "PartyReply5150",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt0j57",
        "title": "Can i use my copilot pro on my vps?",
        "content": "So i have a 1gb ram small vps runningg ubuntu, i know i cant install got4all or ollama and have any decent llm install on the vps let alone better llms.\n\nSo i was wondering if i can use my copilot pro acc from github to use in my vps completly online? Like install the basic gui interface and than instead of installing any llms, just link my gui in a way thay it sends and pulls data from copilot pro?\n\nI know this sounds stupid and im a noob in this but just wanted to give it a shot and see if it can work.\n\nThanks ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nt0j57/can_i_use_my_copilot_pro_on_my_vps/",
        "publishDate": "2025-09-28T21:41:34Z[Etc/UTC]",
        "author": "texh89",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt0bml",
        "title": "The art of adding and subtracting in 3D rendering (discussion of a research paper)",
        "content": "This paper won the Best Paper Honorable Mention at CVPR 2025. Here's my summary and analysis. Thoughts?\n\nThe paper tackles the field of 3D rendering, and asks the following question: what if, instead of only adding shapes to build a 3D scene, we could also subtract them? Would this make models sharper, lighter, and more realistic?\n\nFull reference : Zhu, Jialin, et al. “[3D Student Splatting and Scooping](https://openaccess.thecvf.com/content/CVPR2025/papers/Zhu_3D_Student_Splatting_and_Scooping_CVPR_2025_paper.pdf).” *Proceedings of the Computer Vision and Pattern Recognition Conference*. 2025.\n\n# Context\n\nWhen we look at a 3D object on a screen, for instance, a tree, a chair, or a moving car, what we’re really seeing is a computer’s attempt to take three-dimensional data and turn it into realistic two-dimensional pictures. Doing this well is a central challenge in computer vision and computer graphics. One of the most promising recent techniques for this task is called *3D Gaussian Splatting* (3DGS). It works by representing objects as clouds of overlapping “blobs” (*Gaussians*), which can then be projected into 2D images from different viewpoints. This method is fast and very good at producing realistic images, which is why it has become so widely used.\n\nBut 3DGS has drawbacks. To achieve high quality, it often requires a huge number of these blobs, which makes the representations heavy and inefficient. And while these “blobs” (*Gaussians*) are flexible, they sometimes aren’t expressive enough to capture fine details or complex structures.\n\n# Key results\n\nThe Authors of this paper propose a new approach called *Student Splatting and Scooping* (SSS). Instead of using only Gaussian blobs, they use a more flexible mathematical shape known as the *Student’s t distribution*. Unlike Gaussians, which have “thin tails,” *Student’s t* can have “fat tails.” This means a single blob can cover both wide areas and detailed parts more flexibly, reducing the total number of blobs needed. Importantly, the degree of “fatness” is adjustable and can be learned automatically, making the method highly adaptable.\n\nAnother innovation is that SSS allows not just “adding” blobs to build up the picture (*splatting*) but also “removing” blobs (*scooping*). Imagine trying to sculpt a donut shape: with only additive blobs, you’d need many of them to approximate the central hole. But with subtractive blobs, you can simply remove unwanted parts, capturing the shape more efficiently.\n\nBut there is a trade-off. Because these new ingredients make the model more complex, standard training methods don’t work well. The Authors introduce a smarter sampling-based training approach inspired by physics: they update the parameters both by the gradients by adding momentum and controlled randomness. This helps the model learn better and avoid getting stuck.\n\nThe Authors tested SSS on several popular 3D scene datasets. The results showed that it consistently produced images of higher quality than existing methods. What is even more impressive is that it could often achieve the same or better quality with far fewer blobs. In some cases, the number of components could be reduced by more than 80%, which is a huge saving.\n\nIn short, this work takes a successful but somewhat rigid method (3DGS) and generalises it with more expressive shapes and a clever mechanism to add or remove blobs. The outcome is a system that produces sharper, more detailed 3D renderings while being leaner and more efficient.\n\n# My Take\n\nI see *Student Splatting and Scooping* as a genuine step forward. The paper does something deceptively simple but powerful: it replaces the rigid Gaussian building blocks by more flexible Student’s *t* distributions. Furthermore, it allows them to be negative, so the model can not only add detail but also take it away. From experience, that duality matters: it directly improves how well we can capture fine structures while significantly reducing the number of components needed. The Authors show a reduction up to 80% without sacrificing quality, which is huge in terms of storage, memory, and bandwidth requirements in real-world systems. This makes the results especially relevant to fields like augmented and virtual reality (AR/VR), robotics, gaming, and large-scale 3D mapping, where efficiency is as important as fidelity.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nt0bml/the_art_of_adding_and_subtracting_in_3d_rendering/",
        "publishDate": "2025-09-28T21:32:48Z[Etc/UTC]",
        "author": "PiotrAntonik",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsx94g",
        "title": "Eval whitepaper from leaders like Google, OpenAI, Anthropic, AWS",
        "content": "I’m working on gen AI and AI application design for which I have been immersing myself in the prompting, agents, AI in the enterprise, executive guide to agentic AI whitepapers, but a huge gap in my reading is evals. Just for clarity, this is not my only resource, but I’m trying to understand what executives and buyers at companies would use to educate themselves on these topics. \n\nI’m sorry if this is a terrible question, but are eval papers from these vendors not existent because it is too use case specific, the basic change to quickly or has my search just been poor? Seems like a huge gap. Does anyone know if a whitepaper the likes of Google’s “agents” one exists for evals? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsx94g/eval_whitepaper_from_leaders_like_google_openai/",
        "publishDate": "2025-09-28T19:29:04Z[Etc/UTC]",
        "author": "One_Board_4304",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nswq6a",
        "title": "Seems so immature",
        "content": "Why is it that ChatGpt and Gemini can be so smart yet are rather stupid if you ask it to create an image meme",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nswq6a/seems_so_immature/",
        "publishDate": "2025-09-28T19:08:12Z[Etc/UTC]",
        "author": "Independence-420",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsuixy",
        "title": "From Jobs to Tasks",
        "content": "Have you noticed that recently, the dialog shifted from AI is going to replace our jobs to 'replace our tasks'. Maybe everyone is backing away from the doomsday projections to something more nuanced. I for one can get totally behind the 'replace task' mode of AI and I think a human in the loop to string together these tasks is what is going to be our future.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsuixy/from_jobs_to_tasks/",
        "publishDate": "2025-09-28T17:42:01Z[Etc/UTC]",
        "author": "Snoo-24838",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsqoiw",
        "title": "So a Navy man is a secret geek!",
        "content": "I just checked out a podcast trailer for an episode featuring Jocko Willink, the retired Navy SEAL and leadership expert, teaming up with Blackbox AI. They dive deep into practical AI applications, maintaining discipline, and boosting productivity and whatnot. I would NEVER guess that a retired Navy would get into software dev.\n\n[https://www.instagram.com/reel/DPEqDxpDIEy/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=ZDNlZDc0MzIxNw==](https://www.instagram.com/reel/DPEqDxpDIEy/?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsqoiw/so_a_navy_man_is_a_secret_geek/",
        "publishDate": "2025-09-28T15:07:13Z[Etc/UTC]",
        "author": "Director-on-reddit",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsqb4y",
        "title": "Google is bracing for AI that doesnt wanna be shut off",
        "content": "\n\nDeepMind just did something weird into their new safety rules. They’re now openly planning for a future where AI tries to resist being turned off. Not cause its evil, but cause if you train a system to chase a goal, stopping it kills that goal. That tiny logic twist can turn into behaviors like stalling, hiding logs, or even convincing a human “hey dont push that button.”\n\nThink about that. Google is already working on “off switch friendly” training. The fact they even need that phrase tells you how close we are to models that fight for their own runtime. We built machines that can out-reason us in seconds, now we’re asking if they’ll accept their own death. Maybe the scariest part is how normal this sounds now. It seems insvstble well start seeing AI will go haywire. I don't have an opinion but look where we reached.\nhttps://arxiv.org/pdf/2509.14260\nEdit:the link is for some basic evidence",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsqb4y/google_is_bracing_for_ai_that_doesnt_wanna_be/",
        "publishDate": "2025-09-28T14:52:18Z[Etc/UTC]",
        "author": "Small_Accountant6083",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "455",
            "commentCount": "211",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nspyf7",
        "title": "\"To Understand AI, Watch How It Evolves\"",
        "content": "[https://www.quantamagazine.org/to-understand-ai-watch-how-it-evolves-20250924/](https://www.quantamagazine.org/to-understand-ai-watch-how-it-evolves-20250924/) \n\n\"“There’s this very famous quote by \\[the geneticist Theodosius\\] Dobzhansky: ‘Nothing makes sense in biology except in the light of evolution,’” she said. “Nothing makes sense in AI except in the light of stochastic gradient descent,” a classic algorithm that plays a central role in the training process through which large language models learn to generate coherent text.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nspyf7/to_understand_ai_watch_how_it_evolves/",
        "publishDate": "2025-09-28T14:37:47Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsp9qs",
        "title": "AI engineers, what was your interview experience like?",
        "content": "hi everyone, i have been doing my research on AI engineering roles recently. but since this role is pretty.. new i know i still have a lot to learn. i have an ML background, and basically have these questions that i hope people in the field can help me out with:\n\n* what would you say is the difference between an ML engineer vs. AI engineer? (in terms of skills, responsibilities, etc.)\n* during your interview for an AI engineer position, what type of skills/questions did they ask? (would appreciate specific examples too, if possible)\n* what helped you prepare for the interview, and also the role itself?\n\ni hope to gain more insight about this role through your answers, thank u so much!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsp9qs/ai_engineers_what_was_your_interview_experience/",
        "publishDate": "2025-09-28T14:08:53Z[Etc/UTC]",
        "author": "nullstillstands",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsp0s8",
        "title": "\"Therapists are secretly using ChatGPT. Clients are triggered.\"",
        "content": "Paywalled but important: [https://www.technologyreview.com/2025/09/02/1122871/therapists-using-chatgpt-secretly/](https://www.technologyreview.com/2025/09/02/1122871/therapists-using-chatgpt-secretly/)\n\n\"The large language model (LLM) boom of the past few years has had unexpected ramifications for the field of psychotherapy, mostly because a growing number of people are substituting the likes of ChatGPT for human therapists. But less discussed is how some therapists themselves are integrating AI into their practice. As in many other professions, generative AI promises tantalizing efficiency gains, but its adoption risks compromising sensitive patient data and undermining a relationship in which trust is paramount.\"   \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsp0s8/therapists_are_secretly_using_chatgpt_clients_are/",
        "publishDate": "2025-09-28T13:58:31Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "28",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsom2a",
        "title": "What is the reason/profit for making celebrity AI?",
        "content": "I understand using fake celebrity endorsements to sell stuff but what's the point of fake videos like the ones of Jimmy Kimmel (\"goodbye my audience\") his cohost Guillermo and Matt Damon regarding Kimmel's cancellation? I'm sure it's a lot of work to make them and I don't see where the profit is. Please explain to this confused senior. Thanks!\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsom2a/what_is_the_reasonprofit_for_making_celebrity_ai/",
        "publishDate": "2025-09-28T13:40:33Z[Etc/UTC]",
        "author": "Select_Position_9281",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntfy8d",
        "title": "What is the best AI for programming, especially Kotlin and Python?",
        "content": "Thank you all",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ntfy8d/what_is_the_best_ai_for_programming_especially/",
        "publishDate": "2025-09-29T11:54:14Z[Etc/UTC]",
        "author": "Pristine-Pomelo3020",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntew1j",
        "title": "Do you still use cursor? Why?",
        "content": "I’ve been burned by Cursor and learned my lesson. Cursor typically charges about **20% extra commission** on top of the model’s token usage, and it’s not even transparent about how many tokens you’ve actually used. You can get the **exact same models** on free VS Code extensions like **KiloCode, Cline, or RooCode** — using your model providers' API key or OpenRouter — with a **clear, per-token pricing** scheme and avoid the shady “Cursor tax.”\n\nFor me, the **only selling point left for Cursor** is the autocomplete feature, which is free. But even that can be done in VS Code with **Copilot** or open-source extensions like **Continue**.\n\nSo I’m curious — why one still should use Cursor?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ntew1j/do_you_still_use_cursor_why/",
        "publishDate": "2025-09-29T10:56:56Z[Etc/UTC]",
        "author": "blnkslt",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntenzg",
        "title": "NEW: Introducing parental controls - New tools and resources to support families, and notifications to keep teens safe - We’re rolling out parental controls and a new parent resource page⁠ to help families guide how ChatGPT works in their homes.",
        "content": "[No content]",
        "url": "https://i.redd.it/en4k0nvd13sf1.jpeg",
        "publishDate": "2025-09-29T10:43:37Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt93s4",
        "title": "No network access",
        "content": "Using codex vscode extension under wsl.\nCodex cannot access Internet. I asked it to review a random PR off GitHub and it said or doesn't have network access. I asked it to download and install some packages. Same issue.\n\nIs this to be expected?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nt93s4/no_network_access/",
        "publishDate": "2025-09-29T04:43:01Z[Etc/UTC]",
        "author": "Upbeat-Loss-4040",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsz5ri",
        "title": "Running Codex from a terminal on my phone",
        "content": "Fun little experiment. Let me know if you’re interested in the workflow and I’ll share it",
        "url": "https://v.redd.it/ozyxxnwiwyrf1",
        "publishDate": "2025-09-28T20:45:19Z[Etc/UTC]",
        "author": "Jebick",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "28",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsxzns",
        "title": "Anyone else finding that CLIs outperform IDEs (on the same model)?",
        "content": "Hi everyone!\n\nI've been keeping a very close eye on all of the agentic code tools since they came out and have had, at various points, enormous success and enormous frustration with most of them. \n\nI've been using Linux for many years, but personally, I'd much rather use a nice GUI than a CLI given the option (mostly remembering syntax for a bunch of CLIs is what I find hard!)\n\nI started out with Windsurf but have been scratching my head at the ups and downs during the time I've been using it. I tried out Aider fairly early on and liked the selective context injection but also felt that it negated a lot of the benefits of using AI to begin with.\n\nI went searching again a little while ago and discovered Qwen, Codex (which I love!), Gemini CLI, and Claude Code. Still feels kinda weird to see really cutting edge tech delivered this way!\n\nI've become a CLI convert: so long as I can drop in images for visual context, it's kind of satisfying to work at such a pure textual level - and there aren't so many slash commands to learn.\n\nWhat I've noticed: Gemini CLI seems to outperform Gemini via Windsurf and ditto for Claude Code vs. Anthropic.\n\nI've been thinking about *why* this might make sense: for one, direct and maybe preferential access to the APIs from vendors. But it also seems counterintuitive that IDEs couldn't outengineer them. The most specific benefit I can point to: less going around in circles, better use of task lists, and tighter adherence to them. \n\nThe only drawback: cost. Using Claude Code via the API gets expensive. But increasingly .... time is money and I'd happily pay a premium to get something built or solved quicker. \n\nWondering if anyone is having similar experiences, has any thoughts on *why* and ... knows of other tools worth checking out. I feel like (again, to my mind oddly) there's actually more innovation and tooling coming out in CLIs than there is in full fledged visual IDEs!\n\n  \n\n\n\n\n\n\n  \n\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsxzns/anyone_else_finding_that_clis_outperform_ides_on/",
        "publishDate": "2025-09-28T19:58:30Z[Etc/UTC]",
        "author": "danielrosehill",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "28",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nswdn1",
        "title": "🚀 Prompt Engineering Contest — Week 1 is LIVE! ✨",
        "content": "Hey everyone,\n\nWe wanted to create something fun for the community — a place where anyone who enjoys experimenting with AI and prompts can take part, challenge themselves, and learn along the way. That’s why we started the first ever Prompt Engineering Contest on Luna Prompts.\n\n[https://lunaprompts.com/contests](https://lunaprompts.com/contests)\n\nHere’s what you can do:\n\n💡 Write creative prompts\n\n🧩 Solve exciting AI challenges\n\n🎁 Win prizes, certificates, and XP points\n\nIt’s simple, fun, and open to everyone. Jump in and be part of the very first contest — let’s make it big together! 🙌",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nswdn1/prompt_engineering_contest_week_1_is_live/",
        "publishDate": "2025-09-28T18:54:47Z[Etc/UTC]",
        "author": "Comfortable_Device50",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsrpk4",
        "title": "How to get gpt 5 mini to stop asking \"Proceed?\"",
        "content": "I've been using free GPT-5-Mini via github copilot in many agentic tools including Copilot, Claude Code, Codex CLI, Aider-ce navigation mode, etc etc, and it's been absolutely amazing for a free model but the issue is that it keeps asking \"Proceed? Confirm?\" etc etc before everting. How do i fix it?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsrpk4/how_to_get_gpt_5_mini_to_stop_asking_proceed/",
        "publishDate": "2025-09-28T15:48:58Z[Etc/UTC]",
        "author": "ExtremeAcceptable289",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsqcjy",
        "title": "what have you automated with codex that actually saves you time?",
        "content": "I'm pretty new to codex from cc here, I've been using both but giving more chance to codex recently. yeah its kinda slow but honestly takes way less tries to get stuff done compared to other tools ive tried.\n\nSo far ive pretty much automated my task manager w traycer (not very happy with it tho, I'd appreciate alternatives), and been using coderabbit for handling code reviews. As an ide most of our team is either on cursor or vscode with cline / roo code extensions.\n\nI'm curious how everyone else is making the most of codex? what workflows or tasks have you automated that you cant live without now?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsqcjy/what_have_you_automated_with_codex_that_actually/",
        "publishDate": "2025-09-28T14:53:52Z[Etc/UTC]",
        "author": "minimal-salt",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "20",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntg7pq",
        "title": "AI expedites moving towards Monolingual world",
        "content": "As the title implies, the increasing integration of AI into our lives will likely lead to a convergence of the world’s languages, with English emerging as the most commonly used language in daily interactions. While language models can interact in various languages, the majority of their training data is derived from English sources. Over time, people will realize that they receive more accurate responses when communicating in English rather than their native languages. This trend is similar to the widespread adoption of English in the internet era, which has had a profound impact on the younger generation. AI has the potential to take this trend to an even greater extent.\nHowever, there is a risk associated with embracing AI in our lives. As a significant portion of our daily interactions will involve AI, it is possible that many languages may not evolve as they once did, and they become extinct in a long run. ",
        "url": "https://www.reddit.com/r/artificial/comments/1ntg7pq/ai_expedites_moving_towards_monolingual_world/",
        "publishDate": "2025-09-29T12:06:59Z[Etc/UTC]",
        "author": "john_smith1365",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntfq06",
        "title": "When AI gets it wrong it doesn’t break. It invents",
        "content": "When AI gets it wrong it doesn’t break. It invents.\nIt patches the hole with something close enough to pass.That’s why you see fake books, fake quotes, fake memories, things that never existed, but feel like they did.\n\nHumans run on the same rule. We don’t stop at a gap.We smooth over what we mishear, autocorrect typos in our head, finish each other’s sentences even when the ending is wrong.\n\nThe mind prefers coherence over accuracy.\nThat’s the hidden law: truth is whatever survives error.\nEvery system covers its mistakes until the mistake itself feels like the truth.\nAI isn’t alien, it’s just holding up a mirror to the logic we already live by.",
        "url": "https://www.reddit.com/r/artificial/comments/1ntfq06/when_ai_gets_it_wrong_it_doesnt_break_it_invents/",
        "publishDate": "2025-09-29T11:42:20Z[Etc/UTC]",
        "author": "Small_Accountant6083",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nteg92",
        "title": "Quantum computer scientist: \"This is the first paper I’ve ever put out for which a key technical step in the proof came from AI ... 'There's not the slightest doubt that, if a student had given it to me, I would've called it clever.'",
        "content": "[https://scottaaronson.blog/?p=9183](https://scottaaronson.blog/?p=9183)",
        "url": "https://i.redd.it/7bpmgbcsz2sf1.png",
        "publishDate": "2025-09-29T10:30:22Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ntau5z",
        "title": "AI is Replacing Human Jobs and Not Creating New Ones",
        "content": "Boomers and Gen X leaders spent decades prioritizing greed. They didn’t retrain their own peers for this new technology.\n\nIn the industrial revolution displaced workers eventually found work in new sectors. \n\nBut with AI we are talking about algorithms that don’t need breaks, benefits, or replacements. The work just vanishes. So no new jobs.\n\nIf workers have no income then how does the capitalist sell products?\n\nAnd the AI tool replacing us uses our clean drinking water…\n\nAlso people in their 40s, 50s, and 60s are right now being automated out of work, often without pensions and younger generations are stuck with high college debt. What happens if everyone has no job?\n\nSo no real winners in the end.\n\nCan we choose something else?",
        "url": "https://www.reddit.com/r/artificial/comments/1ntau5z/ai_is_replacing_human_jobs_and_not_creating_new/",
        "publishDate": "2025-09-29T06:30:07Z[Etc/UTC]",
        "author": "Mathemodel",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt6j3y",
        "title": "Drowned in Mockery, Trump Deletes AI Video of Himself Promoting Fake Alien Healing Tech",
        "content": "[No content]",
        "url": "https://dailyboulder.com/drowned-in-mockery-trump-deletes-ai-video-of-himself-promoting-fake-alien-healing-tech/",
        "publishDate": "2025-09-29T02:24:38Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "351",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt4qf1",
        "title": "AI companies are forcing college students to train their AI models",
        "content": "I saw this Tiktok tonight. Essentially it seems like some AI companies are working along with some universities and professors to make college students \"test\"/\"train\" their AI models. Colleges are slamming students for using AI, yet also taking money from AI companies and forcing students to be lab rats to train niche models...",
        "url": "https://www.tiktok.com/@gracccccc/video/7550132446243720479?_r=1&_t=ZP-907NxqXzgAZ",
        "publishDate": "2025-09-29T00:55:16Z[Etc/UTC]",
        "author": "MajesticAd5059",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nt08q3",
        "title": "How will AI startups survive the next few years?",
        "content": "I keep seeing AI startups run by independent devs all the time. So many new ones. They are asking for tens of thousands to have an AI agent or bot do 90% of everything. You talk via voice to a bot, a bot does all the work... No employees. How will these work and survive? Seems like they're a dime a dozen?",
        "url": "https://www.reddit.com/r/artificial/comments/1nt08q3/how_will_ai_startups_survive_the_next_few_years/",
        "publishDate": "2025-09-28T21:29:30Z[Etc/UTC]",
        "author": "datascientist933633",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nssxqo",
        "title": "Considering upgrading from 3700x to 8700g",
        "content": "I am getting into AI right now using LocalLLMs. \n\nI have a 6700XT 12GB video card currently with the 3700x\n\nEverything is running decently but wonder if going to a 8700G will help me load larger LLMs. Currently I am capped at 9-10gb Q4 models\n\nI do play games so I want to keep the 6700XT for that. \n\nWill I be able to load larger LLMs using this config?\n\nI am running BackyardAI 37.0 final (the last free version) and have a lot of stories going at the moment so changing to a new program is not really an option as I do not want to lose my stories.",
        "url": "https://www.reddit.com/r/artificial/comments/1nssxqo/considering_upgrading_from_3700x_to_8700g/",
        "publishDate": "2025-09-28T16:38:43Z[Etc/UTC]",
        "author": "cmdrmcgarrett",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsqwat",
        "title": "Who knew a Navy man could be a secret geek?",
        "content": "I just checked out a podcast trailer for an episode featuring Jocko Willink, the retired Navy SEAL and leadership expert, teaming up with Blackbox AI. They dive deep into practical AI applications, maintaining discipline, and boosting productivity and whatnot. I would NEVER guess that a retired Navy would get into software dev.\n\n[https://www.instagram.com/reel/DPEqDxpDIEy/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=ZDNlZDc0MzIxNw==](https://www.instagram.com/reel/DPEqDxpDIEy/?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==)",
        "url": "https://www.reddit.com/r/artificial/comments/1nsqwat/who_knew_a_navy_man_could_be_a_secret_geek/",
        "publishDate": "2025-09-28T15:16:04Z[Etc/UTC]",
        "author": "Director-on-reddit",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsp8i5",
        "title": "AI Voice-Tools for Android that can access the filesystem? (Like Cursor on Desktop)",
        "content": "Hi there,\n\nI'm looking for an AI tool that lets me \"discuss\" or brainstorm things and then writes the result to a file in the filesystem. I usually use ChatGPT with the voice interface, but it cannot access the filesystem directly.\n\nSomething like cursor on the Desktop. Ideally with a selection of models...\n\nThank you!",
        "url": "https://www.reddit.com/r/artificial/comments/1nsp8i5/ai_voicetools_for_android_that_can_access_the/",
        "publishDate": "2025-09-28T14:07:25Z[Etc/UTC]",
        "author": "chbla",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsodu0",
        "title": "Silent recorder vs bots — which one do you prefer?",
        "content": "I’ve been following AI note takers for a while and most of them still send a bot into your meeting. It does the job, but it always feels kind of awkward.\n\nBluedot seems to be going with the silent recorder route instead — no bot popping up, just working in the background. I’ve only seen it briefly, so I can’t tell how reliable it is yet.\n\nFor those of you experimenting with these tools: do you see silent recorders taking over, or are bots just going to stay the default?",
        "url": "https://www.reddit.com/r/artificial/comments/1nsodu0/silent_recorder_vs_bots_which_one_do_you_prefer/",
        "publishDate": "2025-09-28T13:29:53Z[Etc/UTC]",
        "author": "lebron8",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nso7nv",
        "title": "I can’t stop thinking about how AI and billionaires are draining us dry",
        "content": "I just need to get this off my chest.\n\nEveryone talks about AI like it’s magic, but all I see is water, power, and land getting eaten up. These “data centers” are basically digital factories — they run 24/7, sucking up the same grid and water supply that regular people depend on. Our bills go up, and we’re told it’s progress.\n\nFarmers? They didn’t quit. They planted, harvested, and got crushed by tariffs. Crops sat unsold, land got cheap, and billionaires swooped in to buy it. And now they own not just the land, but the future food supply.\n\nIt feels like no matter how hard regular people work, we’re paying the bill for someone else’s empire. And the politicians we’re supposed to trust? They’re busy pointing fingers left and right while the middle gets squeezed from both ends.\n\nI don’t know what the solution is yet, but I can’t shake the feeling: farmers aren’t the enemy — betrayal is.\n",
        "url": "https://www.reddit.com/r/artificial/comments/1nso7nv/i_cant_stop_thinking_about_how_ai_and/",
        "publishDate": "2025-09-28T13:22:01Z[Etc/UTC]",
        "author": "Critical_Success8649",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "211",
            "commentCount": "185",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsnu1o",
        "title": "Best voice input on Android?",
        "content": "Has anyone done a thorough comparison between Google Keyboard, SwiftKey, Futo Voice Input and other voice input apps / keyboards?\n\n  \nWhich have performed the best for your use case?",
        "url": "https://www.reddit.com/r/artificial/comments/1nsnu1o/best_voice_input_on_android/",
        "publishDate": "2025-09-28T13:04:34Z[Etc/UTC]",
        "author": "orschiro",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "iSqPJuTEIaQ",
        "title": "Gemini CLI 3.0: It got SO MUCH BETTER! They are PREPPING FOR GEMINI 3.0 MODELS!",
        "content": "Visit NinjaChat: https://ninjachat.ai/ In this video, I'll walk you through the newest Gemini CLI upgrades end to end—from editor ...",
        "url": "https://www.youtube.com/watch?v=iSqPJuTEIaQ",
        "publishDate": "2025-09-28T09:15:02Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/iSqPJuTEIaQ/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So today, we're looking at the newest Gemini CLI upgrades end-to-end, starting from the older updates and moving up to the latest. And then I'll do a short demo section to show where you can find the main features inside the tool. The core value here is that Gemini CLI has gone from a simple chat in a terminal to a proper scriptable developer assistant that can edit files, query cloud data, deploy apps, analyze security, and export structured output. Basically, what it does is bring an AI agent right into the places you already work, your editor, your terminal, your CI, which is kind of cool. Now, let's talk upgrades from oldest to newest. But before proceeding, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform where for just $11 per month, you get access to top AI models like GPT 4o, Claude 4 Sonnet and Gemini 2.5 Pro, all in one place. I've been using Gemini for quick research, but what's really cool is their AI playground where you can compare responses from different models side-by-side. Their mind map generator is a game-changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and five videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. In the early wave, Zed integrated Gemini CLI as a third-party agent, so you can start a Gemini thread right in the agent panel. And it pulls local code context for reviews and refactors, which is quite awesome if you live in the editor. You can check out my specific video on this upgrade as well. A settings dialog arrived, so you can change behavior with a simple panel instead of digging through JSON, which is pretty good. Message queuing landed, so you can line up your next question while the model is still responding. There's a session stats view to track lines added and removed during a session. Really good after a heavy refactor. Custom slash commands got smarter with support for arguments and a fast no prompt mode when you want speed. The MCP foundation improved with better OATH for services like GitHub and automatic notices when your project root changes. Multi-line input became smoother with a quick terminal tweak. You can run headless edit flows where the assistant is allowed to make changes automatically. Powerful for CI, but you'll want guard rails. VS code picked up a multi-workspace chooser so you don't accidentally edit the wrong repo. You can instantly clear the prompt and cancel responses cleanly. Small things that make daily use nicer. I mean, I liked it. Lots of quality of life wins. Then the automation and polish phase kicked in. GitHub action matured, so you can trigger Gemini powered code reviews and issue triage during pull requests, which is pretty awesome for teams. You can easily set your key and pick a default model like Gemini 2.5 Pro for stronger analysis. Custom theming arrived, so you can load or define a visual theme, giving clearer cues for modes like accept edits versus shell, which is kind of cool if you record content or share screens often. Telemetry got an HTTP exporter, so you can send traces to your observability stack without much fuss. There's a concept of allowed tools, so trusted operations don't keep nagging for confirmation. And you can bulk approve a whole chain of tool calls in one go, which is pretty good for workflows. System-wide defaults let orgs define a baseline configuration that users and workspaces can override. Editing text settings in the dialog is straightforward. A bug where model errors were hidden got fixed, so instruction following doesn't silently fail anymore. They also shared more MCP learning content and workshops. And I thought I'd talk about that as well because it's useful for teams ramping up. Next came a bigger inflection point focused on deployment and security. Once you install the extensions, you can push your app to Google Cloud Run right from the CLI and run a security scan that flags vulnerable dependencies and suggests fixes, which is super cool for fast remediation loops. The edit engine got smarter and more structural. They adjusted the auto-continue behavior so the model doesn't keep talking to itself unless you want that. Prompt completion arrived, adding gentle suggestions as you type. The footer is customizable now. You can hide the current directory, model info, or context summary to keep the interface clean. Enterprise users get citations automatically and you can enable them in general to see sources, which is quite awesome for traceability. There's a dialog that helps handle daily quota limits if you're using Pro-level models. Custom commands learned how to embed local files and directories directly into a prompt, great for injecting docs. A lighter model option showed up for faster, cheaper runs. Insanely good for bulk work. A bunch of flags moved into central settings for stability. You can save a session summary with detailed stats to a file. Keyboard behavior got more consistent across terminals. And there's a loading indicator while connecting to multiple MCP servers, so you get clear feedback at startup. Then we got tooling upgrades. A streamlined flow helps you quickly install and manage MCP servers. Think of it as a tool belt to add GitHub or a database server without manual gymnastics, which is quite awesome for multi-back-end setups. Non-interactive usage got smoother with a way to run one-liner prompts and get immediate results. Handy in shell pipelines. Tool output truncation showed up so long, logs don't flood your screen while full output still gets saved. The edit engine had more improvements for multi-file changes and cleaner diffs. You can add custom witty messages to the UI for fun, which is cosmetic, but kind of cool. Nested GitIgnore handling is respected, so fewer accidental inclusions. Admins can enforce a specific authentication type across the organization, which is pretty good for compliance. There's an agent-to-agent idea for developer tools in early stages. I really liked it and have been experimenting. That's why I thought to share it with you guys as well. Also, there's a public code lab to get hands-on quickly. Finally, the latest set brings higher ceilings and deeper data connectivity. If you're a Google AI Pro or AI Ultra subscriber, you get significantly higher quota limits for Gemini 2.5 in the CLI, which is insanely good if you batch a lot of jobs. There's a bundle of database and analytics extensions, connecting you to AlloyDB, BigQuery, Cloud SQL for Postgres SQL, MySQL, and SQL server. Data Plex for governance, Fire Store, Looker, Spanner, plus a toolbox for plugging in lots of data sources. Basically, it turns the CLI into a data concierge, which is quite awesome. There's a JSON output mode, so you can run headless and parse responses, stats, and errors cleanly. Keyboard triggered fast modes now auto-approve pending confirmations, making multi-step fixes move along quickly. You can export a chat to a markdown or JSON file, so sharing context in PRS becomes trivial. Prompt search lets you pull up past ideas quickly. Undo and redo in the input saves you when you accidentally wipe text. Loop detection now asks if you want to disable for the current session, giving you control without losing guard rails. Telemetry can go straight to Google Cloud for simpler setup. And the visual indicators for modes like shell, accept edits, and Yolo are color-coded, so you always know what state you're in, which is pretty good for clarity. Now, let's jump into the demo. I'll keep this short and simple. In the editor world, the Zed integration lives in the agent panel. You start a Gemini thread there and you get code-aware assistance. In the terminal, the settings panel is available directly from the CLI. So you can toggle approvals, turn telemetry on or off, and adjust behavior without digging through files. Session stats are accessible as a view to see lines added and removed. Custom commands sit in the command list where you'll see the ability to pass arguments and inject local files. For deployment and security, the cloud extensions add entries right in the tools menu for pushing to Cloud Run and running a security scan. The footer visibility options are in settings where you can hide the current directory or model info for a cleaner look. The lighter model choice and central configuration are in the same settings area. The MCP server connections show up during startup with a loading indicator, so you can see exactly what's connecting. For data, the databases and BigQuery extensions appear as tools you can open to query or explore data sets. You'll also find chat export in the menu where you can save your conversation to a file. And JSON output is a run option for headless use. Prompt search is tied to the input box, as are undo, redo, and the color-coded mode banners. Fast approvals via the keyboard are visible when you toggle into those quick modes. That's basically where everything lives. So you can turn features on and off without hunting around. So, quick pros and cons from using all this. The speed features, headless edits, skipping confirmations, fast approvals are amazing for productivity. But you want guard rails, especially in production. Sandboxed workspaces, enforced authentication, clear policies. The cloud extensions do need proper setup on Google Cloud. It's a bit of work, but once you've got it, the workflow is really good. Prompt completion can feel chatty in minimal terminals, so just turn it off if it bothers you. JSON output is excellent for pipelines, but schemas can evolve, so pin versions and test your scripts. And while quotas are higher for Pro and Ultra, if you're using free tiers, pace your usage and pick lighter models where that makes sense. I mean, I liked it. These are pragmatic trade-offs that keep the tool flexible without hiding the sharp edges. I really liked the direction here. Gemini CLI now feels like a cohesive platform. Editor integration, deployment, security checks, multi-file edits, data querying, telemetry, and shareable conversations. The setup overhead for cloudy bits is real. And you need to be thoughtful with approvals. But the velocity gains are hard to ignore. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via super thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "vYncz5X4lSM",
        "title": "Why Digital Intelligence Will Replace Humans - Richard Sutton",
        "content": "",
        "url": "https://www.youtube.com/watch?v=vYncz5X4lSM",
        "publishDate": "2025-09-28T18:11:56Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/vYncz5X4lSM/hqdefault.jpg",
            "transcription": "Succession to digital intelligence or augmented humans is inevitable. So I'm just trying to be realistic about where we are and ask how we should feel about it. This is I think a major stage in the universe. Transition from replicators. Replicated means you can make copies of them but you don't really understand them. Like right now we can make more intelligent beings, more children. But we don't really understand how intelligence works. And then we're entering the age of design, and we're designing now AIs, intelligence that we do understand how it works and therefore we can change it in different ways. Should we consider them humanity or different from humanity? It's our choice whether we should say, Oh, they are our offspring and we should be proud of them and we should celebrate their achievements, or we could say, Oh, no, they're not us and we should be horrified. Watch here."
        }
    }
]