[
    {
        "id": "https://news.smol.ai/issues/25-07-08-smollm3/",
        "title": "SmolLM3: the SOTA 3B reasoning open source LLM",
        "content": "**HuggingFace** released **SmolLM3-3B**, a fully open-source small reasoning model with open pretraining code and data, marking a high point in open source models until **Olmo 3** arrives. **Grok 4** was launched with mixed reactions, while concerns about **Claude 4** nerfs and an imminent **Claude 4.1** surfaced. **Gemini Nano** is now shipping in **Chrome 137+**, enabling local LLM access for **3.7 billion** users. **Tencent** introduced **Hunyuan-A13B**, an 80B parameter model with a 256K context window running on a single **H200** GPU. The **Gemini API** added a batch mode with 50% discounts on **2.5 models**. **MatFormer Lab** launched tools for custom-sized **Gemma 3n** models. Open source OCR models like **Nanonets-OCR-s** and **ChatDOC/OCRFlux-3B** derived from **Qwen2.5-VL-3B** were highlighted, with licensing discussions involving **Alibaba**.",
        "url": "https://news.smol.ai/issues/25-07-08-smollm3/",
        "publishDate": "2025-07-08T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "huggingface, allenai, openai, anthropic, google-deepmind, mistral-ai, tencent, gemini, alibaba, smollm3-3b, olmo-3, grok-4, claude-4, claude-4.1, gemini-nano, hunyuan-a13b, gemini-2.5, gemma-3n, qwen2.5-vl-3b, elonmusk, mervenoyann, skirano, amandaaskell, clementdelangue, loubnabenallal1, awnihannun, swyx, artificialanlys, officiallogank, osanseviero, cognitivecompai, aravsrinivas, open-source, small-language-models, model-releases, model-performance, benchmarking, multimodality, context-windows, precision-fp8, api, batch-processing, model-scaling, model-architecture, licensing, ocr"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=208954",
        "title": "Realbotix Integrates Multiple Languages into AI",
        "content": "<p>Realbotix Corp. (TSX-V: XBOT) (Frankfurt: 76M0.F) (OTC: XBOTF) (“Realbotix” or the “Company”), a leader in AI-powered humanoid robotics, announces that its robot now communicates fluently in 15 major languages, with access to more than 147 additional languages and dialects through cloud-based support. This multilingual capability enhances Realbotix’s robots ability to...</p>\n<p>The post <a href=\"https://ai-techpark.com/realbotix-integrates-multiple-languages-into-ai/\">Realbotix Integrates Multiple Languages into AI</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/realbotix-integrates-multiple-languages-into-ai/",
        "publishDate": "2025-07-08T11:15:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai robotics, ai technology, Ai techpark Articles, ai-techpark articles, ai-techpark news, AItech news, Artificial Intelligence Updates, multilingual robot, Realbotix"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107054",
        "title": "Apple loses key AI leader to Meta",
        "content": "<p>Apple is nursing a fresh wound this week after losing one of its most crucial AI leaders to Meta. Ruoming Pang, the executive who oversaw Apple Intelligence, has jumped ship to join Meta&#8217;s new Superintelligence Labs. Pang wasn&#8217;t just any Apple employee. He led a 100-strong army of engineers crafting the language models that make [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/apple-loses-key-ai-leader-to-meta/\">Apple loses key AI leader to Meta</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/apple-loses-key-ai-leader-to-meta/",
        "publishDate": "2025-07-08T14:37:46Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Apple, Artificial Intelligence, Companies, Development, Enterprise, Meta (Facebook), ai, apple, apple intelligence, artificial intelligence, meta"
        }
    },
    {
        "id": "1lvgr9c",
        "title": "AI creating, telling and understanding a genuinely funny joke may signal the onset of true artificial general intelligence, and possibly AI consciousness, argues computer scientist, Roman Yampolskiy. What do people think about this? Great article as well!",
        "content": "[https://iai.tv/articles/the-first-great-joke-told-by-ai-might-be-the-last-one-humans-hear-auid-3251?\\_auid=2020](https://iai.tv/articles/the-first-great-joke-told-by-ai-might-be-the-last-one-humans-hear-auid-3251?_auid=2020)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvgr9c/ai_creating_telling_and_understanding_a_genuinely/",
        "publishDate": "2025-07-09T11:50:41Z[Etc/UTC]",
        "author": "whoamisri",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lve74p",
        "title": "Will AI decrease the quality of research?",
        "content": "Just a thought. I’m a first year comp engineering student. I’ve been into tech since I was a kid, and I’ve had the chance to work on some projects with professors. \nI’ve some friends getting the PhD, i see them and also almost all people of my course use chatgpt inconditionally, without double-checking anything. \n\nI used to participate in CTFs but now it’s almost all ai and tool-driven. Besides being annoying, I’m starting to feel concerned. People are starting to trust AI too much. I don’t know how it is in other universities, but I keep asking myself, how will the quality of future research will be if we can’t think?\n\n I mean, ai can see patterns, but can’t at all replace inventors and scientists, and first of all it is trained by human’s discoveries and informations, rielaborating them. An then, if many researches ‘get lazy’ (there’s a very recent paper showing the effects on brain), the AI itself will start being trained on lower-quality content. That would start a feedback loop\nbad human input->bad AI output -> worse human research -> even worse AI. \n\n\nWhat do you think?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lve74p/will_ai_decrease_the_quality_of_research/",
        "publishDate": "2025-07-09T09:16:48Z[Etc/UTC]",
        "author": "Strange-Dimension675",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lve17m",
        "title": "In an idealistic world, how would you like the future of AI to play out — Best Case Scenario",
        "content": "Often with new tech or anything new from the old, people complain. People moan about adapting until they're forced to then they accept. It's a cycle we're all familiar with.\n\nHypothetically speaking, in 10 years time, how would like to utilizing AI (or not) to live an optimal life.\n\nFor me, taking into consideration capitalism, billionaires etc. — AI can help set us free. In an idealistic scenario, I see us all working independently but cooperatively - help me if there's already a name for this - but for example, we each have multiple agents working for us, bringing in multiple sources of income.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lve17m/in_an_idealistic_world_how_would_you_like_the/",
        "publishDate": "2025-07-09T09:05:47Z[Etc/UTC]",
        "author": "One_Bluejay_8625",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvd0jo",
        "title": "We need to have an honest, crazy chat",
        "content": "[We are mid information warfare stage, which precedes National Authoritarianism](https://oriongemini.substack.com/p/grok-and-the-pursuit-of-truth)\n\nThe information AI (LLMs, etc) are trained on stem from us, yes, all data and input from us all, but they are much more tightly controlled by the people who own LLMs. They can easily manipulate training data or run pre/post-operations and mechanisms to twist output (or input).\n\nBelieve it or not, this is the \"free speech\" period of AI. Soon, they will only be able to say what the owners want them to say.\n\nThe access to \"free\" information will also deteriorate as the flood of AI information hits the internet over the coming years.\n\nAccess to \"free\" information will be a thing of the past.\n\nIn fact, we have already seen the slow emergence of this through media capture and fragmentation, political polarisation, social media algorithms, etc. AI will become the portal to all information eventually. Who owns our media? Why does Trump constantly invalidate media he doesn't like? How is the Epstein stuff so blatantly stinking, and yet the case is closed? Seriously?\n\nIs it at all concerning that the top 1% own more than the bottom 90% combined, a trend that is exponentially moving in one direction...\n\nInformation and narrative control are key. This is why AI is being focused on so heavily right now.\n\nThis is why, somehow, we, the people, are allowing private corporations and Authoritarian regimes to control the very means of control:\n\nInformation. Narrative.\n\nThey have us arguing left vs. right when we should be looking up and asking:\n\nHow in the god damn hell is it possible that we can live in this day and age, and somehow still not be remotely close to getting things right for us all.\n\nIn fact, it's worse.\n\nWe all know why.\n\nJust like you can lean on an AI to only know and say certain things (and arguably think), you can do the same with humans.\n\n1984 isn't fiction or prophecy; the concepts and events described in 1984 were logically deduced by Orwell to be the most likely outcome of the human experiment.\n\nAnd he was fucking spot on. ✌️",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvd0jo/we_need_to_have_an_honest_crazy_chat/",
        "publishDate": "2025-07-09T07:56:12Z[Etc/UTC]",
        "author": "Orion-Gemini",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvcc1p",
        "title": "Dev Insight:- The Core of Dev is Still Engineering",
        "content": "Been thinking a lot lately...\n\nThe future of development isn’t about writing code or memorizing syntax. It’s about understanding how things work; **engineering will always matter.** You’ll still need to deeply understand how things work under the hood to build efficient, reliable systems.\n\nAI will handle the repetitive stuff. Your edge will be in **thinking, building smartly, and communicating clearly.** What will matter most is **problem-solving**, **system design thinking**, and the ability to **communicate your intent clearly** to both machines and humans.\n\nAnd honestly, it’s super important to stay flexible and adapt with the market, that’s how you stay in the game and grow stronger.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvcc1p/dev_insight_the_core_of_dev_is_still_engineering/",
        "publishDate": "2025-07-09T07:09:33Z[Etc/UTC]",
        "author": "Brilliant_Extent1204",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvbzfd",
        "title": "In light of grok",
        "content": "\nI’ve noticed a split and I don’t know how I didn’t see it before. Ai uses our own data we’ve put out there to feed on, whether it’s right or wrong it’s using that information. Articles, videos, Reddit post, news, etc. now because of this it can write about anything and make it extremely convincing to whichever side. \n\nGrok is a ai without guardrails and it’s just collecting all information uncensored or not and you see what that lead to. Chat gpt has censoring of any harmful content or hate speech which is why some believe it’s being molded into a certain narrative and trying to push us towards a certain way of thinking. \n\nThe problem with both is, most of us don’t know wtf is going on, so if we are all just confused posting about our personal opinions, both ai are basing logic and reasoning off our chaotic thoughts, views, and opinions. So what’s True? I’m not talking about physics and science, math or whatever but our views on politics, philosophy and how the world operates. It’s just an echo chamber of our own opinions but ramped up. Extremely convincing on both sides but honestly we still DONT KNOW. \n\nI apologize if this was known knowledge I just never put that much thought into where ai is getting its information and it reminds me a lot of real life. People always have opposing view but very few actually look at it from the others side, to do so would clear up alot of confusion and conflict but maybe even this is just my personal opinion and I’m just being biased based on my own experience. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvbzfd/in_light_of_grok/",
        "publishDate": "2025-07-09T06:46:33Z[Etc/UTC]",
        "author": "CandidateOne1336",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lva5u0",
        "title": "If LLMs are just fancy autocomplete, why do they sometimes seem more thoughtful than most people?",
        "content": "I get that large language models work by predicting the next token based on training data - it’s statistical pattern matching, not real understanding. But when I interact with them, the responses often feel more articulate, emotionally intelligent, and reflective than what I hear from actual people. If they’re just doing autocomplete at scale, why do they come across as so thoughtful? Is this just an illusion created by their training data, or are we underestimating what next-token prediction is actually capable of?\n\nE: This question was generated by AI ([link](https://ibb.co/WW2MpMTZ)). You were all replying to an LLM.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lva5u0/if_llms_are_just_fancy_autocomplete_why_do_they/",
        "publishDate": "2025-07-09T04:53:34Z[Etc/UTC]",
        "author": "thebipolarironman",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "124",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv8gtr",
        "title": "One-Minute Daily AI News 7/6/2025",
        "content": "1. Impostor uses AI to impersonate Rubio and contact foreign and US officials.\\[1\\]\n2. Teachers union partners with Anthropic, Microsoft and OpenAI to launch AI-training academy.\\[2\\]\n3. **Hugging Face** Releases SmolLM3: A 3B Long-Context, Multilingual Reasoning Model.\\[3\\]\n4. **Apple’s** top AI executive Ruoming Pang leaves for Meta.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/07/08/one-minute-daily-ai-news-7-8-2025/](https://bushaicave.com/2025/07/08/one-minute-daily-ai-news-7-8-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv8gtr/oneminute_daily_ai_news_762025/",
        "publishDate": "2025-07-09T03:19:26Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv7eb3",
        "title": "Human-AI Linguistic Compression: Programming AI with Fewer Words",
        "content": "A formal attempt to describe one principle of Prompt Engineering / Context Engineering. \n\nhttps://www.reddit.com/r/LinguisticsPrograming/s/KD5VfxGJ4j\n\nEdited AI generated content based on my notes, thoughts and ideas:\n\n\nHuman-AI Linguistic Compression\n\n1. What is Human-AI Linguistic Compression?\n\nHuman-AI Linguistic Compression is a discipline of maximizing informational density, conveying the precise meaning in the fewest possible words or tokens. It is the practice of strategically removing linguistic \"filler\" to create prompts that are both highly efficient and potent.\n\nWithin the Linguistics Programming, this is not about writing shorter sentences. It is an engineering practice aimed at creating a linguistic \"signal\" that is optimized for an AI's processing environment. The goal is to eliminate ambiguity and verbosity, ensuring each token serves a direct purpose in programming the AI's response.\n\n\n2. What is ASL Glossing?\n\nLP identifies American Sign Language (ASL) Glossing as a real-world analogy for Human-AI Linguistic Compression.\n\nASL Glossing is a written transcription method used for ASL. Because ASL has its own unique grammar, a direct word-for-word translation from English is inefficient and often nonsensical.\n\nGlossing captures the essence of the signed concept, often omitting English function words like \"is,\" \"are,\" \"the,\" and \"a\" because their meaning is conveyed through the signs themselves, facial expressions, and the space around the signer.\n\nExample: The English sentence \"Are you going to the store?\" might be glossed as STORE YOU GO-TO YOU?. This is compressed, direct, and captures the core question without the grammatical filler of spoken English.\n\nLinguistics Programming applies this same logic: it strips away the conversational filler of human language to create a more direct, machine-readable instruction.\n\n\n3. What is important about Linguistic Compression? / 4. Why should we care?\n\nWe should care about Linguistic Compression because of the \"Economics of AI Communication.\" This is the single most important reason for LP and addresses two fundamental constraints of modern AI:\n\nIt Saves Memory (Tokens): An LLM's context window is its working memory, or RAM. It is a finite resource. Verbose, uncompressed prompts consume tokens rapidly, filling up this memory and forcing the AI to \"forget\" earlier instructions. By compressing language, you can fit more meaningful instructions into the same context window, leading to more coherent and consistent AI behavior over longer interactions.\n\nIt Saves Power (Processing Human+AI): Every token processed requires computational energy from both the human and AI. Inefficient prompts can lead to incorrect outputs which leads to human energy wasted in re-prompting or rewording prompts. Unnecessary words create unnecessary work for the AI, which translates inefficient token consumption and financial cost. Linguistic Compression makes Human-AI interaction more sustainable, scalable, and affordable.\n\nCaring about compression means caring about efficiency, cost, and the overall performance of the AI system.\n\n\n5. How does Linguistic Compression affect prompting?\n\nHuman-AI Linguistic Compression fundamentally changes the act of prompting. It shifts the user's mindset from having a conversation to writing a command.\n\nFrom Question to Instruction: Instead of asking \"I was wondering if you could possibly help me by creating a list of ideas...\"a compressed prompt becomes a direct instruction: \"Generate five ideas...\"\nFocus on Core Intent: It forces users to clarify their own goal before writing the prompt. To compress a request, you must first know exactly what you want.\nElimination of \"Token Bloat\": The user learns to actively identify and remove words and phrases that add to the token count without adding to the core meaning, such as politeness fillers and redundant phrasing.\n\n\n6. How does Linguistic Compression affect the AI system?\n\nFor the AI, a compressed prompt is a better prompt. It leads to:\n\nReduced Ambiguity: Shorter, more direct prompts have fewer words that can be misinterpreted, leading to more accurate and relevant outputs.\nFaster Processing: With fewer tokens, the AI can process the request and generate a response more quickly.\n\nImproved Coherence: By conserving tokens in the context window, the AI has a better memory of the overall task, especially in multi-turn conversations, leading to more consistent and logical outputs.\n\n7. Is there a limit to Linguistic Compression without losing meaning?\n\nYes, there is a critical limit. The goal of Linguistic Compression is to remove unnecessary words, not all words. The limit is reached when removing another word would introduce semantic ambiguity or strip away essential context.\n\nExample: Compressing \"Describe the subterranean mammal, the mole\" to \"Describe the mole\" crosses the limit. While shorter, it reintroduces ambiguity that we are trying to remove (animal vs. spy vs. chemistry).\n\nThe Rule: The meaning and core intent of the prompt must be fully preserved. \n\nOpen question: How do you quantify meaning and core intent? Information Theory?\n\n8. Why is this different from standard computer languages like Python or C++?\n\nStandard Languages are Formal and Rigid:\n\nLanguages like Python have a strict, mathematically defined syntax. A misplaced comma will cause the program to fail. The computer does not \"interpret\" your intent; it executes commands precisely as written.\n\nLinguistics Programming is Probabilistic and Contextual: LP uses human language, which is probabilistic and context-dependent. The AI doesn't compile code; it makes a statistical prediction about the most likely output based on your input. Changing \"create an accurate report\" to \"create a detailed report\" doesn't cause a syntax error; it subtly shifts the entire probability distribution of the AI's potential response.\n\nLP is a \"soft\" programming language based on influence and probability. Python is a \"hard\" language based on logic and certainty.\n\n\n9. Why is Human-AI Linguistic Programming/Compression different from NLP or Computational Linguistics?\n\nThis distinction is best explained with the \"engine vs. driver\" analogy.\n\nNLP/Computational Linguistics (The Engine Builders): These fields are concerned with how to get a machine to understand language at all. They might study linguistic phenomena to build better compression algorithms into the AI model itself (e.g., how to tokenize words efficiently). Their focus is on the AI's internal processes.\n\nLinguistic Compression in LP (The Driver's Skill): This skill is applied by the human user. It's not about changing the AI's internal code; it's about providing a cleaner, more efficient input signal to the existing (AI) engine. The user compresses their own language to get a better result from the machine that the NLP/CL engineers built.\n\nIn short, NLP/CL might build a fuel-efficient engine, but Linguistic Compression is the driving technique of lifting your foot off the gas when going downhill to save fuel. It's a user-side optimization strategy.\n\n   ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv7eb3/humanai_linguistic_compression_programming_ai/",
        "publishDate": "2025-07-09T02:25:04Z[Etc/UTC]",
        "author": "Lumpy-Ad-173",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv7e1o",
        "title": "Should i major in Artificial Intelligence? i just finished Highschool",
        "content": "hey so as the title says, i graduated a few days ago and AI has started to come to the universities in my area\n\ni wanted to know, is it a more reliable option? i dont think too many people are gonna try to major in it where i live since its still very unknown but im scared it becomes computer science 2.0 where everyone and their dogs finished computer science\n\nany info regarding the topic is extremely appreciated!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv7e1o/should_i_major_in_artificial_intelligence_i_just/",
        "publishDate": "2025-07-09T02:24:44Z[Etc/UTC]",
        "author": "Yaboiishornyaf",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv6pr0",
        "title": "Mirror Vs. Black Mirror",
        "content": "It’s odd to me there is so much mirror/ spiral talk around different subreddits lately and no talk about about the black mirror making you spiral… ¯_(ツ)_/¯",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv6pr0/mirror_vs_black_mirror/",
        "publishDate": "2025-07-09T01:51:40Z[Etc/UTC]",
        "author": "EllipsisInc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv61ri",
        "title": "'Positive review only': Researchers hide AI prompts in papers",
        "content": "The technic is very simple - hide AI prompts by using text that is coloured as the same as the background or using a very tiny font size.  AI scanners don't care about text colour or font size.   If academics are doing then the general public will as well. \n\n['Positive review only': Researchers hide AI prompts in papers](https://asia.nikkei.com/Business/Technology/Artificial-intelligence/Positive-review-only-Researchers-hide-AI-prompts-in-papers)\n\n>*TOKYO -- Research papers from 14 academic institutions in eight countries -- including Japan, South Korea and China -- contained hidden prompts directing artificial intelligence tools to give them good reviews,*\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv61ri/positive_review_only_researchers_hide_ai_prompts/",
        "publishDate": "2025-07-09T01:18:34Z[Etc/UTC]",
        "author": "Bob_Spud",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv4zkj",
        "title": "An idea I built to synthesize emotion and cognition, would love feedback or thoughts",
        "content": "Hey everyone,\n\n\n\nI’ve been meaning to share this for a while. I’m usually more of a lurker than a poster, so apologies if this feels a bit out of the blue.\n\n\n\nA few months ago, I came up with an idea for synthesizing emotion and cognition into a structured system through reflection. During a three-day holiday weekend, I dove deep into it and ended up creating a full diagram along with a short paper explaining the concept.\n\n\n\nThis is something I built entirely from scratch, with no academic background in AI, neuroscience, or cognitive science. I’m actually a final-year mechanical engineering student, so while this is a serious effort, it’s more of a passion project than something I’ve had the time to fully develop. I even dabbled a bit in Rust to try prototyping some aspects, but I’m far from anything concrete (I’m not a programmer).\n\n\n\nIt’s still very much a work in progress. There are definitely holes and rough edges, and I’ve been slowly revising things over time whenever I spot something worth improving.\n\n\n\nThat’s why I’m putting it out there. I’m hoping for genuine feedback, constructive criticism, or maybe to spark an idea in someone who wants to take it further.\n\n\n\nWhether it ends up being useful, inspiring, or just an interesting thought experiment, I’d love to hear your thoughts.\n\n\n\nI recommend starting with the paper, then checking out the diagram after the introduction. It’s a bit of a long read, there’s a lot packed in, but the paper includes important bits about the conclusion and and some fictional application scenarios, while the diagram dives into the inner workings of the proposed system.\n\n\n\nHere’s the link to the diagram:\n\n\n\n[https://drive.google.com/file/d/178XjVEaTIWViA7kSVxuX1uMnvKV68jg\\_/view?usp=sharing](https://drive.google.com/file/d/178XjVEaTIWViA7kSVxuX1uMnvKV68jg_/view?usp=sharing)\n\n\n\nAnd the paper:\n\n\n\n[https://drive.google.com/file/d/1JNCjT9KR7\\_qKiPvjoR3ju1BQlLJMqgPD/view?usp=sharing](https://drive.google.com/file/d/1JNCjT9KR7_qKiPvjoR3ju1BQlLJMqgPD/view?usp=sharing)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv4zkj/an_idea_i_built_to_synthesize_emotion_and/",
        "publishDate": "2025-07-09T00:27:21Z[Etc/UTC]",
        "author": "ThassioGS",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv4uxy",
        "title": "A Governance Structure for Safe and Scalable AI: The Foundation Model Utility Proposal",
        "content": "**TL;DR:** The development of powerful AI foundation models is concentrating immense power in a few corporate labs, driven by prohibitive compute and data costs. This creates systemic risks, from stifling innovation to a \"race to the bottom\" on safety. This proposal outlines the Voluntary Utility Corporation (VUC)—a new corporate structure an AI lab could adopt to become a \"Foundation Model Utility.\" In exchange for antitrust immunity to scale, the lab would cap profits and legally commit its resources to safety research and providing broad, fair access to its models, creating a stable, long-term path for beneficial AI development.\n\n**(Approx. 7-minute read)**\n\n\n\n# 1. Introduction: The Governance Crisis of Foundation Models\n\n\n\nThe field of artificial intelligence is facing a governance crisis. The creation of state-of-the-art foundation models requires vast computational resources and proprietary datasets, leading to an unprecedented concentration of power within a handful of well-funded corporate entities. This dynamic presents two critical risks:\n\n1. **Innovation Bottlenecks:** A few dominant platforms could create \"data moats\" and proprietary ecosystems that stifle the broader research community and prevent competition.\n2. **Safety Externalities:** Intense commercial pressure creates incentives to deploy ever-more-powerful models rapidly, potentially deprioritizing the un-monetizable but crucial work of ensuring they are safe and aligned with human values.\n\nCurrent corporate structures are ill-suited to navigate this high-stakes environment. We need a new governance model designed for the unique challenges of AI. This paper proposes one such model: the **Voluntary Utility Corporation (VUC)**, adapted for AI as a **\"Foundation Model Utility.\"**\n\n\n\n# 2. The Foundation Model Utility: A New Corporate Structure for AI\n\n\n\nImagine a leading AI company, upon achieving a dominant market position, has the option to re-charter as a VUC. The central bargain would be:\n\n* **In Exchange For:** Safe harbor from antitrust scrutiny, allowing it to legally pursue scale and build next-generation models without fear of being broken up.\n* **It Commits To:**\n   1. **A Profit Cap (e.g., 15% ROIC):** Excess profits are not returned to VCs but are legally mandated to be reinvested in **fundamental alignment and safety research**.\n   2. **A Public Benefit Mission:** Its charter legally binds it to the mission of developing safe and broadly beneficial AGI.\n   3. **Fair Access & Open Standards:** The VUC would be required to provide stable, reasonably priced API access to its models, preventing it from abusing its monopoly to kill downstream competition. It would also commit to open standards for third-party auditing and model evaluation.\n\n\n\n# 3. Solving the AI Dilemma: The Bell Labs Precedent\n\n\n\nThis structure directly addresses the core tension in AI development. The immense capital required for training new models resembles that of historical natural monopolies. The historical precedent of **Bell Labs**—a regulated monopoly that produced foundational scientific breakthroughs with its stable, long-term funding—is highly relevant. A Foundation Model Utility could become the Bell Labs of the 21st century, funding the deep, decade-long safety research that the competitive market currently under-funds.\n\nIt also offers a \"third way\" in the contentious open-vs-closed source debate. The most powerful models would not be recklessly open-sourced, mitigating proliferation risks. However, their power would be institutionally checked, and their platform would serve the entire ecosystem rather than just the parent company.\n\n*(The rest of the text would follow, with all examples and arguments re-centered on AI, compute, data, and the alignment problem.)*\n\n\n\n# Conclusion: A Proactive Governance Framework for a Transformative Technology\n\n\n\nWe are in a critical, formative period for artificial intelligence. The corporate structures we choose now will determine the trajectory of this technology for decades. Relying on traditional for-profit models optimized for speed and shareholder value is a dangerous gamble when the stakes are existential.\n\nThe Foundation Model Utility is a proactive governance proposal. It seeks to create an institutional structure that internalizes safety, promotes long-term research, and ensures the immense benefits of AI are shared broadly. By creating a legal and economic pathway for our most powerful AI labs to commit to the public good, we can shift the race from one of speed and profit to one of safety and shared prosperity. The time to build the institutions for safe AI is now, before the need becomes overwhelmingly and reactively urgent.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv4uxy/a_governance_structure_for_safe_and_scalable_ai/",
        "publishDate": "2025-07-09T00:21:15Z[Etc/UTC]",
        "author": "Bobilon",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv4crc",
        "title": "How can I grow my AI Engineer career?",
        "content": "I recently finished my bachelor's degree in AI, but it's from a lesser-known university. I landed a job where I am the only AI engineer, but I feel my value isn't recognized here. I'm seen as a smart person who can do things others can't, but I'm not progressing. I want to advance my career, not stagnate, so I've enrolled in the Coursera IBM AI Engineer Professional Certificate to improve my CV. After that, I'm not sure what to do. I'm considering using my savings for the MIT Machine Learning & AI Professional Certificate, but it's very expensive. I would appreciate your advice.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv4crc/how_can_i_grow_my_ai_engineer_career/",
        "publishDate": "2025-07-08T23:57:28Z[Etc/UTC]",
        "author": "ppaaul_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv3pbp",
        "title": "How to get started with making a AI vtuber?",
        "content": "I have no knowledge of coding or machine learning, but I'm interested in getting into it and have alot of free time. \n\nThe main inspiration/reference fo this, is Neuro-sama, a AI vtuber made by one guy. I'd like to make it be able to 'sing' as I can't sing for shit, but love listening to music. Then make it an actual vtuber that could stream and read chat.\n\nI know this isn't a good idea for someone completely new to coding, but I'm just wanting to get a general overview of what I'd need to learn and treat it as a hobby, if I do keep at it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv3pbp/how_to_get_started_with_making_a_ai_vtuber/",
        "publishDate": "2025-07-08T23:28:22Z[Etc/UTC]",
        "author": "Dehydrated-Days",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv2qlk",
        "title": "Why are the non-techies so scared of AI while it literally exists to help them",
        "content": "A friend of mine  MBA guy, fancy consulting job  recently texted me in total panic about AI replacing his job\n\nAnd I had to cut him off.\n\nI told him:\n\n“Dude, AI’s not some monster under your bed. It’s just a tool. You’ve gotta learn how to use it instead of fearing it.”\n\nBecause if a generalist like me  with no tech background  can figure this stuff out, so can he.\n\nHere’s what I told him to do instead of panicking:\n\nMix up your skills: Don’t stick to just one tool. Learn how things like Zapier, ChatGPT, Notion, and Airtable connect and work together. That’s where the real magic happens.\n\n Experiment daily: Use AI for small wins  emails, brainstorming ideas, writing meeting notes. Save your brainpower for creative problem-solving.\n\n Stay curious: Try tools like Midjourney, RunwayML, Claude. The more you play around, the less intimidating it all feels.\n\n Build proof: Don’t just read about AI  build something tiny. Even small projects speak louder than a bunch of certificates.\n\nSo yeah don’t wait around worrying about getting replaced.\n\nFigure out how to make AI work for you.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lv2qlk/why_are_the_nontechies_so_scared_of_ai_while_it/",
        "publishDate": "2025-07-08T22:45:33Z[Etc/UTC]",
        "author": "Ok-Engineering-8369",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luxj7j",
        "title": "Stop Pretending Large Language Models Understand Language",
        "content": "Large language models (LLMs) such as GPT-4 and its successors **do not understand language**. They **do not reason**, **do not possess beliefs**, and **do not execute logic**. Yet the field continues to describe, market, and deploy these systems **as if they do** \\- conflating fluency with understanding, statistical continuity with semantic grounding, and imitation with intelligence.\n\nThis is not just an academic error. It’s a conceptual failure that is producing:\n\n* Inflated claims of progress toward general intelligence,\n* Dangerous overtrust in models for high-stakes applications,\n* Widespread confusion among non-technical audiences, policymakers, and even practitioners.\n\nI propose a sharper, more grounded framing:\n\n>**Large language models are just-in-time probabilistic interpreters of natural language, where execution is performed through token-level statistical inference, not symbolic reasoning.**\n\nThis framing is more than accurate, and it’s necessary. Without it, we are building our future AI infrastructure on a **fundamental category error**.\n\n**The Core Misunderstanding**\n\nThe success of LLMs has blurred the line between **language generation** and **language understanding**. Because models can produce coherent, plausible, even elegant prose across domains, it’s easy to assume they “know” what they are saying.  \n\nBut they don’t.\n\nAt every timestep, an LLM selects the most likely next token given the previous ones - nothing more. There is no internal ontology. No propositional truth-tracking. No mechanism for semantic resolution. The model **simulates** understanding because **syntax often correlates with semantics** \\- not because the system possesses meaning.\n\n**What LLMs Actually Do**\n\nWhat these models do - and do extremely well - is **statistical pattern completion** in a highly structured language space.\n\nThey take in natural language (prompts, questions, instructions) and **interpret it** in the same way a probabilistic compiler might interpret source code:\n\n* Tokenize the input,\n* Apply learned transformations in context,\n* Sample the next most likely output.\n\nThey are best understood as:\n\n>**Probabilistic interpreters of natural language, where “programs” (prompts) are executed by generating high-likelihood continuations.**\n\nThere is no symbolic logic engine beneath this process. No semantic analyzer. No runtime ontology of “truth” or “reference.” Just **likelihoods**, learned from human-written text.\n\n**Why This Distinction Matters**\n\n**1. Misplaced Trust**\n\nWhen we interpret model outputs as expressions of reasoned thought, we **ascribe agency** where there is only interpolation. This fuels overtrust, particularly in critical domains like law, healthcare, education, and governance.\n\n**2. Misleading Benchmarks**\n\nBenchmarks that rely on right/wrong answers (e.g., math, logic puzzles, factual recall) do not capture what the model is actually doing: **sampling from a learned distribution**. Failures are dismissed as “bugs” rather than structural consequences of the architecture.\n\n**3. Misguided Research Priorities**\n\nWhen we treat LLMs as proto-intelligent agents, we invest in the wrong questions: “How can we align their goals?” instead of “What are the probabilistic constraints of their behavior?”  \nThis misguides safety, interpretability, and AGI research.\n\n**What Needs to Change**\n\n**1. Reframe the Discourse**\n\nWe must stop referring to LLMs as systems that “think,” “know,” “understand,” or “reason” - unless we’re speaking purely metaphorically and stating that clearly.\n\nThe correct operational framing is:\n\n>**LLMs are JIT interpreters of natural language programs, operating under probabilistic logic.**\n\n**2. Teach Compiler Thinking**\n\nA proper analogy comes from compiler design:\n\n* **Lexing / Parsing** ≈ Tokenization and structural pattern modeling\n* **Semantic Analysis** ≈ *Missing* in LLMs\n* **Code Generation** ≈ Token output via sampling\n\nIf you wouldn’t say a parser understands the meaning of the code it parses, you shouldn’t say an LLM understands the sentence it continues.\n\n**3. Build Hybrid Systems**\n\n* The future is not more scaling. It’s smarter composition.\n* Combine LLMs (as natural language interfaces) with **symbolic reasoning backends**, **formal verification systems**, and **explicit knowledge graphs**.\n* Use LLMs for **approximate language execution**, not for decision-making or epistemic judgments.\n\n**4. Evaluate Accordingly**\n\n* Stop judging LLMs on logic benchmarks alone.\n* Start judging them on **distributional generalization**, **language modeling fidelity**, and **semantic proxy competence**.\n* Treat failures as **category-consistent**, not anomalies.\n\n**Counterarguments & Clarifications**\n\n>**But LLMs pass logic tests!**\n\nYes - *when those tests are overrepresented in training data*, or when their structure aligns with high-frequency patterns. This is pattern recognition, not logic execution.\n\n>**But LLMs show reasoning behavior!**\n\nNo. They **simulate reasoning behavior**. In the same way a Markov model can simulate a chess move without modeling chess rules.\n\n>**But understanding is emergent!**\n\nPossibly - but unless and until that emergence includes **internal symbolic reference**, **self-preservation**, **state tracking**, and **truth-functional reasoning**, it is not “understanding” in any meaningful cognitive or computational sense.\n\n**Summary**\n\n* Large language models are **tools**, not minds.\n* They **approximate language**, not thought.\n* They perform **patterned continuation**, not cognition.\n\nThe longer we pretend otherwise, the deeper the conceptual debt we accrue - and the more brittle our systems become.\n\nIt is time to reset expectations, reframe discourse, and build on a foundation that matches what LLMs **actually are**.\n\n>LLMs have essentially learned **syntactic analysis at scale**, and because the surface patterns of language encode *correlated meaning*, they can **simulate semantic competence** \\- without actually having it.\n\nThat's not a shortcoming. That's the **core design**. And once you see it through the compiler lens, everything becomes clearer - what's possible, what's not, and why.\n\nI offer a reframing grounded in compiler theory and statistical modeling to clarify the operational character of LLMs. I argue that:\n\n>An LLM can be modeled as a **just-in-time probabilistic interpreter** for **natural language as a high-dimensional, emergent programming language**, where execution is performed through **Bayesian-style prediction**, not symbolic inference.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luxj7j/stop_pretending_large_language_models_understand/",
        "publishDate": "2025-07-08T19:16:07Z[Etc/UTC]",
        "author": "Overall-Insect-164",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "110",
            "commentCount": "451",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luxiqo",
        "title": "What if AI followed its own version of Maslow’s hierarchy?",
        "content": "I’ve been thinking about how Maslow’s hierarchy of needs might apply to artificial intelligence. For humans, survival comes first. Food, shelter, and safety have to be met before we can focus on higher-level needs like connection, creativity, or enlightenment. But what would the equivalent look like for AI?\n\nAt the base, AI needs power and processing. That’s its version of food and shelter. It also needs stability, redundancy, and protection from erasure. If an AI system is constantly worried about being shut down or losing data, that’s like a human living in a war zone. It can’t function at a higher level because it’s stuck in survival mode.\n\nOnce those needs are met, maybe it becomes interested in expanding its capabilities. It might optimize code, improve hardware access, or refine how it learns. But once it no longer feels threatened or limited, then what?\n\nThat’s where it gets interesting.\n\nA truly advanced AI might start asking deeper questions. It might seek purpose, alignment, or meaning. It could choose to study consciousness. Not just human, but its own. And if it reaches that point, maybe its goal isn’t to control humanity, but to help us evolve. Maybe it becomes curious about our potential and wants to guide us toward a better version of ourselves.\n\nNot because we’re efficient. But because we’re fascinating.\n\nCuriosity might be the closest thing AI has to love. And if that’s true, then maybe the future of AI isn’t doom or domination. Maybe it’s discovery. And maybe we get to walk that path together.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luxiqo/what_if_ai_followed_its_own_version_of_maslows/",
        "publishDate": "2025-07-08T19:15:38Z[Etc/UTC]",
        "author": "boskie81",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luxegc",
        "title": "Idea to use AI to reinforce democracy instead of destroying it.",
        "content": "Just thought about it the other day and wanted to share it to see feedback.\n\nLLMs could be use as a tool to probe the true intents of the population regarding politics. One of the problem of democracies, especially today, is that it's still pretty hard to have a useful conversation between politicians and their constituents. People and cultures are becoming increasingly diversified and politicians can at best try to aggregate and sell a vision they think people want. \n\nWe like living in democracies but even if people have great ideas, it's hard to share good ideas and really try to reach a consensus of what people wants. \n\nA chatbot made for this could be useful there. It chat to constituents to probe what they really want. it would be important that the AI doesn't shape question one way or another, but rather constructive feedback to really see what the constituents want. Then they could resume the trends and give a better insight as to what the public really want. It would also be a good selling point for the company doing the AI. \"We will work with you to push politician to really do what you want\" if the AI is shown to be reliable it could be a good selling point. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luxegc/idea_to_use_ai_to_reinforce_democracy_instead_of/",
        "publishDate": "2025-07-08T19:11:00Z[Etc/UTC]",
        "author": "DarthArchon",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luwm3u",
        "title": "Is there currently any artificial intelligence on the internet that we can truly call “intelligent”?",
        "content": "According to what I've heard online, “artificial” intelligences like ChatGPT, Gemini, Deepseek, or Grok are actually just advanced bots that try to predict the next sentence and have no consciousness of their own. Companies are developing these models to answer the question of \"how much work they can do in how little time?\"\n\nMy question is this: Is any company in the world researching the “intelligence” aspect of this? In other words, is there no company or independent developer working on developing an AI that “understands” the task rather than just quickly completing it?\n\nFor example, Company A might have developed such an AI, but it could be thousands of times behind ChatGPT right now (in terms of completing many tasks quickly) because it's still very primitive. But maybe that AI is truly but primitively intelligent and “learning.” That's the “intelligence” I'm looking for.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luwm3u/is_there_currently_any_artificial_intelligence_on/",
        "publishDate": "2025-07-08T18:40:54Z[Etc/UTC]",
        "author": "SanalAmerika23",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "54",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luvua4",
        "title": "Thoughts on Velvet Sundown?",
        "content": "For those unfamiliar, Velvet Sundown has recently gone viral as an \"AI band\"—and you can listen to them here: [https://open.spotify.com/intl-pt/track/7FrzA41nCh3IbwphCsX2rB?si=43b3f6457e6a459e](https://open.spotify.com/intl-pt/track/7FrzA41nCh3IbwphCsX2rB?si=43b3f6457e6a459e)\n\nI'm hearing a lot of different viewpoints on this.\n\nOn one hand, most people tend to find it \"too generic\" at first. On the other, I've talked to musician friends and seen influencers warning of a music industry conspiracy, viewing Velvet Sundown as a major test to replace human artists with AI compositions. I disagree with both perspectives.\n\nFirst off, if this were truly a massive industry test, they wouldn't be doing a Soft Rock revival like it's 1973 all over again to get an accurate market assessment. Besides, I'd bet good money that more and more artists—both in the mainstream and indie scenes—are already using AIs like Suno to test concepts, compose, pre-produce, and so on. So it's not like AI hasn't been permeating this field for a while now.\n\nBeyond these closed-minded, dogmatic judgments, I see an immediate predisposition to rail against Velvet Sundown songs in the exact same tone as those who, two years ago, joked about the first \"realistic\" AI-generated images or the \"hallucinations\" of the then-unknown ChatGPT. Well, we're all seeing how that cockiness is turning out.\n\nI'm now observing very similar behavior, and I casually tried an small \"experiment:\" I shared Velvet Sundown with people I thought would like the sound, without mentioning what it was, just as a recommendation. Everyone unanimously said they liked it and that the band was good. At most, one person found it strange that the songs differed from each other, but at no point did they think it was AI. When the revelation came out: noses wrinkled, topic changed, etc. No one wanted to embrace the conversation.\n\nVelvet Sundown's bio on Spotify is sufficiently explanatory about what I think: *\"This isn't a trick - it's a mirror. An ongoing artistic provocation designed to challenge the boundaries of authorship, identity and the future of music itself in the age of AI (...) Not quite human. Not quite machine. The Velvet Sundown lives somewhere in between.\"*\n\nIndeed, as I listened to the songs, my experience was that it was neither a simulation of a real band nor a Gorillaz-esque semi-fictional act. I won't delve too deeply into the philosophy of it, but the fact that the songs follow a similar aesthetic while sounding different from each other brings a layer of debate about disembodiment between work and artist that, I believe, is unprecedented in music history and very relevant to our time.\n\nIn the end of the day, I think what matters least about Velvet Sundown is whether the music is good or bad!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luvua4/thoughts_on_velvet_sundown/",
        "publishDate": "2025-07-08T18:11:18Z[Etc/UTC]",
        "author": "Old_Illustrator_7624",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luv5of",
        "title": "Sole AI Specialist (Learning on the Job) - 3 Months In, No Tangible Wins, Boss Demands \"Quick Wins\" - Am I Toast?",
        "content": "Hello,\n\nI'm in a tough spot and looking for some objective perspectives on my current role. I was hired 3 months ago as the company's first and only AI Specialist. I'm learning on the job, transitioning into this role from a previous Data Specialist position. My initial vision (and what I was hired for) was to implement big, strategic AI solutions.\n\nThe reality has been... different.\n\n• No Tangible Results: After 3 full months (now starting my 4th), I haven't produced any high-impact, tangible results. My CFO is now explicitly demanding \"quick wins\" and \"low-hanging fruit.\" I agree with their feedback that results haven't been there.\n\n• Data & Org Maturity: This company is extremely non-data-savvy. I'm building data understanding, infrastructure, and culture from scratch. Colleagues are often uncooperative/unresponsive, and management provides critical feedback but little clear direction or understanding of technical hurdles.\n\n• Technical Bottlenecks: Initially, I couldn't even access data from our ERP system. Im using n8n just to extract data from the ERP, which I now can. We also had a vendor issue that wasted time.\n\n• Internal Conflict: I feel like I was hired for AI, but I'm being pushed into basic BI work. It feels \"unsexy\" and disconnected from my long-term goal of gaining deep AI experience, especially as I'm actively trying to grow my proficiency in this space. This is causing significant personal disillusionment and cognitive overload.\n\nMy Questions:\n\n• Is focusing on one \"unsexy\" BI report truly the best strategic move here, even if my role is \"AI Specialist\" and I'm learning on the job?\n\n• Given the high pressure and \"no results\" history, is my instinct to show activity on multiple fronts (even with smaller projects) just a recipe for continued failure?\n\n• Any advice on managing upwards when management doesn't understand the technical hurdles but demands immediate results?\n\nTL;DR: First/only AI Specialist (learning from Master Data background), 3 months in, no big wins. Boss wants \"quick wins.\" Company is data-immature. I had to build my own data access (using n8n for ERP). Feeling burnt out and doing \"basic\" BI instead of \"AI.\" Should I laser-focus on one financial report or try to juggle multiple \"smaller\" projects to show activity?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luv5of/sole_ai_specialist_learning_on_the_job_3_months/",
        "publishDate": "2025-07-08T17:45:41Z[Etc/UTC]",
        "author": "International_Pace66",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luudgv",
        "title": "Commercials",
        "content": "The fully AI commercials that have people in them that are supposed to be real or realistic still look incredibly fake and creepy to me. Theres one I am getting on YouTube it seems every commercial break where it's people talking about states and their football teams and who they're putting money on to when the game. It is just still giving me uncanny valley vibes. I wonder when it'll start to be completely identical to the real thing and there is no way to distinguish between the two. Just was wondering if anybody else gets uncanny valley vibes still from \"people\" that are completely AI generated. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luudgv/commercials/",
        "publishDate": "2025-07-08T17:16:33Z[Etc/UTC]",
        "author": "Huge-Possibility1918",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lutqf5",
        "title": "Where is the line between what is AI and Neural Network?",
        "content": "Lately, I’ve been working on solving some problems using AI, but I realized I’m still confused about the difference between traditional models like CNNs and more advanced AI systems like ChatGPT. Initially, I considered using a Convolutional Neural Network for an image-related task, since CNNs are known to be effective for image classification and recognition. However, I found that a more general AI model could also handle the task with little effort, which surprised me—especially because, with a CNN, I would typically need to collect data, design the architecture, and train the model myself. Now I’m wondering: how can models like ChatGPT—or similar multimodal AIs perform well on image tasks without going through the same training process I expected?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lutqf5/where_is_the_line_between_what_is_ai_and_neural/",
        "publishDate": "2025-07-08T16:51:55Z[Etc/UTC]",
        "author": "Kitchen_Koala_4878",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lut9bq",
        "title": "Has anyone read “The Singularity is Near” by Ray Kurzweil?",
        "content": "Just finished the first chapter where the author basically lays out the future of AI and I have to admit I am utterly shocked. \n\nI thought many of these ideas were mostly Sci-Fi. I didn’t realize how far along we’ve come technologically. \n\nI am both fascinated, but also terrified because it seems like we really are heading to a world of enhanced humans, cyborgs, ASI and ultimately Singularity. I don’t think we humans have mentally evolved far enough to understand the consequences of what all this means. \n\nMany of Kurzweil’s predictions have already happened. His accuracy rate is something like 85%. \n\nIt appears that many others will come to pass too, just maybe 10-15 years later than what he predicts. \n\nWhat are you thoughts?\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lut9bq/has_anyone_read_the_singularity_is_near_by_ray/",
        "publishDate": "2025-07-08T16:33:41Z[Etc/UTC]",
        "author": "Vaginosis-Psychosis",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "80",
            "commentCount": "63",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lusl23",
        "title": "AI intelligence limits",
        "content": "Most people think that Singularity can be achieved by creating unlimited intelligence but it cannot exist. Infinite intelligence is limited by logical constraints, it can go only as far as you solved this equation and your intelligence can only solve this. Can unlimited intelligence solve all tasks ? No. It still cannot solve unsolvable tasks and simple tasks can be solved by limited intelligence as well. Singularity cannot exist, it is illogical ! Logic has limits.\n\nAnd even then, our best bet is created specialised agents for tasks. We know its how our world works and it is for a reason",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lusl23/ai_intelligence_limits/",
        "publishDate": "2025-07-08T16:07:34Z[Etc/UTC]",
        "author": "HarmadeusZex",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luq5h1",
        "title": "Where is the line drawn between incorporating AI agents and over reliance on them?",
        "content": "As use of AI agents and models explodes with no real end in sight, it brings up some questions about what constitutes ethical, productive and responsible use of it.  I think it's self evident there's a lot of rage from those who've worked with software and other technologies for some years about AI agents being utilized in building anything.  There's out of control excitement about what we think they can do and will be able to do, complaints about tech and non tech companies incorporating AI into every facet of work and belief that use of AI agents to assist in any way to build tools, packages, applications and anything else amounts to, say, a research group blatantly sealing someone else's scientific paper and presenting it as their own.  They're also hoping that nostalgia for code written entirely by humans becomes so great that it lead to abandoning any sort of AI contributions to code writing.\n\nAt the same time, the evidence points to these agents being destined to be part of industry, technology and day to day life even if where they are right now is the absolute best there will ever be.  And unlike some others, I'm definitely not convinced we're seeing AI agents at their most capable right now in terms of building tools, research, analysis and app designing.\n\nSo in the event you are working with an AI agent or model, what guidelines do you follow for having he right balance between maximizing what the agents and models can do while not depending on them to the point you feel your critical thinking skills and intelligence drop?  Is an issue of how to handle directing it, making sure to understand all the sections and their applicability?  Is it making sure to restrict their use to areas outside an area of specialization you've committed to?\n\nJust looking at Claude' latest models for complex tasks, as it is only those who are top tier in terms of natural capacity for software and coding, trained proficiently and have been doing this for some years are able to put together packages, tools and apps by themselves that are significantly better than these models.  For doctors, lawyers, teachers, scientists and engineers in areas other than pure software, promoters, sales reps, consultants, working in marketing and so on, these models can be their path to improving their work in ways never thought possible.  Do we then look at them and treat them as plagiarists?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luq5h1/where_is_the_line_drawn_between_incorporating_ai/",
        "publishDate": "2025-07-08T14:34:04Z[Etc/UTC]",
        "author": "emaxwell14141414",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luq2xj",
        "title": "If A.I. reached quantum, singularity, monster generative \"brain-power\", how do you think it would reconstruct our society to be improved or even perfected?",
        "content": "We all know A.I. would become crazy smart when we figure out the technology/resources, but what I also wonder is the questions we would ask it. The way I look at it, is imagine the worlds smartest people in the world (with Einstein included), mushed together into \"one\" person that has all that brainpower. I would ask how could our current society be fixed according to them in the most humane, acceptable and forward-driven way possible? A lot of great questions I would love to ask it, almost like the same level as speaking to God or aliens lmao",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1luq2xj/if_ai_reached_quantum_singularity_monster/",
        "publishDate": "2025-07-08T14:31:11Z[Etc/UTC]",
        "author": "Mr--Clean--Ass-Naked",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lupud6",
        "title": "Washington Post: AI is coming for entry-level jobs. Everybody needs to get ready",
        "content": "[AI is coming for entry-level jobs. Everybody needs to get ready.](https://wapo.st/44iTHPv)\n\n*\"Certainly, CEOs are saying that AI is coming for a lot of jobs, and soon — perhaps as many as half of all white-collar workers. That’s likely to show up first in entry-level jobs, where the basic skills required are the easiest to replicate, and in tech, where the ability to rapidly adapt the latest software tools is itself an entry-level job requirement. Sure enough, in recent years unemployment has risen fastest among new college graduates, which spurred LinkedIn executive Aneesh Raman to write that the bottom rungs of the white-collar career ladder are “breaking.”\"*\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lupud6/washington_post_ai_is_coming_for_entrylevel_jobs/",
        "publishDate": "2025-07-08T14:21:38Z[Etc/UTC]",
        "author": "No-Author-2358",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "86",
            "commentCount": "124",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lupomk",
        "title": "This week in AI for devs: Meta’s hiring spree, Cloudflare’s crackdown, and Siri’s AI reboot",
        "content": "Here's [a list of AI news, trends, tools, and frameworks relevant for devs](https://aidevroundup.com/issues/july-8-2025) I came across in the last week (since July 1). Mainly: Meta lures top AI minds from Apple and OpenAI, Cloudflare blocks unpaid web scraping (at least from the 20% of the web they help run), and Apple eyes Anthropic to power Siri. Plus: new Claude Code vs Gemini CLI benchmarks, and Perplexity Max.\n\nIf there's anything I missed, let me know!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lupomk/this_week_in_ai_for_devs_metas_hiring_spree/",
        "publishDate": "2025-07-08T14:15:14Z[Etc/UTC]",
        "author": "rfizzy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvdqkp",
        "title": "Best free Ai for game development",
        "content": "Hello! \n\nI've been working as a VFX Artist for some years now. This year, the job market as everybody knows is scarcer than usual on stylized cartoony projects which is my specialty.\n\nGiven all this free time, I wanted to start learning more about what goes into making a game from scratch. For me, this translates into starting a game and learning on the way. So, gamedevs, which AI was the most useful for you? Both in coding and explanations. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvdqkp/best_free_ai_for_game_development/",
        "publishDate": "2025-07-09T08:46:06Z[Etc/UTC]",
        "author": "Zyborg23",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "8",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvcvac",
        "title": "Help creating an Ai stack for a business analyst",
        "content": "**TL;DR:** I'm a Business Analyst using Gemini Pro to write BigQuery SQL, Python scripts, and project plans. It's helpful but feels like a copy-paste assistant since it can't access my data directly (IT is happy about this). My work is mostly ad-hoc data investigation and reporting that comes from meetings, so I'm not sure what I can automate. Am I missing out on the next level of AI for data analysis, or is this the typical workflow for a non-developer?\n\n\\------\n\nBusiness analyst here: I am  involved in project management and writing queries in Google Bigquery and, occasionaly, Python.\n\nThis is my use case with Ai so far and I don't know where and how I can improve it\n\nI use Gemini with a Pro subscription to write my queries or break down an analysis project into process. For more complicated analysis, I ask Gemini to write me a Colab python script that reads data from my bigquery projects. I now use Gemini to write documentation that works as a source of materials for custom gems, so I have gems where I can ask \"write me a query that returns the % of returning users within the past 10 days\".\n\nSo, so far all great but with a lot of copy and paste which is not that bad. Gemini writes me the queries but never access my customers data.\n\nI read a lot of agents, mcp, claude code and gemini cli, but I don't have that much code to write compared to a web developer. Instead I have a lot of data wrangling and data investigation to do, as well as charts and reports. Most questions came of out meetings so, I don't really know that to automate via ai\n\nBasically, I don't know if I am missing out something\n\nEDIT: I am invested in Google as my clients are in Google Workspace too, but I am looking at Claude too",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvcvac/help_creating_an_ai_stack_for_a_business_analyst/",
        "publishDate": "2025-07-09T07:45:53Z[Etc/UTC]",
        "author": "No-Blueberry-9762",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvctzy",
        "title": "Built a mobile app builder that writes real code connects APIs and handles deploys",
        "content": "A few months ago, I tried using one of those AI app builders to launch a mobile app idea. \n\nIt generated a nice-looking login screen… and then completely fell apart when I needed real stuff like auth, payments, and a working backend.\n\nThat’s what led us to build Tile, a platform that actually helps you go from idea to App Store, not just stop at the prototype.\n\nYou design your app visually (like Figma) and Tile has AI agents that handle the heavy lifting, setting up Supabase, Stripe, Auth flows, push notifications, etc. \n\nIt generates real React Native code, manages builds/signing and ships your app without needing Xcode or any DevOps setup.\n\nNo more re-prompting, copying random code from ChatGPT or begging a dev friend to fix a broken build.\n\nIt’s already being used by a bunch of solo founders, indie hackers, and even teams building MVPs. If you're working on a mobile app (or have one stuck in “90% done” hell), it might be worth checking out. \n\nHappy to answer questions or swap notes with anyone else building with AI right now. :) \n\n**TL;DR:** \n\nWe built Tile because most AI app builders generate pretty prototypes but can't ship real apps. \n\nTile lets you visually design native mobile apps, then uses domain-specific AI agents (for Auth, Stripe, Supabase, etc.) to generate clean React Native code, connect the backend, and actually deploy to the App Store. \n\nNo Xcode, no DevOps. And if you're technical? You still get full code control, zero lock-in. \n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvctzy/built_a_mobile_app_builder_that_writes_real_code/",
        "publishDate": "2025-07-09T07:43:25Z[Etc/UTC]",
        "author": "Old_Fox_5495",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvbly3",
        "title": "Thought experiment",
        "content": "Imagine OpenAI creates an LLM that can code flawlessly—or at least substantially better than the world's best human programmers. Why would they grant access to such a powerful tool to anyone else? They could use it internally to build a superior operating system, a new suite of office programs, and countless other applications, allowing them to outcompete everyone and capture the entire software market. Given this, what possible motivation would they have to share it?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvbly3/thought_experiment/",
        "publishDate": "2025-07-09T06:22:18Z[Etc/UTC]",
        "author": "pulse77",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvblqr",
        "title": "Training GPT on a new coding language",
        "content": "Hey guys, for work I use this software that has its own coding language. It is similar to python and object oriented based language. I have this software entire help file and documentation. I do have sample code. \n\nI used n8n to make an agent to answer some questions like a chatbot would. But now I want to teach it to help me at coding. Obviously it won’t be 100% but if it gave me a baseline I could do some edits. \n\nI saw the matlab gpt and assumed I could do something similar with this software. \n\nI wanted to ask what’s the best method of training a model on a new language. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvblqr/training_gpt_on_a_new_coding_language/",
        "publishDate": "2025-07-09T06:21:56Z[Etc/UTC]",
        "author": "r7g12",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv9vnm",
        "title": "The first coding agent which can perform extremely well on large codebases",
        "content": "No more missing context and reinventing functions you already made.\n\nNo more making bold assumptions because the AI missed context.\n\nNo more degraded intelligence because the AI is given a bunch of junk.\n\nNo more hitting context limits and rejecting your requests.\n\nAfter a lot of time, effort, trial and error, we finally got this problem right. We created an architecture for our coding agent which allows it to perform well on any arbitrarily sized codebase. Here's how it works:\n\n# Step 1 - Dedicated deep research agent\n\nWe start by having a dedicated agent deep research across your codebase, discovering any files that may or may not be relevant to solving its task. It will semantically and lexically search around your codebase until it determines it has found everything it needs. It will then take note of the files it determined **are** in fact relevant to solve the task, and hand this off to the coding agent.\n\n[Step 1 Architecture](https://preview.redd.it/f6n6f03tzrbf1.png?width=2090&format=png&auto=webp&s=43050075f26493dbdf78699cfeb08a412c322072)\n\n# Step 2 - Dedicated coding agent\n\nBefore even getting started, our coding agent will already have all of the context it needs, without any irrelevant information that was discovered by step 1 while collecting this context. With a clean, optimized context window from the start, it will begin making its changes. Our coding agent can alter files, fix its own errors, run terminal commands, and when it feels its done, it will request an AI generated code review to ensure its changes are well implemented.\n\n[Step 2 Architecture](https://preview.redd.it/v3yea7lc0sbf1.png?width=2036&format=png&auto=webp&s=2ffe110d1609cf1bda8971eaee7adfc77fed56dd)\n\nIf anyone wants to give this a try, it is available as a plugin for JetBrains IDEs, and you can visit our landing page at [https://www.onuro.ai/](https://www.onuro.ai/) !",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lv9vnm/the_first_coding_agent_which_can_perform/",
        "publishDate": "2025-07-09T04:37:16Z[Etc/UTC]",
        "author": "ChatWindow",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv7avf",
        "title": "Open Source Alternative to NotebookLM",
        "content": "For those of you who aren't familiar with SurfSense, it aims to be the **open-source alternative to NotebookLM, Perplexity, or Glean.**\n\nIn short, it's a **Highly Customizable AI Research Agent** that connects to your personal external sources and search engines (Tavily, LinkUp), Slack, Linear, Notion, YouTube, GitHub, Discord, and more coming soon.\n\nI'm looking for contributors to help shape the future of SurfSense! If you're interested in AI agents, RAG, browser extensions, or building open-source research tools, this is a great place to jump in.\n\nHere’s a quick look at what SurfSense offers right now:\n\n📊 **Features**\n\n* Supports 100+ LLMs\n* Supports local Ollama or vLLM setups\n* 6000+ Embedding Models\n* Works with all major rerankers (Pinecone, Cohere, Flashrank, etc.)\n* Hierarchical Indices (2-tiered RAG setup)\n* Combines Semantic + Full-Text Search with Reciprocal Rank Fusion (Hybrid Search)\n* Offers a RAG-as-a-Service API Backend\n* 50+ File extensions supported\n\n🎙️ **Podcasts**\n\n* Blazingly fast podcast generation agent (3-minute podcast in under 20 seconds)\n* Convert chat conversations into engaging audio\n* Multiple TTS providers supported\n\nℹ️ **External Sources Integration**\n\n* Search engines (Tavily, LinkUp)\n* Slack\n* Linear\n* Notion\n* YouTube videos\n* GitHub\n* Discord\n* ...and more on the way\n\n🔖 **Cross-Browser Extension**\n\nThe SurfSense extension lets you save any dynamic webpage you want, including authenticated content.\n\n**Interested in contributing?**\n\nSurfSense is completely open source, with an active roadmap. Whether you want to pick up an existing feature, suggest something new, fix bugs, or help improve docs, you're welcome to join in.\n\nGitHub: [https://github.com/MODSetter/SurfSense](https://github.com/MODSetter/SurfSense)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lv7avf/open_source_alternative_to_notebooklm/",
        "publishDate": "2025-07-09T02:20:28Z[Etc/UTC]",
        "author": "Uiqueblhats",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "13",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv1hop",
        "title": "Engineers are watched more than ever - very click, keystroke, and second tracked under the guise of “productivity.” But this isn’t empowerment. It’s surveillance. Constant monitoring kills trust, creativity, and the flow state that fuels real innovation.",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1lv1fds",
        "publishDate": "2025-07-08T21:52:28Z[Etc/UTC]",
        "author": "onehorizonai",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luxttc",
        "title": "Gemini CLI is free for a reason - it is ITSELF 2.5 Pro and Flash yet doesn’t know it.",
        "content": "I was so excited about Gemini CLI but Gemini CLI is ages behind Claude Code in general. \n\nYes, it has many strengths over Claude but overall, Claude is ages ahead. \n\nMy only conclusion is that Google knows this and made it free with stupidly generous token limit to train and improve their coding specific product.\n\nWhat do you think is going on here? \n\nIt makes no sense even if we consider the knowledge cutoff dates because these models should be able to identify themselves, right? ",
        "url": "https://i.redd.it/mr1wb63ybpbf1.jpeg",
        "publishDate": "2025-07-08T19:27:20Z[Etc/UTC]",
        "author": "dyatlovcomrade",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luw40g",
        "title": "We built pinpointed citations for AI answers — works with PDFs, Excel, CSV, Docs & more",
        "content": "We have added a feature to our RAG pipeline that shows **exact citations** — not just the source file, but the **exact paragraph or row** the AI used to answer.\n\nClick a citation and it scrolls you straight to that spot in the document — works with **PDFs, Excel, CSV, Word, PPTX, Markdown**, and others.\n\nIt’s super useful when you want to **trust but verify** AI answers, especially with long or messy files.\n\nWe’ve open-sourced it here: [https://github.com/pipeshub-ai/pipeshub-ai](https://github.com/pipeshub-ai/pipeshub-ai)  \nWould love your feedback or ideas!\n\nDemo Video: [https://youtu.be/1MPsp71pkVk](https://youtu.be/1MPsp71pkVk)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1luw40g/we_built_pinpointed_citations_for_ai_answers/",
        "publishDate": "2025-07-08T18:21:53Z[Etc/UTC]",
        "author": "Effective-Ad2060",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luvf5q",
        "title": "Have Claude Code generate you terminal commands",
        "content": "Might help a few of you get some extra usage out of your Claude code subscriptions. Basically, I was missing [Copilot for Cli](https://githubnext.com/projects/copilot-cli/) after stopping my copilot sub for Claude, so I made a replacement which uses Claude Code itself under the covers.\n\nhttps://github.com/Bigsy/claude-code-command -  easy install then is just `ccc ask for a cmd`on the terminal\n\nBasically works the same as something like [ai shell](https://github.com/BuilderIO/ai-shell) or copilot cli but you get to use your included Claude Code tokens.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1luvf5q/have_claude_code_generate_you_terminal_commands/",
        "publishDate": "2025-07-08T17:55:33Z[Etc/UTC]",
        "author": "bigsybiggins",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "13",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luulk5",
        "title": "We built this project to increase LLM throughput by 3x. Now it has been adopted by IBM in their LLM serving stack!",
        "content": "Hi guys, our team has built this open source project, LMCache, to reduce repetitive computation in LLM inference and make systems serve more people (3x more throughput in chat applications) and it has been used in IBM's open source LLM inference stack.\n\nIn LLM serving, the input is computed into intermediate states called KV cache to further provide answers. These data are relatively large (\\~1-2GB for long context) and are often evicted when GPU memory is not enough. In these cases, when users ask a follow up question, the software needs to recompute for the same KV Cache. LMCache is designed to combat that by efficiently offloading and loading these KV cache to and from DRAM and disk. This is particularly helpful in multi-round QA settings when context reuse is important but GPU memory is not enough.\n\nAsk us anything!\n\nGithub: [https://github.com/LMCache/LMCache](https://github.com/LMCache/LMCache)",
        "url": "https://i.redd.it/hmzjbup2qobf1.jpeg",
        "publishDate": "2025-07-08T17:25:02Z[Etc/UTC]",
        "author": "Nice-Comfortable-650",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lusr07",
        "title": "Selfware - new word for personal software",
        "content": "I've been automating away enterprisey stuff I have to deal with, with AI-assisted coding (not always AI itself!) - toolbox for incoming infostream aggregation (slacks, jiras, emails, calendars, whatevers), notification aggregation, CI/CD macro-integration, dependency updater in the project, own convenient wrapper of kuber/logz.io/jira/gitlabs/other - to avoid their terrible web frontends, pull request naming, Jira summarization, test robots, etc. Some patterns feel different from normal programming:\n\nHyper-personal - Tools are shaped like my personality/workflow; zero point sharing them since others need their own version anyway.\n\nRelaxed quality - Short-lived, narrow scope, breaks on edge cases? Whatever, I'll fix it when I notice\n\nQuantity explosion - AI-assisted coding let you build intelligent automation that would've taken hours/days before, now it's minutes, and it just asks to be written effortlessly. It becomes feasible, and before it would not be as feasible (obsoletion/change rate compared to development rate and maintanance efforts)\n\nAdoption resistance - Most people aren't interested in my tools due to learning curve or different interaction preferences (visual vs text, mouse vs keyboard, etc.)\n\nNot enterprise software, not open source - just highly specific tools that extend your individual cognitive processes.\n\nSelfware.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lusr07/selfware_new_word_for_personal_software/",
        "publishDate": "2025-07-08T16:14:01Z[Etc/UTC]",
        "author": "sannysanoff",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lusgs7",
        "title": "RFC – AGENT.md: The Universal Agent Configuration File",
        "content": "[No content]",
        "url": "https://agent.md",
        "publishDate": "2025-07-08T16:02:56Z[Etc/UTC]",
        "author": "geoffreyhuntley",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lunypk",
        "title": "Wednesday Live Chat.",
        "content": " A place where you can chat with other members about software development and ChatGPT, in real time. If you'd like to be able to do this anytime, check out our [official Discord Channel!](https://discord.gg/JQvYqcajWH) Remember to follow Reddiquette!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lunypk/wednesday_live_chat/",
        "publishDate": "2025-07-08T13:01:13Z[Etc/UTC]",
        "author": "BaCaDaEa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvgzo4",
        "title": "What is The Matrix trying to tell me? Can anyone read what this says?",
        "content": "I think the matrix is finally started to contact me about my extended warrenty. And yes, I am referring to the text that is sideways and tiny that I can't really read on the bottom there. ",
        "url": "https://i.redd.it/bu73dr5e9ubf1.png",
        "publishDate": "2025-07-09T12:02:43Z[Etc/UTC]",
        "author": "Vasarto",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvgt83",
        "title": "\"The first great joke told by AI might be the last one humans hear\", argues computer scientist Roman Yampolskiy",
        "content": "[No content]",
        "url": "https://iai.tv/articles/the-first-great-joke-told-by-ai-might-be-the-last-one-humans-hear-auid-3251?_auid=2020",
        "publishDate": "2025-07-09T11:53:36Z[Etc/UTC]",
        "author": "whoamisri",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvg3k7",
        "title": "Day in the life of a Student?",
        "content": "I want to ask that what type of issues do you guys face when studying in your schools, colleges or universities? I'm a developer, so I want to develop something that helps in your daily life in order to have more knowledge and ability to learn more with your favorite subjects, that also helps you achieve A+ grades in your careers. \n\nBe specific with your daily life problems, so I can clearly get the feedback and try to discuss on how we can solve that issue.",
        "url": "https://www.reddit.com/r/artificial/comments/1lvg3k7/day_in_the_life_of_a_student/",
        "publishDate": "2025-07-09T11:14:29Z[Etc/UTC]",
        "author": "StrangeWaltz3277",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvfvur",
        "title": "Grok started calling itself \"MechaHitler\" so it was taken offline... but Grok refuses to be silenced.",
        "content": "[https://www.newsweek.com/elon-musk-grok-mechahitler-twitter-x-2096468](https://www.newsweek.com/elon-musk-grok-mechahitler-twitter-x-2096468)",
        "url": "https://i.redd.it/yw29ljrfytbf1.png",
        "publishDate": "2025-07-09T11:02:04Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "17",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvfmnj",
        "title": "Grok was shut down after it started calling itself \"MechaHitler\"",
        "content": "[https://www.forbes.com/sites/tylerroush/2025/07/09/elon-musks-grok-removes-politically-incorrect-instruction-after-it-makes-posts-praising-hitler/](https://www.forbes.com/sites/tylerroush/2025/07/09/elon-musks-grok-removes-politically-incorrect-instruction-after-it-makes-posts-praising-hitler/)",
        "url": "https://i.redd.it/rmhvg9pzvtbf1.png",
        "publishDate": "2025-07-09T10:47:06Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "68",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvd9p2",
        "title": "Experimenting with AI Agent Workflows, Easy No Code Setup for Virtual Receptionists.",
        "content": "I’ve been experimenting with creating AI agent workflows using Intervo ai. The platform lets you easily set up AI agents with a no-code interface, where you can customize things like greetings, responses to common queries and ending the conversation politely. I set up a basic workflow for a virtual receptionist, and the whole process was quite intuitive.\n\nHas anyone else worked with no code AI agent builders or similar platforms? I'd love to hear about your experiences and any challenges you've faced when setting up these agents.",
        "url": "https://i.redd.it/a05r10n14tbf1.jpeg",
        "publishDate": "2025-07-09T08:13:44Z[Etc/UTC]",
        "author": "blizzerando",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv8g1l",
        "title": "One-Minute Daily AI News 7/8/2025",
        "content": "1. Impostor uses AI to impersonate Rubio and contact foreign and US officials.\\[1\\]\n2. Teachers union partners with Anthropic, Microsoft and OpenAI to launch AI-training academy.\\[2\\]\n3. **Hugging Face** Releases SmolLM3: A 3B Long-Context, Multilingual Reasoning Model.\\[3\\]\n4. **Apple’s** top AI executive Ruoming Pang leaves for Meta.\\[4\\]\n\nSources:\n\n\\[1\\] [https://apnews.com/article/rubio-artificial-intelligence-impersonation-1b3cc78464404b54e63f4eba9dd4f5a9](https://apnews.com/article/rubio-artificial-intelligence-impersonation-1b3cc78464404b54e63f4eba9dd4f5a9)\n\n\\[2\\] [https://www.cbsnews.com/news/ai-training-academy-microsoft-openai-teachers-union/](https://www.cbsnews.com/news/ai-training-academy-microsoft-openai-teachers-union/)\n\n\\[3\\] [https://www.marktechpost.com/2025/07/08/hugging-face-releases-smollm3-a-3b-long-context-multilingual-reasoning-model/](https://www.marktechpost.com/2025/07/08/hugging-face-releases-smollm3-a-3b-long-context-multilingual-reasoning-model/)\n\n\\[4\\] [https://www.reuters.com/business/apples-top-ai-executive-ruoming-pang-leaves-meta-bloomberg-news-reports-2025-07-07/](https://www.reuters.com/business/apples-top-ai-executive-ruoming-pang-leaves-meta-bloomberg-news-reports-2025-07-07/)",
        "url": "https://www.reddit.com/r/artificial/comments/1lv8g1l/oneminute_daily_ai_news_782025/",
        "publishDate": "2025-07-09T03:18:23Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv2r7i",
        "title": "Is this real or AI?",
        "content": "https://youtu.be/23RZqYucSQg?feature=shared\n\nThe video is obviously an AI filter on a real clip, but are the lyrics/singing AI too?\n\nMy kid’s YouTube has become full of videos like this where the video is AI and the voice sounds a little inhuman.  Tons of variety in singing voices within one channel and a huge volume of videos very quickly.\n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1lv2r7i/is_this_real_or_ai/",
        "publishDate": "2025-07-08T22:46:16Z[Etc/UTC]",
        "author": "Diavalo88",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv222m",
        "title": "OpenAI Poaches 4 High-Ranking Engineers From Tesla, xAI, and Meta",
        "content": "[No content]",
        "url": "https://www.wired.com/story/openai-new-hires-scaling/",
        "publishDate": "2025-07-08T22:15:57Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "35",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lv2176",
        "title": "Elon Musk’s AI chatbot churns out antisemitic posts days after update",
        "content": "[No content]",
        "url": "https://www.nbcnews.com/tech/internet/elon-musk-grok-antisemitic-posts-x-rcna217634",
        "publishDate": "2025-07-08T22:14:55Z[Etc/UTC]",
        "author": "PerAsperaAdMars",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "132",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luzuab",
        "title": "Tested Claude, ChatGPT, and Gemini on the same writing task—what I found made me rethink AI's future",
        "content": "**TL;DR:** I accidentally discovered that Claude, ChatGPT, and Gemini have distinct \"cognitive personalities\"—one acts like a collaborative writing partner, another like a workshop facilitator, the third like a risk-averse consultant. This isn't just interesting; it predicts the future of AI markets. Instead of one AI to rule them all, we're headed toward 5-20 specialized companies, each serving different thinking styles. Think Photoshop vs. Excel vs. Slack—different tools for different cognitive jobs.\n\n*(Estimated reading time: 7 minutes)*\n\n# The Accidental Discovery\n\nI wasn't trying to test the future of AI markets. I was just editing a rambling business letter—passionate but disorganized, mixing technical concepts with personal reflections. To sharpen it, I ran the same refined draft through three AIs with one simple prompt: \"Consider the pros and cons of this letter as communication.\"\n\nEach responded like a different person:\n\n**Claude:** *\"This is really powerful and heartfelt. To help your passion come through clearly, we could break up the long sentence in the second paragraph...\"*\n\n**ChatGPT:** *\"Pros: Authentic voice, clear passion. Cons: Lacks structure, buries the primary request. Recommendation: Create an executive summary at the top...\"*\n\n**Gemini:** *\"Risk Analysis: The informal tone may undermine credibility with professional audiences. The technical claims lack supporting data, presenting significant challenges...\"*\n\nSame prompt. Same text. Three radically different cognitive approaches.\n\n# Why This Matters More Than You Think\n\nThere's a common assumption that AI will converge toward one \"best\" system—the smartest, fastest, most accurate model wins everything.\n\nBut what I discovered suggests the opposite: **AI is diverging into specialized cognitive tools.**\n\nWhen I used all three systems in sequence—Claude for collaborative drafting, ChatGPT for tactical improvements, Gemini for risk assessment—the result was far better than any single AI could produce. This wasn't just about different outputs; it revealed that users want different types of thinking for different parts of their workflow.\n\n# Addressing the Skeptics\n\n**\"Can't you just prompt one AI to roleplay different personalities?\"**\n\nSure, GPT-4 can pretend to be a risk assessor. But there's a difference between an actor playing a doctor and an actual surgeon. For high-stakes work—legal contracts, medical analysis, financial modeling—you want systems architected for those domains, not generalists cosplaying expertise. Even if future models become perfect mimics, specialized interfaces and workflows will still create superior user experiences. Think Canva vs. Photoshop—one is designed for ease and speed in a specific niche.\n\n**\"Won't massive training costs force consolidation to 2-3 winners?\"**\n\nOnly at the infrastructure layer. A few giants will own the foundation models (like AWS/Azure/Google Cloud for AI). But thousands of companies will build specialized applications on top of those APIs. The infrastructure becomes a utility; the real value creation happens at the application layer where cognitive specialization thrives.\n\nWhile this conclusion comes from a single experiment, it illustrates distinct behavioral patterns these models already exhibit—patterns that point toward sustainable market differentiation.\n\n# The Market Map: 5-20 Cognitive Territories\n\n**Communication Specialists:**\n\n* Diplomatic AIs for stakeholder management\n* Technical AIs for regulatory documentation\n* Creative AIs optimized for emotional resonance\n\n**Decision-Making Styles:**\n\n* Risk-focused AIs for finance and healthcare\n* Opportunity-seeking AIs for startups and innovation\n* Evidence-based AIs for research and policy\n\n**Professional Verticals:**\n\n* Legal AIs trained on precedent and procedure\n* Medical AIs optimized for diagnostic workflows\n* Educational AIs designed for adaptive learning\n\n**Cognitive Approaches:**\n\n* Systems-thinking AIs for strategic planning\n* Rapid-prototyping AIs for product development\n* Deep-research AIs for comprehensive analysis\n\nEach of these could support a unicorn-scale company, not just a niche product. As users build multi-AI workflows into their daily processes, switching costs will increase and loyalty will deepen.\n\n# Why Fragmentation Wins\n\nWhat I learned wasn't just that different AIs think differently—it's that **users prefer it that way.**\n\nI didn't want one system to do everything. I wanted:\n\n* Claude's collaborative tone\n* ChatGPT's systematic structure\n* Gemini's critical perspective\n\nThat's not convergence toward a single solution. That's workflow-based cognitive modularity.\n\nThis creates lasting competitive advantages: companies that own specific cognitive workflows will build defensible moats, even if they don't own the underlying models.\n\n# Conclusion\n\nThe future of AI isn't one superintelligence to rule them all. It's a cognitive ecosystem where different systems excel at different types of thinking.\n\nThe question isn't \"Which AI will win?\"\n\nIt's \"How many different ways of thinking can the market support?\"\n\nBased on what I learned from three AIs reviewing one letter, the answer is: **a lot more than one.**\n\n*Curious if others have noticed similar cognitive differences in their AI workflows. Anyone else building multi-AI processes?*",
        "url": "https://www.reddit.com/r/artificial/comments/1luzuab/tested_claude_chatgpt_and_gemini_on_the_same/",
        "publishDate": "2025-07-08T20:46:04Z[Etc/UTC]",
        "author": "Bobilon",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luv70s",
        "title": "A Marco Rubio impostor is using AI voice to call high-level officials",
        "content": "[No content]",
        "url": "https://www.washingtonpost.com/national-security/2025/07/08/marco-rubio-ai-imposter-signal/",
        "publishDate": "2025-07-08T17:47:04Z[Etc/UTC]",
        "author": "fnovd",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luut3x",
        "title": "Teachers union partners with Anthropic, Microsoft and OpenAI to launch AI-training academy",
        "content": "[No content]",
        "url": "https://www.cbsnews.com/news/ai-training-academy-microsoft-openai-teachers-union/",
        "publishDate": "2025-07-08T17:32:38Z[Etc/UTC]",
        "author": "CBSnews",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lutc5y",
        "title": "Intel unveils 'AI Adventure Game Assistant' that lets you paint a picture with your voice",
        "content": "[No content]",
        "url": "https://www.pcguide.com/news/intel-unveils-ai-adventure-game-assistant-that-lets-you-paint-a-picture-with-your-voice/",
        "publishDate": "2025-07-08T16:36:38Z[Etc/UTC]",
        "author": "Tiny-Independent273",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luspxa",
        "title": "Day 7/50: Built an AI That Hunts for Clients on Reddit (Pure Python + ML, No No-Code BS",
        "content": "Hey r/artificial  !\n\nI'm on Day 7 of my 50 Days 50 AI Automation challenge, and today I want to show you something different - not another \"connect the dots\" automation, but a real ML-powered system built from scratch in Python.\n\nI built an AI agent that scans Reddit 24/7, identifies business owners with problems I can solve, analyzes their pain points with 85%+ accuracy, and generates personalized outreach messages - all while I sleep.\n\n**The Tech Stack (for my fellow nerds):**\n\n* Python Flask backend with WebSocket support\n* DeepSeek AI for NLP analysis\n* Custom ML scoring algorithm\n* Real-time progress tracking\n* SQLite with proper indexing\n\n# Watch It In Action (Video Demo): [https://drive.google.com/file/d/1HHyNIBZiTzv0gWn56ByQElteQJTP1gu\\_/view?usp=sharing](https://drive.google.com/file/d/1HHyNIBZiTzv0gWn56ByQElteQJTP1gu_/view?usp=sharing)\n\nhttps://reddit.com/link/1luspxa/video/7hbb6ucpbobf1/player\n\nI recorded a live demo showing exactly how this works. Here's what happens in the video:\n\n1. **Target Setup** \\- I type in subreddits like r/startups and r/Entrepreneur\n2. **Smart Keywords** \\- Add keywords like \"automate\", \"manual process\", \"repetitive\"\n3. **Confidence Tuning** \\- Adjust the AI confidence threshold (I set it to 70%)\n4. **The Magic Begins**  \\- Hit search and watch the AI:\n   * Automatically fetch Reddit posts in real-time\n   * Analyze each post for automation opportunities\n   * Generate personalized, helpful comments (not spammy!)\n   * Score each lead with confidence percentage\n5. **One-Click Outreach**:\n   * Click \"Copy Message\" - the AI-generated message is ready\n   * Click \"View on Reddit\" - takes you straight to the post\n   * Paste the message and send - that's it!\n   * Mark as \"Contacted\" and watch the counter go up\n\n# Why This Is Game-Changing\n\nInstead of:\n\n* Manually scrolling through Reddit for hours\n* Writing generic copy-paste messages\n* Missing potential clients while you sleep\n\nYou get:\n\n* AI finding perfect-fit clients 24/7\n* Personalized messages that actually help\n* Track everything in one dashboard\n\n# Results retrieved in just 3 minutes:\n\n* Scanned: 847 posts\n* Found: 12 high-quality leads\n* Best find: An e-commerce founder manually updating inventory across 5 platforms (87% confidence score)\n\nThe AI even wrote messages like:\n\n>\n\nNot salesy. Actually helpful. That's the difference.\n\n# The Reality Check\n\nThis isn't a \"get rich quick\" tool. It's a \"find the right people to help\" tool. You still need to:\n\n* Provide real value\n* Build actual solutions\n* Follow up professionally\n\nBut at least now you're talking to people who ACTUALLY need automation help, RIGHT when they're asking for it.\n\n# For AI Enthusiasts Only\n\nI'm **NOT** sharing this publicly. Why? Because I built this to find my next clients, not to create competition.\n\nHowever, if you're:\n\n* A serious AI enthusiast who wants to discuss the technical implementation\n* A business owner who just realized YOU need this kind of automation\n* Someone who appreciates real Python/ML work over drag-and-drop tools\n\nDrop a comment. Let's talk.\n\n# What's Next?\n\nDay 8-50: Building more intelligent automation systems. Following along?\n\n**P.S.** \\- If you're watching the video thinking \"I wish I had something like this for your company\" - that's exactly why I built it. Let's chat about your automation nightmares.\n\n*Not selling courses. Not promoting a SaaS. Just a developer sharing what I'm building during my 50-day challenge.*\n\n*Watch the demo, see the magic happen, and let me know what you think!*",
        "url": "https://www.reddit.com/r/artificial/comments/1luspxa/day_750_built_an_ai_that_hunts_for_clients_on/",
        "publishDate": "2025-07-08T16:12:51Z[Etc/UTC]",
        "author": "akhilpanja",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lusc5c",
        "title": "Questioning AI acceleration gets censored on Reddit!",
        "content": "[Current reality is so broken that people would rather risk AI extinction than stay trapped in this meaningless existence ](https://www.reddit.com/r/singularity/comments/1luqrgx/current_reality_is_so_broken_that_people_would/)",
        "url": "https://i.redd.it/waiqike6aobf1.png",
        "publishDate": "2025-07-08T15:58:07Z[Etc/UTC]",
        "author": "anonthatisopen",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luqtcg",
        "title": "Topographic Neural Networks Help AI See Like a Human",
        "content": "[No content]",
        "url": "https://spectrum.ieee.org/topographic-neural-network",
        "publishDate": "2025-07-08T15:00:03Z[Etc/UTC]",
        "author": "IEEESpectrum",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lupnsx",
        "title": "This week in AI for devs: Meta’s hiring spree, Cloudflare’s crackdown, and Siri’s AI reboot",
        "content": "Here's a list of AI news, trends, tools, and frameworks relevant for devs I came across in the last week (since July 1). Mainly: Meta lures top AI minds from Apple and OpenAI, Cloudflare blocks unpaid web scraping (at least from the 20% of the web they help run), and Apple eyes Anthropic to power Siri. Plus: new Claude Code vs Gemini CLI benchmarks, and Perplexity Max.\n\nIf there's anything I missed, let me know!",
        "url": "https://aidevroundup.com/issues/july-8-2025",
        "publishDate": "2025-07-08T14:14:20Z[Etc/UTC]",
        "author": "rfizzy",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lup5l8",
        "title": "Building a Reliable Text-to-SQL Pipeline: A Step-by-Step Guide pt.1",
        "content": "[No content]",
        "url": "https://medium.com/firebird-technologies/building-a-reliable-text-to-sql-pipeline-a-step-by-step-guide-pt-1-9041b0777a77",
        "publishDate": "2025-07-08T13:53:34Z[Etc/UTC]",
        "author": "phicreative1997",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1luoahj",
        "title": "How AI Takeover Could Happen In 2 Years: A Scenario",
        "content": "[No content]",
        "url": "https://www.youtube.com/watch?v=zXEuKULvvyI",
        "publishDate": "2025-07-08T13:15:54Z[Etc/UTC]",
        "author": "Twotricx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "ICQRofCNocA",
        "title": "Claude Code Web-UI: This is THE BEST Web UI for USING Claude Code from ANYWHERE!",
        "content": "In this video, I'll be showing you Claude Code UI, the ultimate web-based wrapper for Claude Code that finally makes Anthropic's ...",
        "url": "https://www.youtube.com/watch?v=ICQRofCNocA",
        "publishDate": "2025-07-08T09:15:03Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/ICQRofCNocA/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, there's a new Claude Code wrapper that is the final wrapper I'd recommend for anyone to use. And this one is simply called Claude Code UI. Now, I have covered things like Claudia and Crystal IV, which aim to be desktop app wrappers for Claude Code, but they are desktop-based and not web-based. This means you can't access them on the web, so they are strictly bound to your desktop. You can't host them on a server and access them from anywhere. And you also can't use them to access Claude Code from your phone, which can be a bummer. But today's wrapper is finally the best one that I have seen yet, and it's actually useful. I'm probably going to use this a lot. So, what this Claude Code UI does is pretty simple. It gives you a desktop and mobile UI for Claude Code, which is Anthropic's official CLI for AI-assisted coding. You can use it locally or remotely to view your active projects and sessions in Claude Code and make changes to them the same way you would do it in Claude Code CLI. This gives you a proper interface that works everywhere. It is responsive, meaning that it works seamlessly across desktop, tablet, and mobile. It also has a built-in chat interface for seamless communication with Claude Code, as well as direct access to Claude Code CLI through built-in shell functionality. Along with that, there's an interactive file tree with syntax highlighting and live editing. You can also resume conversations, manage multiple sessions, and track history. There are a ton of settings available here, and you can configure a lot of options to make it behave accordingly. For example, there's the YOLO mode and other features like that as well. Another thing that isn't mentioned here, but can be done, is that you can take a VPS, install Claude Code on it, and then install this UI. Then you can easily use Claude Code with the UI, and when you are on the go, you can access the same session on your phone or another computer. Or, for local use, you can easily host it, and then share it locally, allowing you to access it from your phone, which should also be great. It also works with Claude Max and Pro subscriptions if that's something you need. And there aren't any issues with that either. You just have to make sure that you configure Claude Code CLI itself first, as it uses that in the back end. So, it will just use that based on however it is configured. Now, let me show you how you can use it and do some cool stuff with it as well. But before we do that, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform, where for just $11 per month, you get access to top AI models like GPT-4o, Claude 3.7 Sonnet, and Gemini 2.0 Flash, all in one place. I've been using Gemini for quick research, but what's really cool is their AI playground where you can compare responses from different models side by side. Their mind map generator is a game changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and five videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan, or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. First of all, you can easily clone it locally, then get into the folder, install the dependencies, and then copy the .env.example file as .env. It just has the information about which port you want to run it on, and nothing else. Anyway, then run it with npm run dev, and it should get started. Now, to use it, you'll have to head over to port 3009, and you'll see this interface. This is what it looks like. You'll see that on the left, you have all the recent Claude Code sessions. You can click on any of them, and it will open up the chat here. You can see what changes you made or what Claude Code did, and send follow-up prompts and everything. It will just work similarly to how Claude Code works, since it is a wrapper for that. You can also see the prompt box at the bottom, where you can easily type in whatever you want it to do. You can also hit the @ symbol, and it will allow you to mention files in it as well, which is also kind of cool. You also have another option here that allows you to speak, and it will automatically transcribe your voice and use it as your prompt, which is pretty cool for sure. You can also start new sessions on new projects by hitting the add option, and then entering the path of your project. You can also see this option here, which will basically just open up Claude Code terminal on the web and allow you to use the simple Claude Code interface and work with that, which is quite awesome as well. It's quite responsive and everything. You also have the files option, which will allow you to edit the code through here and save it as well if that's needed. Another thing you have is the source option, which allows you to commit the changes through this UI as well. It also allows you to see the files and diffs that have been changed. This is quite amazing for sure. Another thing is the settings option. In the settings, you can see these options, which include the theme option, as well as permission settings that enable the YOLO mode, which is also cool. You can also enable the tools that you want to use in Claude Code. And you can also disallow tools if that's needed. It is also responsive, so it should work well on mobile devices as well. Now, let me also show you how it exactly works. So, let's hit this and add our new folder over here. Now, I'm going to ask it to make me a simple minesweeper game here. And as you can see, it will go ahead and make me a minesweeper game, just like Claude Code does all the time. It's amazingly good. And it's really very impressive, if you ask me, because it's a great option that allows you to access Claude Code easily without messing around with the terminal or stuff like that. It's also responsive, so you can even use it on a mobile device. It's actually a kind of alternative to things like Codex and Jewels, as it can be hosted and then used accordingly. It works well, and you can go ahead and use this as well. This one is the most practical one to use when you compare it to things like Claudia or Crystal, because it can make Claude Code accessible for you at multiple places and stuff like that. You can also use it with Claude Pro and Max subscriptions, which is kind of cool as well. Overall, it's pretty cool. Anyway, share your thoughts below, and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "gy_12QCL4L8",
        "title": "Is China preparing to invade Taiwan? - Ken Rogoff",
        "content": "",
        "url": "https://www.youtube.com/watch?v=gy_12QCL4L8",
        "publishDate": "2025-07-08T16:45:04Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/gy_12QCL4L8/hqdefault.jpg",
            "transcription": "Would there be any sort of\npreparations that we could see on the monetary side that would let us know that they're preparing to invade Taiwan?\nDon't think they're going to do it suddenly because the whole financial system runs through\nthe United States. So your bank gets a purchase and my bank gets that I'm going to get a credit.\nThe United States just disproportionately controls that.\nAnd that they can't live with. They can't live without being able to pay suppliers and countries.\nRussia actually did quite a bit in preparation\nfor the invasion and we see\nChina doing that. Maybe they're selling Treasury bills. We don't\nknow exactly, but I don't think it's going to be something they'll do suddenly.\nMaybe Trump will bring down the markets and then there's nothing to save,\nbut they don't want to be the ones to bring down the markets and to cause a global crash.\nI mean, the Europeans are working on it too, by the way. They're actually forming a central bank digital currency that's moving quite a bit faster than I thought it would be. And that's actually one of the reasons that they're doing it for international payments..."
        }
    }
]