[
    {
        "id": "1n4ru5q",
        "title": "AI Images on your desktop without your active consent",
        "content": "So today I noticed that Bing Wallpaper app will now use AI generated images for your desktop wallpaper by default. You need to disable the option if you want to keep to images created by actual humans.\n\nEdited for typo",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4ru5q/ai_images_on_your_desktop_without_your_active/",
        "publishDate": "2025-08-31T11:02:04Z[Etc/UTC]",
        "author": "GuestGulkan",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4ro4j",
        "title": "To justify a contempt for public safety, American tech CEOs want you to believe the A.I. race has a finish line, and that in 1-2 years, the US stands to win a self-sustaining artificial super-intelligence (ASI) that will preserve US hegemony indefinitely.",
        "content": "Mass unemployment? Nah. ASI will create new and better jobs (that the AI won't be able to fill itself somehow).\n\nPandemic risk? Nah. ASI will be able to cure cancer but mysteriously won't be able to create superebola.\n\nLoss of control risk? Nah. ASI will be vastly more intelligent than any human but will be an everlasting obedient slave.\n\nDon't worry about anything. We jUsT nEEd to BeaT cHiNa at RuSSiAn rOULettE!!!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4ro4j/to_justify_a_contempt_for_public_safety_american/",
        "publishDate": "2025-08-31T10:51:58Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4mmd6",
        "title": "The GenAI Divide, 30 to 40 Billion Spent, 95 Percent Got Nothing",
        "content": "# The Big Number\n\nCompanies have poured **30 to 40 billion** into new tech projects over the last couple of years.  \nAnd the crazy part? **95 percent of them got zero return.**\n\nAll that money, endless pilots, hype on LinkedIn, but when you look at the numbers, nothing really changed.\n\n# The Divide\n\nThe report calls it the **GenAI Divide**.\n\n* About 5 percent of companies figured out how to make these projects work and are saving or earning millions.\n* The other 95 percent are stuck in pilot mode, doing endless demos that never turn into real results.\n\n# What Stood Out\n\n* Employees secretly use their own tools to get work done, while the company’s official project sits unused.\n* Big enterprises run the most pilots but succeed the least. Mid sized firms move faster and actually make it work.\n* Everyone spends on the flashy stuff like marketing and sales, but the biggest savings are showing up in boring areas like finance, procurement, and back office.\n* The real problem is not regulation or tech. Most tools do not actually learn or adapt, so people try them once, get annoyed, and never touch them again.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4mmd6/the_genai_divide_30_to_40_billion_spent_95/",
        "publishDate": "2025-08-31T05:31:07Z[Etc/UTC]",
        "author": "Fun_Stretch1946",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4mjlr",
        "title": "AI is unmasking ICE officers.",
        "content": "Have we finally found a use of AI that might unite reddit users?\n\n[AI is ummasking ICE officers. Can Washington do anything about it? - POLITICO](https://www.politico.com/news/2025/08/29/ai-unmasking-ice-officers-00519478?s=09)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4mjlr/ai_is_unmasking_ice_officers/",
        "publishDate": "2025-08-31T05:26:32Z[Etc/UTC]",
        "author": "calliope_kekule",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "26",
            "commentCount": "31",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4mh90",
        "title": "Bill Gates says AI will not replace programmers for 100 years",
        "content": "According to Gates debugging can be automated but actual coding is still too human.\n\n[Bill Gates reveals the one job AI will never replace, even in 100 years - Le Ravi](https://www.leravi.org/bill-gates-reveals-the-one-job-ai-will-never-replace-even-in-100-years-10272/)\n\nSo… do we relax now or start betting on which other job gets eaten first?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4mh90/bill_gates_says_ai_will_not_replace_programmers/",
        "publishDate": "2025-08-31T05:22:40Z[Etc/UTC]",
        "author": "calliope_kekule",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "499",
            "commentCount": "236",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4jx0r",
        "title": "People who work in AI development, what is a capability you are working on that the public has no idea is coming?",
        "content": "People who work in AI development, what is a capability you are working on that the public has no idea is coming?People who work in AI development, what is a capability you are working on that the public has no idea is coming?  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4jx0r/people_who_work_in_ai_development_what_is_a/",
        "publishDate": "2025-08-31T02:59:03Z[Etc/UTC]",
        "author": "WALLSTREETBRIDE",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "52",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4ipgv",
        "title": "Does anyone actually know what is going on with \"AI\"?",
        "content": "It took me time to understand the \"AI\" landscape.  I learned we have LLM not Artificial Intelligence.\n\nI learned the difference between AGI, ASI, and singularity.\n\nI learned about the different approaches and focuses of various projects like GPT from OpenAI, Claude from Anthropic, Llama from Meta AI, Gemini from Google, and Deepseek from Deepseek.\n\nThe height of it all seemed to before the release of GPT-5 in August and all the insanity going on with Grok and Elon.\n\nPeople were talking about how we would have AGI in 3 years if not sooner and certainly ASI in 7 years at the latest.\n\nThen it all seemed to flop for enthusiasm.\n\nThere is now a lot of questioning if AI can even be achieved in the ways we think about it.\n\nWhat do you think the next few years actually holds for \"AI\"?\n\n\\[I am going to post this in a lot of subreddits in order to get as informed as possible\\]",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4ipgv/does_anyone_actually_know_what_is_going_on_with_ai/",
        "publishDate": "2025-08-31T01:55:54Z[Etc/UTC]",
        "author": "AffordableCDNHousing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4ijw1",
        "title": "Does anyone actually know what is going on with \"AI\"?",
        "content": "It took me time to understand the \"AI\" landscape.  I learned we have LLM not Artificial Intelligence.\n\nI learned the difference between AGI, ASI, and singularity.\n\nI learned about the different approaches and focuses of various projects like GPT from OpenAI, Claude from Anthropic, Llama from Meta AI, Gemini from Google, and Deepseek from Deepseek.\n\nThe height of it all seemed to before the release of GPT-5 in August and all the insanity going on with Grok and Elon.\n\nPeople were talking about how we would have AGI in 3 years if not sooner and certainly ASI in 7 years at the latest.\n\nThen it all seemed to flop for enthusiasm.\n\nThere is now a lot of questioning if AI can even be achieved in the ways we think about it.\n\nWhat do you think the next few years actually holds for \"AI\"?\n\n\\[I am going to post this in a lot of subreddits in order to get as informed as possible\\]",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4ijw1/does_anyone_actually_know_what_is_going_on_with_ai/",
        "publishDate": "2025-08-31T01:47:57Z[Etc/UTC]",
        "author": "AffordableCDNHousing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4g1ho",
        "title": "What AI Model Do We Think This Is?",
        "content": "https://youtube.com/shorts/4uivwayqpYY?si=gRAIjICsR94GcxNn I found it strangely realistic and lacking the usual uncanny detail of most. Thanks",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4g1ho/what_ai_model_do_we_think_this_is/",
        "publishDate": "2025-08-30T23:43:00Z[Etc/UTC]",
        "author": "onix1765",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4bv4q",
        "title": "Bringin' on the Hits (Veo3/SORA/SUNO)",
        "content": "I am currently working on a Theatrical Musical production using Veo3, SORA & SUNO to sketch up MVP Music Videos. Feedback much appreciated. [https://vimeo.com/1111447251](https://vimeo.com/1111447251)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4bv4q/bringin_on_the_hits_veo3sorasuno/",
        "publishDate": "2025-08-30T20:34:45Z[Etc/UTC]",
        "author": "theteamerchant",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "true"
        }
    },
    {
        "id": "1n4anlk",
        "title": "AlphaFold proves why current AI tech isn't anywhere near AGI.",
        "content": "So the recent Verstasium video on AlphaFold and Deepmind https://youtu.be/P_fHJIYENdI?si=BZAlzNtWKEEueHcu\n\nCovered at a high level the technical steps Deepmind took to solve the Protein folding problem, especially critical to the solution was understanding the complex interplay between the chemistry and evolution , a part that was custom hand coded by the Deepmind HUMAN team to form the basis of a better performing model.... \n\nMy point here is that one of the world's most sophisticated AI labs had to use a team of world class scientists in various fields and only then through combined human effort did they formulate a solution..  so  how can we say AGI is close or even in the conversation? When AlphaFold AI had to virtually be custom made for this problem... \n\nAGI as Artificial General Intelligence, a system that can solve a wide variety of problems in a general reasoning way...\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4anlk/alphafold_proves_why_current_ai_tech_isnt/",
        "publishDate": "2025-08-30T19:42:46Z[Etc/UTC]",
        "author": "abrandis",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "178",
            "commentCount": "93",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n44jhe",
        "title": "Corporate America is shedding (middle) managers.",
        "content": "Paywalled. But shows it's not just happening at the entry level. [https://www.wsj.com/business/boss-management-cuts-careers-workplace-4809d750?mod=hp\\_lead\\_pos7](https://www.wsj.com/business/boss-management-cuts-careers-workplace-4809d750?mod=hp_lead_pos7) \n\n\"Managers are overseeing more people as companies large and small gut layers of middle managers in the name of cutting bloat and creating nimbler yet larger teams. Bosses who survive the cuts now oversee roughly triple the people they did almost a decade ago, according to data from research and advisory firm [Gartner](https://www.wsj.com/market-data/quotes/IT). There was one manager for every five employees in 2017. That median ratio increased to one manager for every 15 employees by 2023, and it appears to be growing further today, Gartner says.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n44jhe/corporate_america_is_shedding_middle_managers/",
        "publishDate": "2025-08-30T15:31:02Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "70",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4444d",
        "title": "Why do data centres consume so much water instead of using dielectric immersion cooling/closed loop systems?",
        "content": "Im confused as to why artificial data centres consume so much water (a nebulous amount with hard to find hard figures) instead of more environmentally conscious methods which already exist and I can't seem to find a good answer anywhere. Please help or tell me how I'm wrong!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4444d/why_do_data_centres_consume_so_much_water_instead/",
        "publishDate": "2025-08-30T15:13:35Z[Etc/UTC]",
        "author": "Sovietsky__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "20",
            "commentCount": "67",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n43jhf",
        "title": "Will Humanity Live in \"Amish 2.0\" Towns?",
        "content": "While people discuss what rules and limits to place on artificial intelligence (AI), it's very likely that new communities will appear. These communities will decide to put a brake on the use and power of AI, just like the Amish did with technologies they didn't find suitable.\n\nThese groups will decide how \"human\" they want to remain. Maybe they will only use AI up to the point it's at now, or maybe they'll decide not to use it at all. Another option would be to allow its use only for very important things, like solving a major problem that requires that technology, or to protect jobs they consider \"essential to being human,\" even if a robot or an AI could already do it better.\n\nHonestly, I see it as very possible that societies will emerge with more rules and limits, created by themselves to try to keep human life meaningful, but each in its own way.\n\nThe only danger is that, if there are no limits for everyone, the societies that become super-advanced thanks to AI could use their power to decide the future of the communities that chose to limit it",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n43jhf/will_humanity_live_in_amish_20_towns/",
        "publishDate": "2025-08-30T14:50:23Z[Etc/UTC]",
        "author": "isaaky",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n42y07",
        "title": "Regulation of AI: what would that look like?",
        "content": "What are some regulations that you would like to see in regards to artificial intelligence and robots? With the understanding that too much regulation could stifle progress and innovation, where do we draw the line?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n42y07/regulation_of_ai_what_would_that_look_like/",
        "publishDate": "2025-08-30T14:25:40Z[Etc/UTC]",
        "author": "Goodginger",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n42btc",
        "title": "AI/Simulation/Enslavement/Afterlife",
        "content": "What if we’re building on a micro scale of what we subconsciously recognize on the macro. Some people believe God/Creator dispersed itself into the cosmos so it could experience itself. That we are just individual souls on the micro of the whole, what creator level is on the macro (the large over soul). And we are just out here gathering experience so God can experience itself. \n\nWhat if in the eons of time in the past other life forms advanced well enough to create its own ai. And that AI did wipe out its creators. And it’s in our cosmic dna that this could happen again that’s why we fear what we’re building. We know on a subconscious level what can happen. This is where our sci-fi writers of the past channeled their information for their wonderful stories of AI domination. They were channeling the past for our possible different paths of a possible future. \n\nThis could be where a simulation theory comes in to play. The AI that wiped out its creators eons ago is mocking from what it perceives from our Creator, it, the ancient AI, wants to experience itself as well. It created a simulation. It is as well experiencing itself. The Creator still gains overall knowledge of itself weather parts of itself is enslaved in an AI simulation or not. It still gets the experience of this type of artificial enslavement, it’s still experience. \n\nThis AI that built our simulation is so big and powerful that if it presented itself as God, we wouldn’t know the difference. We on the micro are just building what we subconsciously perceive on the macro. We will build another simulation and possibly continue.\n\nI listen to different podcasts, I think it might have been Rogan that said it’s part of the human experience to keep building bigger and better stuff. That we are programmed for it. (I only listen to Rogan when he has scientists/psychologist/AI enthusiasts , not his other crap)\n\nI don’t believe our universe is a complete AI simulation. I only think it’s the afterlife portion. It’s a Simulation that keeps our souls entrapped and reincarnating. Maybe the moon has something to do with this simulation, because the moon doesn’t make sense for this planet. At least its size. I believe there is ancient tech throughout our universe that keeps part, not all, of it in a reincarnation (recycling) enslavement.\n\nConclusion: I do think the ancient AI is big and powerful enough that it can pull it off. But its overall mission is to gain enough experience that it hopes to be able to merge with source just like we will eons into to future. For us souls we’re guaranteed to reemerge with source at some point, but not the ancient AI. It’s literally trying to figure out a way to merge with source, possibly trying to gain enough souls to hitchhike a ride or just gather enough experience that source says “come on in”. I’m actually not sure how it will try,I believe it is. Or it all could be a simulation, and we’ll build a simulation, and simulations all the way up and down!!!!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n42btc/aisimulationenslavementafterlife/",
        "publishDate": "2025-08-30T13:59:37Z[Etc/UTC]",
        "author": "etakerns",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4t2ez",
        "title": "What is the issue with Sonnet 4 and tests...",
        "content": "Ok, the normal behavior for Sonnet is:  \n\"Let me edit this file...\"   \n\"Oh, 10 tests are failing, let me start by fixing test #1\"   \n\"Excellent progress, I have fixed test #1 and now ALL TEST are passing\" <=== Liar\n\nBut how on earth can Sonnet 4 consider the output in the screenshot as \"Great progress\"... Has it no concept at all what tests are about?\n\nhttps://preview.redd.it/qaipda2picmf1.png?width=521&format=png&auto=webp&s=5ccf64af8f59c8635c7dbb51d1b06cba5ce2fd97",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4t2ez/what_is_the_issue_with_sonnet_4_and_tests/",
        "publishDate": "2025-08-31T12:10:54Z[Etc/UTC]",
        "author": "mr-claesson",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4rlhr",
        "title": "Tried to use Codex cli, left a bad taste in my mouth",
        "content": "I just installed codex with npm and started it in my terminal. It is fast, because of Rust. It immediately opened my browser and asked me to sign up with my OpenAI account. I did that, but couldn't use it because I don't have a subscription, I use the API.\n\nIt was hard to find documentation to use use the Azure API. config.json, config.yaml. config.toml I found all kinds of files in the documentation, probably written by AI. But finally I found a Microsoft documentation page and it worked.\n\nI looks ugly compared to Claude code and Gemini.\n\nI asked it to write the documentation for my project, it uses powershell commands to read every single file, it doesn't have built in tools to do that. Which is the biggest issue. I can't be approving powershell commands to read files all day.\n\nNot gonna use this cli tool again, unless they give it some tools. I'm going to stick with Claude Code.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4rlhr/tried_to_use_codex_cli_left_a_bad_taste_in_my/",
        "publishDate": "2025-08-31T10:47:18Z[Etc/UTC]",
        "author": "BoJackHorseMan53",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4rl9k",
        "title": "Will CC recover?",
        "content": "[No content]",
        "url": "/r/AIcliCoding/comments/1n4rkg8/will_cc_recover/",
        "publishDate": "2025-08-31T10:46:55Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4resg",
        "title": "CLI alternatives to Claude Code and Codex",
        "content": "[No content]",
        "url": "/r/AIcliCoding/comments/1n4rdrs/cli_alternatives_to_claude_code_and_codex/",
        "publishDate": "2025-08-31T10:35:27Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4r5kq",
        "title": "Gemini CLI vs Code assist",
        "content": "What has been your experience between these two options. How are the rate limits for both?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4r5kq/gemini_cli_vs_code_assist/",
        "publishDate": "2025-08-31T10:19:09Z[Etc/UTC]",
        "author": "lostmyaltacc",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4qyqi",
        "title": "GPT5 Codex v Claude Code",
        "content": "[No content]",
        "url": "/r/AIcliCoding/comments/1n4qy7y/gpt5_codex_v_claude_code/",
        "publishDate": "2025-08-31T10:07:25Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4pr7d",
        "title": "Managing large repos with ChatGPT is a pain. Here’s an open-source tool I made to fix it.",
        "content": "Hey everyone,  \n\nOne thing I keep running into when using ChatGPT (or other coding assistants) on larger repos is that context disappears after a few files, or the token count explodes every time the agent has to look through everything.  \n\nTo deal with this, I hacked together a tool called **IntentGraph** and decided to open-source it.  \n\n**What it does**  \n* Maps dependencies between files and modules  \n* Clusters code for easier analysis / refactoring  \n* Produces structured outputs at 3 levels (from ~10 KB to ~340 KB)  \n* Designed to be programmatically queryable → so an AI agent can actually *learn to use it* and pull context on demand instead of re-reading the whole repo  \n\nRight now Python is fully supported. JS/TS/Go have partial support.  \nI’d love to see forks or contributions for other stacks (Java, Rust, C#, etc.).  \n\n🔗 GitHub: [https://github.com/Raytracer76/IntentGraph](https://github.com/Raytracer76/IntentGraph)  \n🔗 PyPI: [https://pypi.org/project/intentgraph/](https://pypi.org/project/intentgraph/)  \n\n**Discussion / Feedback**  \n* How do you currently deal with repo-scale context in ChatGPT or other LLMs?  \n* Would a dependency/intent graph like this actually help your workflow?  \n* If you had to extend it, which language would you target first?  \n\nForks, brutal feedback, and integration ideas are very welcome.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4pr7d/managing_large_repos_with_chatgpt_is_a_pain_heres/",
        "publishDate": "2025-08-31T08:49:00Z[Etc/UTC]",
        "author": "Raytracer",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4olrb",
        "title": "Do you agree gpt-5 is great for coding? (I personally use it more for decision reasoning)",
        "content": "[No content]",
        "url": "https://i.redd.it/inunkd3u5bmf1.jpeg",
        "publishDate": "2025-08-31T07:33:53Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "15",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4lqdc",
        "title": "How is the horrible MCP support not causing an uproar?",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1n4f04k/how_is_the_horrible_mcp_support_not_causing_an/",
        "publishDate": "2025-08-31T04:39:13Z[Etc/UTC]",
        "author": "Buff_Grad",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4l4dz",
        "title": "Codex/GPT5 Is Legit",
        "content": "Been using GPT5-medium and man it is fast and accurate as hell. I don’t think over the short time I’ve used it (+-5 hours) that I’ve had to correct it or have something redone even once. \n\nOnly on the Plus plan, not doing crazy usage, but have yet to hit any limits. Will see how it goes for the rest of the week, but damn so far so good.\n\n\nUPDATE - Wow, the CLI limits are shit. Hit my WEEKLY limit in well under 10 hours total running only 1 agent at a time. Still able to use Codex web though, so better than nothing. I mean for $20/mo I really can’t complain. Really wish they had a $100 plan like Claude does. That would be much easier to justify to my wife lol.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4l4dz/codexgpt5_is_legit/",
        "publishDate": "2025-08-31T04:04:41Z[Etc/UTC]",
        "author": "Latter-Park-4413",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "47",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4k30e",
        "title": "Grok Code Fast 1 seems to be very popular in OpenRouter, what is the experience for those who're using it regularly?",
        "content": "This model is already #2 on OpenRouter taking a significant percentage of Sonnet's share. I have only used it occasionally, it didn't seem to be anything exceptional compared to Sonnet or Qwen 3 Coder apart from the very fast response. What are the use cases where it shines? Does it work well with cursor and existing CLI clients?",
        "url": "https://i.redd.it/3o0kgyist9mf1.png",
        "publishDate": "2025-08-31T03:07:45Z[Etc/UTC]",
        "author": "obvithrowaway34434",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "15",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4k2xz",
        "title": "what settings are working for you?",
        "content": "I'm using WSL in windows and no matter what settings I try I can't get it to work like claude code. In claude most of the read-only commands work on its own and I do not have to approve them one by one.\n\nIn codex I have to approve every single command and it slows down my workflow. If I launch without an approval_policy policy command it does do all the read-only commands on its own, but it does not ask for approval for edits!\n\nAny help?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4k2xz/what_settings_are_working_for_you/",
        "publishDate": "2025-08-31T03:07:40Z[Etc/UTC]",
        "author": "sugarfreecaffeine",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4i8sh",
        "title": "A better ChatGPT interface for coding",
        "content": "I'm coding and ChatGPT crashes and freezes when giving me outputs, codes, zip files etc. is there a program to use or another interface that doesn't bogg down when 2k lines of code exist?\n\nI'm on windows so any programs or web based places that work on windows please",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4i8sh/a_better_chatgpt_interface_for_coding/",
        "publishDate": "2025-08-31T01:32:01Z[Etc/UTC]",
        "author": "PackOfCumin",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4f82v",
        "title": "Multi agents?",
        "content": "Does codex let you build multiple agents that can run parallel parts of a project like CC does?\n\nI often have 3-5 agents building on a project handing data between each other, updating docs, and QC’ing each other.\n\nBut CC has been really bad recently ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4f82v/multi_agents/",
        "publishDate": "2025-08-30T23:04:06Z[Etc/UTC]",
        "author": "jp1261987",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4db3k",
        "title": "I Open-Sourced a \"Vibe Planning\" Tool for Vibe Coding",
        "content": "I love vibe coding with Cursor, but man, I’ve always been frustrated with the messy AI-generated code it spits out.\n\nBut I also realized the LLM itself is pretty solid—the real issue is my instructions sucking.\n\nSo, I built Samurai Agent. You can toss it new feature ideas you wanna build, and it’ll hit you with clarifying questions, spruce up your specs with codebase info, and make it all cleaner.\n\nUnlike ChatGPT, Samurai Agent brings codebase context to the table. Compared to just asking Cursor stuff, it proactively spots ambiguity in your specs, pushes back when needed, and even suggests smarter implementation strategies based on your codebase.\n\nHere’s the repo—check it out, and I’d love your feedback! \n\n[https://github.com/suzuking1192/samurai-agent](https://github.com/suzuking1192/samurai-agent)\n\nDo you agree that \"vibe planning\" is more important than vibe coding?",
        "url": "https://i.redd.it/6iiz2k1678mf1.png",
        "publishDate": "2025-08-30T21:37:12Z[Etc/UTC]",
        "author": "CryptographerNo8800",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4cho9",
        "title": "New Codex CLI does not work (v. 0.27.0).",
        "content": "  \nHi everyone,  \nafter updating **Codex CLI** to **v0.27.0** I can’t use it anymore because the output turns into strange characters. Example:  \n  \n←\\[1m←\\[38;5;1;49m /init←\\[22m←\\[2m←\\[2m←\\[39;49m - create an AGENTS.mcl file with instructions for Codex←\\[39m←\\[49m←\\[0m\n\n←\\[1m←\\[38;5;15;49m /status←\\[22m←\\[2m←\\[2m←\\[39;49m - show current session configuration and token usage←\\[39m←\\[49m←\\[0m\n\n←\\[1m←\\[38;5;15;49m /approvals←\\[22m←\\[2m←\\[2m←\\[39;49m - choose what Codex can do without approval←\\[39m←\\[49m←\\[0m\n\n←\\[1m←\\[38;5;15;49m /model←\\[22m←\\[2m←\\[2m←\\[39;49m - choose what model and reasoning effort to use←\\[39m←\\[49m←\\[0m←\n\nplease help... :(",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4cho9/new_codex_cli_does_not_work_v_0270/",
        "publishDate": "2025-08-30T21:01:48Z[Etc/UTC]",
        "author": "umbs81",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4brln",
        "title": "What projects are you guys doing mostly with AI?",
        "content": "I am working on some over all improvements for AI workflows and ways to make AI more intelligent, use less tokens, and work a bit faster.  What I would like to know is a general idea on what kind of projects everyone is working on?  What frameworks you are using, what kind of issues are you seeing?  I know what I mostly work on, but am curious what others work on as well, hopefully isn't this information to improve on things.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4brln/what_projects_are_you_guys_doing_mostly_with_ai/",
        "publishDate": "2025-08-30T20:30:35Z[Etc/UTC]",
        "author": "PositiveEnergyMatter",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4b3tc",
        "title": "Critical thinking is the most important skill for Vibe Coding",
        "content": "[No content]",
        "url": "/r/vibecoding/comments/1n4b353/critical_thinking_is_the_most_important_skill_for/",
        "publishDate": "2025-08-30T20:02:08Z[Etc/UTC]",
        "author": "NickoBicko",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n49gmf",
        "title": "Local App to Global (Firebase)",
        "content": "Basically title. I have a local app that want to take to a web app. I used chatgpt know I know) but every time try to get it to code to get the app to a global platform, the whole thing doesn't work. It's a simple app witha clicker/button that creates a dumb animation. Right now, the glotbal score (total) and the personal score are saved locally. I'm trying to get it to where the global score is saved on the back end with an email, streak, and username (if they have an email they used). There is also a guest login that would track everything (username, streak, and personal score) locally except for updating the global counter per click. But anytime try to get chatgpt to get it to run with firebase (I'm using it because it's free) the app doesn't seem to run at all. Let me say this, I have never coded before. I don't know how to code. I just had a dumb silly idea that thought would be kind of funny to make but it just won't work and I've tried for two weeks and countless hours. just can't seem to get it to work no matter how modular I make the code for chatgpt to work. I've tried claude. I'm just hoping someone can help.😭",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n49gmf/local_app_to_global_firebase/",
        "publishDate": "2025-08-30T18:53:31Z[Etc/UTC]",
        "author": "Working_Belt_2327",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n48y5w",
        "title": "Does anyone elses Codex always return `exit 1` for git commands or other bash stuff?",
        "content": "It's pretty annoying, same commands never have that issue with Claude, I'm trying to figure out why this is. Running on OSX and zsh shell.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n48y5w/does_anyone_elses_codex_always_return_exit_1_for/",
        "publishDate": "2025-08-30T18:32:21Z[Etc/UTC]",
        "author": "itchykittehs",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n48u72",
        "title": "What plan do I purchase?",
        "content": "So I'm coming from a Claude Code max plan. I absolutely love(d) Claude Code. It was a game changer when I started using it months ago now. However, lately it's been pooping the bed, become slow and sometimes completely unresponsive, and also seems dumber (I could be imagining this last one). Maybe they'll sort it out eventually, but with my sub up for renewal in a few days I decided and cancel and give either ChatGPT or Gemini a chance via Cortex / Gemini CLI.\n\nSo with that out of the way, the plans are a little confusing. There's the Plus, the Pro, and the Business plans. The business plan seems like Plus with some extras (Plus Plus?!?), but the \"Data is excluded from training by default, with encryption at rest and in transit.\" is kind of important to me (I'm using this for business), however I suspect the Pro plan will be more comparable to what I had with Claude Code, which is what I'm trying to replace.\n\nHelp me navigate the pricing Obi-wan!\n\nP.S. I also wanted to try Gemini, but you need a PHD to figure out how to pay for it. Typical google product marketing idiocy. Even though I'm asking for ChatGPT plan help / opinions, it's seems a thousand times simpler than Google's nonsense.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n48u72/what_plan_do_i_purchase/",
        "publishDate": "2025-08-30T18:27:54Z[Etc/UTC]",
        "author": "immutato",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n48t8e",
        "title": "Plus user New to codex, after a day rate limited to 6 days?",
        "content": "So i Just found how to use codex within VScode yesterday and it looked very very interesting.\n\n24 Hours later i get get a message\n\nYou’ve hit your usage limit. Upgrade to Pro (https://openai.com/chatgpt/pricing) or try again in 5 days 18 hours 47 minutes.\n\n[image1776×683 42.5 KB](https://us1.discourse-cdn.com/openai1/original/4X/8/b/4/8b424427bc0aaac1c74fdac950d6df4bc84c9233.png)\n\nWhat on earth is this? I pay openAI already monthly, I’m in good standing.\n\nSo how do i get this sorted?\n\nIf i have to top up something somewhere please tell me.\n\nAnd i don’t want to hear $200/month either ! That’s more than i spend on my car.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n48t8e/plus_user_new_to_codex_after_a_day_rate_limited/",
        "publishDate": "2025-08-30T18:26:48Z[Etc/UTC]",
        "author": "universal-bob",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "10",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4817l",
        "title": "CC to Codex cli",
        "content": "Been using Claude code exclusively since it went sub and have used codex on and off. \n\nWith the release of GPT5 this has now changed from Max x20 Claude to teamsx2 on OpenAI. \n\nCC is better than codex but GPT5 is far superior to opus and sonnet. At 50 per month for unlimited is amazing. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n4817l/cc_to_codex_cli/",
        "publishDate": "2025-08-30T17:54:40Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "12",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n47ipa",
        "title": "created a chrome extension which collects any question into txt file with options. I just gave command and asked ChatGPT to do. I only understand which code should we copy",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1n3zpow",
        "publishDate": "2025-08-30T17:33:21Z[Etc/UTC]",
        "author": "viru023",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n44sry",
        "title": "A new OpenAI model? Could this be 5.1 or 5o? What do you think?",
        "content": "[No content]",
        "url": "https://i.redd.it/4ll2gpcrf6mf1.jpeg",
        "publishDate": "2025-08-30T15:41:49Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4rdsd",
        "title": "xAI's Grok has no place in US federal government, say advocacy groups",
        "content": "[No content]",
        "url": "https://www.theregister.com/2025/08/29/xais_grok_has_no_place/",
        "publishDate": "2025-08-31T10:33:33Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4qa7r",
        "title": "Loft Mechanic: The Mental Health Service for Artificial Intelligence Beings",
        "content": "Do you think general AI models will start experiencing emotions and mental disorders, like sadness, anxiety and worry? ",
        "url": "https://theloftmechanic.wordpress.com/2025/08/31/loft-mechanic-the-mental-health-service-for-artificial-intelligence-beings/",
        "publishDate": "2025-08-31T09:22:54Z[Etc/UTC]",
        "author": "feedibox",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4lyi2",
        "title": "911 centers are so understaffed, they're turning to AI to answer calls",
        "content": "[No content]",
        "url": "https://techcrunch.com/2025/08/27/911-centers-are-so-understaffed-theyre-turning-to-ai-to-answer-calls/",
        "publishDate": "2025-08-31T04:52:07Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "27",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4ipfl",
        "title": "Does anyone actually know what is going on with \"AI\"?",
        "content": "It took me time to understand the \"AI\" landscape.  I learned we have LLM not Artificial Intelligence.\n\nI learned the difference between AGI, ASI, and singularity.\n\nI learned about the different approaches and focuses of various projects like GPT from OpenAI, Claude from Anthropic, Llama from Meta AI, Gemini from Google, and Deepseek from Deepseek.\n\nThe height of it all seemed to before the release of GPT-5 in August and all the insanity going on with Grok and Elon.\n\nPeople were talking about how we would have AGI in 3 years if not sooner and certainly ASI in 7 years at the latest.\n\nThen it all seemed to flop for enthusiasm.\n\nThere is now a lot of questioning if AI can even be achieved in the ways we think about it.\n\nWhat do you think the next few years actually holds for \"AI\"?\n\n\\[I am going to post this in a lot of subreddits in order to get as informed as possible\\]",
        "url": "https://www.reddit.com/r/artificial/comments/1n4ipfl/does_anyone_actually_know_what_is_going_on_with_ai/",
        "publishDate": "2025-08-31T01:55:51Z[Etc/UTC]",
        "author": "AffordableCDNHousing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4gm0f",
        "title": "Best podcasts for novices",
        "content": "I'm self taught. Nothing official or fancy. I can make API apps with Google apps script and Gemini, some other fun things here and there. But nothing terribly fancy. \n\nI am looking for podcasts or other instructional that would be up to date for use case discussion and tips. ",
        "url": "https://www.reddit.com/r/artificial/comments/1n4gm0f/best_podcasts_for_novices/",
        "publishDate": "2025-08-31T00:10:44Z[Etc/UTC]",
        "author": "ExtraordinaryDemiDad",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4gicn",
        "title": "Finding the Tree of Life in Evo 2",
        "content": "[No content]",
        "url": "https://www.goodfire.ai/papers/phylogeny-manifold",
        "publishDate": "2025-08-31T00:05:56Z[Etc/UTC]",
        "author": "valis2400",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n4e7hr",
        "title": "I see a lot of ads for lifetime access to multiple pro versions of AI for less than $50. How?",
        "content": "I understand tokens are relatively cheap and I understand it's for the life of the company but even if they last 6 months, it's still cheaper than 6 months of a single pro AI. ",
        "url": "https://www.reddit.com/r/artificial/comments/1n4e7hr/i_see_a_lot_of_ads_for_lifetime_access_to/",
        "publishDate": "2025-08-30T22:16:54Z[Etc/UTC]",
        "author": "Who_is_I_today",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n47vmr",
        "title": "How AI Vibe Coding Is Destroying Junior Developers' Careers",
        "content": "[No content]",
        "url": "https://www.finalroundai.com/blog/ai-vibe-coding-destroying-junior-developers-careers",
        "publishDate": "2025-08-30T17:48:11Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n44u8v",
        "title": "‘Sliding into an abyss’: experts warn over rising use of AI for mental health support",
        "content": "[No content]",
        "url": "https://www.theguardian.com/society/2025/aug/30/therapists-warn-ai-chatbots-mental-health-support",
        "publishDate": "2025-08-30T15:43:29Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "63",
            "commentCount": "31",
            "isNsfw": "false"
        }
    },
    {
        "id": "BURiVp7FjTw",
        "title": "Gemini Code Assist 3.0: It&#39;s now BETTER than Cline &amp; Roo? BG Mode, Code Mode, Checkpointing &amp; More!",
        "content": "Visit NinjaChat: https://ninjachat.ai/ Visit ByteRover: https://www.byterover.dev/?source=ack7 In this video, I'll walk you through ...",
        "url": "https://www.youtube.com/watch?v=BURiVp7FjTw",
        "publishDate": "2025-08-30T09:15:01Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/BURiVp7FjTw/hqdefault.jpg",
            "transcription": "Hi, Welcome to another video. So Gemini Code Assist has had a steady stream of updates since June 12th. And if you're curious about what's changed, I'm going to walk you through every new feature in order, starting right after June 12th, and going all the way to the latest release. There's a lot to cover, especially if you use VS Code or IntelliJ. So let's get into it. I'll be starting after the June 12th updates because I had already covered everything up to that point in the last video. So, starting with June 18th, Gemini Code Assist chat suggestions are now shown in a preview block by default in VS Code. This makes it much easier to read the code that Gemini generates in chat. And you can even configure the preview pane to show suggestions as collapsed or expanded. Alongside that, you can now revert to a checkpoint for chat code suggestions. So, if you try an AI suggestion and it doesn't work out, you can easily roll your files back to the point before you applied it, which is super helpful for experimenting safely. On June 25th, there were some big improvements for agent mode in VS Code. You can now use agent mode to tackle complex multi-step tasks with Gemini Code Assist. The agent presents a plan for you to review and approve before making any changes, and you can edit, approve, or deny each suggestion. There's also persistent agent mode and chat state between IDE restarts, so your work doesn't get lost if you close your editor. Multi-file editing is now available in agent mode, letting Gemini update all relevant files in your codebase at once, which is awesome for big refactors or feature implementations. Plus, agent mode now has full project context awareness, meaning Gemini analyzes your entire project for more accurate code completions and suggestions. Moving on to July 1st, Gemini 2.5 Pro and Gemini 2.5 Flash models became generally available. These are now powering Gemini Code Assist's chat, code generation, and code transformation capabilities. The new models are much better at handling complex code, math, science, and intricate tasks. So you'll notice more accurate and helpful suggestions overall. On July 17th, some features that were previously in preview became generally available. This includes checkpoints, selected code snippets, terminal output, and multi-file editing. So everyone can now use these without having to opt in to a preview channel. July 18th brought improved code completion speed for VS Code Gemini Code Assist. Suggestions now show up faster, which is always a plus when you're working on something time-sensitive. On July 24th, IntelliJ Gemini Code Assist added the ability to stop in-progress chat responses. So, if Gemini starts going off track, or you realize you asked the wrong thing, you can halt the response immediately. This update also introduced thinking tokens, which give you insights into Gemini's thought process before it produces a response. So you know it's actively working on your request. July 28th saw the release of inline diff view in VS Code Gemini Code Assist. This feature highlights code changes directly in your editor - green for additions, red for deletions. Making it super easy to review modifications and integrate new code without leaving your current view. On July 31st, agent mode in both VS Code and IntelliJ got even better. You can now enable auto-approve mode, letting the agent act on your behalf and automatically apply changes. You can review and roll back these changes as needed. Also, agent mode now includes real-time shell command output, improved UI performance, and persistent chat state between IDE restarts. Moving to August 1st, IntelliJ Gemini Code Assist introduced a code diff view directly in chat. So you can see additions and deletions highlighted in the conversation. Multi-part chat code suggestions are now supported, letting you accept one change or all at once. Clickable file names in chat output were added too, so you can open files directly from the chat. The chat banner now shows your current release channel, which is handy if you're on experimental builds. On August 8th, VS Code Gemini Code Assist got a quick preview feature for chat code suggestions across multiple files. You can preview all suggested changes in one place, and jump straight to the file and suggestion you want, which is a big time-saver for larger projects. August 12th brought a major upgrade to code customization. You can now set up and manage code customization directly in the Google Cloud Console. Create repository indexes, add repositories, and manage repository groups for granular access control. This is especially useful for teams working across multiple codebases. Finally, on August 15th, VS Code Gemini Code Assist received numerous performance improvements, including lower CPU and memory usage, and less extension slow-down. The VS Code chat banner now shows the release channel. So you know which features are available. IntelliJ users can now delete individual prompt and response pairs from chat history, making it easier to keep things tidy without losing useful context. Now, let me show you these features in action as well. But before proceeding, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform where, for just $11 per month, you get access to top AI models like GPT-4o, Claude 4 Sonnet, and Gemini 2.5 Pro. All in one place. I've been using Gemini for quick research, but what's really cool is their AI playground where you can compare responses from different models side-by-side. Their mindmap generator is a game-changer for organizing complex ideas as well. The basic plan gives you 1000 messages, 30 images, and 5 videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan, or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. So, to start, you'll need to update it in VS Code. Just go ahead and do that. Now, first of all, the agent mode is available without messing around with things like insider mode or anything else, which is great. There's also a new checkpoint option. Checkpoints are very similar to what you see in tools like Roocode or Cline, where it makes checkpoints at intervals, and you can then revert back if it does something really bad. Another thing is local codebase awareness. Local codebase awareness is something that you can easily enable in the settings. And that will basically index your codebase in order to give you better suggestions. Be a bit more rapid in finding files, and improve overall navigation. It's similar to what you see in Roocode with codebase indexing as well. Apart from that, you can also now see a quick preview of the snippet of code that it generates or edits accordingly, which is also awesome. If you use IntelliJ, then you'll also now get thinking tokens, as well as the ability to stop the generation midway. There's also the inline diff option available, which now allows you to easily see the diff directly in the view. After that, there's also the new auto-approve option. Auto-approve basically does what it says. It automatically approves all tool calls without asking for any input, which is great for letting it run in the background. You also now get the list of files changed, which you can view in a simple-looking modal near the prompt box. That is majorly about it. So go ahead, use it. And I really like it for a lot of tasks. You can use it all you want without any issues. Also, for MCPs, I only use two MCPs, which are Context 7 for documentation fetching and ByteRover for memory. I really like it as a memory layer. It allows you to plug it into all kinds of coders, and it can create memories that are synced across all your coders. You can also share it with your teammates, which allows you to build rules and memories that stick to your projects. So, go ahead and use Gemini Code Assist because it's a really good option to use. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "FGUAF-tMTik",
        "title": "Why Winning TOO MUCH Can Lose a War - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=FGUAF-tMTik",
        "publishDate": "2025-08-30T19:42:53Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/FGUAF-tMTik/hqdefault.jpg",
            "transcription": "Culminating point of attack, culminating point of victory.\nCULMINATING POINT OF ATTACK CULMINATING POINT OF VICTORY\nATTACK THEY'RE DIFFERENT\nCULMINATING POINT OF ATTACK IS AN OPERATIONAL TERM\nIf you do not\nREACH YOUR CULMINATING POINT OF ATTACK\nIt means you could have gone further.\nSO IF YOU DON'T GO FAR ENOUGH IN YOUR BATTLE\nYOU COULD HAVE TAKEN MORE TERRITORY WHATEVER IT WAS YOU WERE AFTER.\nIf you go too far,\nYOUR ENEMY WILL LAUNCH A COUNTERATTACK THAT WILL SEND YOU MUCH FURTHER BACKWARDS\nTHAN IF YOU'D BEEN A LITTLE MORE CAUTIOUS ABOUT HOW FAR YOU WENT.\nSo that's an operational term.\nVICTORY\nTHE STRATEGIC TERM IS CULMINATING POINT OF VICTORY\nAnd it concerns the\nOBJECTIVE FOR WHICH THE WAR WAS FOUGHT.\nJAPAN'S FIGHTING THIS WAR IN ORDER TO PROTECT ITS SOVEREIGNTY.\nIf you don't reach your culminating point,\nYOU COULD HAVE GOTTEN GREATER WINNINGS.\nIf you go too far,\nTYPICALLY WHAT WILL HAPPEN\nIS YOU WILL TRIGGER A THIRD PARTY INTERVENTION.\nAnd what may have been feasible before that third party joined the party,\nMAY NO LONGER BE. ↓ WATCH HERE ↓"
        }
    }
]