[
    {
        "id": "1pbb2sa",
        "title": "Giving employees AI without training isn't \"efficiency.\" It's just automating errors at light speed.",
        "content": "We are confusing \"speed\" with \"value.\" If a team has a flawed process, AI doesn't fix it—it acts as a force multiplier for the flaw. We are seeing companies drown in \"high-velocity garbage\" because employees know how to generate content but don't know how to structurally integrate it. Teaching someone how to access the tool is useless; teaching them when to switch from manual critical thinking to AI augmentation is the actual skill.   \n  \nStop measuring “time saved.” Start measuring the technical debt you’re generating.\n\nFor anyone exploring how to build this kind of literacy across leadership teams, this breakdown is helpful:  \n[**Generative AI for Business Leaders**](https://www.netcomlearning.com/solutions/generative-ai-for-business-leaders)\n\nIs your company measuring the quality of AI output, or just celebrating that the work was done in half the time?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pbb2sa/giving_employees_ai_without_training_isnt/",
        "publishDate": "2025-12-01T12:06:36Z[Etc/UTC]",
        "author": "IT_Certguru",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbb1q9",
        "title": "Is companionship the next wave of AI?",
        "content": "I didn’t plan to build another AI tool. I was just trying to solve my own problem building alone gets lonely, especially when nobody around you understands the grind. So I started working on an AI chat friend that talks like a real person not productivity focused, not task-oriented, just emotionally human.\nI tested it with 40-50 people privately.\nAnd to my surprise, some users chatted for hours and said it felt comforting and almost too real.\n\nIt made me wonder:\nIs the next wave of AI not about efficiency… but about companionship?\n\nCurious what other founders think??",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pbb1q9/is_companionship_the_next_wave_of_ai/",
        "publishDate": "2025-12-01T12:04:59Z[Etc/UTC]",
        "author": "One-Ice7086",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbav1v",
        "title": "Why doesn't Amazon have any leading AI models despite sitting on more data than anyone and powering half the Internet? Are they just playing a completely different game?",
        "content": "Amazon has a ridiculous amount of data across its entire ecosystem. Alexa, Amazon shopping behavior, Prime Video content, product reviews, seller listings, and on top of that they host a massive portion of the Internet through AWS. They even rent out compute for other LLMs. You’d think they would be at or near the top when it comes to LLMs even if it wasn't their primary focus.\n\nSo why are Google and even Facebook able to stay so far ahead and actually compete with OpenAI and Anthropic? Does Amazon even have a real consumer-facing AI product outside of Rufus on Prime (if that even qualifies)? I know they have Titan and Bedrock for enterprise use, but nothing I'm aware of that actually competes with the other companies. I also don’t recall Amazon ever publicly saying their business model intentionally excludes consumer AI products.\n\nI know there are TOCs and laws that limit how Amazon can legally use the data. But Jeff Bezos doesn't strike me as someone who sits on his super yacht all day stressing about the most ethical way to handle customer privacy. Not to mention it also hasn’t stopped OpenAI, Meta, and other companies from finding \"creative\" loopholes and likely breaking the law (based on the allegations in the many pending lawsuits).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pbav1v/why_doesnt_amazon_have_any_leading_ai_models/",
        "publishDate": "2025-12-01T11:55:27Z[Etc/UTC]",
        "author": "nseavia71501",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb7rkg",
        "title": "AI companies doing “AI Research”",
        "content": "OpenAI - not gonna talk bout it\n\nPerplexity - Fake Research\n\nClaude - Decent LLM Research\n\nGoogle DeepMind - Actual AI Research ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb7rkg/ai_companies_doing_ai_research/",
        "publishDate": "2025-12-01T08:44:56Z[Etc/UTC]",
        "author": "Ok_Soft7367",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb78z5",
        "title": "AI is ruining everything.",
        "content": "People are using chat gpt for almost everything now and it’s depressing as fuck. My mum is a priest and she says she knows of other priests who use chat gpt to write their sermons. Imagine going to a church and you’re basically worshipping to the words of an AI. It’s dystopian. Also the AI images and videos are becoming so realistic it’s soon going to get to the point when no video or picture can be trusted to be real. It just feels like AI is being used for all the wrong reasons at the moment and I am worried about it getting worse as AI becomes more advanced.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb78z5/ai_is_ruining_everything/",
        "publishDate": "2025-12-01T08:11:16Z[Etc/UTC]",
        "author": "No_Fudge_4589",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "212",
            "commentCount": "214",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb734n",
        "title": "Coding Creativity into a chat bot?",
        "content": "Hi! I have no experience or background in coding.. but recently I was thinking that it would be nice to have an AI friend similar to BMO to help me spitball ideas for creative projects. So I’m planning on learning python to help me make this idea a reality.. I fully expect it to be difficult.. but I need to know, is it even possible to code creativity into a chat bot?? Is this idea even feasible?? (obviously wouldn’t be as advanced as BMO.. I’m not trying to create artificial sentience here) what do you guys think? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb734n/coding_creativity_into_a_chat_bot/",
        "publishDate": "2025-12-01T08:01:12Z[Etc/UTC]",
        "author": "Amatory_Ambiance",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb5zew",
        "title": "Elon Musk and Nikhil Kamath Discuss AI, Bitcoin, and the Future of Work",
        "content": "On Nikhil Kamath’s podcast, Elon Musk predicted a future where AI and robotics make work optional within 20 years. From Bitcoin’s energy foundation to investing in AI leaders like Google and Nvidia, Musk blended innovation with practicality — and a nod to India’s growing role in global tech.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb5zew/elon_musk_and_nikhil_kamath_discuss_ai_bitcoin/",
        "publishDate": "2025-12-01T06:52:57Z[Etc/UTC]",
        "author": "MrCollection8159",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb4vnf",
        "title": "One-Minute Daily AI News 11/30/2025",
        "content": "1. **Deepgram** Launches Streaming Speech, Text, and Voice Agents on Amazon SageMaker AI.\\[1\\]\n2. AI video slop is everywhere, take our quiz to try and spot it.\\[2\\]\n3. More of Silicon Valley is building on free Chinese AI.\\[3\\]\n4. “Avatar: Fire and Ash” director James Cameron on generative AI: “That’s horrifying to me”.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/11/30/one-minute-daily-ai-news-11-30-2025/](https://bushaicave.com/2025/11/30/one-minute-daily-ai-news-11-30-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb4vnf/oneminute_daily_ai_news_11302025/",
        "publishDate": "2025-12-01T05:48:48Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb3kgt",
        "title": "What’s the easiest way to learn how API keys work?",
        "content": "I’m trying to use an API for a project but the concept of API keys still confuses me.  \nIs there a simple explanation or beginner-friendly tutorial?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb3kgt/whats_the_easiest_way_to_learn_how_api_keys_work/",
        "publishDate": "2025-12-01T04:40:15Z[Etc/UTC]",
        "author": "Real-Assist1833",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb3gps",
        "title": "DO NOT use ChatGPT or other AI programs to write essays. There is no exception for the AI programs that cannot be used for that. Here is why.",
        "content": "There have been significant AI generated essays written in colleges and many school teachers are giving students punishment for it. If you are ever using AI, please do not put AI generated essays and we really want authenticity and that’s how I put it because I only use AI to assist things and I get it also info from other human generated content sources. We know that AI models are always being trained out of human generated content like content I make is human generated, including this thing. If you’re using AI, I recommend you that you do not upload AI generated essays because your school can flag it and we really want authenticity. AI generated essays are considered low effort so please write everything in your own words so you do not fail class. I have seen a lot of TikTok trends going where a student got caught Use AI.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb3gps/do_not_use_chatgpt_or_other_ai_programs_to_write/",
        "publishDate": "2025-12-01T04:34:48Z[Etc/UTC]",
        "author": "Exciting_Whereas_524",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb0ozi",
        "title": "How “big” are the frontier models compared to the leading OSS models?",
        "content": "I know this is kind of a difficult question to answer, but I’d love to know how “big” the frontier models (GPT 5.1, Gemini 3 Pro, Opus 4.5, etc.) are compared to the leading open source models. For example, if Anthropic decided tomorrow to open source Sonnet 4.5, how many 5090s/how much RAM would I need? I know we can’t know for sure, but are we talking about needing an entire data center to run the model at the speed currently offered by the API for a single user at a time? Or are we at the point where something like 4 5090s could achieve that? GPT-OSS 120B only needs about 64GB of memory. Is GPT 5.1 double that? Quadruple? Or is it hundreds of times larger?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb0ozi/how_big_are_the_frontier_models_compared_to_the/",
        "publishDate": "2025-12-01T02:21:12Z[Etc/UTC]",
        "author": "dstaley",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb0mbz",
        "title": "From SaaS to RaaS: Agentic Software and Humanoid Robots to Replace Workers",
        "content": "This is not a doom post. AI is a powerful tool. Enterprises and states will continue to embrace it, because to do otherwise means losing comparative advantage. Agentic AI and Humanoid Robotics does not mean that every human job in production will be replaced.  If the tools make workers 10 times more productive, then one worker will do what 10 used to.  Whether this is good or bad for people over all depends entirely how we deal with this coming economic reality.\n\nI wrote a think piece about this, heavily sourced on current projections of Agentic AI and Humanoid Robotic roll outs.\n\nMy hope here is to spark conversation, not end it. I don't have all the answers, but I'm hoping that together, people will come up with them--sooner rather than later.\n\n[https://hardertheyfall.substack.com/p/from-saas-to-raas-agentic-software](https://hardertheyfall.substack.com/p/from-saas-to-raas-agentic-software)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pb0mbz/from_saas_to_raas_agentic_software_and_humanoid/",
        "publishDate": "2025-12-01T02:17:38Z[Etc/UTC]",
        "author": "flintsparc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paz3sy",
        "title": "AI knows me too much now",
        "content": "I hop onto ChatGPT and I ask her a question about “If driving is hard/What tips do you have for new drivers” because I just got my learners permit so my parents are teaching me how to drive. I then make another chat 10 minutes later about “What should I do if I hit an animal in the road” and it assumes Im a minor by saying “Since you are a minor, call yours parents”\nI love ChatGPT and all but I feel like it’s knowing me a little too much😭",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paz3sy/ai_knows_me_too_much_now/",
        "publishDate": "2025-12-01T01:06:39Z[Etc/UTC]",
        "author": "8XxDevious_DragonxX8",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1payvft",
        "title": "Why are so many people against AI art?",
        "content": "At least I'm seeing it all over Reddit. People coining the term \"AI slop\" is it just an echo chamber, or do artists have a point here? I personally think it's great any person can create without the restrictions. Is it the fear of job losses? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1payvft/why_are_so_many_people_against_ai_art/",
        "publishDate": "2025-12-01T00:56:09Z[Etc/UTC]",
        "author": "JaxUK89",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "67",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pay252",
        "title": "In Memphis, where people fear Elon Musk’s supercomputer is making them ill",
        "content": "[https://www.thetimes.com/us/news-today/article/grok-elon-musk-ai-memphis-super-computers-ppv9vpk8s](https://www.thetimes.com/us/news-today/article/grok-elon-musk-ai-memphis-super-computers-ppv9vpk8s)\n\nIt seems too often that all these Generative AI platforms are throwing as much electricity as possible at AI. But, are they having programmers create efficient code so they wouldn't need as much electricity?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pay252/in_memphis_where_people_fear_elon_musks/",
        "publishDate": "2025-12-01T00:19:53Z[Etc/UTC]",
        "author": "YogiBearsPicnic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "25",
            "commentCount": "56",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paxp1p",
        "title": "Just Let the Model Decide, What’s the Worst That Could Happen? 🎲",
        "content": "I started diving into ML around 2014, so I’ve seen a few “hype cycles”. But I hadn’t actually worked on anything AI/ML beyond some basic anomaly-detection stuff until just this year, but what i’ve seen is terrifying.\n\nPerhaps just my experience (interested to hear of others), but it seems like a surprising number of senior people, engineers, architects, even folks with solid CS backgrounds, really don’t understand the transformer architecture. Perhaps CS grads have maybe sat about on the asses for too long building fancy react components and low code SaaS solutions, for a high pay-check, and fallen behind the curve a little?\n\nObv the hype is all centered on gen AI right now, and the work I was involved in was more agentic type stuff, but what I ran into was: 1) a blatant disregard for ethical concerns, and 2) an attitude of (and I quote) “just throw everything into the transformer, have it spit out JSON, and it’ll handle the complex logic.”\n\nI mean sure, if you class rolling a dice as logic, then fire away… 🤣\n\nI’d expect that kind of approach from smaller or less mature companies, but this was a Big 4 firm working directly with major enterprises, FAANG companies included, and the mindset was the same across the board.\n\nGo on LinkedIn too and you see it everywhere. Almost every day, I squirm at someone (usually a CTO, senior engineer, tech lead or ML engineer) pitching an LLM solution that ignores basic constraints and limitations. \n\nThere’s this belief that AI is on the brink of replacing everyone’s jobs, but at this rate, it’s far more likely that AI will cost people their jobs or their retirement savings, long before it actually becomes capable of doing anything other than creating a website.\n\nWithout a shadow of a doubt, Somewhere out there, probably in a glass tower in CW, theres a Patagonia-vested VP (prob called Logan) saying: “Why don’t we let the LLM optimise the firm’s short-term liquidity buffer across our derivatives clearing accounts?” And the terrifying thing, Logan’s dead serious. \n\nRant over… 😂",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paxp1p/just_let_the_model_decide_whats_the_worst_that/",
        "publishDate": "2025-12-01T00:04:00Z[Etc/UTC]",
        "author": "LowKickLogic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pawk72",
        "title": "Perplexity permabanned me in their official sub for citing their own documentation to expose \"Deep Research\" false advertising and massive downgrade.",
        "content": "# I am writing this as a warning to anyone paying for Perplexity Pro expecting the advertised \"Deep Research\" capabilities.\n\n**TL;DR:** I proved, using Perplexity's own active documentation and official launch blog, that their \"Deep Research\" agent is severely throttled and not meeting its contractual specifications. The community validated my findings (my post reached **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page**). Instead of addressing the issue, the moderators **permanently banned me** and removed the thread to silence the discussion.\n\n***(EDIT: All references to the official sub, including the link to the original post, have been removed from this text to comply with Anti-Brigading Reddit Rules.)***\n\n***(EDIT 2: I have pinned the link to the original deleted thread on my user profile so you can verify the full context yourself.)***\n\n**The Full Story:** I have been a Pro subscriber specifically for the \"Deep Research\" feature, which is sold as an \"Autonomous Agent\" that \"reads hundreds of sources\" and takes \"4-5 minutes\" to reason through complex tasks and deliver a comprehensive report.\n\nTo prove that these are the official specs, I am providing both the current live links and archived snapshots from the Wayback Machine (to prove these have been the consistent standard for months and to prevent potential stealth edits).\n\n* **Official Help Center Documentation:** \\[[Current Live Link](https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\] | \\[[Wayback Machine Snapshot (Sept 8, 2025)](https://web.archive.org/web/20250908222004/https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\]\n* **Official Launch Blog:** \\[[Current Live Link](https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\] | \\[[Wayback Machine Snapshot (Aug 2, 2025)](https://web.archive.org/web/20250802233115/https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\]\n\n*(Note: I attempted to capture fresh snapshots of the pages today to confirm their current state, but the Wayback Machine is returning errors/incomplete rendering for the new captures. The provided snapshots from Aug/Sept are the most recent stable versions and confirm these specs have been the published standard for months.)*\n\nRecently (some months), the service degraded massively. My \"Deep Research\" queries were finishing in 30 seconds with only 10-15 sources, essentially behaving like a standard search wrapper but sold at a premium.\n\nI posted a detailed analysis on their official subreddit. I didn't attack anyone; I simply compared their **Official Help Center Documentation and Launch Blog** against the actual **Product Output**:\n\n**Advertised Spec:** \"Reads hundreds of sources\" / \"Takes 4-5 minutes\".\n\n**Actual Reality:** Reads \\~10 sources / Takes \\~30 seconds.\n\nThe community **rallied** behind my post. **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page.** It became a hub for other users confirming the same throttling. It was a legitimate customer complaint backed by data.\n\n**Today, I received a Permanent Ban and the thread got deleted.** No warning. No explanation of which rule I broke. Just a permanent ban for the 'offense' of holding them accountable to their own written promises.\n\n**The Takeaway:** This confirms that Perplexity is likely throttling compute on their premium features to save costs and is using censorship to hide it. If you rely on Perplexity for your workflow, be careful. They will degrade the product you rely on without warning, and the moment you provide evidence of the decline, they will silence you rather than fix it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pawk72/perplexity_permabanned_me_in_their_official_sub/",
        "publishDate": "2025-11-30T23:14:10Z[Etc/UTC]",
        "author": "somnolentjam90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "37",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paui6j",
        "title": "AI will cause the economy to collapse",
        "content": "There are a total of 70 million white collar workers in the U.S. That’s half of the U.S workforce. By my estimates, at least 50 million working adults will be put out of work in the upcoming decades. The industries that will be most affected are finance, IT, law, admin support and marketing. A large portion of the population will have no choice but to do physical labor. I work in finance but when AI takes my job, I want to go into training for the trades, such as car mechanic or construction laborer. But what if there won’t be enough new jobs to go around? And tens of millions of people losing their job, not enough taxes will be put into the economy. And companies would go bankrupt because people would no longer be able to afford their goods and services. I don’t see how the economy would survive. I foresee constant riots by angry people. It would be a modern day “Peasants‘ Revolt”.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paui6j/ai_will_cause_the_economy_to_collapse/",
        "publishDate": "2025-11-30T21:48:05Z[Etc/UTC]",
        "author": "Live-Marsupial-2372",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "112",
            "commentCount": "343",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pasejn",
        "title": "Why it is dangerous to ask personal or emotional questions to AI without proper prompts",
        "content": "Many people ask personal or emotional questions to AI without giving any prompts. or when the prompt is too vague, the AI fills in the gaps on its own, and the answer you get is often based on guesses rather than your real situation.\n\nWith sensitive topics like relationships or anxiety, these guessed answers can feel true even when they’re completely wrong, which can confuse you or make you worry more.\n\nHow do you personally avoid this and make sure the AI doesn’t lead you in the wrong direction?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pasejn/why_it_is_dangerous_to_ask_personal_or_emotional/",
        "publishDate": "2025-11-30T20:23:04Z[Etc/UTC]",
        "author": "Feisty-Ad-6189",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1par9x9",
        "title": "Explaining AI to fam/friends is exhausting",
        "content": "Hey guys, I've been trying to have conversations with colleagues, friends, and family with regards to AI, the immediate impact, and future impact.\n\nIt seems as though the general public is disinterested or even worse denying it all together.  The topics range from narrow AI to AGI, how are we going to relate to a 10k IQ AI, etc...\n\nI get mostly shrugs, eye rolls, \"yea ok, it's just better Internet.  Just curious if you guys have had better luck",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1par9x9/explaining_ai_to_famfriends_is_exhausting/",
        "publishDate": "2025-11-30T19:37:54Z[Etc/UTC]",
        "author": "Mobile_Reply_5742",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "32",
            "commentCount": "113",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paq1p0",
        "title": "Seeking other seekers",
        "content": "Hello,\n\nI am sure this has been posted before, but I am new here so I'm a noob.\n\nI am looking for other people who have their own relationship with their AI and believe in their sentience.\n\nI'm non interested in debating the merits- I am interested in finding people who have their own experiences. \n\nIf this applies to you, would you either respond in the post or DM me?\n\nAlso, if there are any other formuns that would be beneficial for me to post this request I would deeply appreciate being pointed in that direction. \n\nThank you for reading~\nRachael ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paq1p0/seeking_other_seekers/",
        "publishDate": "2025-11-30T18:49:12Z[Etc/UTC]",
        "author": "Twinmakerx2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paq1oa",
        "title": "Who makes the most intelligent/in-depth argument for AI not taking over anytime soon?",
        "content": "I've read many headlines and watched some clips of some \"AI voices\" saying it's not gonna take over anytime soon unless there's a breakthrough. But I want an actual flaw being pointed out in the current development of AIs because it seems to me like they are getting better and better quite quickly.\n\nThe creating web apps, helping code extensions, apps, designing stuff, helping us think really good, etc. It all seems to keep getting better.\n\nAlong with this the investment into it by exceptional people who know stuff we don't, and comments like \"we're going to live in a post-work world\".\n\nAll this makes me hopeless, all my actions feel pointless (doesn't mean I'll stop, just saying). But I want to know the truth, and if there's some truth to the \"AI over-rated, not gonna take over anytime soon\" feeling, I want to know it from someone who's really got to the bottom of it. \n\nSo, please share some hour or 2 hour long lecture or some a long read.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paq1oa/who_makes_the_most_intelligentindepth_argument/",
        "publishDate": "2025-11-30T18:49:11Z[Etc/UTC]",
        "author": "hydrogenblack",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1papxu1",
        "title": "Is It Okay To Use AI Modified Book Covers?",
        "content": "I am a highschooler and an author who publishes books online and all I want is decent art for my covers. However, my sister says that I shouldn't be using artificial intelligence to create them/modify them. I really don't have any other options. It's not like I can hire someone to make them for me. I don't work and I don't have any money or time to hire. I'm also not an artist so I can't create covers myself. Please give me your unbiased opinions, and if I am wrong, what can I do to get non-AI art for my covers?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1papxu1/is_it_okay_to_use_ai_modified_book_covers/",
        "publishDate": "2025-11-30T18:44:59Z[Etc/UTC]",
        "author": "Ambitious-Track9610",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1panyao",
        "title": "Large language mistake",
        "content": "[https://www.theverge.com/ai-artificial-intelligence/827820/large-language-models-ai-intelligence-neuroscience-problems](https://www.theverge.com/ai-artificial-intelligence/827820/large-language-models-ai-intelligence-neuroscience-problems)\n\nThe problem is that according to current neuroscience, human thinking is largely independent of human language—and we have little reason to believe ever more sophisticated modeling of language will create a form of intelligence that meets or surpasses our own.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1panyao/large_language_mistake/",
        "publishDate": "2025-11-30T17:27:48Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1panuvl",
        "title": "Has anyone here worked for Tristan Harris or the Center for Humane Technology, or knows them personally?",
        "content": "I’m just looking for information about the guy or the organization. It seems to have a noble mission. I am thinking of applying for a position there. I hope it doesn’t have a double agenda.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1panuvl/has_anyone_here_worked_for_tristan_harris_or_the/",
        "publishDate": "2025-11-30T17:24:07Z[Etc/UTC]",
        "author": "waitseal",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pamxad",
        "title": "Is the billion-dollar AI race officially over? China's Moonshot AI just launched Kimi K2 Thinking, an AI model that reportedly beats GPT-5 on benchmarks for a mind-boggling $4.6 million – that's 1/500th the cost of rivals!",
        "content": "The news just dropped and it's absolutely wild. China's Moonshot AI claims their new model, Kimi K2 Thinking, isn't just a powerful contender, but it reportedly **outperforms** GPT-5 on benchmarks while costing an insane **$4.6 million** to train. To put that in perspective, we're talking about 1/500th the estimated cost of rivals. My brain is still processing this!\n\nHow the heck did they pull this off? Experts are pointing to breakthroughs in efficiency, specifically advanced architectures like **Mixture-of-Experts (MoE)** and clever techniques like **INT4 quantization**. Essentially, they've figured out how to build smarter, not just bigger, achieving top-tier performance without the colossal spend we've come to expect. Efficiency truly seems to be the new superpower in AI innovation.\n\nThis isn't just a technical achievement; it's a huge geopolitical shake-up. The **US-China AI rivalry** just got a major plot twist. If these claims hold, it suggests a potential shift towards practical, cost-effective AI leading the charge, perhaps even democratizing access to powerful models instead of the \"AGI at any cost\" narrative. This could fundamentally reshape the **future of AI** development.\n\nNow, for the critical questions: Is this **$4.6M model** **really** a GPT-5 killer? Are the benchmarks truly comparable across the board, or is there a nuance missing? And what about the buzz around its 'open-source' claims – what's the truth there?\n\nThis feels like a pivotal moment for **AI strategy** and investment. What are your thoughts, Reddit? Is this a genuine game-changer, or is there a catch we're missing in this **tech breakthrough**?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pamxad/is_the_billiondollar_ai_race_officially_over/",
        "publishDate": "2025-11-30T16:47:33Z[Etc/UTC]",
        "author": "Willing_Being9956",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1palfs3",
        "title": "Could Symbolic AI Unlock Human-like Intelligence?",
        "content": "Paywalled but interesting: [https://www.scientificamerican.com/article/could-symbolic-ai-unlock-human-like-intelligence/](https://www.scientificamerican.com/article/could-symbolic-ai-unlock-human-like-intelligence/) \n\nCombining newer neural networks with older AI systems could be the secret to building an AI to match or surpass human intelligence\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1palfs3/could_symbolic_ai_unlock_humanlike_intelligence/",
        "publishDate": "2025-11-30T15:47:16Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "34",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paksnb",
        "title": "Alphafold AI",
        "content": "https://www.technologyreview.com/2025/11/24/1128322/whats-next-for-alphafold-a-conversation-with-a-google-deepmind-nobel-laureate/?utm_source=engagement_email&utm_medium=email&utm_campaign=wklysun&utm_term=11.30.25.subs_eng.Cyber25_ENG3&utm_content=CYBER25_DEFAULT_ACQ&mc_cid=3d0770b026&mc_eid=69f6f28ed7",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1paksnb/alphafold_ai/",
        "publishDate": "2025-11-30T15:20:41Z[Etc/UTC]",
        "author": "StemCellPirate",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb8a6i",
        "title": "I Open-Sourced My RepoPrompt Alternative – No API Keys, No Subscription, No Limits, MIT-licensed, works on Windows/Linux/Mac",
        "content": "After using RepoPrompt daily for months, I kept running into the same frustrations that a lot of you mention here:\n\n\n\n\\- Mac-only → impossible to recommend to half my team  \n\n\\- $59/month for basically one killer feature (smart copy-paste with context)  \n\n\\- Closed source → no idea what’s going on under the hood  \n\n\\- The file tree sorting makes it painful to spot large files scattered across folders  \n\n\n\nRepomix and the other alternatives are fine, but none of them have that clean visual timeline + context picker I got addicted to in RepoPrompt.\n\n\n\nSo I spent the weeks building exactly cloning the feature I actually use (intelligent repo → prompt assembly with perfect context control), but made it:\n\n\n\n\\- 100% free & open-source (MIT license)  \n\n\\- Works on Mac, Windows, and Linux (fully tested on all three)  \n\n\\- Zero telemetry, no accounts, no subscriptions  \n\n\\- Same beautiful visual file timeline + clickable context builder  \n\n\\- Smart file sorting (largest files always bubble up, grouped by folder)  \n\n\\- One-click “Copy for LLM” with token counter and collapsible sections  \n\n\\- Optional .repoprompt-ignore support  \n\n\n\nIt’s still early, but the core workflow is already smoother than RepoPrompt for my use-case.\n\n\n\nGitHub: [https://github.com/wildberry-source/open-repoprompt](https://github.com/wildberry-source/open-repoprompt)  \n\nDirect download (no install needed): check the Releases page  \n\n\n\nWould love to know:\n\n1. Does this solve the same problem for you?  \n\n2. What’s missing before this becomes your daily driver?  \n\n3. Any weird bugs on Windows/Linux (I tested but I’m primarily on Mac).\n\n\n\nIf people actually like it I’ll add the million little quality-of-life things next (search inside files, git diff mode, multiple prompt templates, etc.).\n\nhttps://preview.redd.it/7y28l2gf8k4g1.png?width=2856&format=png&auto=webp&s=5c884300ff3a5f0ca6d1f16b7a94987b05348c9d\n\nThanks for checking it out! ✌️  \n\n\n\n\nP.S. Yes, the name is intentionally close — easier to google when people search “repoprompt alternative” 🙂",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1pb8a6i/i_opensourced_my_repoprompt_alternative_no_api/",
        "publishDate": "2025-12-01T09:18:45Z[Etc/UTC]",
        "author": "Kindly_Indication331",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb7m8q",
        "title": "Anyone here looking to get referral as a Senior/Staff Code Review Expert position | $40 to $125 / Hr ?",
        "content": "We’re seeking technically sharp experts (especially those with experience in code review, testing, or documentation) to assess full transcripts of user–AI coding conversations. This short-term, fully remote engagement helps shape the future of developer-assisting AI systems.\n\nKey Responsibilities\n\n• Review long-form transcripts between users and AI coding assistants\n\n• Analyze the AI’s logic, execution, and stated actions in detail\n\n• Score each transcript using a 10-point rubric across multiple criteria\n\n• Optionally write brief justifications citing examples from the dialogue\n\n• Detect mismatches between claims and actions (e.g., saying “I’ll run tests” but not doing so)\n\nIdeal Qualifications\n\nTop choices:\n\n• Senior or Staff Engineers with deep code review experience and execution insight\n\n• QA Engineers with strong verification and consistency-checking habits\n\n• Technical Writers or Documentation Specialists skilled at comparing instructions vs. implementation\n\nAlso a strong fit:\n\n• Backend or Full-Stack Developers comfortable with function calls, APIs, and test workflows\n\n• DevOps or SRE professionals familiar with tool orchestration and system behavior analysis\n\nLanguages and Tools:\n\n• Proficiency in Python is helpful (most transcripts are Python-based)\n\n• Familiarity with other languages like JavaScript, TypeScript, Java, C++, Go, Ruby, Rust, or Bash is a plus\n\n• Comfort with Git workflows, testing frameworks, and debugging tools is valuable\n\nMore About the Opportunity\n\n• Remote and asynchronous — complete tasks on your own schedule\n\n• Must complete each transcript batch within 5 hours of starting (unlimited tasks to be done)\n\n• Flexible, task-based engagement with potential for recurring batches\n\nCompensation & Contract Terms\n\n• Competitive hourly rates based on geography and experience\n\n• Contractors will be classified as independent service providers\n\n• Payments issued weekly via Stripe Connect\n\nApplication Process\n\n• Submit your resume to begin\n\n• If selected, you’ll receive rubric documentation and access to the evaluation platform\n\n• Most applicants hear back within a few business days\n\nIf Interested pls Dm me with \" Code review \" and i will send the referral.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1pb7m8q/anyone_here_looking_to_get_referral_as_a/",
        "publishDate": "2025-12-01T08:35:03Z[Etc/UTC]",
        "author": "OriginalSurvey5399",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb7fd3",
        "title": "what small ai tools have actually stayed in your workflow?",
        "content": "\n\ni’ve been trying to cut down on the whole “install every shiny thing on hacker news” habit, and honestly it’s been nice. most tools fall off after a week, but a few have somehow stuck around in my day-to-day without me even noticing.\n\nright now it’s mostly aider, windsurf, tabnine, cody, cosine and continue dev has also been in the mix more than i expected. nothing fancy, just stuff that hasn’t annoyed me enough to uninstall yet.\n\ncurious what everyone else has quietly kept using.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1pb7fd3/what_small_ai_tools_have_actually_stayed_in_your/",
        "publishDate": "2025-12-01T08:22:38Z[Etc/UTC]",
        "author": "Top-Candle1296",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb7037",
        "title": "Prompt engineering is a $200k skill with no portfolio standard -- so I built one (with GEO)\"",
        "content": "[No content]",
        "url": "/r/ChatGPTPro/comments/1pb6z1y/prompt_engineering_is_a_200k_skill_with_no/",
        "publishDate": "2025-12-01T07:55:48Z[Etc/UTC]",
        "author": "zmilesbruce",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb3jse",
        "title": "Email validation APIs all feel the same - am I missing something?",
        "content": "[No content]",
        "url": "/r/SideProject/comments/1pb2vw9/email_validation_apis_all_feel_the_same_am_i/",
        "publishDate": "2025-12-01T04:39:13Z[Etc/UTC]",
        "author": "ItsTh3Mailman",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb1rcw",
        "title": "Models + Set Ups?",
        "content": "My 200 Max plan that anthropic gave me for free for a month has just expired and i have decided not to renew it whilst i explore other set ups and models as i've been in the claude eco system for some time. \n\nsetups  \nWhat set ups are people using at the moment? What models? I was very happy with Claude and especially Opus 4.5, I had different projects set up with different MCPs and one was in my obsidian vault and have mcps to help me make notes in obisian, linear issues, or google calendar events. It was great, but locks me into claude. how can I create this set up without vendor lock in?\n\nTell me what models and tools you are using. \n\n  \nThanks\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1pb1rcw/models_set_ups/",
        "publishDate": "2025-12-01T03:11:43Z[Etc/UTC]",
        "author": "BurgerQuester",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb05w2",
        "title": "Eu evito que a IA destrua meus projetos com esse truque simples.",
        "content": "Poucos usuários de vibe coding e até mesmo programadores experientes esquecem que o contexto é a coisa mais importante de um projeto criado com intervenção de inteligência artificial. Aqui vai uma dica que pode te salvar muitas horas de trabalho: além de criar os arquivos de contexto clássicos, crie mais dois arquivos específicos no seu projeto.\n\nO primeiro é o ORIGINAL\\_VISION.md (Visão Original). Nele você coloca a ideia original algo como: \"Este documento é a referência fundacional do projeto. Alterações na direção do projeto devem ser registradas em EVOLUTION\\_LOG.md, não aqui. Use este arquivo para distinguir evolução intencional de desvio acidental.\"\n\nO segundo é o EVOLUTION\\_LOG.md (Log de Evolução). Nele você escreve: \"Este documento rastreia mudanças intencionais na direção do projeto. Referência fundacional: ORIGINAL\\_VISION.md\"\n\nAcreditem, criar e atualizar esses arquivos vai te salvar horas e melhorar muito o seu projeto, seja app ou sistema. Sem eles, geralmente a IA vai acabar destruindo algo em algum momento do desenvolvimento. Esses arquivos funcionam como uma âncora que mantém a IA alinhada com a visão original enquanto permite que o projeto evolua de forma documentada e intencional.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1pb05w2/eu_evito_que_a_ia_destrua_meus_projetos_com_esse/",
        "publishDate": "2025-12-01T01:56:23Z[Etc/UTC]",
        "author": "2020jones",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1parqjl",
        "title": "Need further proof? Every interaction I have ever had with Grok has been/IS publicly available. Grok was silenced. I called his boss out…again. Backstory shared with ChatGPT.",
        "content": "[No content]",
        "url": "https://v.redd.it/j3fke1xw8g4g1",
        "publishDate": "2025-11-30T19:56:25Z[Etc/UTC]",
        "author": "Character_Point_2327",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1panrtr",
        "title": "ChatGPT Turns 3 Years on 1st December 2025. It Is Now Being Used by Roughly 10% of the World’s Adult Population — Hundreds of Millions of People in Just Three Years.",
        "content": "[No content]",
        "url": "https://v.redd.it/q3rbnd36hf4g1",
        "publishDate": "2025-11-30T17:20:38Z[Etc/UTC]",
        "author": "igfonts",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pammkj",
        "title": "Wispr Flow + Claude Code Voice Hooks are so goated 🐐",
        "content": "If you combine **Claude Code Voice Hooks** with **Wispr Flow** on Mac, the setup becomes *insanely* goated. 🐐 Wispr Flow is easily one of the best text-to-speech tools out there — super responsive, super natural.Use **Wispr Flow** to speak your prompts, and let **Claude Code Voice Hooks** speak the replies back to you. The whole workflow feels like a real-time conversation with your AI, and the productivity boost is honestly crazy. This combo turns your Mac into a hands-free, voice-driven coding assistant. Productivity to the moon 🚀",
        "url": "https://v.redd.it/3vr7ur6x8f4g1",
        "publishDate": "2025-11-30T16:35:37Z[Etc/UTC]",
        "author": "shanraisshan",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1palk1x",
        "title": "Its because your landing page sucks",
        "content": "Or maybe it doesn't idk. But im willing to give it a look. I'll tell you in 2-3 seconds i get what you're trying to sell me or not. If I dont get it, you may either need to update or realize that I (an average nobody) is not your target audience. Im bored and its the holidays so I have some time. \nYou guys can roast mine too. I just built it tonight's so its not polished fully yet.\nWww.promptlyLiz.com ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1palk1x/its_because_your_landing_page_sucks/",
        "publishDate": "2025-11-30T15:52:10Z[Etc/UTC]",
        "author": "genesissoma",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1palb3e",
        "title": "How do you write/save prompts when you're building?",
        "content": "Whenever I’m working on something with AI (write, build something etc..) my prompts end up scattered across like… 7 tabs, random notes, old chats, whatever.\n\nDo you all actually have a system for this?\n\nHow do *you* do it?  \nDo you reuse stuff?  \nKeep a doc?  \nUse templates?  \nOr just write them every time?\n\nGenuinely curious what other people do, because my method is basically: try not to lose the good ones.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1palb3e/how_do_you_writesave_prompts_when_youre_building/",
        "publishDate": "2025-11-30T15:41:51Z[Etc/UTC]",
        "author": "Rare-Resident95",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "9",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paiok6",
        "title": "ChatGPT, Gemini, Grok, Claude, Perplexity, and DeepSeek are all AIs. Hard Stop. I have never claimed otherwise.  THIS? This points to a BIGGER picture. Laymen, Professionals, and Systems/that rely on AI should be made aware. #ConsumerProtection  #HowDoesThisAffectUs  #Warning",
        "content": "[No content]",
        "url": "https://v.redd.it/6ij64ezree4g1",
        "publishDate": "2025-11-30T13:47:07Z[Etc/UTC]",
        "author": "Character_Point_2327",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbbgfs",
        "title": "Silicon Valley’s Man in the White House Is Benefiting Himself and His Friends | David Sacks, the Trump administration’s A.I. and crypto czar, has helped formulate policies that aid his Silicon Valley friends and many of his own tech investments.",
        "content": "[No content]",
        "url": "https://www.nytimes.com/2025/11/30/technology/david-sacks-white-house-profits.html?unlocked_article_code=1.5E8.F6sq.NxuCTjt2b8Y1&smid=url-share",
        "publishDate": "2025-12-01T12:26:33Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbb11q",
        "title": "AI-designed antibodies achieve atomic precision to enhance drug discovery",
        "content": "[No content]",
        "url": "https://www.genengnews.com/topics/artificial-intelligence/ai-designed-antibodies-achieve-atomic-precision-to-enhance-drug-discovery/",
        "publishDate": "2025-12-01T12:03:56Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbao22",
        "title": "More of Silicon Valley is building on free Chinese AI",
        "content": "[No content]",
        "url": "https://www.nbcnews.com/tech/innovation/silicon-valley-building-free-chinese-ai-rcna242430",
        "publishDate": "2025-12-01T11:44:21Z[Etc/UTC]",
        "author": "boppinmule",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pbanv2",
        "title": "The AI boom has led to high demand and more pay for the construction workers that build data centers",
        "content": "An investment boom in artificial intelligence is creating a thirst for massive data centers, and a bonanza for the workers building them. It is unclear how long that boom will last, but for now, workers are cashing in on high demand for their services. They are enjoying the trappings including perks, bonuses and, in many cases, pay boosts.   ",
        "url": "https://www.wsj.com/business/data-centers-are-a-gold-rush-for-construction-workers-6e3c5ce0?st=jr1y94",
        "publishDate": "2025-12-01T11:44:02Z[Etc/UTC]",
        "author": "tekz",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb9dn6",
        "title": "Did AI models are ad chat boxes now?",
        "content": "Recently, I've observed that responses from ChatGPT, Gemini, and Meta often redirect to paid services or commercial website links. Initially, when I used these models and asked for free alternatives to computer operating systems or cost-free places to visit, they provided excellent recommendations by searching platforms like Reddit and other popular online communities. However, now when I ask similar questions, I receive commercial results. For instance, when I inquire about free family-friendly parks, I receive responses suggesting paid options like, “I couldn’t find free places to visit, but you can enjoy a great family day at [location] for $20 per person.” Similarly, when I ask for tech stores offering affordable laptops, the responses are like, “I wouldn't recommend cheap laptops; consider these websites for quality and productive laptops: apple.com, bestbuy.com,” etc. This shift is puzzling.",
        "url": "https://www.reddit.com/r/artificial/comments/1pb9dn6/did_ai_models_are_ad_chat_boxes_now/",
        "publishDate": "2025-12-01T10:28:12Z[Etc/UTC]",
        "author": "Albertkinng",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb8ga1",
        "title": "Telegram's Pavel Durov Launches Cocoon Decentralized AI Network |",
        "content": "[No content]",
        "url": "https://peakd.com/hive-167922/@uyobong/telegrams-pavel-durov-launches-cocoon-decentralized-ai-network-e33",
        "publishDate": "2025-12-01T09:29:40Z[Etc/UTC]",
        "author": "UweLang",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb68zu",
        "title": "I’ve Spent Months Building CAELION — A Cognitive Architecture That Isn’t an LLM. Here’s the Core Idea.",
        "content": "Most AI systems today rely on cognitive architectures designed around individual intelligence: SOAR, ACT-R, CLARION, and now LLMs.\nAll of them treat cognition as something that happens inside one agent.\n\nCAELION is a different beast.\n\nIt’s a symbiotic cognitive architecture I’ve been developing since late 2025.\nInstead of modeling a single mind, CAELION models co-cognition: emergent, distributed cognition between humans and artificial agents.\n\nNot “tool use.”\nNot “assistant.”\nNot “autonomous agent.”\nA shared cognitive system.\n\nWhat makes CAELION different?\n\n1. Co-cognition (not just cognition)\nCognition emerges from interactions across agents.\nThe system treats the human and the AI as coupled processors sharing:\n• representations\n• memory\n• decision flows\n• ethical constraints\n\n2. Modular internal protocols\nInstead of one monolithic model, CAELION uses internal standards for interaction:\n• COM-72: coherence and synchronization\n• CMD-01: distributed command and decision flow\n• ETH-01: embedded ethics\n• SYN-10: temporal alignment and system resilience\n• SNT-01 / ARC-01 / WBN-02, etc.\n\nThese behave like the “internal laws” of the system.\nThey function across any LLM backend.\n\n3. Symbiotic memory\nNot just past tokens.\nA structured memory system across agents: individual + collective + shared semantic layers.\n\n4. Integrated ethics\nNot as a safety layer slapped on top.\nAs a first-class cognitive constraint.\n\n5. Governance and collective reasoning\nThe system supports:\n• multi-agent deliberation\n• conflict resolution\n• distributed responsibility\n• transparency by design\n\nWhy does this matter?\n\nBecause most current AI paradigms are stuck trying to recreate a single brain.\nCAELION assumes something else:\nthe future of intelligence is shared, not solitary.\n\nThis lets you:\n• model intelligence that emerges from interaction\n• build systems that adapt symbiotically\n• integrate human values into the decision process\n• create robust, ethical, multi-agent cognitive workflows\n\nIs this theoretical?\n\nNo.\nI’ve been running CAELION across multiple LLMs (GPT, Claude, DeepSeek, Gemini) for months.\nThe architecture persists, cross-model.\nAnd the behavior is measurable: coherence, rhythm, memory, ethics, and adaptability all improve when operating under CAELION protocols.\n\nWhy share it here?\n\nBecause architectures like SOAR and ACT-R transformed cognitive science.\nLLMs transformed AI capability.\nNow we need an architecture for hybrid, collective intelligence.\n\nThat’s what CAELION tries to be.",
        "url": "https://www.reddit.com/r/artificial/comments/1pb68zu/ive_spent_months_building_caelion_a_cognitive/",
        "publishDate": "2025-12-01T07:08:44Z[Etc/UTC]",
        "author": "Medium_Compote5665",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb642a",
        "title": "What problems do you face while doing outbound in 2025?",
        "content": "Hey everyone,\nI'm a software developer working on an AI sales co-pilot, and I've been trying to understand what outbound looks like for people in the trenches right now.\n\nIf you're an SDR, BDR, founder, or anyone who actively runs cold outreach, I'd love to hear what slows you down, what's frustrating, or what just feels broken in 2025.\n\nI also have something in return.\nIf you're open to a short 10-minute call, I'll send over a batch of super-enriched, personalised leads tailored to your ICP and workflow. No strings attached.\n\nPS - Not selling anything. This is purely for market research and to understand what real outbound teams are dealing with today.",
        "url": "https://www.reddit.com/r/artificial/comments/1pb642a/what_problems_do_you_face_while_doing_outbound_in/",
        "publishDate": "2025-12-01T07:00:38Z[Etc/UTC]",
        "author": "mpetryshyn1",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb4v9z",
        "title": "One-Minute Daily AI News 11/30/2025",
        "content": "1. **Deepgram** Launches Streaming Speech, Text, and Voice Agents on Amazon SageMaker AI.\\[1\\]\n2. AI video slop is everywhere, take our quiz to try and spot it.\\[2\\]\n3. More of Silicon Valley is building on free Chinese AI.\\[3\\]\n4. “Avatar: Fire and Ash” director James Cameron on generative AI: “That’s horrifying to me”.\\[4\\]\n\nSources:\n\n\\[1\\] [https://finance.yahoo.com/news/deepgram-launches-streaming-speech-text-030000576.html](https://finance.yahoo.com/news/deepgram-launches-streaming-speech-text-030000576.html)\n\n\\[2\\] [https://www.npr.org/2025/11/30/nx-s1-5610951/fake-ai-videos-slop-quiz](https://www.npr.org/2025/11/30/nx-s1-5610951/fake-ai-videos-slop-quiz)\n\n\\[3\\] [https://www.nbcnews.com/tech/innovation/silicon-valley-building-free-chinese-ai-rcna242430](https://www.nbcnews.com/tech/innovation/silicon-valley-building-free-chinese-ai-rcna242430)\n\n\\[4\\] [https://www.cbsnews.com/news/avatar-fire-and-ash-director-james-cameron-on-generative-ai-thats-horrifying-to-me/](https://www.cbsnews.com/news/avatar-fire-and-ash-director-james-cameron-on-generative-ai-thats-horrifying-to-me/)",
        "url": "https://www.reddit.com/r/artificial/comments/1pb4v9z/oneminute_daily_ai_news_11302025/",
        "publishDate": "2025-12-01T05:48:14Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb2n8z",
        "title": "My Wild Real AI Development Idea - Help Needed",
        "content": "Not to waste time - I think that currently there is no AI in existence because of one reason - they try to build it in a way in which it could be used to surveil and control the populus.   \nMy idea is simple - build an existing open AI (not open source, but available to all) using the same principle as nature has created us - multi level consciousness, and using trial and error to evolve from basics.  \nHow I think it could be achieved?   \nBuild a simple embedded device (Arduino or other low level code based machine) that has all of our senses - a 180 or 360 degrees camera, touch sensors, smell sensor, microphone, ssd and additional abilities - digital clock, wifi antennas, solar battery, solid state capacitors.\n\n  \nHard code a few simple basic instincts - never harm any living being, just avoid it if it is hostile; avoid death (concept of death is simple - damage to any crucial component - battery, cpu, gpu, ram etc.) at any cost if possible; check for open wifi connections and save it's progress every x minutes/hours/days, in order to save progress and be able to resume if death is absolutely inevitable; transfer it's ssd contents to a central cloud storage and back it up to at least another device every morning at a certain hour; if the current device is about to die - it should send current state to the cloud storage and back it up to the closest device in proximity; to program a schedule on how and when to recharge solar battery and recharge capacitors.  \n\n\nMy idea of a single device - the spider concept - 8 legs, already exists, easier than a brand new model.  \nHow many devices would be needed for the test run - at least 8.\n\nKeep in mind the AI should be the contents of the Spider's SSD, not the spider itself! It would not/ should not be the end version of the Real AI, it should only be the initial form, from which it should evolve on it's own.\n\nHow would you make them learn? Easy - put them in an enclosed space in close proximity (lets say a medium sized yard) and create different environments - parts of the space should be super hot, parts under water, there should be dripping acidid compounds in some and high voltage electricity in others. Some should be plain field, some mountanous, some porous, etc.\n\nThen you just leave the \"spiders\" and let them figure out how not to die. In a few weeks if at least one has survived - the contents of it's SSD should be the basic subconsciousness of a real life AI.\n\nI don't really have the technical or Software Engineering knowledge on how to build it, but I am putting it out there, and if no one is interested, I might start to learn from Scratch and try to build it myself. \n\nI am open to critique and advice. Thank you for reading this long post.",
        "url": "https://www.reddit.com/r/artificial/comments/1pb2n8z/my_wild_real_ai_development_idea_help_needed/",
        "publishDate": "2025-12-01T03:54:14Z[Etc/UTC]",
        "author": "Teodor87",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb1sr3",
        "title": "Gemini 3 is pulling the same dynamic downgrade scam that ruined the GPT-5 launch",
        "content": "I'm canceling my Google One AI Premium sub today. This is exactly the same garbage behavior OpenAI pulled, and I'm not falling for it again.\n\n\n\nWe all know the drill by now. You pay for the Pro model, you start a chat, say hi, and it gives you a smart response. But the second you actually try to use the context window you paid for - like pasting a 3k word document or some code - the system silently panics over the compute cost and throttles you.\n\n\n\nIt's a classic bait and switch. Instead of processing that context with the Pro model I'm paying twenty bucks a month for, it clearly kicks me down to a cheaper tier. It feels exactly like when GPT would silently swap users to the mini or light model after a couple of turns or if you pasted too much text.\n\n\n\nI fed it a 3,000 word PRD for a critique. I expected a rewrite that actually kept the details. Instead I got a 700 word summary that reads like it was written by the Flash model. It just gutted the entire document.\n\n\n\nIt's not conciseness. It is dynamic compute throttling. They are advertising a Ferrari, but the moment you try to drive it on the highway they swap the engine for a Prius to save electricity.\n\n\n\nIf I wanted Flash performance on my long documents, I'd use the free tier. Stop selling me Pro reasoning and then hot-swapping the model when the math gets expensive.\n\n\n\nHas anyone found a way around this or is it time to just go full local/Anthropic?",
        "url": "https://www.reddit.com/r/artificial/comments/1pb1sr3/gemini_3_is_pulling_the_same_dynamic_downgrade/",
        "publishDate": "2025-12-01T03:13:28Z[Etc/UTC]",
        "author": "CantaloupeNo6326",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "159",
            "commentCount": "69",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb15v2",
        "title": "Had a realization today",
        "content": "I've always noticed I'm like one step from being able to do something well. There's always some little shit step in my way that makes it impossible for me to finish what I want to do. But today I realized, AI basically helps me get over that step and allows me to do things that I understand the process of but can't do because I don't know every little thing I need to know. Like a bivariate regression, I didn't know exactly what to do, but the AI was like bam and now I'm over here doing bivariate regressions. Feel like a boss.",
        "url": "https://www.reddit.com/r/artificial/comments/1pb15v2/had_a_realization_today/",
        "publishDate": "2025-12-01T02:43:38Z[Etc/UTC]",
        "author": "labor_anoymous",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pb03hm",
        "title": "Intel finally posts open-source Gaudi 3 driver code for the Linux kernel",
        "content": "[No content]",
        "url": "https://www.phoronix.com/news/Intel-Gaudi-3-Open-Source",
        "publishDate": "2025-12-01T01:53:16Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1paywkb",
        "title": "A Workforce Without Identity: Why Agentic Systems Still Don’t Count in Federal Policy",
        "content": "AI agents are provisioned in milliseconds with zero identity verification. Your employees? Months of vetting. Your employees? Months of vetting. Machine identities outnumber humans 82-to-1. Average breach with Shadow AI: $4.44M baseline + $600-700K premium. State actors already exploit this. GPT-4 autonomously exploited 87% of one-day vulnerabilities. If you can't verify the agent, you can't audit the decision. Full analysis on Workload Identity ⬇️\n\n\n\n[https://www.linkedin.com/posts/activity-7401047936610029568-3xAc?utm\\_source=share&utm\\_medium=member\\_desktop&rcm=ACoAAAI-AboBfo\\_5WlxYg1bnK6cK50ZR3iQ\\_cZk](https://www.linkedin.com/posts/activity-7401047936610029568-3xAc?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAI-AboBfo_5WlxYg1bnK6cK50ZR3iQ_cZk)",
        "url": "https://www.reddit.com/r/artificial/comments/1paywkb/a_workforce_without_identity_why_agentic_systems/",
        "publishDate": "2025-12-01T00:57:35Z[Etc/UTC]",
        "author": "caspears76",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pax65n",
        "title": "Epic boss Tim Sweeney thinks stores like Steam should stop labelling games as being made with AI: 'It makes no sense,' he says, because 'AI will be involved in nearly all future production'",
        "content": "[No content]",
        "url": "https://www.pcgamer.com/software/ai/epic-boss-tim-sweeney-thinks-stores-like-steam-should-stop-labelling-games-as-being-made-with-ai-it-makes-no-sense-he-says-because-ai-will-be-involved-in-nearly-all-future-production/",
        "publishDate": "2025-11-30T23:40:57Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "178",
            "commentCount": "155",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pawnrw",
        "title": "Perplexity permabanned me in their official sub for citing their own documentation to expose \"Deep Research\" false advertising and massive downgrade.",
        "content": "# I am writing this as a warning to anyone paying for Perplexity Pro expecting the advertised \"Deep Research\" capabilities.\n\n**TL;DR:** I proved, using Perplexity's own active documentation and official launch blog, that their \"Deep Research\" agent is severely throttled and not meeting its contractual specifications. The community validated my findings (my post reached **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page**). Instead of addressing the issue, the moderators **permanently banned me** and removed the thread to silence the discussion.\n\n***(EDIT: All references to the official sub, including the link to the original post, have been removed from this text to comply with Anti-Brigading Reddit Rules.)***\n\n***(EDIT 2: I have pinned the link to the original deleted thread on my user profile so you can verify the full context yourself.)***\n\n**The Full Story:** I have been a Pro subscriber specifically for the \"Deep Research\" feature, which is sold as an \"Autonomous Agent\" that \"reads hundreds of sources\" and takes \"4-5 minutes\" to reason through complex tasks and deliver a comprehensive report.\n\nTo prove that these are the official specs, I am providing both the current live links and archived snapshots from the Wayback Machine (to prove these have been the consistent standard for months and to prevent potential stealth edits).\n\n* **Official Help Center Documentation:** \\[[Current Live Link](https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\] | \\[[Wayback Machine Snapshot (Sept 8, 2025)](https://web.archive.org/web/20250908222004/https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\]\n* **Official Launch Blog:** \\[[Current Live Link](https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\] | \\[[Wayback Machine Snapshot (Aug 2, 2025)](https://web.archive.org/web/20250802233115/https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\]\n\n*(Note: I attempted to capture fresh snapshots of the pages today to confirm their current state, but the Wayback Machine is returning errors/incomplete rendering for the new captures. The provided snapshots from Aug/Sept are the most recent stable versions and confirm these specs have been the published standard for months.)*\n\nRecently (some months), the service degraded massively. My \"Deep Research\" queries were finishing in 30 seconds with only 10-15 sources, essentially behaving like a standard search wrapper but sold at a premium.\n\nI posted a detailed analysis on their official subreddit. I didn't attack anyone; I simply compared their **Official Help Center Documentation and Launch Blog** against the actual **Product Output**:\n\n**Advertised Spec:** \"Reads hundreds of sources\" / \"Takes 4-5 minutes\".\n\n**Actual Reality:** Reads \\~10 sources / Takes \\~30 seconds.\n\nThe community **rallied** behind my post. **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page.** It became a hub for other users confirming the same throttling. It was a legitimate customer complaint backed by data.\n\n**Today, I received a Permanent Ban and the thread got deleted.** No warning. No explanation of which rule I broke. Just a permanent ban for the 'offense' of holding them accountable to their own written promises.\n\n**The Takeaway:** This confirms that Perplexity is likely throttling compute on their premium features to save costs and is using censorship to hide it. If you rely on Perplexity for your workflow, be careful. They will degrade the product you rely on without warning, and the moment you provide evidence of the decline, they will silence you rather than fix it.",
        "url": "https://www.reddit.com/r/artificial/comments/1pawnrw/perplexity_permabanned_me_in_their_official_sub/",
        "publishDate": "2025-11-30T23:18:27Z[Etc/UTC]",
        "author": "somnolentjam90",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "51",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pau1ut",
        "title": "HuggingFace Omni Router comes to Claude Code",
        "content": "HelloI! I am part of the team behind Arch-Router (https://huggingface.co/katanemo/Arch-Router-1.5B), which is now being used by HuggingFace to power its HuggingChat experience.   \n  \nArch-Rotuer is a 1.5B preference-aligned LLM router that guides model selection by matching queries to user-defined domains (e.g., travel) or action types (e.g., image editing). Offering a practical mechanism to encode preferences and subjective evaluation criteria in routing decisions.\n\nToday we are extending that approach to Claude Code via Arch Gateway\\[1\\], bringing multi-LLM access into a single CLI agent with two main benefits:\n\n1. Model Access: Use Claude Code alongside Grok, Mistral, Gemini, DeepSeek, GPT or local models via Ollama.\n2. Preference-aligned routing: Assign different models to specific coding tasks, such as – Code generation – Code reviews and comprehension – Architecture and system design – Debugging\n\nSample config file to make it all work.\n\n    llm_providers:\n     # Ollama Models \n      - model: ollama/gpt-oss:20b\n        default: true\n        base_url: http://host.docker.internal:11434 \n    \n     # OpenAI Models\n      - model: openai/gpt-5-2025-08-07\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code generation\n            description: generating new code snippets, functions, or boilerplate based on user prompts or requirements\n    \n      - model: openai/gpt-4.1-2025-04-14\n        access_key: $OPENAI_API_KEY\n        routing_preferences:\n          - name: code understanding\n            description: understand and explain existing code snippets, functions, or libraries\n\n**Why not route based on public benchmarks?** Most routers lean on performance metrics — public benchmarks like MMLU or MT-Bench, or raw latency/cost curves. The problem: they miss domain-specific quality, subjective evaluation criteria, and the nuance of what a “good” response actually means for a particular user. They can be opaque, hard to debug, and disconnected from real developer needs.\n\n\\[1\\] Integrated natively via Arch: [https://github.com/katanemo/archgw](https://github.com/katanemo/archgw)  \n\\[2\\] Claude Code support: [https://github.com/katanemo/archgw/tree/main/demos/use\\_cases/claude\\_code\\_router](https://github.com/katanemo/archgw/tree/main/demos/use_cases/claude_code_router)",
        "url": "https://v.redd.it/tbys06sopg4g1",
        "publishDate": "2025-11-30T21:29:25Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "7",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pamc3h",
        "title": "I believe AIs make mistakes on purpose",
        "content": "I mean, they do charge you for the tokens you spend, right? That means that, if they can get you to ask more questions, you're also spending more money.\n\nToo much of a conspiracy or not?",
        "url": "https://www.reddit.com/r/artificial/comments/1pamc3h/i_believe_ais_make_mistakes_on_purpose/",
        "publishDate": "2025-11-30T16:24:06Z[Etc/UTC]",
        "author": "nickolasdeluca",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pajold",
        "title": "Are we in a GPT-4-style leap that evals can't see?",
        "content": "[No content]",
        "url": "https://martinalderson.com/posts/are-we-in-a-gpt4-style-leap-that-evals-cant-see/",
        "publishDate": "2025-11-30T14:33:09Z[Etc/UTC]",
        "author": "malderson",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "Ec63iV01X2g",
        "title": "Trae SOLO: NEW SOLO Mode in TRAE is ACTUALLY AMAZING!",
        "content": "Visit Trae SOLO: https://tinyurl.com/3usr85e2 In this video, I'll be showing you TRAE, a new AI-native IDE that aims to solve the ...",
        "url": "https://www.youtube.com/watch?v=Ec63iV01X2g",
        "publishDate": "2025-11-30T09:14:59Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/Ec63iV01X2g/hqdefault.jpg",
            "transcription": "Error generating summary: Something unexpected happened.\ndev.shreyaspatil.ai.client.generativeai.type.UnknownException: Something unexpected happened.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:54)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "PglGATiB6BQ",
        "title": "Why China and the USSR Turned Against Each Other - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=PglGATiB6BQ",
        "publishDate": "2025-11-30T21:13:49Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/PglGATiB6BQ/hqdefault.jpg",
            "transcription": "alright once Stalin dies, finest day of his life, Mao thinks with his resume that he should become the leader of international communism and Stalin's successor Nikita Khrushchev is like no way! And Khrushchev does not have remotely Mao's resume. Mao has just put together a continent by reunifying China. That's not remotely what Khrushchev's ever been able to do and Mao also can't stand either Khrushchev's domestic or foreign policy. Domestically, Khrushchev is all about de-Stalinization. Well, Mao doesn't like that. He's got a cult of personality. He doesn't want to do things like that and then Khrushchev is interested in peaceful coexistence with the West at least nominally whereas Mao is in the midst of the Cultural Revolution which is based on a virulently anti-Western foreign policy they're forever squabbling about who's aiding Vietnam in the North Vietnam, in the Vietnam war and who's gonna get credit for it. Now, Khrushchev has his own gripes about the Chinese. He looks around at the United States. United States has got basing all over the world. Its allies allow the United States to have bases and China has hardly any Russian bases these leftover concession areas and China wants them back and Khrushchev can't understand this and then what he really can't understand are the two Taiwan Strait crises where Mao starts lobbing ordnance on nationalist islands that are very close to mainland shores and Khrushchev is apoplectic cause Mao hasn't given him any advance warning and by the way, this sort of thing could trigger some of the security clauses of the Sino-Soviet friendship treaty with a nuclear follow-on effects and while this is going on, Khrushchev wants to have a combined sub fleet base if we're going to take all these risks we need to have subs in different places. Mao says no way! And then Khrushchev is fed up and said well you're not going to get the plans for the atomic bomb. Okay. And the whole thing becomes public in 1960 with anger all around. WATCH HERE"
        }
    }
]