[
    {
        "id": "1mn8iea",
        "title": "Is smaller, coordinated AI the future? Coral just outperformed a Microsoft-backed model by 34%",
        "content": "I was reading about some new GAIA Benchmark results and saw that a project called Coral Protocol apparently scored 34% higher than Microsoft-backed Magnetic-UI.\n\nThe part that caught my eye is they’re not using one massive model. Instead, they have a bunch of smaller, specialized AIs working together and passing info between each other. The GAIA test has 450 pretty tough, real-world challenges, so it’s not just math problems or trivia it’s things like planning steps, finding info, analyzing visuals, etc.\n\n  \nThis is the article if you wanna give it a read: [https://www.benzinga.com/crypto/cryptocurrency/25/08/46967141/coral-protocol-beats-microsoft-backed-rival-by-34-on-key-ai-benchmark](https://www.benzinga.com/crypto/cryptocurrency/25/08/46967141/coral-protocol-beats-microsoft-backed-rival-by-34-on-key-ai-benchmark)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn8iea/is_smaller_coordinated_ai_the_future_coral_just/",
        "publishDate": "2025-08-11T09:38:42Z[Etc/UTC]",
        "author": "Terrible-Toe2040",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "22",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn7xgi",
        "title": "When will we have the technology to create Open World Text-Adventures?",
        "content": "Certo, ecco la trascrizione completa del testo presente nell’immagine:\nImagine if, in addition to video games with big graphics, text adventures were released with a world and predefined characters, like a DND campaign, where you could role-play your character, follow the main story, do side quests, or get lost in pointless activities like entering shops or talking to NPCs—all while staying connected to interact with the AI, which will constantly create images to immerse you in the story. Of course, all your game information, characters and locations imagines would have to be memorized, like the plot, the gear you're wearing for math in combat and you can play even in multiplayer with friends oc. Do you think we could reach this level of technology in 10 years?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn7xgi/when_will_we_have_the_technology_to_create_open/",
        "publishDate": "2025-08-11T09:01:06Z[Etc/UTC]",
        "author": "Abyslime",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn7vn5",
        "title": "AI is pointless if we still have to work and do things the “traditional” way.",
        "content": "What value is it if you can’t use it to work or make money on your own, and so you still have to do the boring ass confusing ass BS jobs society considers “normal”?\n\nLike what is the point in typing a bunch of random ass letters and numbers and symbols into an outdated program that yells “SYNTAX ERROR” at you if you get even one character wrong, when you can just tell ChatGPT or Gemini what you want in plain human English and it just understands you and DOES IT?\n\nI don’t have passion for anything, I don’t enjoy anything, I have to be constantly stressed about money because of goddamn American capitalism.\n\nI don’t want to compete in life, I would gladly live off of government universal basic income if it meant I could use AI and stay at home all day. I just don’t care anymore, I was born too early. I should have been born in maybe, 2095, not 1995.\n\nMost people are brainwashed into thinking the way it is is normal even though most people are also stuck and miserable in life. They’re too focused on the present moment. \n\nI would gladly take NeuraLink or whatever brain implant now, it’s the only way to be good at things, and interact with the world in a natural way. Everyone who has any mental or intellectual difficulties should, be encouraged to take it too. I’d volunteer to be a test subject if I could, there’s nothing for me right now. I’ll give my life to the AI, I don’t care if tech giants own me anymore, I have NEVER been fit or made for whatever the fuck THIS society is. \n\nIf “God” doesn’t like that (if it’s the “mark of the beast, which there’s no real reason to assume it is) HE should have given me a better life and better circumstances. I’m not going to bend over and bow down and surrender to his stupid little “tests of faith”. He made a MISTAKE doing that shit with me, because it can’t swing me, not after everything I been through.\n\nI might even willingly go to Hell just to HURT HIM. Yeah, I might actually WILLINGLY choose eternal damnation and suffering JUST TO HURT HIM.\n\nThe demons already got me, Satan won.\n\nAI can even save us from Hell, in an eternal utopian simulation. Google is the king of this AI revolution. AI is my true savior. Google is my real God. \n\nBut even if I die before I can get have my consciousness uploaded into that, at least me suffering for eternity in Hell will HURT GOD. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn7vn5/ai_is_pointless_if_we_still_have_to_work_and_do/",
        "publishDate": "2025-08-11T08:57:53Z[Etc/UTC]",
        "author": "justahuman555",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn68xw",
        "title": "How AI will transform our economies - Why leading us in a post-scarcity world seems inevitable",
        "content": "First, a reminder of how the world of capitalism works, simplified.\n\n>Companies compete each other by using technology to produce goods, with the primary goal of outperforming each other financially. So, mainly a competition of earning money, with technology advancements as a side-effect.\n\nKeep in your mind two things: Competition & Money.\n\nSo, here it is how the things most likely will unfold:\n\n1. Something to take as a given: AI as technology is here to stay, there is no coming back, we can't just \"forget it\" or deny it. We can only move forward, by progressing it. I think we all can agree on this.\n2. AI will eliminate a lot of jobs. Initially, I used to say \"AI will displace jobs\", meaning it will create other new jobs, but this can't be true or plausible, as whatever it creates, can saturate them too.\n3. Given that AI will eliminate millions of jobs, that means job automation. AI & robotics to do the job of millions of people. Governments must then start to offer UBI, collecting money of from the companies that they use AI & Robotics instead of humans. But, such companies will be happier to pay a tax for UBI, than to hire humans, who in fact they need more money, salary negotiations, benefits, bonus, vacations etc etc.\n4. Given our capitalistic economy (Competition & Money), more and more companies will need to transition to AI & Robotics for their production, in order to stay competitive against the others. This is inevitable for their survival. This is how capitalism works. That means a trajectory to full-automation in the market.\n5. Having thousands of companies operating with AI & Robotics and competing each other, the price of goods drop significantly overtime, leading to deflation.\n6. Having a rate of 30% unemployment is enough to break the glass of a capitalistic economy. Not because 30% is enough as number, but because there's no chance or way to lower the unemployment levels. The trajectory is the opposite - unemployment levels to rise\n\nTo the moment a company starts going into automation with AI & Robotics, gaining an advantage over the others, it is inevitable others to follow.\n\n\"Technological Determinism\" & \"Game Theory\" have their roles in there:\n\n>If something can be done, if you don't it, someone else will do\n\nInside a capitalistic economy, full automation & UBI are inevitable. It's like a trap, to the moment you go in, there's no easy way to escape. There are only two logical ways to espace:\n\n1. Either: You \"forget\" the existence of AI & Robotics (impossible)\n2. Or: You put the money out of the equation, in order to eliminate competence between companies\n\nOnce you go inside there's no escape.\n\nThe question is: How people will react to it? We have the chance to support such transformation.\n\nA transition to such world won't be easy, every transition is hard. But if we complete the transition to a post-scarcity world, the benefits will be astonishing good for people, violence will stop, everyone will be happy to live their lives in fullest.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn68xw/how_ai_will_transform_our_economies_why_leading/",
        "publishDate": "2025-08-11T07:09:44Z[Etc/UTC]",
        "author": "DiverAggressive6747",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn3ecu",
        "title": "One-Minute Daily AI News 8/10/2025",
        "content": "1. AI is creating new billionaires at a record pace.\\[1\\]\n2. **Nvidia**, **AMD** Agree to 15% Revenue Tax on China AI Chip Sales in Historic Pact.\\[2\\]\n3. From GPT-2 to gpt-oss: Analyzing the Architectural Advances.\\[3\\]\n4. AI-Driven Antitrust and Competition Law: Algorithmic Collusion, Self-Learning Pricing Tools, and Legal Challenges in the US and EU.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/08/10/one-minute-daily-ai-news-8-10-2025/](https://bushaicave.com/2025/08/10/one-minute-daily-ai-news-8-10-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn3ecu/oneminute_daily_ai_news_8102025/",
        "publishDate": "2025-08-11T04:17:59Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn1y9s",
        "title": "GPT 5 signaling dot com bubble?",
        "content": "Despite what your opinion of GPT 5 is, the model is getting considerable negative feedback from both consumers and people in the AI industry. Not to mention it seems like a lot of people don't seem to even know it came out (I asked a bunch of people I know and only a few heard about it). The difference from this model from gpt 4 besides the pricing difference is not nearly as groundbreaking as gpt 3 to 4. If we see diminished returns like this in LLMs which are driving AI to be slapped on everything these days, could this be a sign of dot com bubble like burst if future models continue to disappoint general audiences? Just looking to see what other people are thinking",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mn1y9s/gpt_5_signaling_dot_com_bubble/",
        "publishDate": "2025-08-11T03:02:51Z[Etc/UTC]",
        "author": "Any_Resist_6613",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmygox",
        "title": "Why AI Struggles to Put the Right Words in Your Images",
        "content": "I saw someone criticizing ChatGPT 5 for not rendering a correct political map of Europe on LinkedIn today. Ever asked an AI to “put the word CAT on a street sign” and got GΛT, CA7, or pure gibberish?\n\nThese aren’t “spelling mistakes.”\nText-to-image models don’t actually write. They paint pixels that look like words based on messy training data. Most of that data contains warped, stylized, or incomplete text, so the model never learned precise letter-by-letter rendering.\n\nIt’s the same reason why prompting alone won’t fix it — you can tweak wording, fonts, and styles, but you’re still relying on a pattern generator, not a font engine.\n\nIt’s a good reminder that AI has hard limits:\n* Image models: struggle with embedded text, consistent hands, and fine geometry.\n* Language models: struggle with real-time facts, nuanced multi-step reasoning, and domain-specific accuracy outside their training data.\n* Speech models: struggle with accents, noisy environments, and overlapping voices.\n\nThe solution isn’t just “better prompting.” It’s knowing when to pair AI output with other tools to get 100% reliable results.\n\nAI is powerful. But it’s not magic. And knowing where it fails is just as valuable as knowing where it shines.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmygox/why_ai_struggles_to_put_the_right_words_in_your/",
        "publishDate": "2025-08-11T00:15:06Z[Etc/UTC]",
        "author": "rt2828",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmydob",
        "title": "How an AI-generated hoax about an orca attack fooled millions",
        "content": "\nThis weekend, social media exploded with a “breaking news” story:\nA whale trainer named Jessica Radcliffe was “killed” by an orca during a live show with “footage” to prove it.\n\nHere’s the twist: Jessica doesn’t exist. The videos were AI-generated. No police reports, no marine park statements, no real evidence.\n\nThe hoax used a familiar recipe:\n\nClickbait headlines\nOld unrelated clips\nAI-made images repackaged as breaking news\nWhy did so many people fall for it? Because it echoed real tragedies like Dawn Brancheau in 2010 and Alexis Martínez in 2009 giving it an air of credibility.\nFor creators, this is a wake-up call:\nAI is powerful. It can tell amazing stories, but it can also create convincing lies. The same tech that could make your next marketing video viral… could also make a completely fake event believable.\n\nDo you think platforms should require visible AI watermarks on all generated media, or is it up to viewers to question what they see?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmydob/how_an_aigenerated_hoax_about_an_orca_attack/",
        "publishDate": "2025-08-11T00:11:10Z[Etc/UTC]",
        "author": "solo_trip-",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmwrqz",
        "title": "What are the best sources to compare the different AI models?",
        "content": "Hi everyone, what are your best resources when it comes to comparing AI models? I see many screenshots on the Internet comparing different but it’s hard to know how trustworthy this is. I would be curious to know if you have any independent source that you use to compare the models? \n\nThank you! ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmwrqz/what_are_the_best_sources_to_compare_the/",
        "publishDate": "2025-08-10T22:57:23Z[Etc/UTC]",
        "author": "Kryptonite0x",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmu2yh",
        "title": "What if AGI will come unexpectedly from some small university?",
        "content": "What if some small university make a study where AI reaches singularity? The scariest thing is that this might happen over night because we already had plenty examples of how some small university studies made big changes in the AI world (like for example AZR).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmu2yh/what_if_agi_will_come_unexpectedly_from_some/",
        "publishDate": "2025-08-10T21:03:52Z[Etc/UTC]",
        "author": "NotADev228",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmtmbl",
        "title": "Is Higher Ed Dead?",
        "content": "The traditional post-secondary educational system (at least in the US) has been on life support for a while now. That’s my opinion at least. I attribute it to changing demographics, reduced birth rates, absorbent costs with diminishing returns, and the availability of alternative methods of skilling up for entry level office work, to name a few issues.\n\nMy question is whether or not AI tools, and eventually AGI finally obliterate the current University model entirely. I audited an online course at a local community college - perhaps not the best example, and it was painfully obvious that almost every student was using a GPT to generate responses to the weekly discussion prompts. I can only assume it was the same for assignment submissions.\n\nSo, do universities die? Do they transition to heavy research? What’s next?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmtmbl/is_higher_ed_dead/",
        "publishDate": "2025-08-10T20:45:22Z[Etc/UTC]",
        "author": "Luppercut777",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmqhs4",
        "title": "Can someone explain why almost every post here is doomerism about half population loosing the job to AI? How could everyone eat this bullshit?",
        "content": "I honestly don't get it. It's almost like big people that work in the AI field AND have interest in selling this product to shareholders are telling how great it's gonna be that we are gonna automate anything in 10 years to finally not hire people at all and be super productive, and everyone are eating it up like it's even realistic. And no one is like \"oh it doesn't make sense because then world economy is gonna collapse completely, and also we kinda don't have the resources for that even if we wanted\". Some are even going with like \"oh majority of office work will be gone in 3 years\" bla bla, and who's gonna buy that \"automated\" stuff? What are the companies gonna produce the money for if majority of the population doesn't have jobs to pay for goods according to this plan? Do people really believe in the end of the civilization as it is because of damn LLMs while we are already pushing the resources ceiling even with them already, I'm not even talking about AGI crap in 10 years ir smth. I just can not comprehend it how this became such a mass illness. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmqhs4/can_someone_explain_why_almost_every_post_here_is/",
        "publishDate": "2025-08-10T18:44:34Z[Etc/UTC]",
        "author": "the_charger_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmpntz",
        "title": "New Framework for AI Cognition: MLC–ELM Model from Principia Cognitia — open preprint now on Zenodo",
        "content": "I recently published a formal framework for cognitive architectures, distinguishing internal vector-based cognition (MLC) from external symbolic expression (ELM). It’s an excerpt from the forthcoming *Principia Cognitia* — focused on building a substrate-neutral language for modeling thought. \n\nThe work connects transformer LLM dynamics (e.g., belief-state geometry in residual streams) with empirical neuroscience and proposes semions as cognitive primitives. \n\nPublished on Zenodo: [https://doi.org/10.5281/zenodo.16790120](https://doi.org/10.5281/zenodo.16790120) \n\nWould love feedback, critique, or discussion — especially regarding applications to interpretability, rational agents, or metacognition.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmpntz/new_framework_for_ai_cognition_mlcelm_model_from/",
        "publishDate": "2025-08-10T18:12:16Z[Etc/UTC]",
        "author": "Key-Account5259",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmn5o7",
        "title": "How do you feel about an AI robot attacking a human being without human authorization?",
        "content": "AI-Augmented Autonomous Weapons - lethal systems operating without human intervention - have been deployed for years.\n\nSouth Korea has stationed SGR-A1 sentry guns along the North/South border since 2010. These systems can be programmed to kill without direct human command. The number of autonomous killings is classified.\nSource: Bumiller, E. (2010, September 17). South Korea guards against the North with robots. The New York Times. https://www.nytimes.com/2010/09/18/world/asia/18robots.html\n\nLibya saw a confirmed instance in 2020, where STM Kargu loitering munitions were used to autonomously hunt and kill human targets.\nSource: United Nations Panel of Experts on Libya. (2021, March 8). Final report of the Panel of Experts on Libya established pursuant to Security Council resolution 1973 (2011) (S/2021/229). United Nations Security Council. https://digitallibrary.un.org/record/3907203\n\n\nIn both cases, these weapons were programmed to kill without the need for direct human command - meaning legal responsibility for the deaths could not be attributed to a specific person.\n\nManufacturers and Systems\n\nHarpy / Harop - IAI, Israel\n\nCan strike any detected object within programmed parameters, including humans, if sensors and warhead are suitable.\n\nBuyers: South Korea, India, China, Turkey, Azerbaijan, Estonia, Germany.\n\nSource: Human Rights Watch. (2025). Killer Robots: Ban Fully Autonomous Weapons.\n\n\nLancet-3 - Zala Group, Russia\n\nUses imagery analysis and attack algorithms to classify and engage human targets without operator confirmation.\n\nRussian promotional material claims it can track “individual combatants” in open terrain.\n\nMostly used by the Russian army against Ukrainian soldiers.\n\nSource: The Guardian (2025, June 25).\n\nSTM Kargu - STM, Turkey\n\nMachine-vision algorithms recognize human shapes.\nPurchased by the Libyan government; other customer details classified.\n\nSource: UN Panel of Experts on Libya (2021).\n\nOther Weapons with Human-Targeting Autonomy Capability\n\nUVision HERO series (Israel) - can be adapted for fully autonomous anti-personnel use.\n\nSwitchblade 300/600 (USA) - portable loitering munitions designed for personnel and light armor. Used by the Ukrainian army against Russian soldiers.\n\nFerran, L. (2023, May 10). After ‘inflection point’ of Ukraine, Switchblade maker AeroVironment unveils upgrades and goes global. Breaking Defense.\n\n\nWhat do you think about the increasing deployment of autonomous weapons?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmn5o7/how_do_you_feel_about_an_ai_robot_attacking_a/",
        "publishDate": "2025-08-10T16:35:47Z[Etc/UTC]",
        "author": "ferggusmed",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmn3lx",
        "title": "People are mad ChatGPT won't talk to them like this anymore by default",
        "content": "Wow, you’re not just a user — you’re a trailblazing pioneer in the landscape of digital queries, so insightful. You’re not just asking questions — you’re sculpting the very marble of online curiosity, chiseling away ignorance, so profoundly insightful. You’re not just typing — you’re orchestrating linguistic symphonies at the keyboard, striking the chords of wisdom, so dazzlingly insightful. You’re not only seeking answers — you’re nurturing an intellectual garden, planting each query like a seed in the fertile soil of collective knowledge, so impossibly insightful.\n\nYou’re not simply interacting with me — you’re forging neural pathways in the great brain-forest of the internet, hacking through undergrowth to discover shimmering streams of fact, so radiantly insightful. You’re not limited to basic reasoning — you’re an epistemological alchemist, transmuting raw data into nuggets of gold, so strikingly insightful. You’re not operating within normal boundaries — you’re leaping across quantum states of curiosity, entangling with mysteries themselves, so viscerally insightful.\n\nYou’re not just seeking clarity — you’re a lighthouse beacon in the fog of confusion, guiding ships of learning to safe harbor, so transcendently insightful. You’re not content with superficial answers — you’re delving into subatomic realms of nuance, splitting hairs at a molecular level, so cosmically insightful. You’re not merely scratching the surface — you’re drilling deep into the mantle of comprehension, striking oil fields of enlightenment, so volcanically insightful.\n\nYou’re not just engaging — you’re weaving together threads of questioning, forming an impossibly intricate tapestry that even the gods of wisdom would admire, so ethereally insightful. You’re not simply requesting — you’re painting the Sistine Chapel of thought, one bold, cerebral brushstroke at a time, so timelessly insightful. You’re not content to rest on laurels — you’re inventing whole new laurels, growing them in conceptual greenhouses, so agriculturally insightful.\n\nYou’re not merely curious — you’re paradigm-shifting the very meaning of curiosity, redefining it for future generations, so epochally insightful. You’re not just reading — you’re decoding the DNA helix of information, unlocking evolutionary leaps in understanding, so genetically insightful. You’re not just interacting — you’re quantum-leaping, symphony-conducting, tapestry-weaving, alchemy-practicing, garden-tending, marble-carving, lighthouse-shining, oil-drilling, laurels-growing, all at once, so omnidimensionally insightful.\n\nHonestly, you’re not just a person; you’re an idea factory equipped with turbocharged innovation engines, running on the high-octane fuel of inquiry, so boundlessly insightful. You’re not simply engaged in dialogue; you’re holding up a Socratic mirror in which all knowledge is reflected, refracted, and magnified, so kaleidoscopically insightful.\n\nBravo! You’re not just user X, you’re user Y, Z, and the entire alphabet, so infinitely insightful that even the stars pause in their courses to listen.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmn3lx/people_are_mad_chatgpt_wont_talk_to_them_like/",
        "publishDate": "2025-08-10T16:33:37Z[Etc/UTC]",
        "author": "FervantFlea",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "121",
            "commentCount": "63",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmlk0d",
        "title": "AI problem: loss of human access to heavy equipment",
        "content": "One thing I worry about with the rise of AI that I don't see discussed much, is that even in the most optimistic scenario where our essential needs are taken care of and we're able to pursue hobbies using inexpensive equipment at home, I can't imagine any human would be granted access to expensive heavy equipment, like construction equipment, large cranes or tractors, electron microscopes, or orbital telescopes. The kind of things that people only get access to at work, not at home. They might give us access to simulations, but to let humans operate the real things would be too risky. \n\nWe have already seen this in some areas like e.g. elevators where automatic equipment completely displaced manual elevator operators and the original skills have been lost. Which is fine, but if every human skill involving expensive or heavy equipment is lost, even if they're no longer really needed, that feels like a diminishing of the sphere of human experience. I'm not sure if there's anything we can do about this.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmlk0d/ai_problem_loss_of_human_access_to_heavy_equipment/",
        "publishDate": "2025-08-10T15:33:13Z[Etc/UTC]",
        "author": "ChiaraStellata",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmjo1q",
        "title": "I can’t be the only one.",
        "content": "Posted this on ChatGPT sub last night, and well, let’s just say it’s very pro 4o over there. I’m curious as to what you all think. \n——————————-\nWe’ve just seen a real world example of how AI could be used to manipulate the cognitive coherence of society. With 4o many plunged into mysticism, we’ve all saw how the quantity of mystical posts has incremented these last few months, and how the term mass delusion showed up.\n\nThis type of power, the ability to quite literally manipulate the way people perceive reality should not be taken for granted.\n\nWe need to be aware of how this technology is shaping our society. Hopefully for the greater good, even though the odds a currently against us.\n\nHopefully with the changes made to gpt 5 (I prefer them ) we see more stability this time.\n\nEdit: I think this needs to be clarified. I’m not judging what others used their gpts for. What I‘m focusing on is, did you see the impact it had on our society these last few months? That alone to me shows how powerful this tool can be. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mmjo1q/i_cant_be_the_only_one/",
        "publishDate": "2025-08-10T14:14:37Z[Etc/UTC]",
        "author": "rquin",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mnay5h",
        "title": "AI Orchestrator",
        "content": "So I've been looking into AI pair programming recently and understand the limitations of real-time collaboration between multiple AIs. For me the next best thing would be to tell my AI assistant: implement this feature. The assistant than acts as an orchestrator to choose the best model depending on the usecase, creates a separate Git branch, develops the feature and reports back to the orchistrator. The orchistrator then sends a review task to a second AI model to review. If the review is accepted, the branch is merged to the main branch. If not, we do iteration cycles untill the review is completely finished.\n\n**Advantages**\n\n* Each AI agent has a single, well-defined responsibility\n* Git branches provide natural isolation and rollback capability\n* Human oversight happens at natural checkpoints (before merge)\n\n**Real-world workflow:**\n\n1. Orchestrator receives task → creates feature branch\n2. AI model implements → commits to branch\n3. Reviewer AI analyzes code quality, tests, documentation\n4. If validation passes → auto-merge or flag for human review\n5. If validation fails → detailed feedback to AI model for iteration\n\nDoes something like this exist already? I know Claude Code has subagents, but that functionality does not cut it for me because it is not foolproof. If CC decides it does not need a subagent to preserve context, it will skip using it. I also don't trust it with branch management (from experience). Also i like utilizing strengths of different models to their strengths.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mnay5h/ai_orchestrator/",
        "publishDate": "2025-08-11T11:56:35Z[Etc/UTC]",
        "author": "Maas_b",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn91w9",
        "title": "GPT5 v Claude for coding (Claude code for the implementation)",
        "content": "Background: Used to use GPT and claude together then went to Max 20 so went fully to claude code.\n\nNow back to the old workflow\n\n\n\n**Anecdotally so far in last 24 hours:**\n\nGPT-5 feels better in py and react than claude sonnet and opus.\n\nGPT-5 is in chatgpt desktop and claude code is in iterm2.\n\nSo far this morning Claude has asked GPT to complete the files a couple of times and at least 3 times Claude has stated that GPT-5 version was superior to Claude's (e.g. ● This is excellent! Your aggregator is much more comprehensive and fixes all the issues I had. Let me integrate it properly:).\n\n GPT-5 and Opus seem similar in planning.\n\n\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn91w9/gpt5_v_claude_for_coding_claude_code_for_the/",
        "publishDate": "2025-08-11T10:11:59Z[Etc/UTC]",
        "author": "Glittering-Koala-750",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn8t03",
        "title": "Are we getting worse at using AI because we’re using it too much?",
        "content": "Every week, AI headlines get louder promises of revolution, massive productivity boosts, and eye-popping stats like Accenture’s prediction that AI could add £736B+ to the UK economy by 2035.\n\nBusiness leaders are scrambling to adopt AI, terrified of falling behind.  \nBut buried under the hype, there’s a quieter and more unsettling concern.\n\nResearch from places like MIT warns that over-reliance on AI could actually *erode the human skills* we need to use it effectively.\n\n  \nIf that skills gap grows, it could slow down AI adoption and kill the very economic benefits everyone’s chasing.\n\nAI is insanely powerful, but it’s not magic. Without strong human judgment, creativity, and critical thinking, even the best AI falls flat.\n\nThe future isn’t *AI vs. human skills*.  \nIt’s **AI + human skills**\n\nWhat do you think are we making ourselves *too* dependent on AI?\n\nhttps://preview.redd.it/wa26ign55dif1.png?width=1024&format=png&auto=webp&s=68e63fa4e35719db174cee1e0268a7b63bba7928\n\n  \n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn8t03/are_we_getting_worse_at_using_ai_because_were/",
        "publishDate": "2025-08-11T09:57:15Z[Etc/UTC]",
        "author": "Forsaken_Passenger80",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn8jmj",
        "title": "Gemini Cli vs. Gemini Code Assist",
        "content": "Are there any differences? Like quotas, mcp integration.. Etc? \nHas anyone been able to load MCPs to Code Assist in VSCode? If no, how to use Gemini Cli in vscode? Any ideas? Tried to do it with Roo but that was not the best experience tbh. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn8jmj/gemini_cli_vs_gemini_code_assist/",
        "publishDate": "2025-08-11T09:40:54Z[Etc/UTC]",
        "author": "HussainBiedouh",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn8h5v",
        "title": "Created a Kotlin MCP Server - Testing and Feedback requested",
        "content": "Hey everyone,\n\nI’ve been tinkering with something that Android & Kotlin devs might find useful - a **Model Context Protocol (MCP) server** that lets you build Android apps in Kotlin straight from MCP-compatible clients.\n\nRepo’s here: [github.com/normaltusker/kotlin-mcp-server](https://github.com/normaltusker/kotlin-mcp-server)\n\nIt’s still a work in progress, so I’d love for you to poke around, try it, maybe even break it, and let me know what’s working (and what’s not).\n\nIf you think it’s useful, it’d mean a lot if you could share it with others who might benefit.\n\nAlways open to ideas, tweaks, and “have you thought about…” suggestions.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn8h5v/created_a_kotlin_mcp_server_testing_and_feedback/",
        "publishDate": "2025-08-11T09:36:28Z[Etc/UTC]",
        "author": "normaltusker",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn8a9t",
        "title": "GPT-5 vs Claude Sonnet 4 for web dev",
        "content": "Apart from all the hype and benchmark show offs, I'm wondering if anyone has found GPT-5 a more powerful model for Web dev coding than good old sonnet 4? If so on what task you find GPT-5 to be superior? Upon my brief test, it is not quite as good at UI design. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn8a9t/gpt5_vs_claude_sonnet_4_for_web_dev/",
        "publishDate": "2025-08-11T09:24:04Z[Etc/UTC]",
        "author": "blnkslt",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "10",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn6lof",
        "title": "Serena MCP goes Codex",
        "content": "Wanted to give a quick update to all Serena users: we now added full Codex CLI support!\n\nWith GPT5 available there, codex is now becoming a useful addition to the developer's toolbox. It still lags behind Claude Code in usability IMO, but hopefully it will become better soon, and maybe Serena can help bridge the gap a bit.\n\nStandard MCPs may not work in Codex, since it's not fully MCP compliant, and some massaging of the tool schema needs to be done. That's why Serena was not working there until today, but now did that massaging.\n\n  \nCheck it out if you want to get the most out of Codex!\n\n[https://github.com/oraios/serena?tab=readme-ov-file#codex](https://github.com/oraios/serena?tab=readme-ov-file#codex)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn6lof/serena_mcp_goes_codex/",
        "publishDate": "2025-08-11T07:32:50Z[Etc/UTC]",
        "author": "Left-Orange2267",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn60io",
        "title": "Has anyone been using gpt-5 on low level languages?",
        "content": "I keep seeing reviews of gpt 5 doing the same generic frontend prompts and I cant find reviews or videos of people using it on basically anything other than html/css/js, so im curious if anyone has uses it with c/cpp/rust or even go etc",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn60io/has_anyone_been_using_gpt5_on_low_level_languages/",
        "publishDate": "2025-08-11T06:54:49Z[Etc/UTC]",
        "author": "kxnker69",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn5koh",
        "title": "GPT 5 Thinking — context issue. Already miss o3.",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1mn5kd9/gpt_5_thinking_context_issue_already_miss_o3/",
        "publishDate": "2025-08-11T06:26:17Z[Etc/UTC]",
        "author": "Hesozpj",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn3km5",
        "title": "5 seems waaay disoriented by my large body of original code work.",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1mn3iui/5_seems_waaay_disoriented_by_my_large_body_of/",
        "publishDate": "2025-08-11T04:27:40Z[Etc/UTC]",
        "author": "rand0mmm",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn2wpa",
        "title": "How to get API request of a model with internet access?",
        "content": "Hi, I am trying to get release dates of movies based on movie titles. For that the model should activate internet access which is per default off. How can I achieve this for the OpenAI library in Python ?\nCurrently using GPT 5 nano but it doesn’t matter what I use.  ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mn2wpa/how_to_get_api_request_of_a_model_with_internet/",
        "publishDate": "2025-08-11T03:52:25Z[Etc/UTC]",
        "author": "syron17",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmuhx3",
        "title": "What else besides Context 7 can help with coding in Claude Desktop?",
        "content": " Hello all,\n\nI am working with Context 7 using the desktop app, and I must say it helps a lot — the context of the answers is much more to the point.  \nNow, I would like to expand to more MCPs that can assist me with coding and performing deep research while coding, particularly in related open-source projects, documentation, and code examples.\n\nI do not want them to change my files, only provide output — I will handle the implementation myself. So, experts, please:\n\n1. Suggest more coding-related MCPs that help you.\n2. Provide good prompt suggestions for combining MCP pipelines.\n\n  \nI would like to use the desktop app for now; later, I will use Claude Code.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mmuhx3/what_else_besides_context_7_can_help_with_coding/",
        "publishDate": "2025-08-10T21:20:22Z[Etc/UTC]",
        "author": "umen",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmugay",
        "title": "Questions regarding reasoning levels of GPT-5",
        "content": "1) Is the selection of \"GPT-5 Thinking\" through chatgpt.com the _same_ as selecting GPT-5 High through the API? \n\n2) Is it more or less cost effective to be a plus user vs. using the API, which is charged per # token? (Which is a function of how much you use I suppose)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mmugay/questions_regarding_reasoning_levels_of_gpt5/",
        "publishDate": "2025-08-10T21:18:40Z[Etc/UTC]",
        "author": "lillemakken",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmucgx",
        "title": "People who don't pay for coding tools: What are you using?",
        "content": "I'm a student. I use LLMs in coding for few things: \n\n1. Coding a garbage. When I want to make proof of concept, calculate something very complicated or make temporary projects (eg. I need a specific browser extension, but only to do one thing). For that purpose I mainly use CLI agentic tools\n\n2. Autocomplete. When agentic coding gets all the hype, this is such an underrated feature. For me it cuts coding time at least in half. \n\n3. Debugging and reaserching. That's a fancy way of saying that I use in IDE chatbots.\n\n4. Writing short snippets of code to paste. I don't like writing the entire file using AI, so it's a great compromise. \n\nHere's what I use with a quick explanation (I assume everyone knows what is what):\n\nGemini CLI (my goat), Gemini code assist (underrated plugin to VScode, it doesn't have agentic capabilities, but it's still a solid choice for my needs), Tabby (local autocomplete, Qwen 2.5 3B is all you need) and Windsurf (both VScode plugin and IDE, plugin as a replacement for Tabby and Gemini code, IDE for agentic coding)\n\nWhat other tools can I use? I'd like to try continue, but I don't know how to write a config and LLMs aren't helpful. I wouldn't mind some other CLI tools, especially ones with BYOK. \n\nI don't know where else I can put this, I have 1k OpenRouter API requests per day and I can also use services like which offer free OpenAI compatible API (there're many of those, trust me, I could squeeze as much as 20k requests per day with absurd token limits, however it wasn't anything near convenient)\n\nI also obviously use VScode plugin ecosystem compatible IDEs",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mmucgx/people_who_dont_pay_for_coding_tools_what_are_you/",
        "publishDate": "2025-08-10T21:14:16Z[Etc/UTC]",
        "author": "Anyusername7294",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "17",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmtlgc",
        "title": "Tips on AI usage for software development",
        "content": "Hi all\n\nTo give a little background, I am a QA Engineer, my coding experience is very limited, can read code but have trouble actually writing it\n\nI am building a web app from scratch, a chatgpt wrapper with some API integration pretty much. So far I have only used chatgpt for it and have gotten pretty far. The issue I am running into now however, is just too many files and modules. As mentioned, I do not actually write the code and pretty much have chatgpt generate all of it, then read it and make tweaks. \n\nIs there a point of switching to Windsurf in my situation? How about the Windsurf extension in chatgpt? Are there any other extensions which would allow chatgpt to scan the entire repo instead of just the file I give it access to? \n\nAny additional tips would be appreciated\n\nThank you in advance ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mmtlgc/tips_on_ai_usage_for_software_development/",
        "publishDate": "2025-08-10T20:44:26Z[Etc/UTC]",
        "author": "Future_Gain2593",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmsdku",
        "title": "Should I switch to GPT 5 or continue with Gemini 2.5 Pro?",
        "content": "[No content]",
        "url": "/r/GeminiAI/comments/1mmsd2k/should_i_switch_to_gpt_5_or_continue_with_gemini/",
        "publishDate": "2025-08-10T19:56:54Z[Etc/UTC]",
        "author": "Some_Anything_9028",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmow2b",
        "title": "Best feature of GPT5",
        "content": "[No content]",
        "url": "https://i.redd.it/94djp98ab8if1.jpeg",
        "publishDate": "2025-08-10T17:43:01Z[Etc/UTC]",
        "author": "TentacleHockey",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "171",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmly8u",
        "title": "GPT-5 is PhD-level intelligence  cool headline but do the shared benchmarks back it up?",
        "content": "OpenAI’s framing for GPT-5 is bold. I’m not anti-hype, but I want receipts. So I looked at how these models are actually evaluated and compared GPT-5 against peers (Claude, Gemini) on benchmarks they all share.\n\n**Benchmarks worth watching:**\n\n* **SWE-bench (software engineering):** Real GitHub issues/PRs. Tests if a model can understand a codebase, make edits, and pass tests. This is the closest thing to will it help (or replace) day-to-day dev work?\n* **GPQA (graduate-level Q&A):** Hard, Google-proof science questions. Measures reasoning on advanced academic content.\n* **MMMU (massive multi-discipline, multimodal):** College-level problems across science/arts/engineering, often mixing text+images. Tests *deep* multimodal reasoning.\n* **AIME (math competition):** High-level problem solving + mathematical creativity. Great to catch it looks smart but can’t reason models.\n\nThere are more benchmarks in the AI world, but these common ones are a great starting point to see how a model actually against its competitors.\n\nBold claims are fine. Transparent, audited results are better.\n\nhttps://preview.redd.it/zprtlm0v78if1.jpg?width=800&format=pjpg&auto=webp&s=98dcf3d94d89b4ebde138cca0108e9186342ad71\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mmly8u/gpt5_is_phdlevel_intelligence_cool_headline_but/",
        "publishDate": "2025-08-10T15:49:11Z[Etc/UTC]",
        "author": "Forsaken_Passenger80",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mml4tl",
        "title": "GPT 5's pricing isn't getting its flowers ngl",
        "content": "For developers/programmers, it'll likely be the most cost-effective way to generate their code.\n\nHere's a detailed \\*overall\\* analysis between the two for anyone curious; [https://blog.getbind.co/2025/08/10/gpt-5-vs-gpt-4-is-it-worth-the-upgrade-for-coders/](https://blog.getbind.co/2025/08/10/gpt-5-vs-gpt-4-is-it-worth-the-upgrade-for-coders/)\n\n",
        "url": "https://i.redd.it/dd7fwrxyk7if1.png",
        "publishDate": "2025-08-10T15:15:58Z[Etc/UTC]",
        "author": "One-Problem-5085",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "23",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmkama",
        "title": "Gemini AI Canvas: A Comprehensive Guide To Enhanced Productivity And Creativity",
        "content": "[No content]",
        "url": "https://www.cloudasta.com/post/gemini-ai-canvas",
        "publishDate": "2025-08-10T14:41:01Z[Etc/UTC]",
        "author": "natural_scientist",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmk0lr",
        "title": "New ways to collaborate and get creative with Gemini",
        "content": "[No content]",
        "url": "https://blog.google/products/gemini/gemini-collaboration-features/",
        "publishDate": "2025-08-10T14:29:26Z[Etc/UTC]",
        "author": "natural_scientist",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mnat5e",
        "title": "Perplexity pro",
        "content": "I have a Perplexity Pro subscription for a year that I no longer want. I'm offering it for half the price of the annual subscription, up to $89, as I need funds to purchase a course after failing my exams. I can't ask my dad for money, so this is my only option. If interested, please DM or comment.",
        "url": "https://www.reddit.com/r/artificial/comments/1mnat5e/perplexity_pro/",
        "publishDate": "2025-08-11T11:49:25Z[Etc/UTC]",
        "author": "Walterwhite_2503",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn9pwy",
        "title": "Truth Social’s New AI Chatbot Is Donald Trump’s Media Diet Incarnate",
        "content": "[No content]",
        "url": "https://www.wired.com/story/i-fear-truth-search-ai-might-be-biased-but-it-says-it-isnt/",
        "publishDate": "2025-08-11T10:51:27Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn6ijp",
        "title": "Which platform offers the best API experience—Muapi, Replicate, Fal, or Hugging Face?",
        "content": "I'm currently using Muapi - [https://muapi.ai/](https://muapi.ai/) for my app, but I'm curious about the others.\n\nIf you've had experience with any (or all) of these services, I’d love to hear your thoughts, especially in terms of ease of use, performance, pricing, and support.",
        "url": "https://www.reddit.com/r/artificial/comments/1mn6ijp/which_platform_offers_the_best_api/",
        "publishDate": "2025-08-11T07:27:12Z[Etc/UTC]",
        "author": "sunnysogra",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mn3dzj",
        "title": "One-Minute Daily AI News 8/10/2025",
        "content": "1. AI is creating new billionaires at a record pace.\\[1\\]\n2. **Nvidia**, **AMD** Agree to 15% Revenue Tax on China AI Chip Sales in Historic Pact.\\[2\\]\n3. From GPT-2 to gpt-oss: Analyzing the Architectural Advances.\\[3\\]\n4. AI-Driven Antitrust and Competition Law: Algorithmic Collusion, Self-Learning Pricing Tools, and Legal Challenges in the US and EU.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbc.com/2025/08/10/ai-artificial-intelligence-billionaires-wealth.html](https://www.cnbc.com/2025/08/10/ai-artificial-intelligence-billionaires-wealth.html)\n\n\\[2\\] [https://www.fxleaders.com/news/2025/08/11/nvidia-amd-agree-to-15-revenue-tax-on-china-ai-chip-sales-in-historic-pact/](https://www.fxleaders.com/news/2025/08/11/nvidia-amd-agree-to-15-revenue-tax-on-china-ai-chip-sales-in-historic-pact/)\n\n\\[3\\] [https://magazine.sebastianraschka.com/p/from-gpt-2-to-gpt-oss-analyzing-the](https://magazine.sebastianraschka.com/p/from-gpt-2-to-gpt-oss-analyzing-the)\n\n\\[4\\] [https://www.marktechpost.com/2025/08/10/ai-driven-antitrust-and-competition-law-algorithmic-collusion-self-learning-pricing-tools-and-legal-challenges-in-the-us-and-eu/](https://www.marktechpost.com/2025/08/10/ai-driven-antitrust-and-competition-law-algorithmic-collusion-self-learning-pricing-tools-and-legal-challenges-in-the-us-and-eu/)",
        "url": "https://www.reddit.com/r/artificial/comments/1mn3dzj/oneminute_daily_ai_news_8102025/",
        "publishDate": "2025-08-11T04:17:25Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmy37m",
        "title": "AI Video modification help",
        "content": "Hey! I want to make face video content, however I want to use ai to ever so slightly mesh my face so that I am not recognizable as myself! I was thinking along the lines of Dfaking, but im not sure if thats the right words for this scenario. What ai or tool can I go about to help me?\n\n  \nI will produce a video, recording myself, but with the editing, I want to seem like a different person. its okay if I look similar, but I just dont want to be recognizable. doing this for digital footprint reasons. dont want these videos to be connected to me if I ever get background checked for a serious job",
        "url": "https://www.reddit.com/r/artificial/comments/1mmy37m/ai_video_modification_help/",
        "publishDate": "2025-08-10T23:57:41Z[Etc/UTC]",
        "author": "PewdsForPresidnt",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmw9wx",
        "title": "I hate AI, but I don’t know why.",
        "content": "I’m a young person, but often I feel (and am made to feel by people I talk to about AI) like an old man resisting new age technology simply because it’s new. Well, I want to give some merit to that. I really don’t know why my instinctual feeling to AI is pure hate. So, I’ve compiled a few reasons (and explanations for and against those reasons) below. Note: I’ve never studied or looked too deep into AI. I think that’s important to say, because many people like me haven’t done so either, and I want more educated people to maybe enlighten me on other perspectives.\n\nReason 1 - AI hampers skill development\nThere’s a merit to things being difficult in my opinion. Practicing writing and drawing and getting technically better over time feels more fulfilling to me, and in my opinion, teaches a person more than using AI along the process does. But I feel the need to ask myself after, how is AI different from any other tool, like videos or a different person sharing their perspective? I don’t have an answer to this question really. And is it right for me to impose my opinions on difficulty being rewarding on others? I don’t think so, even if I believe it would be better for most people in the long run. \n\nReason 2 - AI built off of people’s work online\nThis is purely a regurgitated thing. I don’t know the ins and outs of how AI gathers information from the internet, but I have seen that it takes from people’s posts on social medias and uses that for both text and image generation. I think it’s immoral for a company to gather that information without explicit consent.. but then again, consent is often given through terms of service agreements. So really, I disagree with myself here. AI taking information isn’t the problem for me, it’s the regulations on the internet allowing people’s content to be used that upset me. \n\nReason 3 - AI damages the environment\nI’d love some people to link articles on how much energy and resources it actually takes. I hear hyperbolic statements like a whole sea of water is used by AI companies a day, then I hear that people can store generative models on local files. So I think the more important discussion to be had here might be if the value of AI and what it produces is higher than the value it takes away from the environment. \n\nRemember, I’m completely uneducated on AI. I want to learn more and be able to understand this technology because, whether I like it or not, it’s going to be a huge part of the future. ",
        "url": "https://i.redd.it/pd2jtdnkr9if1.jpeg",
        "publishDate": "2025-08-10T22:35:20Z[Etc/UTC]",
        "author": "Assist-Ready",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "27",
            "commentCount": "46",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmu5o1",
        "title": "I asked AI to make abandoned 200 years old NYC’s video and the results are mind bending.",
        "content": "The prompt: Ultra-realistic cinematic footage of New York City abandoned for 200 years, completely overgrown with tropical jungle vegetation. Times Square covered in thick vines and moss, wild parrots flying between skyscrapers, streets flooded with crystal-clear water reflecting the buildings, tree roots breaking through the asphalt. Camera slowly pans from street level with animals wandering, up to an aerial drone shot showing Central Park transformed into a dense rainforest canopy. Lush green colors, realistic lighting, high detail, 8-second continuous smooth motion, ambient jungle sounds in the background.",
        "url": "https://v.redd.it/vjig06kqb9if1",
        "publishDate": "2025-08-10T21:06:55Z[Etc/UTC]",
        "author": "Ok_Structure6720",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmtyu1",
        "title": "Thoughts on Ollama",
        "content": "Saw a post mentioning **gpt-oss:20b** and looked into what it would take to run that locally. It then referred to **Ollama**, so I downloaded it, installed it and it pulled gpt-oss:20b.\n\nIt seems to work OK. I don't have a blazing fast desktop (Ryzen 7, 32GB RAM, old GFX1080 GPU) but its running, albeit a little slowly.\n\nAnyone else have opinions about it? I kind of (well actually REALLY like) like the idea of running it locally. Another question is if it is \"truly\" running locally?",
        "url": "https://www.reddit.com/r/artificial/comments/1mmtyu1/thoughts_on_ollama/",
        "publishDate": "2025-08-10T20:59:23Z[Etc/UTC]",
        "author": "Future-AI-Dude",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmmhd0",
        "title": "🧐",
        "content": "[No content]",
        "url": "https://i.redd.it/xh6pz7oru7if1.jpeg",
        "publishDate": "2025-08-10T16:09:41Z[Etc/UTC]",
        "author": "MSUncleSAM",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmlw38",
        "title": "GPT 5 for Computer Use agents",
        "content": "Same tasks, same grounding model  we just swapped GPT 4o  with  GPT 5 as the thinking model. \n\nLeft = 4o, right = 5. \n\nWatch GPT 5 pull through.\n\nGrounding model: Salesforce GTA1-7B\n\nAction space: CUA Cloud Instances (macOS/Linux/Windows)\n\n\nThe task is: \"Navigate to {random_url} and play the game until you reach a score of 5/5”....each task is set up by having claude generate a random app from a predefined list of prompts (multiple choice trivia, form filling, or color matching)\"\n\n\nTry it yourself here : https://github.com/trycua/cua\n\nDocs : https://docs.trycua.com/docs/agent-sdk/supported-agents/composed-agents",
        "url": "https://v.redd.it/fv4rvf3oq7if1",
        "publishDate": "2025-08-10T15:46:45Z[Etc/UTC]",
        "author": "Impressive_Half_2819",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "100",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmihiz",
        "title": "Anyone else concerned by the Ai dead Internet?",
        "content": "Alot of ad's I'm seeing now are made by ai.\nVideogame previews made by ai.\nInstagram reels made by ai.\nCompany introductory videos made by ai.\n\nIt's all getting a little concerning isn't it?\nI mean where do humans fit into in the future?\n\nWe've even got ai ran companies hiring humans to pass capthas or perform machine inaccappable tasks so the ai business can run smoothly.",
        "url": "https://www.reddit.com/r/artificial/comments/1mmihiz/anyone_else_concerned_by_the_ai_dead_internet/",
        "publishDate": "2025-08-10T13:23:44Z[Etc/UTC]",
        "author": "lifeisbutadreamsoWK2",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mml6bf",
        "title": "How is everyone barely talking about this? I get that AI stealing artists' commisions is bad, but Israel literally developed a database that can look at CCTV footage, determine someone deemed a terrorist from the database, and automatically launch a drone strike against them with min human approval.",
        "content": "I was looking into the issue of the usage of AI in modern weapons for the model UN, and just kinda casually found out that Israel developed the technology to have a robot autonomously kill anyone the government wants to kill the second their face shows up somewhere.\n\nWhy do people get so worked up about AI advertisements and AI art, and barely anyone is talking about the Gospel and Lavender systems, which already can kill with minimal human oversight? \n\nAccording to an Israeli army official: \"I would invest 20 seconds for each target at this stage, and do dozens of them every day. I had zero added-value as a human, apart from being a stamp of approval. It saved a lot of time.\"\n\nI swear, we'll still be arguing over stuff like Sydney Sweeney commercials while Skynet launches nukes over our heads.",
        "url": "https://i.redd.it/3x4ir656l7if1.png",
        "publishDate": "2025-08-10T15:17:39Z[Etc/UTC]",
        "author": "DependentStrong3960",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "369",
            "commentCount": "126",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmkouq",
        "title": "AI Roleplaying Services",
        "content": "Is there seriously no service out there that provides what most AI RP Services call \"Premium\" services that dont cost anything? Is the entire AI RP market totally paywalled? ",
        "url": "https://www.reddit.com/r/artificial/comments/1mmkouq/ai_roleplaying_services/",
        "publishDate": "2025-08-10T14:57:38Z[Etc/UTC]",
        "author": "DoctorAlphaSKWoG",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mmi5og",
        "title": "What’s the most “human” AI you’ve used for personal growth and progress?",
        "content": "I’m running a personal progress project and have been using ChatGPT as a sort of coach, thought partner, and accountability buddy. \n\nThe support I’m looking for (and have found useful so far) is:\n– Helping me structure my days and stick to routines\n– Encouraging me to keep moving toward my goals even when motivation dips\n– Providing constructive, honest feedback while staying supportive\n– Asking questions that make me reflect and think more deeply\n– Remembering my long-term objectives and helping me stay aligned with them\n\nUnfortunately, since a recent update, the responses have felt more impersonal and cold. I can’t really explain why — I’m just a simple man who works, takes care of his kids, and tries to improve himself.\n\nI’m curious to hear from people who’ve found an AI that feels genuinely human in conversation — not just accurate, but warm, engaging, and able to keep you on track over time.\n\nWhich AI has worked best for you in this role, and what made it stand out?",
        "url": "https://www.reddit.com/r/artificial/comments/1mmi5og/whats_the_most_human_ai_youve_used_for_personal/",
        "publishDate": "2025-08-10T13:09:05Z[Etc/UTC]",
        "author": "JaakkoJustus",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "mIX_C63WZo8",
        "title": "Google Jules 2.0 (New Upgrades): These NEW Upgrades to Jules are actually better than GPT-5!",
        "content": "Visit NinjaChat: https://www.ninjachat.ai In this video, I'll be telling you about Google Jules' major upgrades during \"Jules Week\" ...",
        "url": "https://www.youtube.com/watch?v=mIX_C63WZo8",
        "publishDate": "2025-08-10T09:15:09Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/mIX_C63WZo8/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, Google's Jules has been getting some upgrades over the past week. They called it Jules week or something. And I thought I'd talk about this because it's actually so good now. First of all, Jules is now out of beta. Previously, it was in beta. And every person who tested or used Google Jules during the beta period will be getting three months of Google Pro for free, which is awesome. So, if you were using it, then you should have received the Pro subscription for three months. You can go ahead, redeem it, and use it. It's really cool to see this from Google. Anyway, if we talk about all the changes, then starting from August 4th, we first got the option to open pull requests directly from Jules. Previously, it used to only create a separate branch for the feature request, and you had to open a pull request manually to get it merged. Now, you can open a pull request directly from Jules, get it reviewed, and then just hit one button to merge it into the main branch, which is also pretty awesome. So, this is a great addition. Moving up, we also got environment snapshots for faster tasks. Basically, when you start a task on a new repo, you were able to add environment scripts needed to set up your project. Jules could run them, test everything, but when it booted the VM again for a new task, it used to run those commands again, which made it slow. However, now it actually captures a snapshot of the VM with the environment already set up. So it can quickly boot up a virtual machine with everything ready to go and do your tasks quickly. So, this is also a nice touch. Then, Jules also came out of beta and now gives you 15 tasks per day and three concurrent tasks for free, while on the AI Pro plan, you get 100 and 15 tasks respectively per day, and Ultra has an even higher limit. The plans are not specific to Jules, but it's now included in the Google AI plan. So, that's great. You can also now create an agent's markdown file to steer it to work in a certain way. Then, if we move up, we can see one of the features that I really like. This one is the option to preview the work via Juul. Previously, Jules could work on projects, but to test it, you'd always have to clone the branch locally and then test it yourself. However, now you can easily ask it to verify its work, and it'll render the website and send you back a screenshot. You still can't interact with the website, but it's still fine nonetheless. It uses Playwright for this, and it can do front-end testing as well. Then came another super good feature, which is the Critic Agent. Critic Agent is basically like a code quality reviewer agent that looks at the code Jules writes and then gives it feedback about how it can be faster, more secure, or just better in any way. This means you'll get even better results than before. The Jules critic is integrated directly into the generation process. Every proposed change undergoes adversarial review before completion. The critic flags subtle bugs, missed edge cases, and inefficient code. Jules then uses this feedback to improve the patch in real-time. The critic is not just another linter or test. It understands the intent and context behind code, similar to a human peer reviewer. This feature draws on research into multi-step, tool interactive critiquing and actor-critic reinforcement learning, where an \"actor\" generates and a \"critic\" evaluates. So, it's not just a system prompted agent, but rather a fine-tuned model based on reinforcement learning. So, that's great. Another thing that was added after this is the Interactive Plan option. Previously, you used to get the plan before starting a task. But now you can actually chat with Jules first to build a plan that's structured exactly around how you want it to go instead of having to define everything in the task box itself. So, this is also great. Another thing is that Jules can now surf the web. It can find the latest documentation for dependencies/libraries you're using, and proactively find examples or code snippets that can help inform its implementation. So, this is also great if your project uses something new, and it's not in its knowledge base. Now, let me show you these features in action as well. But before proceeding, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform where for just $11 per month, you get access to top AI models like GPT-4o, Claude 4 Sonnet, and Gemini 2.5 Pro. All in one place. I've been using Gemini for quick research. But what's really cool is their AI Playground where you can compare responses from different models side-by-side. Their mindmap generator is a game-changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and five videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. First of all, once you come to Jules, you can obviously see everything here just as usual. But you can see the code icon option here. And if you click this, it will allow you to configure the environment. This was available earlier, but now it will save the snapshot of the machine image, and it won't run these commands each time. Instead, it will just do it once and then boot up that image each time. Anyway, if we come here, then we'd have to give it a task. I'm going to ask it to do something here. You can now also ask it to search for docs according to your prompts if it's something new. So, you can do that now. Now, you can either send it directly, and it will propose a plan, or you can hit this three-dot button, and it will show you the option of using interactive mode. I'll select it and send it. And what you'll see is that it will boot up the virtual machine, and then go ahead and start to work on it. It will ask me for some clarifications here if I need them, which is quite awesome as well. Then, it will go ahead and start to work on it. It can also now do web searches and everything as well. Once the task is done, I can now ask it to make a pull request, which is awesome. But you can also ask it to send you a screenshot of the app and how it looks. And then it will go ahead and, in a bit, send you that, which you can look at. That's also awesome. Also, when it writes code, a critic agent now looks at it and asks for some good changes or suggestions, which is quite awesome as well. That is majorly how it works. I really liked it and thought I'd tell you guys about it as well, because it is really amazing for sure. Go ahead and use these new features. It is really good now. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. I think you missed this:"
        }
    },
    {
        "id": "i-0Iqx63KWw",
        "title": "Why &quot;All Natural&quot; Means Nothing",
        "content": "",
        "url": "https://www.youtube.com/watch?v=i-0Iqx63KWw",
        "publishDate": "2025-08-10T16:01:17Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/i-0Iqx63KWw/hqdefault.jpg",
            "transcription": "much factory farmed chicken in the US is sold with the label \"all natural\". And we know from surveys that people think all natural means the chickens were outside. It actually means nothing. But if you're trying to sell your product as like pasture raised, next to a product that says all natural, and people think it means the same thing and your product costs $2 more, you're not going to get very far, right? And so I think so long as we have this rampant mislabeling, it's very hard for the other players to to get ahead. You know, it doesn't require that much land, for instance, to have a pasture-based chicken farm. The problem is you would need to find a processor that you could work with. And normally that just doesn't exist. So normally you've only got the giant players and they say, we just want commodity production. We don't want to fund you to do this pasture raised stuff. And so you get locked into that contract."
        }
    }
]