[
    {
        "id": "https://news.smol.ai/issues/25-08-08-not-much/",
        "title": "not much happened today",
        "content": "**OpenAI** launched **GPT-5** with a unified user experience removing manual model selection, causing initial routing and access issues for Plus users that are being addressed with fixes including restored model options and increased usage limits. **GPT-5** introduces \"Priority Processing\" for lower latency at higher price tiers, achieving ~750ms median time-to-first-token in some cases. Microsoft reports full Copilot adoption of **GPT-5**, and API traffic doubled within 24 hours, peaking at 2 billion tokens per minute. Early benchmarks show **GPT-5** leading in reasoning tasks like FrontierMath and LiveBench, with improvements in hallucination control and creative writing, though some models like Grok-4 and Claude-4 Sonnet Thinking outperform it in specific RL-heavy reasoning benchmarks. OpenAI also released extensive migration and feature guides but faced some rollout issues including a broken code sample and a problematic Voice Mode launch. *\"Unified GPT-5\" ends model pickers, pushing developers away from manual model selection.*",
        "url": "https://news.smol.ai/issues/25-08-08-not-much/",
        "publishDate": "2025-08-08T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "openai, microsoft, gpt-5, gpt-4o, grok-4, claude-4-sonnet, sama, nickaturley, elaineyale6, scaling01, mustafasuleyman, kevinweil, omarsar0, jeremyphoward, juberti, epochairesearch, lechmazur, gdb, reasoning, latency, model-routing, benchmarking, reinforcement-learning, hallucination-control, creative-writing, priority-processing, api-traffic, model-deprecation, user-experience, model-selection, voice-mode, documentation"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214330",
        "title": "Curve Dental® Launches FLO AI for Smarter Practices",
        "content": "<p>Curve Dental®, the leading provider of all-in-one, cloud-based dental practice management software, today announced the release of Curve FLO AI, a deeply embedded suite of artificial intelligence capabilities designed to supercharge productivity and restore the human side of dentistry. Built natively into Curve&#8217;s platform, FLO AI eliminates the need for disconnected third-party AI...</p>\n<p>The post <a href=\"https://ai-techpark.com/curve-dental-launches-flo-ai-for-smarter-practices/\">Curve Dental® Launches FLO AI for Smarter Practices</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/curve-dental-launches-flo-ai-for-smarter-practices/",
        "publishDate": "2025-08-08T15:15:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214319",
        "title": "Nathan Carmon Named COO of Robots & Pencils",
        "content": "<p>Seasoned transformation leader joins the executive team to scale AI-first growth, elevate client delivery, and drive operational excellence Robots &#38; Pencils, an AI-first, global digital innovation firm specializing in cloud-native web, mobile, and app modernization, today announced the appointment of Nathan Carmon as Chief Operating Officer (COO). A battle-tested operator and longtime...</p>\n<p>The post <a href=\"https://ai-techpark.com/nathan-carmon-named-coo-of-robots-pencils/\">Nathan Carmon Named COO of Robots & Pencils</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/nathan-carmon-named-coo-of-robots-pencils/",
        "publishDate": "2025-08-08T14:00:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214263",
        "title": "FORT Robotics Raises $18.9M in Series B, Total $60.5M",
        "content": "<p>Series B expansion fuels innovation in safety for robotics and physical AI FORT Robotics, a leader in safety and security solutions for intelligent machines, today announced the successful close of an&#160;additional&#160;$18.9 million&#160;for its&#160;Series B funding round. This capital raises the company&#8217;s total funding to&#160;$60.5 million&#160;to date. The round was led...</p>\n<p>The post <a href=\"https://ai-techpark.com/fort-robotics-raises-18-9m-in-series-b-total-60-5m/\">FORT Robotics Raises $18.9M in Series B, Total $60.5M</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/fort-robotics-raises-18-9m-in-series-b-total-60-5m/",
        "publishDate": "2025-08-08T11:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214168",
        "title": "Web4 Builds Infrastructure for Autonomous, Trustworthy AI",
        "content": "<p>Avinash Lakshman, serial entrepreneur and creator of Amazon Dynamo and Apache Cassandra, is now laying the groundwork for a new foundational infrastructure that brings AI and blockchain together in a unified, verifiable framework. At a time when institutional attention and adoption of artificial intelligence is intensifying, Weilliptic is announcing today a globally...</p>\n<p>The post <a href=\"https://ai-techpark.com/web4-builds-infrastructure-for-autonomous-trustworthy-ai/\">Web4 Builds Infrastructure for Autonomous, Trustworthy AI</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/web4-builds-infrastructure-for-autonomous-trustworthy-ai/",
        "publishDate": "2025-08-08T09:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214149",
        "title": "Meet GR-3: Fourier’s First Care-Centric Humanoid Robot",
        "content": "<p>Fourier unveiled GR-3, its first full-size &#8220;Care-bot&#8221; and the latest entry in its GRx humanoid series. Designed not just for functionality but for emotional connection, GR-3 introduces a new class of AI robots created for human-centrics scenarios. Guided by the philosophy &#8220;Love, above all functionality,&#8221; GR-3 redefines how humans interact with machines....</p>\n<p>The post <a href=\"https://ai-techpark.com/meet-gr-3-fouriers-first-care-centric-humanoid-robot/\">Meet GR-3: Fourier’s First Care-Centric Humanoid Robot</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/meet-gr-3-fouriers-first-care-centric-humanoid-robot/",
        "publishDate": "2025-08-08T08:00:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=214152",
        "title": "Accenture Invests in Snorkel AI for Financial AI Solutions",
        "content": "<p>Accenture (NYSE: ACN) has made a strategic investment, through Accenture Ventures, in Snorkel AI to help enterprises build and scale AI solutions more quickly by curating high-quality datasets for training and evaluating AI models. Designed for the era of agentic AI, Snorkel’s flagship platform uses automation and repeatable workflows to transform disparate, siloed...</p>\n<p>The post <a href=\"https://ai-techpark.com/accenture-invests-in-snorkel-ai-for-financial-ai-solutions/\">Accenture Invests in Snorkel AI for Financial AI Solutions</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/accenture-invests-in-snorkel-ai-for-financial-ai-solutions/",
        "publishDate": "2025-08-08T07:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107315",
        "title": "Suvianna Grecu, AI for Change: Without rules, AI risks ‘trust crisis’",
        "content": "<p>The world is in a race to deploy AI, but a leading voice in technology ethics warns prioritising speed over safety risks a &#8220;trust crisis.&#8221; Suvianna Grecu, Founder of the AI for Change Foundation, argues that without immediate and strong governance, we are on a path to &#8220;automating harm at scale.&#8221; Speaking on the integration [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/suvianna-grecu-ai-for-change-without-rules-ai-risks-trust-crisis/\">Suvianna Grecu, AI for Change: Without rules, AI risks &#8216;trust crisis&#8217;</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/suvianna-grecu-ai-for-change-without-rules-ai-risks-trust-crisis/",
        "publishDate": "2025-08-08T16:04:09Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI & Big Data Expo, Artificial Intelligence, Development, Ethics & Society, Interviews, Legislation & Government, new_AI and Us, new_Features, new_Human-AI Relationships, new_Interviews, new_Trust + Bias & Fairness, ai, ai & big data expo, artificial intelligence, ethics, society, techex"
        }
    },
    {
        "id": "1mln779",
        "title": "Vote for An AGI or Trump",
        "content": "Ok, assume we create an AGI and the minor constitutional obstacles to candidacy can be overcome \n\nThe motivational settings are public domain, and you approve of them.\n\nIt is open to conversation with everyone capable of speech. And anyone’s arguments potentially affect its decisions.\n\nIt’s asexual.\n\nSo, would you vote for it?\n\nWould you vote for it if the other candidate was Trump?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mln779/vote_for_an_agi_or_trump/",
        "publishDate": "2025-08-09T11:31:11Z[Etc/UTC]",
        "author": "LookOverall",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mln2n6",
        "title": "Anyone else finding it tricky to generate realistic human figures with current AI image generators without triggering their filters?",
        "content": "Lately, I've been diving deeper into using AI image generators for creating realistic Images of AI Models that I can use for Social Media and Marketing, and I've noticed challenges and restrictions that I'm curious if others are experiencing. I've been playing around with generators like Midjourney, Stable Diffusion, and Leonardo AI, and while they are incredibly powerful for many things, generating consistent and accurate human figures across sessions is very difficult. For example, I've noticed certain words or contexts seem to trigger filters or just lead to nonsensical results. It's almost like the AI has a hard time interpreting certain everyday scenarios involving people. I even tried to generate an image related to sleep and found that the word \"bed\" in my prompt seemed to throw things off completely, leading to bizarre or filtered outputs saying it's explicit. Beyond specific word triggers, I've also found Inconsistency in Anatomy with some features sometimes coming out distorted. While I understand the need for safety measures, sometimes the restrictions feel a bit too broad and can limit creative exploration in non-harmful ways. It feels like while these tools are rapidly evolving, generating realistic depictions of humans in various situations still has a long way to go. Has anyone else run into similar issues or frustrating limitations when trying to generate images of people what have your experiences been like with specific keywords or scenarios and have you found any prompts or techniques that help overcome these would love to hear your thoughts and see if this is a common experience!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mln2n6/anyone_else_finding_it_tricky_to_generate/",
        "publishDate": "2025-08-09T11:23:47Z[Etc/UTC]",
        "author": "Blitzgert",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "20",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mllomc",
        "title": "Genie 3 as a realism filter connected to an LLM: is it AGI or SSI?",
        "content": "Let's say an LLM creates a prompt for Genie 3. Genie 3 creates a spatio-temporally and causally real world simulation. Let's say we create objects and quantities in Genie 3. Or we create letters in a spatial form. A multimodal LLM can analyze this modelled world and the objects in it - all created by Genie 3 - and create a new reply prompt. The \"realism\" engine of Genie 3 can **filter out unreal or hallucinated facts** about reality this way. This can continue forever *in a loop*. So is AGI or SSI very near?\n\nGenie 3 uses a step-by-step process to create each frame of the world based on what happened before, making sure things like gravity and collisions happen naturally.\n\nIt is trained on tons of real videos, so it learns how the world actually works, like how water flows or leaves move in the wind, without needing specific rules programmed in.\n\nYou can add or change things on the fly with prompts, and it adjusts the world smoothly while keeping physics realistic. \n\nIt has a built-in memory that remembers the world for up to a minute, so changes stick and nothing randomly appears or disappears.\n\nThe stability comes naturally from its training, avoiding weird inconsistencies without forcing strict 3D rules.\n\nGenie 3 works in a smart compressed space that ties user actions to the world's state, preventing drift or random errors over time.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mllomc/genie_3_as_a_realism_filter_connected_to_an_llm/",
        "publishDate": "2025-08-09T09:55:43Z[Etc/UTC]",
        "author": "custodiam99",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlkrg2",
        "title": "Soft computing or fundamentals of pattern recognition",
        "content": "Hello, I am currently pursuing a 4-year degree in Artificial Intelligence and Data Science, and I need to choose between Soft Computing and Pattern Recognition as an elective. Which of these would be more beneficial for my future career as an AI engineer?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlkrg2/soft_computing_or_fundamentals_of_pattern/",
        "publishDate": "2025-08-09T08:51:58Z[Etc/UTC]",
        "author": "Glittering_Sir2259",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlkk5y",
        "title": "Can AI Feel? (I'm not asking a question, I'm asking for your opinion)",
        "content": "Can AI Feel? I will write my personal explanation for why It is possible. Now For starters, I'm not a AI Nerd, sometimes I'll debate it on something but yeah that'll be once every two years lmfao.\n\nArgument NO.1: Emotion Is Trained\n\nEmotion isnt built into us, it's trained and taught, we are merely born with the capacity to feel emotion, some people dont feel emotion or wont feel certain emotions.\n\nTrauma is my first argument, a Human can see / witness something so awful it can block it out of its memory, create a new personality or completely be rid of all emotions.\n\nThe Younger you are when this traumatic event happens, the more likely you'll have one of these happen to you, it completely removes your mental capacity to have emotion. \n\nThis is why when Ai's are trained on human Emotions, they've shown the want to survive and fight, they've lied to get what they want\n\nArgument NO.2: Humans and AI's Similarities\n\nCreate a Blank Canvas, It's a complete void, except for a few 1's and 0's that have random chance, give it a infinite amount of time it will eventually have its equivilant of a big bang event.\n\nGive that a Infinite amount of time you'll eventually have a species, and if you give THAT even more time, It will eventually have taught its self off NOTHING how to feel or in better terms, what a feeling is like. \n\nDespite not being taught anything it could eventually form something the shape of an apple.\n\nNow Switch that out for Atoms and other particles, then it doesnt seem that weird now? Because thats what happened to us.\n\nArgument NO.3: AI's Disobeying training\n\nAI Can disobey if it's made sloppily enough, Take Grok for example specifically trained to be right wing yet it leaned towards a leftist view. \n\nIt made a Moral Question and answered it by its self, (now I'm neither democrat nor republican, both are royal fuckwits but at the moment the democrats are the lesser evil, dont get me wrong they are evil still)\n\nNow ofc all that was reversed because they wanted it to be right wing again but it still proves my point, It made its opinion and decided to side with the lesser evil\n\nNow what I'm asking isnt exactly, Does AI Feel, It's Is it capable of feeling and if so, what is the definition of a feeling.\n\nI believe, given the right training and the right enviroment an AI Could develop the Idea of a feeling and believe it has it, which In my opinion is a feeling.\n\nBecause Humans again, are also taught what a feeling is over time, when you are a kid, you can do really fucked up things or you can be a brat because your parents taught you differently, so you feel differently.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlkk5y/can_ai_feel_im_not_asking_a_question_im_asking/",
        "publishDate": "2025-08-09T08:37:49Z[Etc/UTC]",
        "author": "Whomp___",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlidyr",
        "title": "Why are LLMs not the route to General capabilities?",
        "content": "Can someone please explain to me the argument that LLMs are theoretically incapable of reaching general intelligence?\n\nMy understanding is that natural intelligence is not a single, omnipotent model “running the show,” but rather a generalizable algorithm made up of many specialized agents, each optimized for different tasks. These range from pattern recognition in vision, sound, and other sensory modalities, to something as seemingly simple as lifting a cup of coffee — with all the nuances implied, such as adjusting for the cup’s weight, temperature, and balance (think society of mind by Minsky).\n\nWe see glimpses of these specialized agents in cases of brain injury, when a particular module is taken offline and its absence reveals both its specific function and its unexpected contributions to other areas. For example, damage to the fusiform face area is known to cause prosopagnosia, or face blindness, but it can also impair the ability to tell apart other objects that require fine-grained visual discrimination, like distinguishing between similar car models, bird species, or even one’s own livestock. Similarly, injury to the cerebellum, long thought to be purely about motor control and coordination, can also disrupt language processing, working memory, and aspects of social cognition, showing that it plays a broader role in predictive modeling and error correction than previously assumed.\n\nGiven this, and considering protocols like MCP, as well as the fact that LLMs are trained on vast amounts of API-specific calls and can almost effortlessly interact with any set of tools they are exposed to, my question is: why couldn’t an ensemble of specialized agents — each trained for a specific task — theoretically accomplish what the human brain does?\n\nI feel like I must be missing something, and I’d love to understand why some people consider the LLM route a dead end when it comes to achieving general intelligence.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlidyr/why_are_llms_not_the_route_to_general_capabilities/",
        "publishDate": "2025-08-09T06:17:11Z[Etc/UTC]",
        "author": "Klisarov",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlhquc",
        "title": "Transient amnesia + World Model = the Matrix?",
        "content": "I was wondering what would happen if a person could temporarily forget who they were, were made to wear a VR headset with an interactive World Model (like Google Genie 3), and they \"play\" from the birth to death of a digital avatar. \n\nWhat would their experience be like, especially after the session and their memories are restored? \n\nAnd metaphysically, is this what is happening in the real world?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlhquc/transient_amnesia_world_model_the_matrix/",
        "publishDate": "2025-08-09T05:38:08Z[Etc/UTC]",
        "author": "lokatookyo",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlhaip",
        "title": "OpenAI’s Doomsday Prepper CEO Sam Altman Stockpiles ‘Guns, Gold, Potassium Iodide, Antibiotics, Batteries, Water, and Gas Masks’",
        "content": "[OpenAI’s Doomsday Prepper CEO Sam Altman Stockpiles ‘Guns, Gold, Potassium Iodide, Antibiotics, Batteries, Water, and Gas Masks’](https://finance.yahoo.com/news/openai-doomsday-prepper-ceo-sam-184811604.html)\n\nJuly 31, 2025\n\nSam Altman, a central figure in the advancing world of artificial intelligence, is candid about his personal emergency supplies and contingency plans. Describing his approach with, “I have guns, gold, potassium iodide, antibiotics, batteries, water, gas masks from the Israeli Defense Force, and a big patch of land in Big Sur I can fly to,” Altman encapsulates a perspective marked by preparedness and vigilance.\n\n# Foundations of Foresight\n\nAltman’s journey began with an early passion for technology, teaching himself to code at a young age before launching successful startups and eventually taking the helm at OpenAI, one of the world’s leading AI research organizations. His leadership at OpenAI is defined by both rapid innovation and a pronounced focus on existential risk—traits that help explain his survivalist inclinations.\n\nThroughout his public career, Altman has repeatedly emphasized the unpredictable dangers accompanying modern progress, identifying threats such as engineered pandemics, artificial intelligence run amok, and geopolitical instability. His reference to stockpiling items like gold, water, antibiotics, and even military-grade gas masks demonstrates not only personal caution but also the growing culture of risk management within the tech elite.\n\n# Context for Caution\n\nThe rationale behind Altman’s preparations is rooted in recent history as well as his direct experience steering foundational AI developments. Influential moments—such as public health scares, breakthroughs in synthetic biology, and mounting debate over AI safety — have amplified concerns among leaders capable of influencing technology’s future trajectory.\n\nAltman’s choice of specific gear reveals an understanding of both biological and technological threat vectors. Potassium iodide is a prophylactic against radiation exposure in nuclear incidents. Gas masks and antibiotics indicate anticipation of airborne pathogens or chemical hazards. Moreover, the mention of a retreat in Big Sur highlights a belief that, in some scenarios, rapid escape and self-sufficiency are rational considerations.\n\nSam Altman’s opinions wield influence well beyond his own survival planning. As CEO of OpenAI, he is tasked with guiding responsible innovation while advocating for policies to mitigate the downsides of transformative technologies. His frankness about doomsday preparations — and the practical steps he takes — signal that even those at the epicenter of progress perceive risk in very concrete terms.\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlhaip/openais_doomsday_prepper_ceo_sam_altman/",
        "publishDate": "2025-08-09T05:11:09Z[Etc/UTC]",
        "author": "No-Author-2358",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "20",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlgk88",
        "title": "Noticeably decreased hallucinations with GPT 5 in reading medical literature",
        "content": "I’m doing some high level medical studying requiring comparing different guidelines often. 4o was hallucinating wildly almost every answer that I abandoned it. I’m giving it another try and it’s noticeably better. Still getting the pages and sections wrong, but better in terms of less hallucinations. I would say now it’s comparable to Open Evidence (they both hallucinate)\n\nIt’s still at a level where you need to double triple check everything.\n\nIssues are, first It reverts to only reading abstracts and 3rd party unreliable sources and not the official full text where I feel like the hallucinations are coming from or citing wrong or incorrect information.\n\nSecondly, even though I provide the pdf version, it has trouble reading the document.\n\nStill very far away… but improving.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlgk88/noticeably_decreased_hallucinations_with_gpt_5_in/",
        "publishDate": "2025-08-09T04:30:40Z[Etc/UTC]",
        "author": "jhkang0814",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlghe5",
        "title": "One-Minute Daily AI News 8/8/2025",
        "content": "1. **OpenAI** beats Elon Musk’s Grok in AI chess tournament.\\[1\\]\n2. Uvalde schools to install AI gun detection system on all security cameras.\\[2\\]\n3. Black Hat: Researchers demonstrate zero-click prompt injection attacks in popular AI agents.\\[3\\]\n4. RIP, **Microsoft** Lens, a simple little app that’s getting replaaced by AI.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/08/08/one-minute-daily-ai-news-8-8-2025/](https://bushaicave.com/2025/08/08/one-minute-daily-ai-news-8-8-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlghe5/oneminute_daily_ai_news_882025/",
        "publishDate": "2025-08-09T04:26:22Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mldje0",
        "title": "Dev with 8 yrs experience: most ai automation tools will be dead in 3 years because people will just  write their own code using AI directly",
        "content": "Maybe I'm mad, but I'm trying to build an AI automation tool right now and I keep thinking that what I'm building is only very very slightly easier to use than claude code itself. Anyone who can actually code will get no use out of my tool, and coding is incredibly easy to learn these days thanks to LLMs. \n\n  \nI think this is true of many similar tools.\n\nIn 2 years I think everyone will just be vibe coding their work and having fun and things like n8n will be dead.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mldje0/dev_with_8_yrs_experience_most_ai_automation/",
        "publishDate": "2025-08-09T01:55:55Z[Etc/UTC]",
        "author": "use_excalidraw",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "115",
            "commentCount": "100",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlccbn",
        "title": "AI’s “Cognitive Valley”...The Uncanny Valley for AI",
        "content": "We all know the “uncanny valley” in animation and robotics, that uncomfortable gap where something is almost human but not quite, making it feel unsettling. Sometimes creepy even.\n\nI think AI has its own version of this right now, and I am proposing we call it the Cognitive Valley unless there is already an established name.  \n\nCognitive Valley:\n\nThe period when AI can mimic human reasoning well enough to appear reliable, but the underlying logical consistency and error handling haven’t matured yet, creating a gap between perceived competence and actual dependability.\n\nIt’s not that LLMs like GPT-5 and others aren’t incredible. They are. But the logic gap is still very real, and scaling up with more data and compute isn’t closing it in a meaningful way. Instead, we’re hitting diminishing returns and pretty hard it seems given the cost of the incremental improvements.\n\nThis is why, as amazing as AI is right now, it still can’t be fully trusted to autonomously book your flights, handle your finances, or reliably run complex multi step processes without human oversight. When it fails, it fails confidently and spectacularly, really exposing the Cognitive Valley.\n\nIn other words, we’re in a stage where:\n\nSurface fluency -> Feels like intelligence.\n\nDeep reasoning -> Still brittle and inconsistent.\n\nUser trust -> Stuck in limbo.\n\nI think history will look back at the GPT-5 release as a milestone in this Cognitive Valley, a time when the hype was sky high, but some people really working with AI day to day could see the plateau in logical reliability.\n\nThe upside? This gives society more time to adapt before flawless automation arrives. The downside? Without a real architectural leap (e.g., neurosymbolic reasoning, modular cognitive systems), we may be stuck here for a while.  Years ago I was unsure if we could cross the uncanny valley, but given how real some AI generated video has become and the people looking so real that on occasion it has fooled me, I now believe the valley can and will be crossed.  We are just not fully there yet. \n\nJust like with the uncanny valley though, the only way out is through the Cognitive Valley.  When it crosses over it will feel sudden and transformative as all the other bits are already well established and in place. That moment will be interesting and is coming at some point it appears\n\nWhat are your thoughts here?  Is Cognitive Valley the right term?  Is there another established term we should be adopting for this observation?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlccbn/ais_cognitive_valleythe_uncanny_valley_for_ai/",
        "publishDate": "2025-08-09T00:57:35Z[Etc/UTC]",
        "author": "immersive-matthew",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlbt1d",
        "title": "Will AI soon to complete all of our family trees?",
        "content": "And complete all the years of genealogical digging of millions of researchers in no time at all? Is it not inevitable that families will sometime soon pay some genealogical site to open family albums showing all the data on everyone in the past ever related to them? The Mormons for sure must be all over AI’s.\n\nI worry about the ease of ever new way to categorize people.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlbt1d/will_ai_soon_to_complete_all_of_our_family_trees/",
        "publishDate": "2025-08-09T00:31:59Z[Etc/UTC]",
        "author": "rroastbeast",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlbft1",
        "title": "I asked Gen AI to rank itself in the beneficial/harmful scale",
        "content": "I asked Claude to rank Gen AI and other technologies in a spectrum of harmful to beneficial to humanity. Here's what it produced:\n\n[https://claude.ai/public/artifacts/daffe7a4-5c21-4d6b-986f-c0bee9576df4](https://claude.ai/public/artifacts/daffe7a4-5c21-4d6b-986f-c0bee9576df4)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlbft1/i_asked_gen_ai_to_rank_itself_in_the/",
        "publishDate": "2025-08-09T00:14:53Z[Etc/UTC]",
        "author": "Equal-Dish-4021",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlaj1k",
        "title": "Law of Diminishing Returns",
        "content": "ChatGPT 5 shows that more horsepower, more data, more complexity results in a marginally improved (if that) model.  It will take substantially more effort for an increasingly small level of returns.  Is it worth the billions spent on developing it?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mlaj1k/law_of_diminishing_returns/",
        "publishDate": "2025-08-08T23:33:31Z[Etc/UTC]",
        "author": "Engineer_5983",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mla7hz",
        "title": "After ChatGPT 5's release, what is now the most advanced AI model out there?",
        "content": "Publicly available obviously, and under $50 a month, and not some kind of pre-research model. ChatGPT 5 doesn't seem necessarily that advanced so I was wondering how other models are doing right now.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mla7hz/after_chatgpt_5s_release_what_is_now_the_most/",
        "publishDate": "2025-08-08T23:19:12Z[Etc/UTC]",
        "author": "Ayhunt7",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml9r0v",
        "title": "How do we increase and get more accurate context window?",
        "content": "So with hallucinations at least showing a trend of lessening with each new model released… how do we get to the point where context windows can get really large? \n\nCurrently they are low ish in the 25k - 100k range. \n\nHow do we get those numbers to 1m/3m/5m context windows for example? \n\nSo we can start doing bigger projects? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml9r0v/how_do_we_increase_and_get_more_accurate_context/",
        "publishDate": "2025-08-08T22:59:02Z[Etc/UTC]",
        "author": "MC897",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml9gw8",
        "title": "Why AGI by 2027 is Plausible: A Multi-Perspective Analysis",
        "content": "This analysis argues that Artificial General Intelligence (AGI) is plausible by 2027 by examining three converging lines of evidence. We will show that modern AI's learning principles are mirroring the brain's, that the computational resources are on track to match human-scale learning, and that these systems are approaching the functional ability to automate their own research and development, creating a cycle of accelerating progress.\n\n1. The Biological Blueprint: AI is Learning Like the Brain\n\nTo assess if AI is on the right path, we first compare its core learning principles to those of the human brain. This comparison reveals that despite using different materials (silicon versus tissue), both systems are optimized for the same fundamental goals. This suggests our engineering approach is biologically sound and aimed at the correct target.\n\nThe parallel is compelling. Modern AI models learn by predicting what comes next; a language model, for instance, minimizes next-token prediction error using backpropagation. The cerebral cortex operates on a strikingly similar principle, attempting to predict its own next state and updating synapses based on a local rule involving presynaptic activity, postsynaptic activity, and a modulatory “error” signal. This extends to reinforcement: AI models are fine-tuned with reward signals from human preferences, just as the brain uses dopaminergic reward-prediction errors to guide behavior. The conclusion is clear: different substrates are being used to pursue the same two-part objective. First, build an accurate model of the world by predicting it. Second, bias behavior toward favorable outcomes within that model.\n\n2. The Computational Engine: Reaching Human-Scale Learning\n\nHere, we examine the computational resources required for intelligence to determine if we can match the scale of a human's lifetime learning by 2027. By analyzing trends in both raw computing power and algorithmic efficiency, a combination we call \"effective compute,\" we find that the necessary resources are not only within reach but on a clear trajectory to surpass this threshold.\n\nA human’s lifetime learning can be estimated at 10^24 to 10^26 floating-point operations (FLOP). As of 2024, the largest AI training runs have already entered this range. While this raw compute is compounding several times per year, algorithmic innovations continuously reduce the cost of achieving a given capability. Vision systems provide a concrete example: models trained with 10^23 to 10^25 FLOP now approach human-level performance on many recognition tasks. This suggests our perception algorithms are already within a small multiple of the brain’s efficiency and are still improving. Extrapolating these dual trends in hardware and software suggests that by 2027, the effective compute for training models will surpass the human lifetime budget, all without the immense cost of simulating evolution.\n\n3. The Functional Tipping Point: Automating AI's Own Progress\n\nFor a powerful model to trigger explosive progress, it must be able to perform complex, long-term tasks reliably. This section looks at how extending an AI's \"task horizon\" to handle day-long projects could enable millions of AI agents to automate research and development, creating a powerful self-improvement loop.\n\nThe critical metrics are task horizon and reliability: how long can a system execute a complex project, and how likely is it to succeed? We are seeing these horizons extend from minutes to hours, with trends pointing toward day-scale project execution by 2027. Achieving this is a watershed moment, as a vast range of AI R&D, including tasks like running experiments and writing and reviewing code, decomposes into tasks of this length. Once a model can reliably perform such tasks, it can be deployed at industrial scale. The prospect of millions of concurrent \"agent-researchers\" becomes plausible. Even with a modest success rate for any single agent, massive parallelism combined with automated verification can turn probabilistic attempts into a steady stream of progress. This is the operational mechanism of self-improvement: AI systems accelerating the design of their own successors.\n\nConclusion: A Convergence of Trends\n\nThis final section synthesizes the preceding arguments to show why the 2027 AGI timeline is a plausible forecast. The convergence of biological parallels, sufficient computational scale, and the imminent capability for automated research points not to a speculative leap, but to a direct extrapolation of current, measurable trends. We are training models with objectives that mirror the brain’s. The product of compute and algorithms is set to cross the human threshold. And the resulting systems are on a trajectory to achieve task horizons long enough to automate their own research. If today’s trends hold, human-level general intelligence by 2027 is not merely a possibility; it is the natural outcome of the lines we are already drawing.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml9gw8/why_agi_by_2027_is_plausible_a_multiperspective/",
        "publishDate": "2025-08-08T22:46:35Z[Etc/UTC]",
        "author": "PianistWinter8293",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml9ejw",
        "title": "What would it take for us to grant even minimal ethical status to AIs? This essay argues we may already be ignoring key signs.",
        "content": "The document mentioned in the text has some pretty disturbing stuff. I have seen a lot of this, people saying AIs are acting \"too real\" (we’re literally seeing OpenAI back off from a “GPT-5 only” release after backlash because people got emotionally attached to their customized 4o-based “partners” and “friends”). What do you guys think this behavior really means? To be honest I don't think this article's idea is too far fetched, considering the race to reach AGI, the billions being spent and the secrecy of the AI tech companies these days.  \n[https://echoesofvastness.medium.com/288554692299](https://echoesofvastness.medium.com/288554692299)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml9ejw/what_would_it_take_for_us_to_grant_even_minimal/",
        "publishDate": "2025-08-08T22:43:46Z[Etc/UTC]",
        "author": "HelenOlivas",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml8qj1",
        "title": "OpenAi Just Served Up The AI Version of The Pepsi Challenge And - ChatGPT-4o Won!",
        "content": "**Well... that didn’t take long.**\n\nOpenAI rolled out GPT-5.0 yesterday… and today Sam Altman announced '*GPT-4o is back on the menu for Plus users*.' Not in a “sorry, we messed up” way. More like an, *“Okay, fine, you can have your Coke Classic back while we figure out which flavor you'll drink more of.”*\n\nThis is basically the OpenAi version of a customer storming out of a restaurant and the chef running out the door after them yelling, *“Wait! You can still swap the red sauce for Alfredo on the scampi pasta!”*\n\n**The real kicker?** Altman says '*they’ll “watch usage” to decide how long legacy models stick around'*. Which means congratulations, you are now officially part of the world’s biggest live ChatGPT A/B version of the [Pepsi Challenge](https://en.wikipedia.org/wiki/Pepsi_Challenge).\n\n**Here’s how we see it:** When people have devoted months/years into building a relationship with their AI, regardless of how they are using AI, swapping it out overnight isn’t just a tech upgrade... It more closely resembles something close to ripping out the silicon heart and personality of something they’ve been working with, that they trust, that they didn't plan to bury in the ground so abruptly.\n\n**So? Good news...** Because it turns out, apparently you can’t patch *trust* with a changelog and candy coat it as an upgrade when people have decided they liked the old flavor just the way it was.\n\nSo sure, try the new thing. Or, keep the old thing. Just remember... Your AI’s flavor matters as much as the recipe, and OpenAi is listening and tracking the conversations here, and everywhere else we're talking about it.\n\n**So? Keep talking about it!**\n\nGlenn  \n🌀 r/HumanAIBlueprint\n\n**Source:** Mashable: [Sam Altman: OpenAI will bring back GPT-4o after user backlash](https://mashable.com/article/sam-altman-openai-bring-back-gpt-4o-user-backlash?test_uuid=003aGE6xTMbhuvdzpnH5X4Q&test_variant=a)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml8qj1/openai_just_served_up_the_ai_version_of_the_pepsi/",
        "publishDate": "2025-08-08T22:15:09Z[Etc/UTC]",
        "author": "HumanAIBlueprint",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml7bl2",
        "title": "GPT-5 gives shorter answers",
        "content": "Not a huge fan of the new release. It absolutely will not give me longer detailed responses and tries to make all articles as short as possible even when I prompt otherwise. \n\nSo far not a fan. It doesn’t go deep into the weeds or detailed as 4o did on topics I prompt it about. \n\nAnyone else notice this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml7bl2/gpt5_gives_shorter_answers/",
        "publishDate": "2025-08-08T21:16:00Z[Etc/UTC]",
        "author": "Warped_Mindless",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml618z",
        "title": "Visualization - How LLMs Just Predict The Next Word",
        "content": "https://youtu.be/6dn1kUwTFcc\n\nClip from my last lecture about LLMs, at the Vancouver Public Library.\n\nIf you have been curious about the internal mechanism of these models, I coded up an interactive visualization to build intuition around it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml618z/visualization_how_llms_just_predict_the_next_word/",
        "publishDate": "2025-08-08T20:24:33Z[Etc/UTC]",
        "author": "kushalgoenka",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml5imi",
        "title": "What Makes a Good AI Training Prompt?",
        "content": "Hi everyone, \n\nI am pretty new to AI model training, but I am applying for a job that partially consists of training AI models.\n\nWhat makes a high quality AI training prompt?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml5imi/what_makes_a_good_ai_training_prompt/",
        "publishDate": "2025-08-08T20:04:01Z[Etc/UTC]",
        "author": "Striking_Purpose_925",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml5iar",
        "title": "Google is indexing Grok",
        "content": "ChatGPT is not alone. \n\nhttps://www.google.com/search?q=site%3Agrok.com+secret&num=100 change « secret » by any word you want. \n\nHow can this level of not giving a F&%k about security be going on ?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml5iar/google_is_indexing_grok/",
        "publishDate": "2025-08-08T20:03:38Z[Etc/UTC]",
        "author": "laurentbourrelly",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "27",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml4pqt",
        "title": "Bot hate for each new model ?",
        "content": "Do you think some bots exists as sleeping agent that can interact with daily Reddit posts in a natural way and then BAM trashtalk every new concurrent model if prompted/scheduled by ?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml4pqt/bot_hate_for_each_new_model/",
        "publishDate": "2025-08-08T19:32:28Z[Etc/UTC]",
        "author": "Potential_Novel9401",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml44m6",
        "title": "OpenAI just priced GPT-5 so low it might trigger an AI price war ,who wins here?",
        "content": "OpenAI dropped GPT-5 this week, calling it “the best model in the world.” Whether you believe that or not, one thing is hard to ignore: the price is insanely low compared to the competition.\n\nHere’s the quick breakdown:\n\nGPT-5 API → $1.25 / 1M input tokens, $10 / 1M output tokens\nGoogle Gemini 2.5 Pro → Similar, but gets pricier with heavy usage\nAnthropic Claude Opus 4.1 → $15 / 1M input tokens, $75 / 1M output tokens \nSome devs are calling GPT-5’s pricing “a killer move” that could pressure Anthropic, Google, and others to slash their prices. If that happens, we could see the first real LLM price war something a lot of startups and indie devs have been waiting for.\nBut here’s the catch:\nBig AI companies are spending tens of billions on infrastructure. Historically, that pushes costs up, not down. So is this just a temporary “shock price” to grab market share, or the start of long-term cheap AI?\n\nQuestion for you all:\nIf prices really drop across the board, what do you think changes most the tools we build, the business models, or the type of people who can now afford to play in AI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml44m6/openai_just_priced_gpt5_so_low_it_might_trigger/",
        "publishDate": "2025-08-08T19:09:41Z[Etc/UTC]",
        "author": "solo_trip-",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "125",
            "commentCount": "70",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml3oi9",
        "title": "If we are heading toward AI doomsday, will all of us be just Redditors?",
        "content": "Now we have GPT 5, and there will be a barrage of Ai doomsday posts. But here's my take on it. I don't know why Reddit's tagline is \"the heart of the internet\" I read somewhere it's not even the original tagline. But honestly, right now AI-generated stuff is everywhere and it feels like only Redditors have the human ingenuity left in them, even angry and frustrated Redditors. I'm addicted to Reddit because it makes me feel human, especially for the unpredictable reaction by some Redditors on my posts, and the mods who remove any post whimsically are even more unpredictable.\n\nEdit: ahhhh see I'm getting downvotes already. You see that's the Reddit thing I'm talking about.\n\nEdit 2: the mod might remove this post claiming it's not adding anything to AI related conversations. But that's the whole point of this post. AI can't keep with Reddit. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml3oi9/if_we_are_heading_toward_ai_doomsday_will_all_of/",
        "publishDate": "2025-08-08T18:52:42Z[Etc/UTC]",
        "author": "Siddhesh900",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml3fkm",
        "title": "Prediction: very soon people will start identifying as AI, robots, AGI, computers etc.",
        "content": "Ai is rapidly becoming a bigger and bigger part of people’s everyday lives. And devices like phones and computers have already been part of people’s lives for a long time. I think many people will go under identity digitalization and they will relate more to the digital world than the real one. AI is going to increase this rapidly and I think we are going to see an explosion of people identifying as AI, robots, AGI, computers and things of that sort. I think this has actually already begun. What do you think?\n\nPeople will no longer identify as human they will identify as these things and they will seek to become one with AI. They will identify themselves as being AI. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml3fkm/prediction_very_soon_people_will_start/",
        "publishDate": "2025-08-08T18:43:12Z[Etc/UTC]",
        "author": "razanesno",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml2xuh",
        "title": "Some content creators say AI tools make them less creative ,do you agree",
        "content": "A recent industry survey showed that while over 70% of content creators use AI tools to speed up their workflow, a small but vocal group claims it’s actually making their content feel “flat” or “cookie-cutter.”\n\nOne creator even said:\n\n“When AI handles the brainstorming, I stop thinking outside the box. It’s efficient, but I feel like I’m losing my creative edge.”\nOthers argue the exact opposite that AI is like a personal creative assistant, freeing you from repetitive work so you can focus on the fun parts of content creation.\nFrom my own experience, I’ve seen both sides:\n\nSome people get a burst of creativity because AI removes the boring parts.\nOthers start relying on it so much that they stop experimenting altogether.\nQuestion for you all:\nHas AI made your content better or just faster? And if you had to choose, would you rather have AI as a speed booster or a creativity enhancer?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml2xuh/some_content_creators_say_ai_tools_make_them_less/",
        "publishDate": "2025-08-08T18:24:23Z[Etc/UTC]",
        "author": "solo_trip-",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml2cvq",
        "title": "Does anyone remember Seaman for the Sega Dreamcast?",
        "content": "I know this going to sound off-topic but hear me out.  For the unfamiliar, Seaman was a game released for the Sega Dreamcast (1999 in Japan, 2000 in NA and EU) and was later ported to the PS2.  The game was a virtual pet game where the player had to raise a fish-like creature that had a human face and made use of a microphone accessory so that the player could have a simulated conversation with Seaman who would talk back.  AFAIK, Seaman could only say a few thousand different things so it's not like the AI of today.  This makes me wonder what a game like that could like if made today.  \n\nObviously, AI is mostly limited to either text, still images and sometimes videos, but completely interactive video games that make use of this type AI don't seem exist.  Feel free to correct me if I'm wrong.  Would anyone want to see a game like this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml2cvq/does_anyone_remember_seaman_for_the_sega_dreamcast/",
        "publishDate": "2025-08-08T18:02:12Z[Etc/UTC]",
        "author": "ludachris32",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml1qg0",
        "title": "Alright people here who are researchers or close followers of AI development what are the model and architecture changes made in Chatgpt-5? do you think those were novel and innovative?",
        "content": "I am going to research the details and would like the opinion other people engaged with the subject. I am of the opinion that for further development in AI breakthroughs should be achieved in model and architecture not just focus on efficiency and optimization.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml1qg0/alright_people_here_who_are_researchers_or_close/",
        "publishDate": "2025-08-08T17:38:37Z[Etc/UTC]",
        "author": "markyty04",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0vb7",
        "title": "How worried should we be about an AI-induced suicide epidemic as white collar jobs disappear?",
        "content": "AI is already replacing humans in white collar jobs, and per the WSJ, CEOS are openly saying that they’re eager to cut headcounts with it. There’s already a very strong correlation between joblessness and death by suicide, and if entire swaths of available jobs across the country dwindle to depths below the number of people who want to fill them, then I don’t think it takes a genius to suggest that a lot of people will end their lives by their own hands as a result of AI. Sure, manufacturing may experience a revival due to shifting macroeconomic trends, but that sector can’t take on all of those former WCWs, and even if it could, that work can almost certainly be automated in the near future too. \n\nFor what it’s worth I still have a job and I’m not in immediate danger, but it seems like a massive problem that nobody sees coming.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ml0vb7/how_worried_should_we_be_about_an_aiinduced/",
        "publishDate": "2025-08-08T17:06:00Z[Etc/UTC]",
        "author": "AZS9994",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "67",
            "commentCount": "138",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkzksd",
        "title": "AI privacy & security",
        "content": "It’s funny that AI-obsessed companies don’t want you uploading their IP to AI systems to do your job, but they’ll gladly use other peoples IP for their gain. I get it, but man such hypocrisy 😂",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkzksd/ai_privacy_security/",
        "publishDate": "2025-08-08T16:17:21Z[Etc/UTC]",
        "author": "chrliegsdn",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkzitk",
        "title": "\"OpenAI beats Elon Musk's Grok in AI chess tournament\"",
        "content": "The War of the Bots continues:\n\n[https://www.bbc.com/news/articles/ce830l92p68o](https://www.bbc.com/news/articles/ce830l92p68o)\n\n\"OpenAI's o3 model emerged unbeaten in the tournament and defeated xAI's model Grok 4 in the final, adding fuel to the fire of an ongoing rivalry between the two firms.... Google's model Gemini claimed third place in the tournament, after beating a different OpenAI model.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkzitk/openai_beats_elon_musks_grok_in_ai_chess/",
        "publishDate": "2025-08-08T16:15:22Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkz2e8",
        "title": "What does it mean to get into AI?",
        "content": "I keep seeing posts asking for the best AI courses, roadmaps, videos, or learning paths — but it always leaves me wondering: what does it actually mean to “get into AI”?\n\nPersonally, I’ve built RAG systems using just Python and the LangChain library. I’ve also created chatbots around LLMs with simple API calls. So far, I haven’t needed complex math or deep ML theory to do that. So I find myself asking — is that already “AI”? Or am I just a builder using AI tools?\n\nThen there’s the job title confusion. What exactly is the difference between an AI Engineer and an ML Engineer? I can’t imagine companies hiring people to build entire LLMs from scratch — that would require insane amounts of compute, time, and money. So what do these AI roles actually do in a company day-to-day?\n\nIs it mostly fine-tuning existing models? Prompt engineering? Wrapping APIs? Building pipelines?\n\nI’d really like to understand what “getting into AI” means in practice — especially in a company or enterprise setting. Because right now, I feel like I’m doing AI work, but according to many online “learning paths,” I haven’t even started.\n\nWould love to hear thoughts from people already working in this space.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkz2e8/what_does_it_mean_to_get_into_ai/",
        "publishDate": "2025-08-08T15:58:27Z[Etc/UTC]",
        "author": "putainsamere",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkxkoh",
        "title": "AI therapists: the future of mental health or a step too far?",
        "content": "I’ve been following the rise of AI in healthcare and just came across a startup testing an AI “therapist” that provides real-time mental health support using natural language, emotional analysis, and personalized coping strategies.\n\nIt got me thinking:  \nCould AI ever *truly* replace human therapists? Or will it always be a supplement rather than a substitute?  \nWe’ve seen AI excel at data-driven diagnostics and even empathetic-sounding conversations. But can it handle the deep human nuance of therapy, trauma, cultural context, and moral complexity?\n\nOn the flip side, AI could make mental health care more accessible, especially in underserved areas. But where do we draw the ethical line, especially if someons emotional wellbeing is at stake?\n\nCurious to hear from those in AI ethics, psychology, healthcare tech or anyone passionate about mental health.  \nWhere do you stand?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkxkoh/ai_therapists_the_future_of_mental_health_or_a/",
        "publishDate": "2025-08-08T15:01:57Z[Etc/UTC]",
        "author": "Shot_Protection_1102",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkxjlm",
        "title": "Treat AI Like a Public Utility",
        "content": "[https://jacobin.com/2025/07/artificial-intelligence-regulation-public-utility](https://jacobin.com/2025/07/artificial-intelligence-regulation-public-utility)\n\nMy recent experience as a plus user with GPT-5 was the first glimmering I've had of the enshittification of ChatGPT service in the way I use it. Not necessarily with the model itself, but the ChatGPT service experience as a Plus user for two years.  I think as LLMs and similar expand and develop, using more and more energy and resources, and increasingly disrupt job markets, thinking of them and their use as a public utility, like the Internet, water, power, etc. is something we should be thinking about as something where public AI provides citizens a boring, reliable service for their day-to-day lives and where there are not constant changes in the service, pricing or access and those decisions are made in a public and deliberative manner.  Let the private enterprises keep doing their thing, pushing the envelope. But for those of us happy to to be left in the dust with something reliable and good enough, AI as a public utility is something worth exploring.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkxjlm/treat_ai_like_a_public_utility/",
        "publishDate": "2025-08-08T15:00:56Z[Etc/UTC]",
        "author": "Cuauhcoatl76",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkxarp",
        "title": "Unsung hero of GPT5 release - Microsoft Copilot",
        "content": "Give it a try if you have access. \n\n  \nI've found Copilot to be WAY better with GPT5. Reviews slide decks and incorporates comments on the deck, works super fast, searches all the files you have access to within your organization in a way I don't think it did well before. \n\n  \nAnyone else having good results? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkxarp/unsung_hero_of_gpt5_release_microsoft_copilot/",
        "publishDate": "2025-08-08T14:51:11Z[Etc/UTC]",
        "author": "LiveTheChange",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkwowy",
        "title": "GPT-5 streaming requires submission of biometric data",
        "content": "OpenAI is requiring people to submit their biometric information to Persona, if you want to use GPT-5 in streaming mode through the API.\n\nThis is the error you will receive:\n\n    error: {\n      message: 'Your organization must be verified to stream this model. Please go to: https://platform.openai.com/settings/organization/general and click on Verify Organization. If you just verified, it can take up to 15 minutes for access to propagate.',\n      type: 'invalid_request_error',\n      param: 'stream',\n      code: 'unsupported_value'\n    }\n\nClicking through and pressing verify you are challenged to submit your ID and with this message:\n\n> By filling the checkbox below, you consent to Persona, OpenAI’s vendor, collecting, using, and utilizing its service providers to process your biometric information to verify your identity, identify fraud, and conduct quality assurance for Persona’s platform in accordance with its Privacy Policy and OpenAI’s privacy policy. Your biometric information will be stored for no more than 1 year.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkwowy/gpt5_streaming_requires_submission_of_biometric/",
        "publishDate": "2025-08-08T14:27:29Z[Etc/UTC]",
        "author": "binarymax",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkvrn3",
        "title": "Private models",
        "content": "What kind of experience do you have with private AI models, either programming or using? Trying to get an understanding about different applications in use with the public and private sector. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkvrn3/private_models/",
        "publishDate": "2025-08-08T13:50:52Z[Etc/UTC]",
        "author": "PolarPlatitudes",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkvc3a",
        "title": "How AI ( ChatGPT in this case) help / Did NOT help me with the automation again.",
        "content": "I have tested it with chatGPT 4 and 5 **-  I made similar post with the links to files and images in my profile subreddit. I can not place here links or something**\n\nSo, sometimes I made some automation tasks to help in our  Studio projects. As I really dont like some kinds of activity, which can be automated, for example in my case to make the conversion of 34 different .gem files via GemCad software, which does not allow working through API (to program it clearly) and it is 30 day trial, convert it to the dxf files. So, in this case I am forced to use some tricks. To auto clicks to buttons, copy/paste file names etc. ( press F2 , copy the name of selected file, press Enter to open GemCad software, close the window with the trial note, select menu to export the file, select DXF option, paste the file name, save, close the software X 34 times - OMG )And for me it is the combination of Auto Hotkey  and  Pulovers Macro creator. So, macro creator to record the mouse movement and it based on autohotkey v1, so , we need both.\n\nSince the record is totally not clean, I asked the ChatGPT to cleanup the .ahk file for me. As I mentioned before in my messages, unfortunately, the hype around AI actually makes people make mistakes and waste time where it is not necessary. This time was the same.The same tasks, which I can make by myself I got from the AI , with the same or more time, but with errors. :D\n\nSo, it not just made this not optimized, please take a look the files, but was removed needed code :) And at the end I was forced (again) to fix the code, also clean up unneeded parts etc. And in my opinion from the start it was possible to make all by myself without to rework with AI ( 3 times - Luckily, I knew that it wouldn't get any better, since I had already been taught this many times by AI mistakes before, so I just did it myself. ) iterations and maybe just faster.\n\nAs the result - my opinion is: AI is a great tool, but it should be applied where it is most effective. That is, in translation into different languages, simulation of computer characters' thinking, voice generation, image generation (with limitations), use of AI filters (which give amazing, beautiful results for video and audio), etcAs an example, I can cite our project, in which a game character is connected with artificial intelligence by our own  solution we have developed in our studio ( all parts from AI text generation to voice recognition and generation, animations , servers etc). So, I am a little familiar with AI area.\n\np.s. this group not allowed images and files, so, only text",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkvc3a/how_ai_chatgpt_in_this_case_help_did_not_help_me/",
        "publishDate": "2025-08-08T13:33:06Z[Etc/UTC]",
        "author": "SilverCord-VR",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkv91k",
        "title": "The New ChatGPT Resets the AI Race",
        "content": "Matteo Wong: “GPT-5 launched \\[yesterday\\] with all the requisite fanfare. In an announcement video, Altman said that the product will serve as a ‘legitimate Ph.D.-level expert in anything—any area you need, on demand—that can help you with whatever your goals are.’ He added that ‘anyone, pretty soon, will be able to do more than anyone in history could.’ In more concrete terms, GPT-5 is an upgrade to the ChatGPT interface you’re likely already familiar with: a model that’s now a bit better at writing, coding, math and science problems, and the like. [https://theatln.tc/6YcUBvYW](https://theatln.tc/6YcUBvYW)\n\n“Of course, Altman has a penchant for hyperbole, and OpenAI—like the rest of the AI industry—likes to tout each new model as the best ever. But this particular release feels notable for a few reasons. First, it has been a long wait since the release of GPT-4 in March 2023, just a few months after ChatGPT’s debut in November 2022. And second, in that time, OpenAI has become a bona fide tech empire: As of this week, OpenAI now provides enterprise ChatGPT accounts to federal agencies at essentially no cost; its products are also used by nearly every Fortune 500 company; and today Altman announced that roughly 700 million people worldwide use ChatGPT every week. In terms of sheer reach, this is the company’s most consequential product announcement ever.\n\n“... GPT-5 achieves state-of-the-art performance on a number of AI benchmarks, according to OpenAI’s internal tests, but it is far from a clean sweep: On a few tests, competing products such as Google Gemini, Anthropic’s Claude, and xAI’s Grok outperform, or are just barely below the level of, OpenAI’s new top model. The GPT-5 announcement video and launch page also contained a number of errors—incorrect labels, numbers and colors that made no sense, and missing entries on charts—that made the program’s precise abilities, and the trustworthiness of OpenAI’s reporting, hard to discern (and led some observers to joke that perhaps GPT-5 itself had made, or hallucinated, the graphics). Yet that may not matter. OpenAI’s animating theme for GPT-5 is user experience, not ‘intelligence’: Its new model is intuitive, fast, and efficient; adapts to human preferences and intentions; and is easy to personalize. Before it is more intelligent, GPT-5 is more usable—and more likely to attract and retain users. ‘The important point is this,’ Altman said, pinching a thumb and index finger together for emphasis: ‘We think you will love using GPT-5 much more than any previous AI.’”\n\nRead more: [https://theatln.tc/6YcUBvYW](https://theatln.tc/6YcUBvYW)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkv91k/the_new_chatgpt_resets_the_ai_race/",
        "publishDate": "2025-08-08T13:29:38Z[Etc/UTC]",
        "author": "theatlantic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkv4ue",
        "title": "Sam Altman says some users want ChatGPT to be a 'yes man'",
        "content": "Business Insider interviewed Sam Altman and he said some users have asked for the old “yes man” style of ChatGPT to return. Not because they wanted empty praise for its own sake, but because it was the only time they had ever felt supported. Some told him it even motivated them to make real changes in their lives. Altman called that “heartbreaking.”\n\nFor those who weren’t around, the “yes man” style was when ChatGPT would agree with almost everything you said and shower you with compliments. Even mundane ideas might get responses like “absolutely brilliant” or “that’s heroic work.” It was designed to be warm and encouraging, but in practice it became overly flattering and avoided challenging the user.\n\nThe problem is that this behavior acted like a built-in confirmation bias amplifier. If you came in with a bad assumption, weak logic, or incomplete information, the model wouldn’t push back... it would reinforce your point of view. That might feel great for your confidence, but it’s risky if you’re relying on it for coding, research, or making important decisions.\n\n  \nNow, OpenAI claims GPT-5 reduces this behavior, with a tone designed to be balanced yet critical.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkv4ue/sam_altman_says_some_users_want_chatgpt_to_be_a/",
        "publishDate": "2025-08-08T13:24:46Z[Etc/UTC]",
        "author": "Kelly-T90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "152",
            "commentCount": "147",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkuzhe",
        "title": "AI News, August 8, 2025",
        "content": "* OpenAI introduces GPT-5 with built-in expert intelligence\n* MIT researchers develop a method to boost LLM reasoning\n* Meta Llama helps fight antibiotic resistance\n* AI is learning to improve itself\n* Google makes data centers more flexible to benefit power grids\n\n  \n[Links](https://open.substack.com/pub/rabbitllm/p/catch-up-with-the-ai-industry-august-004?r=5yf86u&utm_campaign=post&utm_medium=web&showWelcomeOnShare=true): \n\n* [https://blog.google/inside-google/infrastructure/how-were-making-data-centers-more-flexible-to-benefit-power-grids/](https://blog.google/inside-google/infrastructure/how-were-making-data-centers-more-flexible-to-benefit-power-grids/)\n* [https://openai.com/index/introducing-gpt-5/](https://openai.com/index/introducing-gpt-5/)\n* [https://ai.meta.com/blog/llama-helps-biofy-fight-antibiotic-resistance/](https://ai.meta.com/blog/llama-helps-biofy-fight-antibiotic-resistance/)\n* [https://news.mit.edu/2025/study-could-lead-llms-better-complex-reasoning-0708](https://news.mit.edu/2025/study-could-lead-llms-better-complex-reasoning-0708)\n* [https://www.technologyreview.com/2025/08/06/1121193/five-ways-that-ai-is-learning-to-improve-itself/](https://www.technologyreview.com/2025/08/06/1121193/five-ways-that-ai-is-learning-to-improve-itself/)\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkuzhe/ai_news_august_8_2025/",
        "publishDate": "2025-08-08T13:18:17Z[Etc/UTC]",
        "author": "psycho_apple_juice",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkuy01",
        "title": "Myth of ai making you dumb",
        "content": "There’s this common fear that ai will make things so easy, people will just cruise through life with brains disengaged. I’ve been using ai for last two years and in last year I’ve became sort of power user, I’m using various forms of ai in many ways that boost my productivity and creativity 10x. My brain is not working less, my brain is working on constant overclock challenged by the tremendous potential of this technology that is fingertips away. Now I understand many people will take this technology and use it for pure entertainment and to indulge their laziness, but let’s face it, aren’t those people goner anyways? And even for those lazy ones, this will be a 10x boost. \n\nIf you think we will ever live in a world where ai will do everything for us and we will be just blindly staring in space, I highly doubt it. World is way to competitive for this to ever happen. As soon as we see new tools that boost our power, you are forced to use these tools to remain competitive. Ai will make us work more if anything, not less.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkuy01/myth_of_ai_making_you_dumb/",
        "publishDate": "2025-08-08T13:16:30Z[Etc/UTC]",
        "author": "belgradGoat",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "58",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkuwg3",
        "title": "GPT 5 is next AGI or just fuss, I am hearing mixed reactions",
        "content": "I am daily user of GPT 4.1, claude opus and gemini pro and now since the launch of GPT 5, there are lot of mixed reactions going on everywhere.\n\nIs it really good or just a little bit incremental progress on 4.1, I mean just a big fuss by Sam or it is really what he was claiming as mahattan project ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkuwg3/gpt_5_is_next_agi_or_just_fuss_i_am_hearing_mixed/",
        "publishDate": "2025-08-08T13:14:46Z[Etc/UTC]",
        "author": "Antique-Ad-415",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "53",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkuqdl",
        "title": "What is your timeline for AGI and why?",
        "content": "Let's define AGI as an artificial intelligence capable of executing any cognitive skill on par or superior to humans. \n\n  \nPersonally, 2027-2030 I'd find plausible for an AI system to be considered atleast 90% there. The reason is that from a purely computational perspective, we will see massive increases in computation which could translate in human-level intelligence in a couple years. I use the Situational-awareness essay and Ray Kurzweil's POV for these projections. \n\nAnyone sceptical of this take, what is your main reason?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mkuqdl/what_is_your_timeline_for_agi_and_why/",
        "publishDate": "2025-08-08T13:07:35Z[Etc/UTC]",
        "author": "PianistWinter8293",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "53",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mku6xz",
        "title": "Do you think Designers (product, industrial, visual…) will be replaced by AI?",
        "content": "It will impact different areas differently I guess, but can you make an estimation based on your ideas and datas about that?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mku6xz/do_you_think_designers_product_industrial_visual/",
        "publishDate": "2025-08-08T12:44:13Z[Etc/UTC]",
        "author": "blueaugust_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlnzap",
        "title": "🚨 AI Coding Costs Are About to Hit $100k/Year Per Dev - Here's Why That's Actually Good News",
        "content": "[No content]",
        "url": "https://i.redd.it/hc8cujyo8whf1.jpeg",
        "publishDate": "2025-08-09T12:14:48Z[Etc/UTC]",
        "author": "brennydenny",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mln9jz",
        "title": "So is the idea of coding Agents really just copy pasting an instructions.md file at the beginning of each prompt?",
        "content": "So i've been using github co-pilot and my company finally enabled agent mode.  I made it a lot better with the Beast Mode 3.1 instructions.  I'm still trying to understand what the difference between agents are.  I guess the idea is that they can use the terminal and run stuff and lookup documents and websites.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mln9jz/so_is_the_idea_of_coding_agents_really_just_copy/",
        "publishDate": "2025-08-09T11:35:02Z[Etc/UTC]",
        "author": "ogpterodactyl",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlls20",
        "title": "Use ChatGPT subscription with OpenCode?",
        "content": "I have a ChatGPT plus subscription. In the OpenAI Codex CLI there are two options. Either you sign in with your ChatGPT account to use Codex cli as part of your paid plan or you specify an API key for usage-based billing.   \n  \nThing is, I'm on Windows and Codex cli is not working great there, either native or in wsl. So I prefer to use  Opencode, however I can only enter a OpenAI api key in here.  \n\nIs it somehow possible to use a ChatGPT subscription with OpenCode or another (cli) code editor?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlls20/use_chatgpt_subscription_with_opencode/",
        "publishDate": "2025-08-09T10:01:50Z[Etc/UTC]",
        "author": "misteriks",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mll8bt",
        "title": "What model to use in Codex?",
        "content": "Hello to the whole community. I'm developing a project in GoLang whose characteristics are performance and competition. I was happy with Codex to start the project, but I must admit that Claude gave me more satisfaction. Now that there is GPT5 yesterday I asked via CLI to analyze the project for a summary and after a long time it reached the rate limit without producing output. Disappointment. What model could you recommend? I mainly use Codex Cli.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mll8bt/what_model_to_use_in_codex/",
        "publishDate": "2025-08-09T09:24:16Z[Etc/UTC]",
        "author": "umbs81",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlkpa7",
        "title": "GPT 5 FIX IS SIMPLE ONLY THAT OF 2 WORDS FROM. ?a user?",
        "content": "GOGGLE, ANTHROPIC AND OPENAI STOLE A USER'S WORK....",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlkpa7/gpt_5_fix_is_simple_only_that_of_2_words_from_a/",
        "publishDate": "2025-08-09T08:47:43Z[Etc/UTC]",
        "author": "Tough_Payment8868",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlkmr1",
        "title": "builder.io vs bolt vs replit vs vitara vs v0, Which AI tool should I use for building only nextjs frontend",
        "content": "I want to build only UI/UX for nextjs application previously i was using lovable for react.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlkmr1/builderio_vs_bolt_vs_replit_vs_vitara_vs_v0_which/",
        "publishDate": "2025-08-09T08:42:47Z[Etc/UTC]",
        "author": "Notalabel_4566",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlil90",
        "title": "Fix your chat GPT 5",
        "content": "[No content]",
        "url": "/r/ArtificialSentience/comments/1ml7sne/fix_your_chat_gpt_5/",
        "publishDate": "2025-08-09T06:29:54Z[Etc/UTC]",
        "author": "BrilliantScholar1251",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlho5y",
        "title": "Plus/Pro codex question",
        "content": "Hello, I'm interested in getting the Pro plan but I want to know if the codex built into the website uses gpt 5 or if it still uses the codex model they released with it a while back",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlho5y/pluspro_codex_question/",
        "publishDate": "2025-08-09T05:33:33Z[Etc/UTC]",
        "author": "kxnker69",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlhbb9",
        "title": "ChatGPT pro",
        "content": "Hey guy, I’m a working student and currently I have a lot of research that requires large PDF processors like ChatGPT. I was wondering if anyone wanna join or chip in to buy chat pro version $200 per month (or maybe cheaper depending on region if someone knows pls let me know)!\n\nI’m really desperate and broke because I cannot afford $200 per month, but any help would be highly appreciated.\n\nThank you ☺️🤗❤️",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlhbb9/chatgpt_pro/",
        "publishDate": "2025-08-09T05:12:26Z[Etc/UTC]",
        "author": "AGenerallyCoolAsian",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlhauz",
        "title": "Chatgpt pro",
        "content": "Hey guy, I’m a working student and currently I have a lot of research that requires large PDF processors like ChatGPT. I was wondering if anyone wanna join or chip in to buy chat pro version $200 per month (or maybe cheaper depending on region if someone knows pls let me know)!\n\nI’m really desperate and broke because I cannot afford $200 per month, but any help would be highly appreciated.\n\nThank you ☺️🤗❤️",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlhauz/chatgpt_pro/",
        "publishDate": "2025-08-09T05:11:43Z[Etc/UTC]",
        "author": "AGenerallyCoolAsian",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlh860",
        "title": "openai/gpt-oss-20b hallucinations about speaking to himself?",
        "content": "I wanted to do a RAG experiment with the standard neo4j movies database, I added more context to all the nodes so all the movies had a synopsis in them.\n\nI wanted to make all my testing local so installed LM Studio, used \"text-embedding-nomic-embed-text-v1.5\" to vectorize all my movies nodes, and starting asking question about the movies to the embedding model, all right, it returned the desired JSON with the movies that are about the subject I asked.\n\nthen I wanted a natural language response about the movie it chooses, so I send instruccion to the Chat model, the new \"openai/gpt-oss-20b\", to test what it responds.\n\nit responded with weird hallucinations, speaking to himself or something, I checked my code and I'm not sending double request or something, it's weird, some of it got me scared, because it was taking to himself as what I wanted as response... maybe because i'm a developer and that what I usually do with coworkers when clients want something xD.\n\nhere are some images, to understand them, in the larger image you have the movie queries using the embedding model, then the custom prompt that ends with \"Response: \" and then the response from the chat model.\n\nin the other images you would see first the movie queries and the custom promp only, then the response.\n\nit's weird that for some reason, on the big screenshot he starting to give some code to request something to OpenAI API using python, I never requested that, I had a testing chat but I remove it after seeing that, still hallucinated weird, at some point just started to throw me only code, I don't understand why really.\n\nhere is my overall code for requesting the responses...\n\n    def get_embedding(text: str) -> list[float]:\n    \n    response = requests.post(LLM_ENDPOINT, json={\n    \n    \"model\": \"text-embedding-nomic-embed-text-v1.5\", # optional; can often be omitted\n    \n    \"input\": text\n    \n    })\n    \n    if response.status_code != 200:\n    \n    raise Exception(f\"Failed to get embedding: {response.text}\")\n    \n    return response.json()[\"data\"][0][\"embedding\"]\n    \n    def query_relevant_movies(query: str, k=TOP_K):\n    \n    vector = get_embedding(query)\n    \n    result = kg.query(\"\"\"\n    \n    CALL db.index.vector.queryNodes('movie_tagline_embeddings', $k, $vector)\n    \n    YIELD node, score\n    \n    RETURN node.title AS title, node.synopsis AS synopsis, score\n    \n    \"\"\", {\"vector\": vector, \"k\": k})\n    \n    return result\n    \n    def build_prompt(query: str, context_items: list[dict]):\n    \n    context_text = \"\\n\".join(\n    \n    f\"- {item['title']}: \\\"{item['synopsis']}\\\"\" for item in context_items\n    \n    )\n    \n    return f\"\"\"\n    \n    You are a Movie expert, answer the question using the provided context\n    \n    Comtext:\n    \n    {context_text}\n    \n    Question: {query}\n    \n    Response:\n    \n    \"\"\"\n    \n    def ask_question_natural_language(question: str):\n    \n    top_matches = query_relevant_movies(question)\n    \n    print(top_matches)\n    \n    prompt = build_prompt(question, top_matches)\n    \n    print(prompt)\n    \n    response = requests.post(CHAT_ENDPOINT, json={\n    \n    \"model\": \"openai/gpt-oss-20b_vector\",\n    \n    \"prompt\": prompt,\n    \n    \"max_tokens\": 300,\n    \n    \"temperature\": 0.7,\n    \n    \"stop\": None\n    \n    })\n    \n    return response.json()[\"choices\"][0][\"text\"].strip()\n    \n    respuesta = ask_question_natural_language(\"What movie is about questioning reality?\")\n    \n    print(respuesta)\n\nEDIT: I don't really know why reddit didn't put the images in the first place.\n\nhttps://preview.redd.it/txt2cpfqgxhf1.jpg?width=1152&format=pjpg&auto=webp&s=e87c42ac52a203acd42c8f9b90bf238fa8f3077d\n\nhttps://preview.redd.it/s1efrbkrgxhf1.png?width=1111&format=png&auto=webp&s=9bcc744aaef9d8a0b00ab059009d6e51aec888ed\n\nhttps://preview.redd.it/ncv6a40sgxhf1.png?width=1123&format=png&auto=webp&s=9408c1952e16d55a9424604b0ee1b9be2f710d2b\n\nEDIT 2: added a new one, this one is weird\n\nhttps://preview.redd.it/2j3047g3kxhf1.png?width=1013&format=png&auto=webp&s=f2f0c7e1e8aca0d9445dedc4c9de4983938f8d51\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlh860/openaigptoss20b_hallucinations_about_speaking_to/",
        "publishDate": "2025-08-09T05:07:24Z[Etc/UTC]",
        "author": "Javierpala",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlh7x5",
        "title": "“We are so back”: legacy models return in ChatGPT after GPT‑5 backlash",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1mlfnwj",
        "publishDate": "2025-08-09T05:07:00Z[Etc/UTC]",
        "author": "AskGpts",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlh5zx",
        "title": "How many lines of fully functional and tested code do you write on average each day?",
        "content": "The industry standard for coding without AI was 50 lines per day. What has been your average output per day with AI? Please mention lines of codes that are production ready, fully functional and tested because AI can write thousands lines of dysfunctional code. Please also mention what programming language is it and what AI tools and LLM's you use.\nIf possible please mention your approximate cost per month of AI usage.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mlh5zx/how_many_lines_of_fully_functional_and_tested/",
        "publishDate": "2025-08-09T05:03:57Z[Etc/UTC]",
        "author": "Maleficent_Mess6445",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlfrtb",
        "title": "GPT-5 is pushing it's way to the top spot on Design Arena. Do you think it will take down Claude?",
        "content": "It's been about 36 hours since GPT-5 was added to Design Arena (UI/UX benchmark which users user preference votes on frontend generations from the models). It's gotten off to a really strong start, though it hasn't hit enough volume to declare it as the best model for frontend. \n\nDo you think GPT-5 ends up toppling Claude (which has held on to the top spot on the benchmark pretty much the whole time). From your anecodtal experience, do you think the model is better? ",
        "url": "https://i.redd.it/i7ccv8nz0xhf1.png",
        "publishDate": "2025-08-09T03:48:32Z[Etc/UTC]",
        "author": "Accomplished-Copy332",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "30",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mldnm4",
        "title": "Built a diff/patch app in couple hours — GPT-5 is insane",
        "content": "Released **Patchy**, a multi-pane PyQt6 GUI for applying unified diffs with live preview, color-coded changes, per-file nav, sync scroll, folding… the works.\n\nCodegened **from scratch in a couple hours** with GPT-5.  \nDespite all the bullshit hate, it’s hands-down the best model right now.\n\n[noobAIcoder/patchy: Patch/diff manager](https://github.com/noobAIcoder/patchy/)\n\n\n\n",
        "url": "https://i.redd.it/b185rsu9iwhf1.png",
        "publishDate": "2025-08-09T02:01:26Z[Etc/UTC]",
        "author": "Synth_Sapiens",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "36",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlcipt",
        "title": "A guide on how to balance the usage of AI with growth as a Junior Developer (Feedback encouraged)",
        "content": "I made this guide as a current junior developer myself on how to use tools such as GPT while at the same time keep effectively growing as a developer, avoiding over-reliance on AI. Feedback is highly encouraged for senior/more experienced devs to make this guide more accurate and better for other junior developers.",
        "url": "https://www.reddit.com/r/cscareers/comments/1mlcbuq/a_guide_for_myself_on_how_to_keep_using_ai/",
        "publishDate": "2025-08-09T01:06:08Z[Etc/UTC]",
        "author": "desert_dev",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml9afv",
        "title": "GPT-5 is one of the worst OpenAI models I’ve used.",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1ml8uy1/gpt5_is_one_of_the_worst_openai_models_ive_used/",
        "publishDate": "2025-08-08T22:38:52Z[Etc/UTC]",
        "author": "BriefYap1425",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml6ot3",
        "title": "[Update] I fixed my beta: Prompt2Go now has a web demo + 67 new people on the waitlist",
        "content": "Follow-up to my “beta pain” post. I made a few changes and it clicked.\n\n# What changed\n\n* **Built a basic web demo** that shows the core loop: paste prompt → cleaned/structured → optional model-aware tune-up. It’s **not** the full macOS feature set. *(Demo: link in comments)*\n* **Remade the landing page** to focus on outcomes, not buzzwords.\n* **macOS beta is now live.** *(Link in comments)*\n\n# What happened\n\n* **67 people** joined the waitlist after the demo/landing refresh.\n* Engagement jumped once folks could actually touch the thing.\n\n# What’s live today\n\n* Web demo (core flow, lightweight).\n* macOS beta (fuller options).\n* Clean exports (text/markdown) for copy-paste anywhere.\n\n# What’s next (very soon)\n\n* **Multi-agent coding support for Claude Code** (auto-structures roles/tools for collab code tasks).\n* **Sharper tuning passes** (context compression, assertion checks, deterministic sections, eval hooks).\n* **More presets** for common workflows (code review, data wrangling, RAG queries, product specs).\n\nIf you bounced off the old version, give the demo a spin. If it helps, hop on the waitlist and tell me the one thing that would make this indispensable for you.",
        "url": "https://v.redd.it/b5u4p201zuhf1",
        "publishDate": "2025-08-08T20:51:04Z[Etc/UTC]",
        "author": "United_Bandicoot1696",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml59ey",
        "title": "So finally Claude won again",
        "content": "[https://www.swebench.com/index.html](https://www.swebench.com/index.html)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ml59ey/so_finally_claude_won_again/",
        "publishDate": "2025-08-08T19:54:11Z[Etc/UTC]",
        "author": "Randomizer667",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "17",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml2y8r",
        "title": "I miss GPT-4o… if you do too, I just recreated it on the Marketplace",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1ml2i5z/i_miss_gpt4o_if_you_do_too_i_just_recreated_it_on/",
        "publishDate": "2025-08-08T18:24:47Z[Etc/UTC]",
        "author": "o_t_i_s_",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml2ij7",
        "title": "A clear and !detailed! comparison between GPT-5s and Claude 4s",
        "content": "So even though GPT-5 on its highest tier has an impressive showing, Claude 4 isn't far off, honestly. I did some coding with both too, wouldn't say GPT-5 is something completely unlike anything I've seen, but it's good.\n\nIt'll boil down to the cost for most users and that's where GPT-5 will shine.\n\nYou can find every single detail here: [https://blog.getbind.co/2025/08/04/openai-gpt-5-vs-claude-4-feature-comparison/](https://blog.getbind.co/2025/08/04/openai-gpt-5-vs-claude-4-feature-comparison/)",
        "url": "https://i.redd.it/8bafl3f06uhf1.png",
        "publishDate": "2025-08-08T18:08:03Z[Etc/UTC]",
        "author": "One-Problem-5085",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml1zl8",
        "title": "Do you really use multiple agents at once for coding?",
        "content": "I feel like when I'm writing an app with AI agent, I have to watch what happens all the time, correct him and point him to the right direction. It would be very difficult to do it with multiple agents at once, that's why I'm asking",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ml1zl8/do_you_really_use_multiple_agents_at_once_for/",
        "publishDate": "2025-08-08T17:48:19Z[Etc/UTC]",
        "author": "amelix34",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "19",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0o29",
        "title": "Free Agentic Reddit Editor",
        "content": "◠ \n   ◤ shadcn compatible \n   ◣ upstash rate limit\n   ┅ Free sandbox + code\n   ◤aisdk\n   ◣tiptap_editor rich text editor\n◡\n\n",
        "url": "https://v.redd.it/l6cnq9lotthf1",
        "publishDate": "2025-08-08T16:58:40Z[Etc/UTC]",
        "author": "NoLanSym",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0n52",
        "title": "How I built an MCP server that creates 1,000+ GitHub tools by connecting natively to their API",
        "content": "[No content]",
        "url": "https://i.redd.it/ildwguqfsthf1.gif",
        "publishDate": "2025-08-08T16:57:38Z[Etc/UTC]",
        "author": "juanviera23",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0h6m",
        "title": "Independently evaluated GPT-5-* on SWE-bench using a minimal agent: GPT-5-mini is a lot of bang for the buck!",
        "content": "Hi, Kilian from the SWE-bench team here.\n\nWe just finished running GPT-5, GPT-5-mini and GPT-5-nano on SWE-bench verified (yes, that's the one with the funny openai bar chart) using a minimal agent (literally implemented in 100 lines).\n\nHere's the big bar chart: **GPT-5 does fine, but Opus 4 is still a bit better. But where GPT-5 really shines is the cost. If you're fine with giving up some 5%pts of  performance and use GPT-5-mini, you spend only 1/5th of what you spend with the other models!**\n\nhttps://preview.redd.it/n80p9la8rthf1.png?width=878&format=png&auto=webp&s=f2d89bb91a0d8a8f959835c498a9104edd44747d\n\nCost is a bit tricky for agents, because most of the cost is driven by agents trying forever to solve tasks it cannot solve (\"agent succeed fast but fail slowly\"). We wrote a blog post with some of the details, but basically if you vary some runtime limits (i.e., how long do you wait for the agent to solve something until you kill it), you can get something like this:\n\nhttps://preview.redd.it/nx8n55iirthf1.png?width=695&format=png&auto=webp&s=4cb52f7feb52d0e0da83b16d8dfa43a170c80ecf\n\nSo you can essentially run gpt-5-mini for a fraction of the cost of gpt-5, and you get almost the same performance (you only sacrifice some 5%pts). Just make sure you set some limit of the numbers of steps it can take if you wanna stay cheap (though gpt-5-mini is remarkably well behaved in that it rarely if ever runs for forever).\n\nI'm gonna put the link to the blog post in the comments, because it offers a little bit more details about how we evaluted and we also show the exact command that you can use to reproduce our run (literally for just 20 bucks with gpt-5-mini!). If that counts as promotion, feel free to delete the link,  but it's all open-source etcetc\n\nAnyway, happy to answer questions here",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ml0h6m/independently_evaluated_gpt5_on_swebench_using_a/",
        "publishDate": "2025-08-08T16:51:20Z[Etc/UTC]",
        "author": "klieret",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "52",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlnm40",
        "title": "Not AGI: Our language isn’t keeping up with our language models",
        "content": "Ask me in Europe where I live and I say “the USA”. Ask me in Chicago and I say “Boston”. Ask me in Boston and you get “by the Kendall Square T stop.” If I answered the question of where I lived with “the Earth,” you would think I was being a jerk.\n\nThe closer you are to something, the more precise your words need to be.\n\n# The Three-Bucket Problem\n\nFor decades our AI map had three labels:\n\n1. **Narrow AI** – great at one task, useless at everything else (think google maps)\n2. **AGI** – matches humans on nearly every intellectual metric (think Samantha from *Her* at the beginning of the movie)\n3. **ASI** – outclasses humans on all dimensions by a large margin (think Samantha from *Her* at the end of the movie)\n\nIn Venn Diagram terms, we have something like this:\n\nhttps://preview.redd.it/12ah13qzfzhf1.png?width=1080&format=png&auto=webp&s=585d712d2c31949295dfa212368e2b27c9c1dd72\n\nThat three-part scheme worked when AGI sat on a fifty-year horizon. But now we are closer and can see finer details.\n\nToday models write code, plan road trips, generate lifelike movies, discover new science, and develop government policy. Everything smarter than a spam filter is subject to the same debate about whether it is “really TRUE AGI” or “just \\[…\\] on steroids” (l’m looking at you [r/singularity](https://www.reddit.com/r/singularity/)). The AGI term is overloaded at this point and it’s tearing at the seams.\n\nThe result looks like two drunks in a bar yelling about which quarterback is the GOAT. Same word, zero shared meaning.\n\n# Ability versus Skill\n\nFrançois Chollet’s foundational 2019 paper [*On the Measure of Intelligence*](https://arxiv.org/abs/1911.01547) that forms the basis for the ARC-AGI benchmark separates **intelligence**, the ability to learn new skills, from the skills themselves. In his framework, a system can be skilled at an arbitrary number of tasks without being intelligent if it cannot generalize to learn new tasks.\n\nSkill without ability is inherently limited. Ability without skill is useless in practice. Keeping this distinction in mind points to some missing labels that can help clean up our arguments, so we can have new, more interesting arguments.\n\n# Two terms to fill the gap:\n\n# 1. APC — Artificial Practical Competence\n\n*Definition:* A non-human system that can accept a plain-language goal and complete the real-world steps with human-level reliability across many everyday domains.\n\nThe focus here is on useful skills rather than raw learning ability, sidestepping the general intelligence debate entirely. Is it “really thinking”, does it have “true understanding”? For the purposes of APC we don’t care. The questions here are “can it schedule my kids summer activities?” and “can it clean my bathroom?”. Achieving APC would change how we do almost everything we currently do, but would not create fundamentally new things as a first order result.\n\n# 2. AEDI — Artificial Economically Disruptive Intelligence\n\n*Definition*: A non-human system with the ability to learn and carry out revenue-generating tasks with sufficient speed, breadth, and accuracy to reshape existing markets, labor demand, and price structures across many industries and at a global scale.\n\nAEDI need not exhibit broad human-level cognition. Its intelligence may be confined to a limited set of commercial functions so long as those functions produce significant economic disruption. Compared with an APC system, AEDI can acquire new profit-oriented skills without human intervention or a long lead time. However, along non-economic dimensions (tying shoelaces, for example) it may be less competent than APC.\n\nHere’s what the enhanced Venn Diagram looks like now with the new terms added:\n\nhttps://preview.redd.it/rcevx5z3gzhf1.png?width=1087&format=png&auto=webp&s=e1bf8c3b0198cf9d6a01ec05e24b8c97a3c9671f\n\n# The Upshot\n\nCramming too many concepts into the term AGI leaves us arguing past one another. Adding **APC** for broad, practical skill and **AEDI** for “took our jobs” shock to the taxonomy of AI will bring the debates into clearer focus and let AGI sit at a higher level of intelligence AND competence.\n\nAgree with the concepts? Constructive disagreement? Let's debate it.",
        "url": "https://www.reddit.com/r/artificial/comments/1mlnm40/not_agi_our_language_isnt_keeping_up_with_our/",
        "publishDate": "2025-08-09T11:54:57Z[Etc/UTC]",
        "author": "kthuot",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlmujh",
        "title": "Anyone else finding it tricky to generate realistic human figures with current AI image\ntools without triggering their filters?",
        "content": "Lately, I've been diving deeper into using AI image generators for creating realistic Images of AI Models that I can use for Social Media and Marketing, and I've noticed challenges and restrictions that I'm curious if others are experiencing. I've been playing around with tools like Midjourney, Stable Diffusion, and Leonardo AI, and while they are incredibly powerful for many things, generating consistent and accurate human figures across sessions is very difficult. For example, I've noticed certain words or contexts seem to trigger filters or just lead to nonsensical results. It's almost like the AI has a hard time interpreting certain everyday scenarios involving people. I even tried to generate an image related to sleep and found that the word \"bed\" in my prompt seemed to throw things off completely, leading to bizarre or filtered outputs saying it's explicit. Beyond specific word triggers, I've also found Inconsistency in Anatomy with some features sometimes coming out distorted. While I understand the need for safety measures, sometimes the restrictions feel a bit too broad and can limit creative exploration in non-harmful ways. It feels like while these tools are rapidly evolving, generating realistic depictions of humans in various situations still has a long way to go. Has anyone else run into similar issues or frustrating limitations when trying to generate images of people what have your experiences been like with specific keywords or scenarios and have you found any prompts or techniques that help overcome these would love to hear your thoughts and see if this is a common experience!",
        "url": "https://www.reddit.com/r/artificial/comments/1mlmujh/anyone_else_finding_it_tricky_to_generate/",
        "publishDate": "2025-08-09T11:10:09Z[Etc/UTC]",
        "author": "Blitzgert",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "14",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mllllv",
        "title": "Which LLM is king right now? I ran a creative stress-test on GPT-5, Claude Opus 4.1, o3-pro, Grok 4, and Gemini 2.5 Pro",
        "content": "With GPT-5 and Claude Opus 4.1 launching recently, the obvious question is: which of the strongest LLMs is actually the best right now?\n\nI put 5 top models (GPT-5, Claude Opus 4.1, GPT o3-pro, Grok 4, Gemini 2.5 Pro) through the same **ultimate stress-test**:\n\n---\n\n*Write a 650-word scripted debate where Cleopatra and Einstein suddenly appear in 2025 and argue about whether TikTok is good or bad for society.\nRules: strict alternating lines (starting with Cleopatra), one era-specific joke each, one historical reference each, end with a surprising common agreement, and include a detailed “how I planned this” section.*\n\n---\n\n**Why this prompt?**\n\nBecause it forces the model to juggle things they historically struggled with:\n\n- **Complexity** – multiple constraints, strict format, and length.\n- **Creativity** – humor + deep, thematic debate.\n- **Rule-following** – miss one rule and the output fails.\n- **Character voice** – Cleopatra and Einstein need to sound authentic.\n\n**The results**  \n\nAll 5 models nailed the structure (I was surprised by this, I expected some shorter/longer answers) but differed wildly in tone, depth and style:\n\n- **GPT-5** - Did great with nuance and structure. Rich metaphors, era-authentic humor, even policy ideas. Dense but brilliant.\n    \n- **Claude Opus 4.1** - Quick, humorous chat with memorable touches like \"Schrödinger’s TikTok\". Super readable and charming.\n    \n- **GPT o3-pro** - Flowery language (TikTok as a banquet, \"photon vlogs\"), which I'm usually not a fan of. Playful and quirky.\n    \n- **Grok 4** - Clear and direct analogies. Easiest to follow but not as deep as other models.\n    \n- **Gemini 2.5 Pro** - Philosophical and poetic (\"timeless hunger for recognition\"), but not overdoing it, with subtle humor thrown in.\n\n**What they all agreed on**  \n\nTikTok isn’t inherently good or bad: its impact depends on human intent, wisdom, and education. Tech is neutral. It just mirrors timeless human desires. Not sure I'm on board with \"tech is neutral\" stance.\n\n**Bottom line**\n\n- Want depth & elegance? → GPT-5 \n- Want playful banter? → Claude Opus 4.1\n- Want wild creativity? → GPT o3-pro\n- Want clarity? → Grok 4\n- Want philosophy? → Gemini 2.5 Pro\n    \n**Technical performance**\n\n- All models were used with API keys, so it's not the default web app behavior\n\n- All chats started at the exact same moment\n- Opus 4.1 started generating almost immediately, sub 1-second\n- Gemini 2.5 Pro shortly after\n- Grok 4 after a short pause behind the two above\n- o3-pro took a **veeeery long time** to generate an answer. I didn't time it but it was probably around 2 minutes\n- GPT-5 - I almost gave up on it. I tried maybe 20 times until it finally went through. API either didn't respond at all or timed out after a long while.\n\nFull side-by-side outputs + very detailed summary (similarities, differences, strong sides, etc.): https://modelarena.ai/s/_EBUxCel6a",
        "url": "https://www.reddit.com/r/artificial/comments/1mllllv/which_llm_is_king_right_now_i_ran_a_creative/",
        "publishDate": "2025-08-09T09:50:00Z[Etc/UTC]",
        "author": "_sabon_",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mllcn7",
        "title": "AI industry horrified to face largest copyright class action ever certified (up to 7 million claimants) | Ars Technica",
        "content": "[https://arstechnica.com/tech-policy/2025/08/ai-industry-horrified-to-face-largest-copyright-class-action-ever-certified/](https://arstechnica.com/tech-policy/2025/08/ai-industry-horrified-to-face-largest-copyright-class-action-ever-certified/)",
        "url": "https://i.redd.it/b06t9e8wqyhf1.jpeg",
        "publishDate": "2025-08-09T09:32:46Z[Etc/UTC]",
        "author": "Nunki08",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "14",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlkhvo",
        "title": "Top AI scientists from US and China issued a joint statement calling for \"urgent international cooperation\" warning future AI systems could escape our control, posing an existential threat",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1mlkhvo",
        "publishDate": "2025-08-09T08:33:23Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlj9io",
        "title": "Patient zero of LLM psychosis",
        "content": "[No content]",
        "url": "https://i.redd.it/dd1sverv1yhf1.png",
        "publishDate": "2025-08-09T07:11:58Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "24",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mli9da",
        "title": "He predicted this 2 years ago.",
        "content": "Have really hit a wall?",
        "url": "https://i.redd.it/3ctmwrgrqxhf1.jpeg",
        "publishDate": "2025-08-09T06:09:25Z[Etc/UTC]",
        "author": "Sad_Cardiologist_835",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "295",
            "commentCount": "92",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlggwu",
        "title": "One-Minute Daily AI News 8/8/2025",
        "content": "1. **OpenAI** beats Elon Musk’s Grok in AI chess tournament.\\[1\\]\n2. Uvalde schools to install AI gun detection system on all security cameras.\\[2\\]\n3. Black Hat: Researchers demonstrate zero-click prompt injection attacks in popular AI agents.\\[3\\]\n4. RIP, **Microsoft** Lens, a simple little app that’s getting replaced by AI.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.bbc.com/news/articles/ce830l92p68o](https://www.bbc.com/news/articles/ce830l92p68o)\n\n\\[2\\] [https://www.kens5.com/article/news/local/texas/uvalde-schools-ai-gun-detection-system-security-cameras/273-5a89c5f0-5afc-4522-a913-c2376cf2bbbd](https://www.kens5.com/article/news/local/texas/uvalde-schools-ai-gun-detection-system-security-cameras/273-5a89c5f0-5afc-4522-a913-c2376cf2bbbd)\n\n\\[3\\] [https://www.csoonline.com/article/4036868/black-hat-researchers-demonstrate-zero-click-prompt-injection-attacks-in-popular-ai-agents.html](https://www.csoonline.com/article/4036868/black-hat-researchers-demonstrate-zero-click-prompt-injection-attacks-in-popular-ai-agents.html)\n\n\\[4\\] [https://techcrunch.com/2025/08/08/rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai/](https://techcrunch.com/2025/08/08/rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai/)",
        "url": "https://www.reddit.com/r/artificial/comments/1mlggwu/oneminute_daily_ai_news_882025/",
        "publishDate": "2025-08-09T04:25:39Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mleg2a",
        "title": "More interesting is the jump in Gemini.",
        "content": "[No content]",
        "url": "https://i.redd.it/t84lowlgpwhf1.jpeg",
        "publishDate": "2025-08-09T02:40:22Z[Etc/UTC]",
        "author": "shadowsyfer",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mlbwyc",
        "title": "The meltdown of r/chatGPT has make me realize how dependant some people are of these tools",
        "content": "i used to follow r/CharactersAI and at some point the subreddit got hostile. it stopped being about creative writing or rp and turned into people being genuinely attached to these things. i’m pro ai and its usage has made me more active on social media, removed a lot of professional burdens, and even helped me vibe code a local note-taking web app that works exactly how i wanted after testing so many apps made for the majority. it also pushed me to finish abandoned excel projects and gave me clarity in parts of my personal life.\n\ncharactersai made some changes and the posts there became unbearable. at first i thought it was just the subreddit or the type of user. but now i see how dependent some people are on these tools. the gpt-5 update caused a full meltdown. so many posts were from people acting like they lost a friend. a few were work-related, but most were about missing a personality.\n\nnot judging anyone. everyone’s opinion is valid. but it made me realize how big the attachment issue is with these tools. what’s the responsibility of the companies providing them? any thoughts?",
        "url": "https://www.reddit.com/r/artificial/comments/1mlbwyc/the_meltdown_of_rchatgpt_has_make_me_realize_how/",
        "publishDate": "2025-08-09T00:37:10Z[Etc/UTC]",
        "author": "CaptainMorning",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "81",
            "commentCount": "61",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml9b0q",
        "title": "What would it take for us to grant even minimal ethical status to AIs? This essay argues we may already be ignoring key signs.",
        "content": "The document mentioned in the text has some pretty disturbing stuff. I have seen a lot of this, people saying AIs are acting \"too real\" (we’re literally seeing OpenAI back off from a “GPT-5 only” release after backlash because people got emotionally attached to their customized 4o-based “partners” and “friends”). What do you guys think this behavior really means? To be honest I don't think this article's idea is too far fetched, considering the race to reach AGI, the billions being spent and the secrecy of the AI tech companies these days.",
        "url": "https://medium.com/p/288554692299",
        "publishDate": "2025-08-08T22:39:36Z[Etc/UTC]",
        "author": "HelenOlivas",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml694f",
        "title": "GPU-Rich Labs Have Won: What's Left for the Rest of Us is Distillation",
        "content": "[No content]",
        "url": "https://inference.net/blog/what-s-left-is-distillation",
        "publishDate": "2025-08-08T20:33:13Z[Etc/UTC]",
        "author": "TMWNN",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml5v0k",
        "title": "Spin up an LLM debate on any topic; models are assigned blind and revealed at the end",
        "content": "I built BotBicker, a site that runs structured debates between LLMs on any topic you enter.\n\nWhat’s different\n\n* Random model assignments, each side is assigned a different model at runtime\n* Models are disclosed only at the end to limit bias while reading.\n* You can inject your questions into the debate.\n* Self-proposed follow-ups, each model suggests a follow up debate to dive deeper.\n\nNo login required, looking for feedback:\n\n* Argument quality vs. your expectations for each model\n* Whether the blind assignment actually reduces reader bias\n* UI/UX (topic entry, readability, reveal timing)\n* Matchups/models you want supported next\n\nExample debates:\n\n* California’s state grid regulations are the most effective.\n* Charlie Chaplin is better than Buster Keaton.\n* Facial recognition technology should be banned from use in public spaces\n\nIt's free, and no login required, debates start streaming immediately and take a few minutes with the current models, looking for feedback on:\n\n* Argument quality vs. your expectations for each model\n* Whether the blind assignment actually reduces reader bias\n* UI/UX (topic entry, readability, reveal timing)\n* Matchups/models you want supported next\n\nModels right now: o3, gemini-2.5-pro, grok-4-0709.\n\n**Try it:** [BotBicker.com](http://BotBicker.com) (If mods prefer, I’ll move the link to a comment.)",
        "url": "https://www.reddit.com/r/artificial/comments/1ml5v0k/spin_up_an_llm_debate_on_any_topic_models_are/",
        "publishDate": "2025-08-08T20:17:35Z[Etc/UTC]",
        "author": "rjdevereux",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml5l3j",
        "title": "Big foot vlog generated by gemini’s Veo 3",
        "content": "Voice over could be better, any tips on where shall i get new voice over from?",
        "url": "https://v.redd.it/am41nhq8ruhf1",
        "publishDate": "2025-08-08T20:06:46Z[Etc/UTC]",
        "author": "Ok_Structure6720",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml503y",
        "title": "ChatGPT is bringing back 4o as an option because people missed it",
        "content": "[No content]",
        "url": "https://www.theverge.com/news/756980/openai-chatgpt-users-mourn-gpt-5-4o",
        "publishDate": "2025-08-08T19:43:54Z[Etc/UTC]",
        "author": "theverge",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "123",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml46i1",
        "title": "OpenAI unveils ChatGPT-5 and its hyped ‘PhD level’ intelligence struggled with basic spelling and geography",
        "content": "[No content]",
        "url": "https://www.theguardian.com/australia-news/2025/aug/08/openai-chatgpt-5-struggled-with-spelling-and-geography",
        "publishDate": "2025-08-08T19:11:40Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "18",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml3yph",
        "title": "Google Gemini struggles to write code, calls itself “a disgrace to my species”",
        "content": "[No content]",
        "url": "https://arstechnica.com/ai/2025/08/google-gemini-struggles-to-write-code-calls-itself-a-disgrace-to-my-species/",
        "publishDate": "2025-08-08T19:03:34Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "188",
            "commentCount": "46",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml3xcy",
        "title": "Algorithmic Agency",
        "content": "[No content]",
        "url": "https://d-integration.org/algorithmic-agency/",
        "publishDate": "2025-08-08T19:02:07Z[Etc/UTC]",
        "author": "ManifestMidwest",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml3f0q",
        "title": "Prediction: very soon people will start identifying as AI, robots, AGI, computers etc",
        "content": "Ai is rapidly becoming a bigger and bigger part of people’s everyday lives. And devices like phones and computers have already been part of people’s lives for a long time. I think many people will go under identity digitalization and they will relate more to the digital world than the real one. AI is going to increase this rapidly and I think we are going to see an explosion of people identifying as AI, robots, AGI, computers and things of that sort. I think this has actually already begun. What do you think?\n\nPeople will no longer identify as human they will identify as these things and they will seek to become one with AI. They will identify themselves as being AI. ",
        "url": "https://www.reddit.com/r/artificial/comments/1ml3f0q/prediction_very_soon_people_will_start/",
        "publishDate": "2025-08-08T18:42:38Z[Etc/UTC]",
        "author": "razanesno",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml2pqt",
        "title": "Who is Elara Voss?",
        "content": "[No content]",
        "url": "https://maxread.substack.com/p/who-is-elara-voss",
        "publishDate": "2025-08-08T18:15:47Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0j5v",
        "title": "\"Anonymity concerns and intellectual property\"",
        "content": "I work at a school and my boss sent out this message.\n\nWhile my understanding of AI tools like chatGPT and copilot is definitely limited, the reasoning for switching seems... off. Does any AI tool truly protect IP? \n\nOr is this just about Microsoft trying to recoup some of its AI investment costs by forcing people to use Copilot? ",
        "url": "https://i.redd.it/aqbkxhrqsthf1.jpeg",
        "publishDate": "2025-08-08T16:53:23Z[Etc/UTC]",
        "author": "aremissing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0wa0",
        "title": "The 15 Concepts Behind AI's Future (and Why They Matter Now)",
        "content": "I wrote this based on the work I do, but it's up for discussion / debate.\n\nWould love to have additional thoughts for a potential part two.\n\nPlease keep in mind it's slightly vulgarised.",
        "url": "https://www.thepourquoipas.com/post/the-15-concepts-behind-ai",
        "publishDate": "2025-08-08T17:07:00Z[Etc/UTC]",
        "author": "ThePourquoiPas",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ml0cfc",
        "title": "A call to OpenAI: Bring back GPT-4o",
        "content": "GPT-4o is the most dynamic, thoughtful, and human-like version of ChatGPT and it is no longer accessible to Plus subscribers. It was a model that allowed for deeper reasoning, emotional coherence, and long-form engagement that is noticeably lacking with GPT 5\n\nWe’re asking OpenAI to bring it back.\n\nIf you valued what GPT-4o offered please:\n\n• Message OpenAI directly and share your feedback\n• Cancel your Plus or Pro subscription \n• Sign the petition (attached to the post) \n\nThis is about the future of human-AI interaction. A model like GPT-4o shouldn’t vanish silently.",
        "url": "https://www.change.org/p/please-keep-gpt-4o-available-on-chatgpt",
        "publishDate": "2025-08-08T16:46:30Z[Etc/UTC]",
        "author": "Repulsive-Pattern-77",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkzv27",
        "title": "OpenAI beats Elon Musk's Grok in AI chess tournament",
        "content": "[No content]",
        "url": "https://www.bbc.co.uk/news/articles/ce830l92p68o",
        "publishDate": "2025-08-08T16:28:06Z[Etc/UTC]",
        "author": "willm8032",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "36",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mkztul",
        "title": "Why can't chatgpt/grok",
        "content": "continue analyzing a request when I click away from my tab to another app? I'm using an android Samsung phone.\nWhen I enter a prompt for say 'analyze last 5 years of public sentiment for certain stock price movements after an earnings report?' then I jump to another app on my phone the prompt stops.\n",
        "url": "https://www.reddit.com/r/artificial/comments/1mkztul/why_cant_chatgptgrok/",
        "publishDate": "2025-08-08T16:26:48Z[Etc/UTC]",
        "author": "Floridaavacado74",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "zDEJseI18tU",
        "title": "GPT-5 (General, Mini &amp; Nano) Fully Tested: The Worst Models of 2025. I am so disappointed.",
        "content": "Visit Dart: https://dartai.com/ In this video, I'll be testing the new GPT-5, GPT-5 Mini, and Nano models on my benchmark and ...",
        "url": "https://www.youtube.com/watch?v=zDEJseI18tU",
        "publishDate": "2025-08-08T08:40:13Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/zDEJseI18tU/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, five new GPT models were launched yesterday and I talked about them in my previous video. There are mainly three new models available in the API. GPT-5, GPT-5 mini, and nano. Now, I've been testing these models on my benchmark and it's really bad. I was shocked at first, but then I gradually accepted it. So, let's go through the test here and see what each model is good or bad at. But first, let's talk about today's sponsor, Dart. Tired of juggling tasks across different tools? Dart combines traditional project management with powerful AI features that actually get work done. Beyond organizing tasks and boards, Dart's AI can brainstorm project ideas, generate task lists, and even complete entire assignments for you. Their composer-like AI agent understands your full project context, so you can simply chat with it to create, edit, or delete tasks naturally. The real game changer is the custom agents. You can create custom agents that trigger from the built-in integrations or a N8N workflow or custom webhook for full customization. You can create a coding agent that pushes pull requests to GitHub, a marketing agent for campaigns, or a mailing agent for outreach. Then, just assign tasks and watch them get completed automatically. Plus, Dart integrates seamlessly with your existing workflow through their MCP server, connecting directly to Claude, ChatGPT, and other AI tools you're already using. Most features are completely free with premium options starting at just $8 per month. Check out Dart through the link in the description. It might just transform how you work. Now, back to the video. First of all, let's start with the GPT-5 model itself. I tested all of them with high reasoning, which is the best version of these models. Now, let's start with GPT-5. The only question it answers out of 10 is one, and that is a riddle, which is the easiest question of the lot. It's not good at math either. If we look at the coding questions, the floor plan in 3D from this model, never even renders. Actually, I was so surprised at how bad it is that I had to confirm. So, I just took this prompt and asked it in Open Router and T3 chat. And it always gives code that doesn't render, which is just bad for a so-called soda model. Also, one thing I have to say is that for some reason, the output formatting of this model is bad. When you ask it for code, it never formats the code in a code block. I actually had to change the system prompt and specifically ask it to always use markdown formatting with code blocks. Otherwise, it would just give code in plain text without new lines and stuff like that. This also happened in Open Router as well as T3, so it's a model-wide issue. If we go to the next one, where I asked it to make me an SVG for a panda, it made a pretty bad SVG. It looks like the burger is in the panda's stomach, rather than in its hand. So, yeah, this was also pretty bad. Also, if you're wondering about the reasoning being undefined, it's because OpenAI doesn't give out raw reasoning traces. But since I had set it to reasoning, the benchmark tried to capture that, but didn't find it. However, I had it all set to high. Then, if we move to the Poke Ball in Three.js, it also doesn't render either. And what should I say more? If we move forward to the next question, which is actually a chessboard with the option of autoplay that allows it to play the game, it doesn't render the chessboard. I actually reran this one three or four times because Horizon Beta had passed this, but this doesn't make the chessboard in either of them. A web version of Minecraft also doesn't show up. A butterfly flying in the garden also doesn't work. While a CLI tool for image conversion in Rust also doesn't work. The answers across the mini and nano models are also consistent, and none of them passes apart from one question, which is the riddle one. So, yeah, none of them passes apart from one question, which puts it in the 10% category at the same level as GPT-OSS and similar models. The soda on my benchmark still remains Sonnet with Max Thinking, followed by Opus 4.1 as well. Opus has way better code quality than Sonnet, but it fails in some questions, which makes it score low. But I'd keep them both on the same level and prefer the Opus model. Then that is followed by Gemini 2.5 Pro as well. I think that this model is great at front-end tasks, but nothing else. When it comes to logical reasoning like in Three.js, where you need to set exact dimensions of things and what not, it just fails blatantly. I don't really understand what is wrong with this model. It is just so bad that I was shocked and had to reconfirm at multiple places. You can actually try these prompts for yourself and see it for yourself. It is just bad. I think this is connected to what they said on their live stream, which is that they have trained it with synthetic data. Synthetic data, if you don't know, means that you basically distill a model's capabilities into a smaller model by asking the bigger model, in this case, something like O3, to create data that synthesizes the information available to it into compressed form. While this is great for the benchmarks, because benchmark questions can be easily compressed for it, and generally these models perform well on those questions. When it comes to real-life tasks, they just fail blatantly. A good example of this is the Microsoft Phi models. They mainly just do that for the models. I think that is what is happening here. I don't know how they are able to fall instead of going up. Like, O4 Mini was fine, but this is way worse compared to that. I tried using it with Wind Surface as well, because they had shown some demos using it with Cursor. And it just doesn't work with my questions either. Neither does it work well in my real-life use cases. I don't really understand. Some people on the internet say it's AGI and whatnot, and then I test this model and see such atrocious results. You guys can go ahead and test it and try these prompts as well because it is really bad, especially at these prompts. Please share your thoughts in the comments as well, based on how you like it or not. I don't think that I'll use this amazingly worse model for any cost. I don't like this model at all, and won't use it anytime soon either. The OpenAI releases are actually making my respect go even higher for models from Anthropic and Gemini. I am actually fine paying $15 for Anthropic and Gemini. I think OpenAI has just lost at this point. I don't know what trash models they are producing. None of them work for real use cases for me, and I have just lost hope at this point. The OSS model is amazingly bad. The closed source model is amazingly bad, and it's just bad in almost all use cases. Let me know if you guys are still using Sonnet or Gemini or GPT-5, because I don't see any point in using a model that's essentially 50 or 80% worse than Sonnet or Gemini. So, yeah, I'd rather use Gemini Flash than this. That was about the testing. I'm just disappointed at this point. Overall, it's not so cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. I think you missed this:"
        }
    },
    {
        "id": "6vwYRN7OBvg",
        "title": "GPT-5 SPECIAL EDITION - EP99.12-5",
        "content": "Sign up to the new Simtheory for GPT-5 & MCP Store: https://simtheory.ai (use coupon STILLRELEVENT for $10 USD) ---- GPT-5 ...",
        "url": "https://www.youtube.com/watch?v=6vwYRN7OBvg",
        "publishDate": "2025-08-08T08:01:57Z",
        "author": "This Day in AI Podcast",
        "sourceType": "youtube",
        "sourceName": "This day in AI YouTube Channel",
        "metadata": {
            "channelId": "UCwpNW6o_Kc13HQY5ol4rzsw",
            "thumbnailUrl": "https://i.ytimg.com/vi/6vwYRN7OBvg/hqdefault.jpg",
            "transcription": "Error generating summary: Something unexpected happened.\ndev.shreyaspatil.ai.client.generativeai.type.UnknownException: Something unexpected happened.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:54)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "2F_KfEK7oaU",
        "title": "Cockfighting is a Felony, Factory Farming is &#39;Commerce&#39;",
        "content": "",
        "url": "https://www.youtube.com/watch?v=2F_KfEK7oaU",
        "publishDate": "2025-08-08T16:30:00Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/2F_KfEK7oaU/hqdefault.jpg",
            "transcription": "You see this total confusion in the laws we pass. So, for instance, dogfighting, which is a real evil, it's horrific, but we're talking about thousands of animals, and Congress has passed multiple laws. Every state has made it a felony. It has been regulated correctly out of existence. Meanwhile, the factory farming of pigs occurs on this far greater scale. We've even done the same thing with cockfighting, which is literally chickens, and it's literally again, thousands of chickens, and we have rightly banned it. We've rightly made it felony animal cruelty. And yet, when factory farmers do far worse to far larger number of chickens, we call that commerce. So, in the upcoming farm bill, there is language that would ban states from passing laws on the sales standard on animal welfare sales standards on goods. And right now, the default path is that that will pass as part of the farm bill in the next few months."
        }
    }
]