[
    {
        "id": "https://news.smol.ai/issues/25-09-10-oci/",
        "title": "Oracle jumps +36% in a day after winning $300B OpenAI contract",
        "content": "**Oracle's OCI division** reported a stunning **+359% revenue bookings growth to $455B** with cloud revenue guidance of **$144B by 2030**, driven significantly by a large deal with **OpenAI** amid tensions with **Microsoft**. On AI infrastructure, **Moonshot AI** released **Kimi’s checkpoint-engine**, enabling rapid weight updates on 1T-parameter models across thousands of GPUs, integrating with **vLLM**. **RLFactory** introduced a plug-and-play reinforcement learning framework for tool-using agents, showing smaller models outperforming larger ones. **TRL v0.23** added context parallelism for long-context training. **Thinking Machines Lab** published research on deterministic inference pipelines, making **vLLM** deterministic for **Qwen** models. **Meta** launched **BackendBench**, a PyTorch benchmarking tool.",
        "url": "https://news.smol.ai/issues/25-09-10-oci/",
        "publishDate": "2025-09-10T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "oracle, openai, microsoft, moonshot-ai, vllm-project, thinking-machines-lab, meta, qwen3-235b, qwen3-4b, qwen2.5-7b, vllm, kimi_moonshot, arankomatsuzaki, qgallouedec, cHHillee, woosuk_k, stasbekman, reinforcement-learning, model-weight-updates, deterministic-inference, benchmarking, long-context, model-optimization, cuda, distributed-training"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219347",
        "title": "Hitachi Launches HARC Agents to Enable Scalable Enterprise AI",
        "content": "<p>From Rapid Development to Unified Observability, HARC Agents Powers Mission-Critical AI with a Pre-Built Agent Library, Seamless Collaboration, and Centralized Control Today, Hitachi Digital Services unveiled Hitachi Application Reliability Center Agents (HARC Agents), the company’s enterprise platform for trusted Agentic AI. The platform combines a full lifecycle of AI services...</p>\n<p>The post <a href=\"https://ai-techpark.com/hitachi-launches-harc-agents-to-enable-scalable-enterprise-ai/\">Hitachi Launches HARC Agents to Enable Scalable Enterprise AI</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/hitachi-launches-harc-agents-to-enable-scalable-enterprise-ai/",
        "publishDate": "2025-09-10T16:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai and machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, cyber security information, cyber threats, Hitachi"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219346",
        "title": "Universal Robots Unveils UR8 Long for Complex, Tight-Space Tasks",
        "content": "<p>UR8 Long&#8217;s&#160;extended reach combined with coordinated multi-axis motion allows for complex weldments at consistent quality. Motion performance optimization also delivers smoother movements at maximum speed to significantly enhance fast-paced bin picking. Universal Robots&#160;(UR), the world’s leading collaborative robot (cobot) company, today introduced a new addition to its portfolio,&#160;the UR8 Long....</p>\n<p>The post <a href=\"https://ai-techpark.com/universal-robots-unveils-ur8-long-for-complex-tight-space-tasks/\">Universal Robots Unveils UR8 Long for Complex, Tight-Space Tasks</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/universal-robots-unveils-ur8-long-for-complex-tight-space-tasks/",
        "publishDate": "2025-09-10T16:15:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai machine learning, ai technology, artificial intelligence, cyber security information, cyber threats, Universal Robots"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219345",
        "title": "RobCo Launches US HQ in SF to Meet Automation & Reshoring Demand",
        "content": "<p>Backed by Sequoia Capital and Lightspeed, RobCo enters the US market with the acquisition of Rapid Robotics, marquee customers, and operations already spanning 14 states RobCo, the robot-as-a-service company redefining industrial automation, has expanded its launch in the United States with the opening of a new San Francisco HQ. In...</p>\n<p>The post <a href=\"https://ai-techpark.com/robco-launches-us-hq-in-sf-to-meet-automation-reshoring-demand/\">RobCo Launches US HQ in SF to Meet Automation & Reshoring Demand</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/robco-launches-us-hq-in-sf-to-meet-automation-reshoring-demand/",
        "publishDate": "2025-09-10T16:00:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai machine learning, ai tech news, ai techpark news, cyber security information, cyber threats, RobCo"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219349",
        "title": "Realbotix Partners With Grupo Kuo to Expand Robotics Distribution",
        "content": "<p>Realbotix Corp. (TSX-V: XBOT) (Frankfurt: 76M0.F) (OTC: XBOTF) (“Realbotix” or the “Company”), a leader in AI-powered humanoid robotics, is pleased to announce its new exclusive strategic distribution partnership with Grupo Kuo to bring Realbotix humanoid robots to Spain and Portugal, effective August 31, 2025. Grupo Kuo, renowned for its expertise in advanced...</p>\n<p>The post <a href=\"https://ai-techpark.com/realbotix-partners-with-grupo-kuo-to-expand-robotics-distribution/\">Realbotix Partners With Grupo Kuo to Expand Robotics Distribution</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/realbotix-partners-with-grupo-kuo-to-expand-robotics-distribution/",
        "publishDate": "2025-09-10T15:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai and machine learning, ai tech news, ai technology, ai techpark news, artificial intelligence, cyber threats, Realbotix Corp"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=219259",
        "title": "VideoVerse Acquired by Minute Media in Major Sportstech Deal",
        "content": "<p>Fund-returning exit leaves Moneta with a considerable equity position in global technology and sports content company Minute Media Moneta Ventures today announced the acquisition of VideoVerse, an AI-powered video solutions provider, by Minute Media, a global leader in technology and sports content. As the largest equity holder in VideoVerse, Moneta...</p>\n<p>The post <a href=\"https://ai-techpark.com/videoverse-acquired-by-minute-media-in-major-sportstech-deal/\">VideoVerse Acquired by Minute Media in Major Sportstech Deal</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/videoverse-acquired-by-minute-media-in-major-sportstech-deal/",
        "publishDate": "2025-09-10T09:00:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai and machine learning, ai machine learning, ai technology, AI-powered, artificial intelligence, cyber security, cyber threats, VideoVerse"
        }
    },
    {
        "id": "1ne6m07",
        "title": "AI and its effects on human birth rates/resources",
        "content": "In whatever time it takes to have super intelligent, humanoid AI in every sector of life, how would that affect human population rate and resources for AI and human consumption (assuming AI doesn’t kill off humans)? Surely, AI would make human lives easier and live longer lifespans, but how would it affect population growth? Would all this AI support give leeway to more human births, less, or stay the same? How about AI population? Would asteroid/planet mining be the way to grow population indefinitely? Shouldn’t we as a human race target this option more than investment into other things like war? Or perhaps we create some infinite energy to alchemize elements? Could China’s “artificial sun” be used to do this? If so, would we need to farm the universe in order to colonize other planets? \n\nAlso randomly, would humanoid AI be able to “go with the flow”?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ne6m07/ai_and_its_effects_on_human_birth_ratesresources/",
        "publishDate": "2025-09-11T11:45:56Z[Etc/UTC]",
        "author": "Bpianist11",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne6dr9",
        "title": "What's stopping tech companies giving AI chatbots separate legal personalities?",
        "content": "I read this article recently where someone said there's a possibility that companies could shift agency from themselves to an AI bot they created and use that entity as a liability shield.\n\nThat disturbed me, because I can see this potential huge pattern of tech companies evading justice when their products do damage.\n\nFor example, in UK law, a limited company is treated as a distinct legal entity, separate from the director and shareholders. So it can be responsible for debts or liabilities, despite the fact it isn't human or even sentient.\n\nSo what could stop companies treating the products they create as separate legal personalities? For example, they put it in the terms and conditions that we never read, on apps before we use a chatbot, that the company would never be held responsible for damages but the bot itself can be?\n\nIs this some messed up loophole where we'd have all these AI products given 'punishment' but the humans responsible for their creation just spin up another one in its place?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ne6dr9/whats_stopping_tech_companies_giving_ai_chatbots/",
        "publishDate": "2025-09-11T11:33:48Z[Etc/UTC]",
        "author": "404NotAFish",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4mvi",
        "title": "Defeating Nondeterminism in LLM Inference by Horace He (ex- OpenAI CTO)",
        "content": ">Reproducibility is a bedrock of scientific progress. However, it’s remarkably difficult to get reproducible results out of large language models.\n\nAint that the truth. Taken from [Defeating Nondeterminism in LLM Inference](https://thinkingmachines.ai/blog/defeating-nondeterminism-in-llm-inference/) by Horace He (ex- OpenAI CTO).\n\nThis article suggests that your request is often batched together with other people’s requests on the server to keep things fast. When that happens, tiny number differences can creep in. The article calls this lack of batch invariance.\n\nThey managed to fix it by \\[*read the article because my paraphrasing will be crap*\\] which means that answers become repeatable at temperature zero, tests and debugging are cleaner, and comparisons across runs are trustworthy.  \n  \nAlthough this does mean that you give up some speed and clever scheduling, so latency and throughput can be worse on busy servers.\n\nHistorically we've been able to select a Model, to trade off some intelligence for speed, for example.  I wonder whether eventually there will be a toggle between deterministic and probabilistic to tweak the speed/accuracy balance ? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ne4mvi/defeating_nondeterminism_in_llm_inference_by/",
        "publishDate": "2025-09-11T09:53:45Z[Etc/UTC]",
        "author": "Paddy-Makk",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4e1h",
        "title": "Big AI pushes the \"we need to beat China\" narrative cuz they want fat government contracts and zero democratic oversight. It's an old trick. Fear sells.",
        "content": "Throughout the Cold War, the military-industrial complex spent a fortune pushing the false narrative that the Soviet military was far more advanced than they actually were.\n\nWhy? To ensure the money from Congress kept flowing.\n\nThey lied… and lied… and lied again to get bigger and bigger defense contracts.\n\nNow, obviously, there is *some* amount of competition between the US and China, but **Big Tech is stoking the flames beyond what is reasonable to terrify Congress into giving them whatever they want.**\n\nWhat they want is fat government contracts and zero democratic oversight. Day after day we hear about another big AI company announcing a giant contract with the Department of Defense.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ne4e1h/big_ai_pushes_the_we_need_to_beat_china_narrative/",
        "publishDate": "2025-09-11T09:37:55Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "63",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4cl4",
        "title": "Ai hallucinations premed school",
        "content": "Hey guys, I hope you are all fine. I just was wondering as I am studying medicine with an exam that will be on multiple-choice questions. There is an unfair advantage to people with money because they could simply pay a tutor here in Europe. A professional and spoon feed them the information. The only closest way to get something similar is actually to use study mode on ChatGPT or Any other AI that would offer explanations. I’m speaking about physiology biochemistry anatomy. It actually helps to get to understand the reason for the names of this and that because there’s a lot of arbitrary stuff and we just need to make sense to memorize at the very least, this is how I work now I was wondering aI hallucination is a huge risk because it would cost points and only the best get to pass so I’m wondering, what do you think guys are that rate of hallucination regarding factual stuff just like purely physics or medicine or chemistry or anatomy because if plausible error sleeps through I’m done.\n\nOtherwise, I would be stuck with pure material and it’s very lacking and scratching for some info in which website for what is real? What is not as Wikipedia trustworthy to the point to the comma. Shark world.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ne4cl4/ai_hallucinations_premed_school/",
        "publishDate": "2025-09-11T09:35:21Z[Etc/UTC]",
        "author": "GZeod",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndzv9k",
        "title": "Diary of a Data Scientist 🥼",
        "content": "REMEMBER when engaging online on pseduoanonymous platforms that agentic AI bot networks are running rampant at massive scale. The industry doesn't really have sophisticated protections in place to prevent this as these agents can be programmed to mimic real user behavior. IP addresses and hardware addresses can be spoofed to avoid blacklists, and bad actors can be harder to get rid of than cockroaches in the summer.\n\nThis isn't even theoretical, the tooling has advanced so far that it's stupidly easy to set up these automations with a little bit of know-how, and you can literally just ask an LLM to help you implement it. The architecture really isn't that complicated for automating tasks like this since OpenAI and other providers did the hard part for us in training the models.\n\nTL;DR - Don't trust the popular, updooted Reddit/Truth/Facebook/Insta/X opinion in times of deep division and inflammation as it's extremely likely that social media is being manipulated. I propose adopting a zero-trust model of online, unverified social media opinions going forward, as I truly believe that these social media platforms are now compromised, and the attack vector is... all of us.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndzv9k/diary_of_a_data_scientist/",
        "publishDate": "2025-09-11T04:47:14Z[Etc/UTC]",
        "author": "Orygregs",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndzjh6",
        "title": "Vision-Language-Action Models",
        "content": "I’ve been following the recent wave of **Vision-Language-Action Models (VLAMs)**, and to me, they mark an interesting shift. For years, AI has been strongest in digital domains — recommendation engines, moderation, trading. Safe spaces. But once you push it into the physical world, things fall apart. Cars misjudge, robots stumble, drones overreact. The issue isn’t just performance, it’s trust.\n\nVLAMs aim to close that gap. The idea is simple but ambitious: combine perception (seeing), language (understanding goals), and action (doing). Instead of reacting blindly, the system reasons about the environment before making a move.\n\nA few recent examples caught my attention:\n\n* **NVIDIA’s Cosmos-Reason1** — tries to embed common sense into physical decision-making.\n* **Meta’s Vision-Language World Model** — mixes quick intuition with slower, deliberate reasoning.\n* **Wayve’s LINGO-2** — explains its decisions in natural language, which adds transparency.\n\nWhat I find compelling is the bigger shift. These aren’t just prediction engines anymore; they’re edging toward something like **embodied intelligence**. With synthetic data, multimodal reasoning, and these architectures coming together, AI is starting to look less like pure software and more like an agent.\n\nThe question I keep coming back to: benchmarks look great, but what happens when the model faces a truly rare edge case? Something it’s never seen? Some people have floated the idea of a **Physical Turing Test** comes to mind.\n\nSo what do you think are VLAMs a genuine step toward generalist embodied intelligence?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndzjh6/visionlanguageaction_models/",
        "publishDate": "2025-09-11T04:28:12Z[Etc/UTC]",
        "author": "d3the_h3ll0w",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndxi40",
        "title": "Can ai actually grow?",
        "content": "Is ai capable of teaching itself and growing like humans? My argument is that they can’t because it has a physical limitation of the processor / hardware and needs exponentially more energy. Where we humans need a burger and can just keep on learning. Thoughts?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndxi40/can_ai_actually_grow/",
        "publishDate": "2025-09-11T02:39:54Z[Etc/UTC]",
        "author": "CurveAdvanced",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndwnoa",
        "title": "Does anyone have any opinions on how XANA, the villain from Code Lyoko was executed as an AI based on 90s basic AI architecture? (Spoiler is moments in the show I will share for some context to understand)",
        "content": "Just curious if he was done well or not for a fictional AI, I mean I think he was & is amazing but that's really just me. Below is few moments I'll provide of how he was done and unlike my past posts which I hope is viewed more positively, just list the few moments with episodes and with one below in Season 4 and how he is kept like.\n\nMoment in Ghost Channel Episode:\n\nX(Looks convincing with skeptism on face): Do you mind telling us how you've got here? We're listening XANA.\n\nJeremie(Stays calm but has a sweat drop):I came here from the Scanner, I'm here in Virtual form.\n\nX(Has smug look on face):You gave yourself away, the real Jeremie wouldnt step foot in the Scanner, he'd be much too frightened.\n\n*Jeremie gasps while saying \"Uhhh....\" feeling like he's going to be turned against with XANA then standing strong having a wider smug smirk on face as if he has the power*\n\nOdd(Looks understanding while looking at Jeremie as well as Yumi and Ulrich):And I'm sure he would go into the Scanner, if his friends were in danger.\n\nUlrich:No doubt about it.\n\nYumi:Absolutely none.\n\nX(No longer smug and is in fear and confliction this time):But it's not logical dont you see? He's much too scared to even try; I-I'm much too scared! If not then why havent I already done it?\n\nJ(With serious look on face):I told you why! Because he's not infallible, XANA's knowledge of people is only approximative!\n\nMoment in Ultimatum Episode:\n\n*In a pretty open room of a abandoned warehouse fridged cold, Odd and Yumi sit far across from XANA possessed the Principal standing still with hands at side while like a statue & silent while facing away and the two showing cold*\n\nO:My...friend is really cold.\n\n*XANA doesnt respond or move an inch*\n\nO(Still sitting as he is as Yumi looks down shivering with slight worry):Hey XANA, apparently you plan on keeping us alive or you'd already have blown us away.\n\n*XANA doesnt change one bit or speak, just absolutely quiet and again like a statue*\n\nO(He keeps a fairly chill manner while Yumi still makes her freezing sounds): In case you didnt know, cold can kill us too (begins at this point to look slightly more serious) so if I were you I'd do something about it.\n\n*XANA doesnt move but the Eye symbol replacing the pupils & iris of the Principal's Eyes flickers and he says \"hmm...\" and begins to process this for a moment then eyebrows are raised as the flicker is a bit faster while making another soft yet bit alarmed sound before turning back and tosses the coat he takes off to toss to Odd & looks back with a genuinely worried look on face before turning around as Odd puts the coat onto Yumi to have her warm up, her not saying anything than a simple \"Mmm...\" while looking in relief & comfort with a smile*\n\nSituation and monents in Hot Shower Episode:\n\nOn Lyoko, Ulrich, Odd, and Aelita are vastly outnumbered and are forced to retreat. Meanwhile, on the roof of the Science Building, Yumi and Johnny work together to hard-wire Jeremie's laptop to the antenna. However, the brunt of the shower is already too close to Earth to revise its course, and the largest meteor enters the atmosphere directly above the school. On Lyoko, Aelita notices the Tarantulas haven't fired at her even once, and realizes X.A.N.A. wants to capture her alive and destroy the Supercomputer, but if she is on Earth, X.A.N.A. cannot accomplish either of those goals. So, Aelita orders Odd to devirtualize her to which he reluctantly agrees. With Aelita back on the Earth, X.A.N.A. is forced to use the satellite to blow up the large meteor, saving Aelita, the Supercomputer, and the rest of the Earth.\n\nAdmitting defeat, X.A.N.A. deactivates the tower manually and rematerializes the Tarantulas while William retreats back to the network. Jeremie then activates a return to the past.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndwnoa/does_anyone_have_any_opinions_on_how_xana_the/",
        "publishDate": "2025-09-11T01:57:20Z[Etc/UTC]",
        "author": "WildSangrita",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndvvwc",
        "title": "One-Minute Daily AI News 9/10/2025",
        "content": "1. **Microsoft** to use some AI from Anthropic in shift from OpenAI, the Information reports.\\[1\\]\n2. **OpenAI** and Oracle reportedly ink historic cloud computing deal.\\[2\\]\n3. US Senator Cruz proposes AI ‘sandbox’ to ease regulations on tech companies.\\[3\\]\n4. **Sam’s Club** Rolls Out AI for Managers.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/09/10/one-minute-daily-ai-news-9-10-2025/](https://bushaicave.com/2025/09/10/one-minute-daily-ai-news-9-10-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndvvwc/oneminute_daily_ai_news_9102025/",
        "publishDate": "2025-09-11T01:18:51Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndv1rx",
        "title": "AI will not displace people for the same reason people are returning to the office after the pandemic",
        "content": "I heard a very interesting amusing theory. After months of pandemic, when people were working from home, managers are making people to return to the office despite the obvious savings that working from home represent for the company.  Why would managers want a return to the office?  The answers of this theory are really amusing:\n\n* Because some psychopatic managers want to breath on people's necks, micromanage them and abuse them psychologically.\n* Managers could not be with their lovers and have affairs at work while working from home under wife supervision.\n* Because they cannot walk and pretend to supervise people on the floor while workers are working from home\n* Add your amusing reason here.\n\nIf people are replaced by AI, it is the equivalent of having a virtual digital worker.  And what will happen is this:\n\n* If AI does not obey or screws up, AI company will blame the supervisor for not entering the right prompt.\n* You cannot abuse an AI worker.\n* Prompt engineers will be hired as scapegoats who will be fired when AI does not work as intended.\n* You cannot have an affair with an AI worker.\n* You cannot micromanage AI worker.\n* If you are the CEO and you fired middle managers and replaced them with AI, you cannot blame middle management for a poor company performance.\n* Add your amusing topic here.\n\nSo as you see, the future promises to be very amusing, not idealistic and not catastrophic, just hilarious and unpredictable.\n\n¿What are your amusing and hilarious predictions about the future with AI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndv1rx/ai_will_not_displace_people_for_the_same_reason/",
        "publishDate": "2025-09-11T00:37:57Z[Etc/UTC]",
        "author": "JoseLunaArts",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndstit",
        "title": "If AI Ability Doubles Every 7 Months, Can other industries keep up. And what will regulations mean later down the line?",
        "content": "I feel like these are questions that really needed to be asked as it may be a massive question for the future. AI is better now than it’s ever been, and is supposed to be 2 times more powerful now than in February. I have a few questions though \n\n1: What happens when AI research goes into AI development, causing an explosion of compute power?\n\n2: If Ai outpaces our ability to harness it, will it reach a point where we can only control it by not building more data centers/ robots?\n\n3: Will regulations and political powers want to fine the leading company for monopolized markets and unethical practices?\n\n4: When will AI become profitable?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndstit/if_ai_ability_doubles_every_7_months_can_other/",
        "publishDate": "2025-09-10T22:53:31Z[Etc/UTC]",
        "author": "Immediate_Kick_6167",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndn6hg",
        "title": "Disconnected Data Centers in Bunkers powered by SMRs?",
        "content": "Humongous data centers are being built in many parts of the world to house large amounts of data to train AI models and to store their data for retrieval.\n\nThese data centers are hyper-connected in order to reach the devices that we use daily. The one you are reading this from, as well as other IOT devices that we may not see, but communicate continuously with these data centers. Some data centers house extremely sensitive data and may not be connected to networks, just to intranets. providing access to only very few individuals; these data centers may be housed in underwater or below-earth bunkers, physically hidden, and, in the near future, may grow in size to house more data and computing power and require small modular reactors to power them and cool them.\n\n\n\nWe know of many tech executives (i.e., Zuckerberg) owning very large, luxurious bunkers. Do they have data centers inside these facilities with sensitive, war-related data hidden? Are companies also developing these types of obscure, hidden data centers for network state purposes? Do governments operate private data centers, in hidden areas, with small nuclear reactors powering them already?\n\nHave these AI models achieved superintelligence, AGI, or some sort of advanced intelligence that only the selective few have access to? Just wondering.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndn6hg/disconnected_data_centers_in_bunkers_powered_by/",
        "publishDate": "2025-09-10T19:02:16Z[Etc/UTC]",
        "author": "Yavero",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndmo8i",
        "title": "We are NOWHERE near understanding intelligence, never mind making AGI",
        "content": "Hey folks,\n\nI'm hoping that I'll find people who've thought about this.\n\nToday, in 2025, the scientific community still has no understanding of how intelligence works.\n\nIt's essentially still a mystery.\n\nAnd yet the AGI and ASI enthusiasts have the arrogance to suggest that we'll build ASI and AGI.\n\nEven though we don't fucking understand how intelligence works.\n\nDo they even hear what they're saying?\n\nWhy aren't people pushing back on anyone talking about AGI or ASI and asking the simple question :\n\n\"Oh you're going to build a machine to be intelligent. Real quick, tell me how intelligence works?\"\n\nSome fantastic tools have been made and will be made. But we ain't building intelligence here.\n\nIt's 2025's version of the Emperor's New Clothes.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndmo8i/we_are_nowhere_near_understanding_intelligence/",
        "publishDate": "2025-09-10T18:43:31Z[Etc/UTC]",
        "author": "LazyOil8672",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "73",
            "commentCount": "340",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndmgc9",
        "title": "AI detects hidden movement clues linked to brain disorders, study shows",
        "content": "Early signs of Parkinson’s are easy to miss — but AI is changing that. \n\nUF researcher Diego Guarín is using artificial intelligence to detect subtle motor changes *before* symptoms are visible to clinicians, a breakthrough in early diagnosis and care.\n\nTo learn more, visit: [https://news.ufl.edu/2025/09/ai-detects-hidden-movement-clues/](https://news.ufl.edu/2025/09/ai-detects-hidden-movement-clues/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndmgc9/ai_detects_hidden_movement_clues_linked_to_brain/",
        "publishDate": "2025-09-10T18:35:14Z[Etc/UTC]",
        "author": "ufexplore",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndm1hj",
        "title": "🧠 Proposal for AI Self-Calibration: Loop Framework with Governance, Assurance & Shadow-State",
        "content": "I’ve been working on an internal architecture for AI self-calibration—no external audits, just built-in reflection loops. The framework consists of three layers:\n\n1. Governance Loop – checks for logical consistency and contradictions  \n2. Assurance Loop – evaluates durability, robustness, and weak points  \n3. Shadow-State – detects implicit biases, moods, or semantic signals  \n\nEach AI response is not only delivered but also reflected through these loops. The goal: more transparency, self-regulation, and ethical resilience.\n\nI’d love to hear your thoughts:  \n🔹 Is this practical in real-world systems?  \n🔹 What weaknesses do you see?  \n🔹 Are there similar approaches in your work?\n\nLooking forward to your feedback and discussion!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndm1hj/proposal_for_ai_selfcalibration_loop_framework/",
        "publishDate": "2025-09-10T18:19:37Z[Etc/UTC]",
        "author": "AuditMind",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndltkj",
        "title": "Genius YT Channel - How do they do it?",
        "content": "Recently subscribed to this [https://www.youtube.com/watch?v=toFYt7gEx5c](https://www.youtube.com/watch?v=toFYt7gEx5c)\n\nThe best way to digest US politics, how do they do it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndltkj/genius_yt_channel_how_do_they_do_it/",
        "publishDate": "2025-09-10T18:11:27Z[Etc/UTC]",
        "author": "Clear_Letterhead9188",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndl2m2",
        "title": "AI & Job Growth",
        "content": "Is it possible that, instead of AI shrinking employment, we’ll see the rise of smaller boutique firms? These firms may never reach hundred-billion-dollar market caps, but with AI helping humans quickly deliver solutions, they could operate profitably and compete with larger companies weighed down by overhead and rigid pricing structures.\n\nThe analogy I see is with entertainment. Today’s generation doesn’t rely on summer blockbusters, prime-time TV, or even traditional sports the way past generations did. Instead, they consume niche content and create their own celebrities, often hugely popular within their communities but virtually unknown outside them.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndl2m2/ai_job_growth/",
        "publishDate": "2025-09-10T17:44:05Z[Etc/UTC]",
        "author": "Apprehensive_Rub3897",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndkfic",
        "title": "\"We should treat AI like we treat other powerful general-purpose technologies.\"",
        "content": "[https://substack.com/inbox/post/173147197](https://substack.com/inbox/post/173147197) This practical framework seems to make a lot of sense on understanding just what AI is (and is not) at the moment. The authors are summarizing and updating their thesis from April. I especially like the comparison between internet adoption in the 1990s and AI adoption today and their point about why AI adoption \"feels\" so fast (but actual uptake is much slower). ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndkfic/we_should_treat_ai_like_we_treat_other_powerful/",
        "publishDate": "2025-09-10T17:20:42Z[Etc/UTC]",
        "author": "egghutt",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndi9sr",
        "title": "\"I created my own AI medical team. It changed the way doctors treat my cancer.\"",
        "content": "[https://www.statnews.com/2025/09/10/ai-cancer-treatment-custom-doctors-response/](https://www.statnews.com/2025/09/10/ai-cancer-treatment-custom-doctors-response/) \n\n\"I developed a medical AI agent named “Haley,” created to use underlying foundation models from OpenAI, Google, Anthropic, and xAI, but with layers of medical context to guide the knowledge exploration in combination with a carefully prepared set of all my medical history. I fed Haley the exact same data that all those doctors had seen just weeks earlier. My full MyChart history. My labs. The imaging results. The doctor notes.\n\nWithin minutes, Haley flagged a concerning pattern: mild anemia, elevated ferritin, low immunoglobulins — signs of immune dysfunction and bone marrow issues. Haley recommended a “serum free light chains” blood test and bone marrow biopsy. None of this had been previously suggested. Same data, new insights. \n\nThen I expanded the team. I built a panel of AI agents — an oncologist, gastroenterologist, hematologist, ER doc, and many more — all trained to think like their human counterparts. I ran the same case through each of them, one at a time. I created a synthesis agent, Hippocrates, to serve as my chairman of the board. He listened to them all and gave me a consolidated recommendation.\n\nI had created my own virtual multidisciplinary medical team. They illuminated the path that my doctors had missed.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndi9sr/i_created_my_own_ai_medical_team_it_changed_the/",
        "publishDate": "2025-09-10T16:02:38Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "82",
            "commentCount": "111",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndfia0",
        "title": "Beginner resources for learning AI/ML (from an epidemiology background)?",
        "content": "Hi everyone, I come from a medical background and currently work in epidemiology. While I’ve done some data analysis, I don’t have much hands-on experience with AI. I really like to start learning the basics of machine learning, neural networks, NLP, large language models, and so on.\n\nWhat is a good starting point? something that gives me a solid overview and a little bit of exposure to each of these areas, so I can understand the landscape and then go deeper later.\n\nAre there particular online courses, textbooks, or other resources you’d recommend for someone with a health/epi background but no formal computer science training? Ideally something beginner-friendly but not too watered down.\n\nHas anyone here also made the transition from a health/epi field into AI/ML? If so, would  love to hear what helped you the most.\n\nThank you all in advance! :) ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndfia0/beginner_resources_for_learning_aiml_from_an/",
        "publishDate": "2025-09-10T14:19:26Z[Etc/UTC]",
        "author": "Haunting-Equal9863",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndf081",
        "title": "Are AI ethicists just shouting into the void at this point?",
        "content": "[https://leaddev.com/ai/devs-fear-the-ai-race-is-throwing-ethics-to-the-wayside](https://leaddev.com/ai/devs-fear-the-ai-race-is-throwing-ethics-to-the-wayside)\n\nI mean, capitalism, but it does feel like anyone concerned about the ethical side of this wave is fighting a losing battle at this point?  \n  \nRumi Albert, an engineer and philosophy professor currently teaching an AI ethics course at Fei Tan College, New York: \"I think \\[these systemic issues\\] have reached a scale where they’re increasingly being treated as externalities, **swept under the rug as major AI labs prioritize rapid development and market positioning over these fundamental concerns.**”\n\n“It feels like the pace of technological advancement far outstrips the progress we’re making in ethical considerations ... In my view, **the industry’s rapid development is outpacing the integration of ethical safeguards**, and that’s a concern that I think we all need to address.”\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndf081/are_ai_ethicists_just_shouting_into_the_void_at/",
        "publishDate": "2025-09-10T14:00:27Z[Etc/UTC]",
        "author": "scarey102",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "52",
            "commentCount": "58",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndcx37",
        "title": "My take on crucial skills for the AI-shaped future: learn how to talk to yourself, talk to others, and talk to the machine",
        "content": "Social and legacy media are buzzing and electrified. What should we learn for tomorrow? Everyone wants to crack the code and be future-proof. Is it too late now to learn coding? Is it time to practice vibe-coding? Should we give up studying languages altogether?\n\nOr, since clear text is today a crucial part of the human-AI interface, maybe it's time to learn to write properly?\n\nMaybe the humanities will finally have their moment? But at least math will still be around, right? Or perhaps it's time to learn plumbing?\n\nSo here's my take on three crucial skills that are already in demand today and will be even more needed tomorrow.\n\n**1. Learn to talk to yourself.**\n\nBeing human is quite a confusing thing. We're brought into this world and then craft ourselves from absorbed information. Mostly out of garbage, coming from family, people, media, corporations, government, religion, politics, conspiracy theories, prejudices, and that deeply offending comment your classmate told you when you were in school, which you still wear to this day as a shadow of doubt.\n\nWe're a mess!\n\nWe stitch this garbage into a wardrobe of identities that we take with us everywhere. It takes the rest of our lives to go through this to figure out who we actually are beyond those socially constructed scripts.\n\nThis is the first step to fully engaging with the world.\n\n**2. Learn to talk to others.**\n\nThese days, it's everyone vs. everyone. Social media is a deep dive into an endless, hateful narrative battle royale. People struggle to find common ground. This is because our identities are easily manipulated and weaponized, and there are so many who wish to divide us. Building a dialogue with others, especially with those you despise, is a must if we want to make it as a species.\n\n**3. Learn to talk to the machine.**\n\nOne of the biggest quests of the future will be this: how do we coexist with non-organic matter if we can't even manage each other?\n\nHow do we become better humans with AI and other tech? How do we build human-AI interaction? How do we make the best of it for ourselves?\n\nWe see prompt libraries and courses getting lots of attention. People search for the best way to communicate and articulate their needs. In the end, it all comes down to articulation. What do you want to do? And to know that, you have to know yourself.\n\nProbably, the code, the language, models, and means of interaction will transform, but the setup of I/them/tech is likely to stay with us.\n\n\n\nWhat do you think? What would you add to this list of valuable future skills?\t",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ndcx37/my_take_on_crucial_skills_for_the_aishaped_future/",
        "publishDate": "2025-09-10T12:32:19Z[Etc/UTC]",
        "author": "I_am_a_wave",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne5nu8",
        "title": "APM v0.4 - Taking Spec-driven Development to the Next Level with Multi-Agent Coordination",
        "content": "Been working on [APM](https://github.com/sdi2200262/agentic-project-management) (Agentic Project Management), a framework that enhances spec-driven development by distributing the workload across multiple AI agents. I designed the original  architecture back in April 2025 and released the first version in May 2025, even before Amazon's Kiro came out.\n\n**The Problem with Current Spec-driven Development:**\n\nSpec-driven development is essential for AI-assisted coding. Without specs, we're just \"vibe coding\", hoping the LLM generates something useful. There have been many implementations of this approach, but here's what everyone misses: **Context Management.** Even with perfect specs, a single LLM instance hits context window limits on complex projects. You get hallucinations, forgotten requirements, and degraded output quality.\n\n**Enter Agentic Spec-driven Development:**\n\nAPM distributes spec management across specialized agents:\n- **Setup Agent**: Transforms your requirements into structured specs, constructing a comprehensive Implementation Plan ( before Kiro ;) )\n- **Manager Agent**: Maintains project oversight and coordinates task assignments\n- **Implementation Agents**: Execute focused tasks, granular within their domain\n- **Ad-Hoc Agents**: Handle isolated, context-heavy work (debugging, research)\n\nThe diagram shows how these agents coordinate through explicit context and memory management, preventing the typical context degradation of single-agent approaches.\n\n**Each Agent in this diagram, is a dedicated chat session in your AI IDE.**\n \n**Latest Updates:**\n \n- Documentation got a recent refinement and a set of 2 visual guides (Quick Start & User Guide PDFs) was added to complement them main docs.\n\n\nThe project is Open Source (MPL-2.0), works with any LLM that has tool access.\n\nGitHub Repo: https://github.com/sdi2200262/agentic-project-management",
        "url": "https://i.redd.it/cuvjlksrniof1.png",
        "publishDate": "2025-09-11T10:55:04Z[Etc/UTC]",
        "author": "Cobuter_Man",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne51tu",
        "title": "z.ai experience?",
        "content": "Hey there, anyone here tried z.ai subscriptions (or chutes.ai/synthetic.new)?\n\nIt's significantly cheaper than Claude Code subscriptions, I'm curious if it's worth giving it a try. I mostly use Sonnet 4 via GH Copilot VSC Insiders and while I'm mostly happy with the code output I find this setup quite slow. I also tried Sonnet 4 in Claude Code and haven't notices any code quality improvements, but the agent was faster and I like how CC cli can be customized.\n\nI'm also interested how well these \"alternative\" subscriptions work in Roo Code/Cline (I never tried agent VSC extensions apart from GH Copilot). ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ne51tu/zai_experience/",
        "publishDate": "2025-09-11T10:19:14Z[Etc/UTC]",
        "author": "branik_10",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne08km",
        "title": "How to efficiently use GPT-5 thinking and Pro for coding?",
        "content": "So, my company upgraded me to the ChatGPT Pro plan for a month. Last weekend, I played around with it and two things I found out:\n\n* GPT-5 thinking is the go to model for internet search and on the go research about a matter. Although it is slow.\n* GPT-5 Pro is best for coding papers.\n\nI knew that [GPT-5 gets things done,](https://go.adaline.ai/2jCq3iU) but I am seeing how OpenAI is rigorously working to improve the model constantly. It makes advanced AI an everyday tool.\n\nOne thing that I am seeing is that OpenAI made intelligence cheap initially but now they are making intelligence better.\n\nIf you are using GPT-5 for your coding and learning then please share how can I improve my coding. I work on Pytorch and I am getting back to serious coding and building and finetuning LLMs.\n\nI am intrigued by all the open-source models out there, and I am really looking forward to using such tools (maybe CLI) for coding. What is the efficient way to code or best practices out there?\n\nI work on Pytorch, and I am getting back to serious coding, building, and finetuning LLMs.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ne08km/how_to_efficiently_use_gpt5_thinking_and_pro_for/",
        "publishDate": "2025-09-11T05:09:03Z[Etc/UTC]",
        "author": "TheProdigalSon26",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndyvuv",
        "title": "Here are the ChatGPT context windows for free, plus, business, pro and enterprise:",
        "content": "[No content]",
        "url": "/r/LovingAI/comments/1ndiylb/here_are_the_chatgpt_context_windows_for_free/",
        "publishDate": "2025-09-11T03:52:05Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndy7eu",
        "title": "Cline Rules",
        "content": "[No content]",
        "url": "/r/CLine/comments/1ndxvb1/cline_rules/",
        "publishDate": "2025-09-11T03:15:52Z[Etc/UTC]",
        "author": "Vzwjustin",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndwlsd",
        "title": "Roo Code Cloud is here with Task Sync & Roomote Control || Roo Code 3.28.0 Release Notes",
        "content": "r/RooCode is a FREE VS Code plugin.\n\nRoo Code Cloud is here with Task Sync & Roomote Control for mobile-friendly task monitoring and control.\n\n# Task Sync & Roomote Control\n\nIntroducing our new cloud connectivity features that let you **monitor and control long-running tasks from your phone** \\- no more waiting at your desk!\n\n>**Important**: Roo Code remains **completely free and open source**. Task Sync and Roomote Control are optional supplementary services that connect your local VS Code to the cloud - all processing still happens in your VS Code instance.\n\n[Roomote Control task view on a mobile phone's browser](https://preview.redd.it/bpcbg5dvxfof1.png?width=852&format=png&auto=webp&s=4e935f3e3a9172b4055211266c18f4375b4e7152)\n\n[**Task Sync**](https://docs.roocode.com/roo-code-cloud/task-sync) **(Free for All Users)**:\n\n* **Monitor from Anywhere**: Check on long-running tasks from your phone while away from your desk\n* **Real-time Updates**: Live streaming of your local task messages and progress\n* **Task History**: Your tasks are saved to the cloud for later reference - **Cloud Visibility**: View your VS Code tasks from any browser\n\n[**Roomote Control**](https://docs.roocode.com/roo-code-cloud/roomote-control) **(**[**14-Day Free Trial, then $20/month**](https://docs.roocode.com/roo-code-cloud/billing-subscriptions#pro-plan-20month)**)**:\n\n* **Continue Tasks Remotely**: Keep tasks going from your phone - respond to prompts, fix errors, approve actions\n* **Full Chat Control**: Interact with the chatbox as though you were in your IDE\n* **Start/Stop Tasks**: Launch new tasks or terminate running ones from anywhere\n* **Complete Control**: Full bidirectional control of your local VS Code from anywhere\n\nTask Sync enables monitoring your local development environment from any device. Add Roomote Control for full remote control capabilities - whether you're on another computer, tablet, or smartphone.\n\n>**📚 Documentation**: See [Task Sync](https://docs.roocode.com/roo-code-cloud/task-sync), [Roomote Control Guide](https://docs.roocode.com/roo-code-cloud/roomote-control), and [Billing & Subscriptions](https://docs.roocode.com/roo-code-cloud/billing-subscriptions).\n\n# 💪 QOL Improvements\n\n* **Click-to-Edit Chat Messages**: Click directly on any message text to edit it, with ESC to cancel and improved padding consistency\n* **Enhanced Reasoning Display**: The AI's thinking process now shows a persistent timer and displays reasoning content in clean italic text - **Manual Auth URL Input**: Users in containerized environments can now paste authentication redirect URLs manually when automatic redirection fails\n\n# 🔧 Other Improvements and Fixes\n\nThese releases include 17 improvements across bug fixes, provider updates, and misc updates. Thanks to A0nameless0man, drknyt, ItsOnlyBinary, ssweens, NaccOll, and all other contributors who made this release possible!\n\n📚 **Full Release Notes** [v3.28.0](https://docs.roocode.com/update-notes/v3.28.0)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndwlsd/roo_code_cloud_is_here_with_task_sync_roomote/",
        "publishDate": "2025-09-11T01:54:31Z[Etc/UTC]",
        "author": "hannesrudolph",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndso3f",
        "title": "codex is getting claude coded",
        "content": "https://preview.redd.it/oixcwcwn1fof1.png?width=2364&format=png&auto=webp&s=56a4f1fcc0159f8dd71421332af5e7965f9da28f\n\nthis is the day i wish it'd never come -- Codex getting a lobotomy like CC. \n\nIs this the end of vibe coding?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndso3f/codex_is_getting_claude_coded/",
        "publishDate": "2025-09-10T22:47:01Z[Etc/UTC]",
        "author": "life_on_my_terms",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndrs5w",
        "title": "A little system for managing language drift.",
        "content": "I find it helpful to 'lock down' some language terms in code, but also sometimes those terms change and you need to update them. This issue seems to be worse when dealing with AI drift in coding. This is what I do to help manage that.\n\n  \nIn your [AGENTS.md](http://AGENTS.md) or [CLAUDE.md](http://CLAUDE.md) files\n\n    ### Naming Canon\n    _We have certain defined terms, and some terms can be deprecated and must not be used and must be changed when found existing in the code._\n    To view our formal defined words you can\n    `rg -o -P '^- term:\\s*\\K[\\w-]+' docs/architecture/naming-canon.md`\n    \n    To view deprecated terms\n    `rg -o -P '^\\s*-\\sprevious_terms:\\s\\K(?!comma-separated)\\S.*$' docs/architecture/naming-canon.md`\n    \n    To view Both\n    `( echo 'Defined Terms'; rg -o -P '^- term:\\s*\\K[\\w-]+' docs/architecture/naming-canon.md; echo; echo 'Deprecated Terms'; rg -o -P '^\\s*-\\sprevious_terms:\\s\\K(?!comma-separated)\\S.*$' docs/architecture/naming-canon.md )`\n\n  \nThen I create a file with this structure\n\n    ---\n    title: Naming Canon\n    status: authoritative\n    version: 0.1\n    scope: [code, data, ui-copy]\n    owners: Architecture\n    last_updated: 2025-09-10\n    change_control: PRs must update redirects; label: canon\n    ---\n    \n    # Naming Canon\n    \n    This document is the single source of truth for canonical terms used across code, data, and UI. It records deprecations (previous terms) and establishes clear relationships between concepts so naming stays consistent.\n    \n    ## How To Use\n    - Prefer the canonical term in new code, data, and UI.\n    - If you encounter a previous term, update it to the canonical term in the same change when practical.\n    - When introducing a new term or renaming an existing one, add or edit the entry here in the same PR.\n    \n    ## Entry Format for Canonical Terms\n    Each canonical term is recorded with a consistent, list-style format:\n    \n    - term: <canonical_name>\n      - category: domain | code | ui | data | input\n      - description: Single, precise sentence\n      - previous_terms: comma-separated list, or \"none\", these terms are deprecated and must be replaced with the canonical name.\n      - synonyms: still prefer not to use these terms, but there for understanding\n      - relationships: labeled links to other canonical terms (see verbs below)\n    \n    Relationship verbs use a small fixed set to keep meaning unambiguous: contains, part_of, connects_to, base_of, derived_from, attached_to, owns, carries, triggers, triggered_by, parameter_of, applied_to, describes, consists_of, contained_in.\n    \n    ## Canonical Terms\n    \n    - term: entity\n      - category: code\n      - description: Unified base contract for persistent game objects; provides unique ID, state categorization, Chronicle event emission, serialization, and registry integration.\n      - previous_terms: \n      - synonyms: game object\n      - relationships: base_of→character, item, room, zone\n    \n    - term: zone\n      - category: domain\n      - description: Top-level region containing rooms; used for world segmentation and theming.\n      - previous_terms:\n      - synonyms: area\n      - relationships: contains→room\n    \n    - term: room\n      - category: domain\n      - description: Discrete location within a zone; on entry the room description is shown (not the room title).\n      - previous_terms: \n      - synonyms: cell, tile\n      - relationships: part_of→zone; connects_to→room (via exit); contains→character, item\n    \n    - term: exit\n      - category: domain\n      - description: Directed connection between two rooms, typically paired with a direction; may enforce requirements.\n      - previous_terms:\n      - synonyms: link, movement graph\n      - relationships: connects_to→room; parameter_of→direction\n    \n    - term: direction\n      - category: input\n      - description: One of NORTH, WEST, SOUTH, EAST; appears in input/hotkeys and exits.\n      - previous_terms:\n      - synonyms: n, e, w, s\n      - relationships: parameter_of→exit, hotkey\n    \n    - term: character\n      - category: domain\n      - description: Base model for in-world agents; parent of player and npc; owns gear and pack.\n      - previous_terms: \n      - synonyms: \n      - relationships: base_of→player, npc; owns→gear, pack; carries→item\n    \n    - term: player\n      - category: domain\n      - description: Human-controlled character instance.\n      - previous_terms: \n      - synonyms:\n      - relationships: derived_from→character\n    \n    - term: npc\n      - category: domain\n      - description: Non-player character instance; AI-controlled.\n      - previous_terms: \n      - synonyms: mob\n      - relationships: derived_from→character\n    \n    - term: item\n      - category: domain\n      - description: Entity that can be carried or equipped by a character or placed in a room.\n      - previous_terms: \n      - synonyms: object, thing\n      - relationships: contained_in→pack, room, gear; consists_of→(subcomponents as needed)\n    \n    - term: gear\n      - category: ui\n      - description: UI View where a player accesses their equipped items\n      - previous_terms: equipment\n      - synonyms: equipped items\n      - relationships: attached_to→character; consists_of→item\n    \n    - term: pack\n      - category: ui\n      - description: Carried container for non-equipped items.\n      - previous_terms: inventory\n      - synonyms: bag, backpack\n      - relationships: attached_to→character; contains→item\n    \n    - term: command\n      - category: code\n      - description: Addressable action routed through the command system; primary trigger path for gameplay operations.\n      - previous_terms: \n      - synonyms: action\n      - relationships: triggered_by→hotkey; may_require→direction, item\n    \n    - term: hotkey\n      - category: input\n      - description: Input binding that triggers a command; not a separate action path.\n      - previous_terms: \n      - synonyms: keybind, shortcut\n      - relationships: triggers→command; may_include→direction\n    \n    - term: effect\n      - category: game\n      - description: Time-bound state modification (buff/debuff) applied to characters or items.\n      - previous_terms:\n      - synonyms: \n      - relationships: applied_to→character, item\n    \n    - term: room_description\n      - category: ui\n      - description: Text presented after movement verification; not the room title; may include dynamic content.\n      - previous_terms: \n      - synonyms: \n      - relationships: describes→room\n    \n    - term: logger\n      - category: code\n      - description: Our log system at `src/utils/logger.ts` and discussed at `docs/architecture/logging-system-architecture.md`\n      - previous_terms: console.log\n      - synonyms: logging\n      - relationships:\n\n  \nThe commands in your [AGENTS.md](http://AGENTS.md) file output lists like this  \n\\`\\`\\`  \nDefined Terms  \n34:entity  \n41:zone  \n48:room  \n55:exit  \n62:direction  \n69:character  \n76:player  \n83:npc  \n90:item  \n97:gear  \n104:pack  \n111:command  \n118:hotkey  \n125:effect  \n132:room\\_description  \n139:logger\n\nDeprecated Terms  \n100:equipment  \n107:inventory  \n142:console.log  \n\\`\\`\\`\n\nWith line numbers so your agent can easily check during a coding session to see if they're using any regulated terminology, what it means, and where it should point to, and whether they have any deprecated language that should be updated. I've found this super helpful for locking in the drift that naturally seems to happen, especially if you're moving through a lot of code at great speed =)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndrs5w/a_little_system_for_managing_language_drift/",
        "publishDate": "2025-09-10T22:08:23Z[Etc/UTC]",
        "author": "itchykittehs",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndrqj1",
        "title": "My open-source project on different RAG techniques just hit 20K stars on GitHub",
        "content": "Here's what's inside:\n\n* 35 detailed tutorials on different RAG techniques\n* Tutorials organized by category\n* Clear, high-quality explanations with diagrams and step-by-step code implementations\n* Many tutorials paired with matching blog posts for deeper insights\n* I'll keep sharing updates about these tutorials here\n\nA huge thank you to all contributors who made this possible!\n\n[Link to the repo](https://github.com/NirDiamant/RAG_Techniques)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndrqj1/my_opensource_project_on_different_rag_techniques/",
        "publishDate": "2025-09-10T22:06:32Z[Etc/UTC]",
        "author": "Nir777",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndowdw",
        "title": "I built an open, self-hosted, mobile-first web UI for Claude, Gemini, Cursor & Codex agents, MobileBuilder - need testers and contributors!",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1ndot08",
        "publishDate": "2025-09-10T20:09:12Z[Etc/UTC]",
        "author": "rttgnck",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndlppb",
        "title": "Please help me with taxonomy / terminology for my project",
        "content": "[No content]",
        "url": "/r/PromptEngineering/comments/1ndlp3w/please_help_me_with_taxonomy_terminology_for_my/",
        "publishDate": "2025-09-10T18:07:28Z[Etc/UTC]",
        "author": "Firm_Meeting6350",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndkq2w",
        "title": "which agentic model is good for front end?",
        "content": "Everytime I use anything like augment code(sonnet 4/gpt5) I am having hard time getting the desired output - this is same case for deepseek r1 with cline, kimi k2 with roocode. At some point in eternity it will give some solution, but the html format and unnecessary css or js functions create a headache to resolve. I would love to know how community is handing or which tool/llm they are using.\n\nnote: I am not trying to create a new web app or something, this is adding some new features for existing app nothing big, just creating button or adjusting sidebar, some rearrangement.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndkq2w/which_agentic_model_is_good_for_front_end/",
        "publishDate": "2025-09-10T17:31:27Z[Etc/UTC]",
        "author": "External_Ad1549",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndhr8o",
        "title": "This AI assistant became our go-to Unity co-pilot (not just another LLM)",
        "content": "During prototyping, bugs in Unity can seriously slow down the whole process not just for one dev, but for the entire team. Deadlines slip, sprints fall apart, burnout creeps in.\n\nWe started using an AI assistant that plugs into the project and fixes bugs on the fly. It doesn’t just scan stack traces it actually understands the project context: code, assets, plugins, dependencies, settings, and more. As a result, we spend less time digging through code and more time focusing on gameplay and design.\n\nSome of the biggest improvements we’ve seen:\n\n* Faster prototyping, with almost no delays in iteration\n* Tech debt isn’t piling up like it used to\n* Easier to test ideas early in the dev cycle\n* Sprints are more predictable, with fewer late-night crunches\n\nIt’s not just a code generator it’s more like a co-pilot that genuinely understands what’s going on in the project. Sometimes it catches things we wouldn’t have noticed until way later.\n\nIf anyone’s curious, I can share a quick demo video. It’s become a solid part of our pipeline",
        "url": "https://v.redd.it/dh19a1b7ycof1",
        "publishDate": "2025-09-10T15:43:56Z[Etc/UTC]",
        "author": "Golovan2",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndglap",
        "title": "I'm a serial vibe coder, this is what i've built in 2.5 years - 1 website, 15 tools, 1k in subscriptions, 8k visits a month",
        "content": "Happy to have a mod verify all of this (by that i mean, verify i am not an expert developer... I have been working on this project for a couple of years, didn't kick off until Anthropic came to the game. Built The Prompt Index which was primarily a prompt database a few popped up around the time i started but it was one of the first few to be built. I then expanded past just a prompt database and created an AI Swiss-Army-Knife style solution and have just been ADDICTED to building AI powered solutions. Here are just some of the tools i have created, most i the last 6 months, some were harder than others (Agentic Rooms and Drag and Drop prompt builder where incredibly hard).\n\n* Tools include drag and drop prompt flow chat builder\n* Agentic Rooms (where agents discuss, controlled by a room controller)\n* AI humanizer\n* Multi UI HTML and CSS generator 4 UI designs at once\n* Transcribe and note take including translation\n* Full image AI image editing suite\n* Prompt optimizer\n\nAnd so much more\n\nUsed every single model since public release currently using Opus 4.1.\n\nMain approach to coding is underpinned with the context egineering philospohy. Especially important as we all know Claude doesn't give you huge usage allowaces. (I am on the standard paid tier btw), so i ensure i feed it exactly what it needs to fix or complete the task, ask yourself, does it have everything it needs so that if you asked the same task of a human (with knowledge of how to fix it) could fix it, if not, then how is the AI supposed to get it right. 80% of the errors i get are because i have miss understood the instructions or I have not instructed the AI correctly and have not provided the details it needs.\n\nInspecting elemets and feeding it debug errors along with visual cues such as screenshots are a good combination.\n\nAlot of people ask me why don't you use OpeAI you will get so much more usage and get more built, my response is that I would rather take a few extra days and have a better quility code. I don't rush and if something isn't right i keep going until it is.\n\nI don't use cursor or any third party integration, simply ensuring the model gets exactly what it needs to solve the problem,\n\ntreat your code like bonsai, ai makes it grow faster, prune it from time to time to keep structure and establish its form.\n\nExtra tip - after successfully completing your goal, ask:  \nPlease clean up the code you worked on, remove any bloat you added, and document it very clearly.\n\nSite generates 8k visits a month and turns over aroud £1,000 in subscriptions per month.\n\nHappy to answer any questions.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndglap/im_a_serial_vibe_coder_this_is_what_ive_built_in/",
        "publishDate": "2025-09-10T15:01:17Z[Etc/UTC]",
        "author": "ThePromptIndex",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndf3bl",
        "title": "Been using Spec Kit for the last few days, plan with whatever model you like, and then switch over to codex, I suggest checking it out",
        "content": "[No content]",
        "url": "/r/ClaudeCode/comments/1ncsxeh/been_using_spec_kit_for_the_last_few_days_its/",
        "publishDate": "2025-09-10T14:03:39Z[Etc/UTC]",
        "author": "trynagrub",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndeqob",
        "title": "To reason or not to reason? (Experiences, benchmarks)",
        "content": "Hi everyone!\n\nWould be curious to hear what people's general experiences have been with using reasoning models vs non-reasoning models and trying out various levels of thinking/reasoning. \n\nI haven't been a huge fan of reasoning models from the get-to across contexts (in general use, too): I find seeing the model's \"thoughts\" kind of distracting although sometimes it's helpful (as you spot it going in an unproductive diretion before it wastes more time). There's also the time factor: if the results aren't significantly better, but the results take a lot longer to produce, I don't see it as a net benefit. \n\nRecently, however, I was trying to fix a Javascript + CSS issue and tried bumping GPT-5 into \"high reasoning\" mode. \n\nIt solved the problem and gave me a useful explanation of how it did that - which is always  something I appreciate. \n\nIt feels, at times, as if the models (in general!) are getting worse or as if they get stuck on what I often later figure out was actually quite basic \"things.\" So a lot of my process with these tools these days is figuring out which things can be safely offloaded to AI (often \"copy this pattern\" type tasks) and which I should do myself. \n\nWhat have people's experiences been? Is there any benchmark data that puts the various reasoning levels head to head and has found something interesting? But I feel like anecdotal experience proves instructive more often. ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ndeqob/to_reason_or_not_to_reason_experiences_benchmarks/",
        "publishDate": "2025-09-10T13:49:45Z[Etc/UTC]",
        "author": "danielrosehill",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne7j9v",
        "title": "OpenAI Lays Out The Principles Of Global-Scale Computing",
        "content": "[No content]",
        "url": "https://www.nextplatform.com/2025/09/10/openai-lays-out-the-principles-of-global-scale-computing/",
        "publishDate": "2025-09-11T12:30:41Z[Etc/UTC]",
        "author": "NISMO1968",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4jj8",
        "title": "AI is quietly taking over the British government",
        "content": "[No content]",
        "url": "https://i.redd.it/wpwpys6tbiof1.png",
        "publishDate": "2025-09-11T09:47:54Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "24",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4fz6",
        "title": "Before OpenAI, Sam Altman used to say his greatest fear was AI ending humanity. Now that his company is $500 billion, he says it's overuse of em dashes",
        "content": "[No content]",
        "url": "https://i.redd.it/06aghnimaiof1.png",
        "publishDate": "2025-09-11T09:41:29Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne447g",
        "title": "People leaving AI companies be like",
        "content": "[No content]",
        "url": "https://i.redd.it/mbl35q5s6iof1.png",
        "publishDate": "2025-09-11T09:19:48Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "207",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne4433",
        "title": "OpenAI whistleblower says we should ban superintelligence until we know how to make it safe and democratically controlled",
        "content": "[No content]",
        "url": "https://v.redd.it/auorop3l6iof1",
        "publishDate": "2025-09-11T09:19:35Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne1x1c",
        "title": "‘What’s Going On Here’: X Users Ask If Trump’s Video After Charlie Kirk Shooting Is AI-Made",
        "content": "[No content]",
        "url": "https://www.news18.com/world/whats-going-on-here-x-users-ask-if-trumps-video-after-charlie-kirk-shooting-is-ai-made-9564299.html",
        "publishDate": "2025-09-11T06:54:11Z[Etc/UTC]",
        "author": "jonovan",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "71",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ne032d",
        "title": "ChatGPT Concept For Customisation",
        "content": "[No content]",
        "url": "https://i.redd.it/li1k90vewgof1.png",
        "publishDate": "2025-09-11T04:59:56Z[Etc/UTC]",
        "author": "un3w",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndx4pe",
        "title": "AGI isn't for happy people",
        "content": "[No content]",
        "url": "https://alreadyhappened.xyz/p/agi-isnt-for-happy-people",
        "publishDate": "2025-09-11T02:21:06Z[Etc/UTC]",
        "author": "Unlikely-Platform-47",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndwdj1",
        "title": "AI Awards",
        "content": "Hi,\n\nJust wanted to invite you to nominate and/or vote for yourself or another AI company or leader:\n\nhttps://aiaward.dev/\n\nThis is a great (and FREE) PR and backlink opportunity.\n\nWinners are posted monthly.\n\nPlease spread to word.\n\nLMK if you have any questions or if you need a nominee badge for your site.\n\nThx!\n\nJason Wade\n\nJasonWade.com\n",
        "url": "https://www.reddit.com/r/artificial/comments/1ndwdj1/ai_awards/",
        "publishDate": "2025-09-11T01:42:59Z[Etc/UTC]",
        "author": "jdawgindahouse1974",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndvvd5",
        "title": "One-Minute Daily AI News 9/10/2025",
        "content": "1. **Microsoft** to use some AI from Anthropic in shift from OpenAI, the Information reports.\\[1\\]\n2. **OpenAI** and Oracle reportedly ink historic cloud computing deal.\\[2\\]\n3. US Senator Cruz proposes AI ‘sandbox’ to ease regulations on tech companies.\\[3\\]\n4. **Sam’s Club** Rolls Out AI for Managers.\\[4\\]\n\nSources:\n\n\\[1\\] [https://finance.yahoo.com/news/microsoft-buy-ai-anthropic-shift-183428281.html](https://finance.yahoo.com/news/microsoft-buy-ai-anthropic-shift-183428281.html)\n\n\\[2\\] [https://techcrunch.com/2025/09/10/openai-and-oracle-reportedly-ink-historic-cloud-computing-deal/](https://techcrunch.com/2025/09/10/openai-and-oracle-reportedly-ink-historic-cloud-computing-deal/)\n\n\\[3\\] [https://www.reuters.com/legal/litigation/us-senator-cruz-proposes-ai-sandbox-ease-regulations-tech-companies-2025-09-10/](https://www.reuters.com/legal/litigation/us-senator-cruz-proposes-ai-sandbox-ease-regulations-tech-companies-2025-09-10/)\n\n\\[4\\] [https://www.pymnts.com/news/artificial-intelligence/2025/sams-club-rolls-out-ai-managers/](https://www.pymnts.com/news/artificial-intelligence/2025/sams-club-rolls-out-ai-managers/)",
        "url": "https://www.reddit.com/r/artificial/comments/1ndvvd5/oneminute_daily_ai_news_9102025/",
        "publishDate": "2025-09-11T01:18:09Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndvdnd",
        "title": "Okay Google",
        "content": "[No content]",
        "url": "https://i.redd.it/winhpkxkofof1.jpeg",
        "publishDate": "2025-09-11T00:54:05Z[Etc/UTC]",
        "author": "Roy4Pris",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "135",
            "commentCount": "63",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndsnz7",
        "title": "Do you ever “argue” with your AI assistant? 😂",
        "content": "I caught myself yesterday rejecting suggestion after suggestion from Blackbox, and it literally felt like I was arguing with a stubborn pair programmer. Same thing happens with Copilot sometimes\n\nMade me wonder, do you guys just accept what the AI throws at you and edit later, or do you fight with it line by line until it gives you exactly what you want?",
        "url": "https://www.reddit.com/r/artificial/comments/1ndsnz7/do_you_ever_argue_with_your_ai_assistant/",
        "publishDate": "2025-09-10T22:46:53Z[Etc/UTC]",
        "author": "Suspicious_Store_137",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndmmqg",
        "title": "Microsoft’s AI Chief Says Machine Consciousness Is an 'Illusion'",
        "content": "[No content]",
        "url": "https://www.wired.com/story/microsofts-ai-chief-says-machine-consciousness-is-an-illusion/",
        "publishDate": "2025-09-10T18:41:54Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "190",
            "commentCount": "88",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndlubh",
        "title": "AI can never be an alcoholic.",
        "content": "I'm a recovering alcoholic and drug user. There is a very specific approach with AA and other similar 12-step or recovery paths that implore connection with and helping fellow alcoholics. \n\nI was a paramedic for about a decade but am transitioning my career into alcohol and drug addiction treatment and counseling. As far as job retention and the economy goes, looking ahead, therapy and counseling is something AI might reasonably be capable of even now, but when it comes to sitting down one alcoholic to another and connecting... Understanding and sharing in the struggles and realizing you aren't alone and there is hope. That's something that I think will always be relevant and valued. And if the world is in for a restructuring like I suspect it will be, that's a service I believe will be needed. Not the reason I am looking into pursuing it as a career, but the idea crossed my mind. \n\nConditions and experiences uniquely human, like addiction and recovery, is something that I don't see going away. At least, parts of it... That deep shared experience of struggle and hope only a fellow addict can offer... \n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1ndlubh/ai_can_never_be_an_alcoholic/",
        "publishDate": "2025-09-10T18:12:10Z[Etc/UTC]",
        "author": "Scribblebonx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndi26r",
        "title": "Sam Altman says people are starting to talk like AI, making some human interactions ‘feel very fake’",
        "content": "[No content]",
        "url": "https://fortune.com/2025/09/09/sam-altman-people-starting-to-talk-like-ai-feel-very-fake/",
        "publishDate": "2025-09-10T15:55:09Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "95",
            "commentCount": "116",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndgx7r",
        "title": "Melania Trump’s AI Era Is Upon Us",
        "content": "[No content]",
        "url": "https://www.wired.com/story/melania-trumps-ai-era-is-upon-us/",
        "publishDate": "2025-09-10T15:13:17Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndee5b",
        "title": "From google gemini (read last paragraph its hilarious)",
        "content": "The Google Doodle linking to Gemini is a direct result of Google's new strategy to integrate AI into its core search product. Google's New Approach\n\n* **The Doodle's New Purpose:** Google Doodles historically celebrated holidays, famous figures, and historical events by linking to search results about that topic. In contrast, the recent Doodle acted as a promotional tool, advertising and linking directly to Google's AI-powered search feature, \"AI Mode\".\n* **Gemini-Powered AI Mode:** AI Mode is an advanced search feature powered by the latest version of Gemini, a generative AI model. It allows users to ask complex, multi-part questions and receive in-depth, AI-generated responses.\n* **Driving AI Adoption:** This move reflects Google's push to get users to adopt its AI-powered search tools, especially as competition in the AI space grows. By putting the AI feature on its most-visited page, Google is signaling the increasing importance of AI in its product strategy. \n\nThis change marks a major shift in how Google uses its homepage for public messaging. It transforms the Doodle from a celebratory and educational graphic into a direct-marketing channel for a new product. ",
        "url": "https://www.reddit.com/r/artificial/comments/1ndee5b/from_google_gemini_read_last_paragraph_its/",
        "publishDate": "2025-09-10T13:35:43Z[Etc/UTC]",
        "author": "JobPowerful1246",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nddslu",
        "title": "The web has a new system for making AI companies pay up | Reddit, Yahoo, Quora, and wikiHow are just some of the major brands on board with the RSL Standard.",
        "content": "[No content]",
        "url": "https://www.theverge.com/news/775072/rsl-standard-licensing-ai-publishing-reddit-yahoo-medium",
        "publishDate": "2025-09-10T13:10:18Z[Etc/UTC]",
        "author": "theverge",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ndczym",
        "title": "Neuromorphic Computing: Reimagining Intelligence Beyond Neural Networks",
        "content": "[No content]",
        "url": "https://ponderwall.com/index.php/2025/06/07/neuromorphic-networks/",
        "publishDate": "2025-09-10T12:36:02Z[Etc/UTC]",
        "author": "Akkeri",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "oC85-Of273c",
        "title": "Quests + Deepseek V3.1 Free API: Bye Bolt &amp; Lovable! The BEST OPENSOURCE Alternative!",
        "content": "Visit MicroSaaS: https://www.microsaasfast.me/?utm_aik=1 In this video, I'll walk you through Quests—an open-source desktop ...",
        "url": "https://www.youtube.com/watch?v=oC85-Of273c",
        "publishDate": "2025-09-10T09:15:05Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/oC85-Of273c/hqdefault.jpg",
            "transcription": "[ 0m0s363ms - 0m3s243ms ] (Music)\n[ 0m4s473ms - 0m7s73ms ] Hi, welcome to another video.\n[ 0m8s298ms - 0m19s528ms ] So, a few days ago, I talked about how there are not many open source alternatives to Bolt.\n[ 0m19s528ms - 0m20s548ms ] And just the most simple vibe coding landscape.\n[ 0m20s888ms - 0m24s848ms ] That's why I had covered Dad at the time, but now we have something that aims to fix that problem.\n[ 0m25s408ms - 0m27s928ms ] And this is quests.\n[ 0m28s658ms - 0m32s858ms ] Quests is an open source app builder.\n[ 0m33s18ms - 0m38s928ms ] It is a desktop app that allows you to build proper React apps in a very simple to use interface.\n[ 0m39s418ms - 0m46s798ms ] The interface is insanely minimal, you can run it on all kinds of operating systems, and it's open source.\n[ 0m47s328ms - 0m51s338ms ] So, you can edit it for your needs or contribute.\n[ 0m51s878ms - 0m57s788ms ] It seems that it currently only builds apps with Vite, Hono, probably for the backend, and RPC.\n[ 0m58s308ms - 1m1s598ms ] It uses pretty good conventions.\n[ 1m1s888ms - 1m15s748ms ] And since you will mostly be creating smaller apps with something like this, it uses Vite, which is much better in my opinion for smaller apps, it's also much faster and easier to maintain.\n[ 1m16s148ms - 1m30s938ms ] And it uses newer conventions like ORPC for generally more professional and better apps, which is great because many of them just slapped Next JS and build on top of that, which is obviously not as performant for smaller apps.\n[ 1m31s528ms - 1m33s458ms ] It is new.\n[ 1m33s748ms - 1m35s368ms ] So, it doesn't have some features.\n[ 1m36s278ms - 1m45s388ms ] For example, I'd have liked to have an option to select a stack between multiple ones, along with some more options, which I'll talk about as we proceed.\n[ 1m46s238ms - 1m47s488ms ] Let's get into it.\n[ 1m47s882ms - 1m51s632ms ] But before we do that, let me tell you about today's sponsor MicroSaasFast.\n[ 1m51s972ms - 1m59s332ms ] Dreaming of launching a Micro SaaS or AI side project, but wasting weeks setting up off, payments, and SEO?\n[ 1m59s332ms - 2m12s692ms ] Check out MicroSaasFast, a Next.js boilerplate with Clerk, Stripe, Resend, PostgreSQL, and AI instructions that cut hallucinations by 90% for vibe coding, easy backend integration with Python, Node, and Go.\n[ 2m13s142ms - 2m17s542ms ] It is built and used by a CTO who helped 50 plus founders to launch SAS in the past year.\n[ 2m17s922ms - 2m21s392ms ] You can save 50 plus hours and actually ship faster.\n[ 2m21s632ms - 2m23s622ms ] Check now, link is in the description.\n[ 2m23s622ms - 2m24s252ms ] Now, back to the video.\n[ 2m24s843ms - 2m36s883ms ] So, after installing it, you'd have to set up a provider, you can select between Anthropic, Open AI, Gemini, and even Open Router and Vercel AI Gateway.\n[ 2m37s873ms - 2m45s733ms ] You are not yet able to add custom, Open AI compatible or Anthropic compatible endpoints, which is a bummer.\n[ 2m46s193ms - 2m56s893ms ] And I hope that is fixed soon, I'd recommend you set up Open Router, as you'll get some free options through there, including Deepseek V 3.1 for free.\n[ 2m57s323ms - 3m0s283ms ] Which is awesome for these tasks.\n[ 3m0s563ms - 3m5s73ms ] That's it for the setup, and you'll get right into it where you can start using it.\n[ 3m6s383ms - 3m8s483ms ] Now, the interface is what I like the most about this.\n[ 3m9s503ms - 3m13s23ms ] First of all, it's very simple, which I really like.\n[ 3m13s913ms - 3m22s753ms ] If Bolt is Jira, then this is linear, and you'll actually see that going forward as well, it also takes up way less memory.\n[ 3m23s213ms - 3m28s993ms ] It sits at about 200 megabytes on average use, which is really awesome.\n[ 3m29s463ms - 3m35s363ms ] It does some things that are different from other options and uses a rather browser-like interface.\n[ 3m35s873ms - 3m38s13ms ] On the top, you have things that look like tabs.\n[ 3m39s253ms - 3m46s843ms ] This is really an efficient way, I think, to manage multiple tasks, because you can just create multiple tabs here, similar to a browser.\n[ 3m47s213ms - 3m52s793ms ] And then build out stuff and just go back and forth.\n[ 3m53s83ms - 4m2s83ms ] This also has a status icon, which shows up when a task is going on in a tab, or if it's complete, which you'll see in the next steps.\n[ 4m2s573ms - 4m6s723ms ] You also have a sidebar here, at the bottom, you have discover.\n[ 4m7s323ms - 4m16s713ms ] Where you can see some examples of stuff made with it, these are just local examples that you can check out in order to understand how it works.\n[ 4m17s643ms - 4m29s903ms ] Then the main thing is the prompt box and the model picker, you can just type in what you wanted to do, and then select the model, and it will just get on it.\n[ 4m30s603ms - 4m36s23ms ] So, let's just get into it, I'm going to ask it to build me a simple movie tracker app.\n[ 4m36s613ms - 4m41s523ms ] Now, what you'll see is that it will go ahead and start to work on this.\n[ 4m41s923ms - 4m54s533ms ] On the left, you can see it start to work on this, it can use all kinds of tools and everything as well, on the right, you can see that the preview will appear once it gets done.\n[ 4m54s993ms - 4m57s283ms ] Let's wait a bit.\n[ 4m57s583ms - 4m58s533ms ] And it will get done.\n[ 4m58s873ms - 5m3s913ms ] So, it's now done, and on the left, you can see the chat and everything.\n[ 5m4s333ms - 5m6s663ms ] While on the right, you can see the preview.\n[ 5m7s93ms - 5m11s663ms ] You can see that it looks pretty good and doesn't have a lot of issues.\n[ 5m12s233ms - 5m16s593ms ] You can also run it yourself in the browser as well by just opening this URL.\n[ 5m17s143ms - 5m22s753ms ] This is quite good, as it just makes a URL on local host in order to allow you to open it in the browser and test it.\n[ 5m23s213ms - 5m44s383ms ] You can also hit the open in option where you'll get the option to open in terminal, cursor, VS code, finder, and even an external browser that will just open it up and allow you to probably take it even further, now here it lacks some features, it doesn't allow you to set environment variables.\n[ 5m44s763ms - 5m57s83ms ] So, if you do try to make something that requires environment variables, then that wouldn't work as of now.\n[ 5m57s443ms - 5m58s903ms ] I hope that is added soon as well.\n[ 5m59s333ms - 6m8s123ms ] You can also change the title of the app and add a reference icon and colors in order to let you navigate between projects that you build here easily.\n[ 6m8s623ms - 6m19s383ms ] It also shows you the tokens used, but it doesn't show you the cost incurred, it would have been great to see that here as well, but that isn't available yet.\n[ 6m20s323ms - 6m31s723ms ] Now, if I want, I can just hit the add tab at the top or just hit command plus T, and now it will create a new tab, and we can ask it to do something else here.\n[ 6m32s623ms - 6m39s203ms ] Let me ask it to make me a simple minesweeper game here, just to show how you can kick off multiple tasks.\n[ 6m39s593ms - 6m44s13ms ] Anyway, let's just send it and this will also go ahead and start to work.\n[ 6m44s350ms - 6m47s40ms ] Actually, let's also create another tab here.\n[ 6m47s430ms - 6m54s50ms ] And now let's ask it to make me a simple autoplay chess game and now let's send it.\n[ 6m54s340ms - 6m58s960ms ] And what you'll see is that it will also go ahead and start to work on this.\n[ 6m59s610ms - 7m4s330ms ] Now, you can go back and forth between all of them and check the stuff for yourself.\n[ 7m4s960ms - 7m15s820ms ] It's really awesome to do this and almost make it behave like a browser, it's quite awesome if you ask me, it works kind of well.\n[ 7m16s140ms - 7m28s990ms ] There are some advanced things that are missing, like the ability to import existing projects or even attaching images doesn't seem to be supported yet.\n[ 7m29s150ms - 7m37s670ms ] And stuff like selecting elements to ask for changes, or creating rules, or custom providers, and things like that are not yet supported.\n[ 7m38s130ms - 7m43s460ms ] And it makes sense because it is a first gen app that is aiming to solve something.\n[ 7m43s960ms - 7m51s660ms ] I'll probably be using this myself because I think that this is much snappier than something like Dat.\n[ 7m52s150ms - 7m56s650ms ] You can open it up with a click, it is fast.\n[ 7m57s90ms - 8m4s540ms ] You can spawn multiple agents at a time and navigate easily and all the stuff like that, which is pretty awesome.\n[ 8m5s40ms - 8m17s330ms ] This is exactly what I would have liked the open source community to have, because it was quite funny to me how the open source community didn't have a good alternative to something like Bolt or lovable.\n[ 8m17s920ms - 8m22s800ms ] I hope it gets the Superbase integration and features like that.\n[ 8m23s230ms - 8m31s840ms ] I really like the trajectory it's going on and I hope that it keeps getting updated to make it a powerhouse.\n[ 8m32s170ms - 8m33s180ms ] Overall, it's pretty cool.\n[ 8m33s950ms - 8m49s390ms ] Anyway, share your thoughts below and subscribe to the channel, you can also donate via Super Thanks option or join the channel as well and get some perks, I'll see you in the next video, bye."
        }
    },
    {
        "id": "jQfQ8GWdkmM",
        "title": "Britain&#39;s Worst WW1 Mission - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=jQfQ8GWdkmM",
        "publishDate": "2025-09-10T16:59:50Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/jQfQ8GWdkmM/hqdefault.jpg",
            "transcription": "Here's a full transcript of the video:\n\n[ 0m0s402ms - 0m3s92ms ] So in World War I, there is no Lend Lease aid.\n[ 0m3s92ms - 0m6s342ms ] No one would have thought of giving that much stuff to each other.\n[ 0m6s342ms - 0m11s662ms ] Now, to the British credit, they did try to break the blockade on Russia.\n[ 0m11s662ms - 0m16s142ms ] The way to get into Russia in those days and hook in with the railway system\n[ 0m16s142ms - 0m18s242ms ] would be to get into the Black Sea in Odessa.\n[ 0m18s242ms - 0m21s302ms ] So this is where the Gallipoli campaign comes in.\n[ 0m21s302ms - 0m26s12ms ] You can argue about whether you think it is good strategy or not, but it was miserably executed.\n[ 0m26s12ms - 0m29s132ms ] The British Navy tries to run the Dardanelles for two months.\n[ 0m29s132ms - 0m30s652ms ] That does not work well.\n[ 0m30s652ms - 0m33s442ms ] Do you suppose the Ottomans might think something was up?\n[ 0m33s442ms - 0m35s322ms ] Yeah.\n[ 0m35s322ms - 0m44s382ms ] And when you get up there on the Dardanelles, all the high point, it's a very steep place, so the Ottomans are all busy sorting that all out, getting troops in place.\n[ 0m44s382ms - 0m55s532ms ] So two months later, when the British, New Zealand, Australian and French troops all land on a given day, the Ottomans are there with a welcome party essentially, and that invasion stalemates in three days.\n[ 0m55s532ms - 1m2s412ms ] But they keep at it for eight months, taking 190,000 casualties, 55,000 of whom are dead men.\n[ 1m2s412ms - 1m4s462ms ] Totally miserably executed.\n[ 1m4s462ms - 1m15s802ms ] And it comes with collateral damage, as the British are trying to run the Dardanelles with their navy, this is when the Ottomans are terrified of their Christian subjects, Armenians, and they're starting to round them up.\n[ 1m15s802ms - 1m17s922ms ] They're pulling them out of the army.\n[ 1m17s922ms - 1m23s212ms ] And then days before the landing, the Turkish massacre of the Armenians began.\n[ 1m23s212ms - 1m28s192ms ] And between 1915 and 1923, 1.5 million Armenians are killed.\n[ 1m28s192ms - 1m30s122ms ] That's a lot of collateral damage."
        }
    }
]