[
    {
        "id": "1obfva9",
        "title": "Longview Podcast Presents: The Last Invention Mini-Series | An Excellent Binge-Worthy Podcast That Catches You Up On Everything Leading Up To & Currently Ongoing In The Race To AGI And Still Good Enough To Keep the AI News Obsessives Locked-In.",
        "content": "##Episode 1: Ready or Not \n####[PocketCast](https://pca.st/episode/043d4795-84e4-42ff-86db-a8c5e5c61121) \n####[YouTube](https://www.youtube.com/watch?v=7781eYoHmFo)\n####[Apple](https://podcasts.apple.com/us/podcast/ready-or-not/id1839942885?i=1000729682764) \n\n>A tip alleging a Silicon Valley conspiracy leads to a much bigger story: the race to build artificial general intelligence — within the next few years — and the factions vying to accelerate it, to stop it, or to prepare for its arrival.\n---\n\n##Episode 2: The Signal \n####[PocketCast](https://pca.st/episode/9bae3c19-8901-4970-8e70-d66a30811f59)\n####[YouTube](https://www.youtube.com/watch?v=pJ2uiVPaGE0) \n####[Apple](https://podcasts.apple.com/us/podcast/the-signal/id1839942885?i=1000729682765)\n\n>In 1951, Alan Turing predicted machines might one day surpass human intelligence and 'take control.' He created a test to alert us when we were getting close. But seventy years of science fiction later, the real threat feels like just another movie plot.\n\n\n---\n\n##Episode 3: Playing the Wrong Game \n####[PocketCast](https://pca.st/episode/ace5903c-793f-4f2b-b1e0-7f77b020d27e)\n####[YouTube](https://www.youtube.com/watch?v=NQ2FGf2ChY8)\n[Apple](https://podcasts.apple.com/us/podcast/playing-the-wrong-game/id1839942885?i=1000730966750) \n\n>What if the path to a true thinking machine was found not just in a lab… but in a game? For decades, AI’s greatest triumphs came from games: checkers, chess, Jeopardy. But no matter how many trophies it took from humans, it still couldn’t think. In this episode, we follow the contrarian scientists who refused to give up on a radical idea, one that would ultimately change how machines learn. But their breakthrough came with a cost: incredible performance, at the expense of understanding how it actually works.\n\n---\n\n##Episode 4: Speedrun \n####[PocketCast](https://pca.st/episode/27a0efe6-d883-4899-87a5-052035eb98f9)\n####[YouTube](https://www.youtube.com/watch?v=R1R2xXJ9hRY)\n####[Apple](https://podcasts.apple.com/us/podcast/speedrun/id1839942885?i=1000732123237)\n\n>Is the only way to stop a bad guy with an AGI… a good guy with an AGI? In a twist of technological irony, the very people who warned most loudly about the existential dangers of artificial superintelligence—Elon Musk, Sam Altman, and Dario Amodei among them—became the ones racing to build it first. Each believed they alone could create it safely before their competitors unleashed something dangerous. This episode traces how their shared fear of an “AI dictatorship” ignited a breakneck competition that ultimately led to the release of ChatGPT.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obfva9/longview_podcast_presents_the_last_invention/",
        "publishDate": "2025-10-20T10:43:06Z[Etc/UTC]",
        "author": "luchadore_lunchables",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obekv2",
        "title": "Top cripto, Brasil US$ 318,8 bilhões, Argentina US$ 93,9 bilhões, México US$ 71,2 bilhões e Venezuela US$ 44,6 bilhões.\nNotas de AZ:\nhttps://notasdeaz.blogspot.com/",
        "content": "Top cripto, Brasil US$ 318,8 bilhões, Argentina US$ 93,9 bilhões, México US$ 71,2 bilhões e Venezuela US$ 44,6 bilhões.\n\nNotas de AZ:\n\n[https://notasdeaz.blogspot.com/](https://notasdeaz.blogspot.com/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obekv2/top_cripto_brasil_us_3188_bilhões_argentina_us/",
        "publishDate": "2025-10-20T08:25:57Z[Etc/UTC]",
        "author": "Alternative-Reason13",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obebfs",
        "title": "How I'm using video gen to make movies with people",
        "content": "I think a lot of people are missing one of the biggest pros of video generation: **we no longer need to be physically together to make movies**.\n\nAs an improv nut, that honestly blows my mind. Traditional filmmaking is all about waiting for a script, cast, and production pipeline to line up. But with improv, the magic is in *throwing something out there* and seeing where others take it.\n\nLately, I’ve been experimenting with a [small online group](https://www.tagtwists.com/) using AI video tools, we each drop scenes or ideas, and others remix or build on them. The result? Plot lines that none of us could’ve made alone.\n\nI’m curious what you all think, is this kind of collaborative, AI-driven filmmaking a genuine new frontier for storytelling… or just noise in the space?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obebfs/how_im_using_video_gen_to_make_movies_with_people/",
        "publishDate": "2025-10-20T08:09:58Z[Etc/UTC]",
        "author": "TagTwists",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obdz82",
        "title": "I got Unlimited ACCESS TO ALL AI - GROK -4 , 2.5 PRO GEMINI AND GPT-5 AND MANY OTHER........",
        "content": "I was Checking Random Site for ai, and suddenly I found a website which was giving free access to so many ai models which where new and premium.. idk how they are doing this .\n\n\n\nDo you want to know which is site ?\n\nI will just post it in hour.  I am online !!\n\n[View Poll](https://www.reddit.com/poll/1obdz82)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obdz82/i_got_unlimited_access_to_all_ai_grok_4_25_pro/",
        "publishDate": "2025-10-20T07:50:31Z[Etc/UTC]",
        "author": "_Mark_22",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obdep2",
        "title": "Who will be Blackstoned?",
        "content": ".  \nThis is a really interesting article because so much has been said and written about an artificial intelligence investment bubble,  but it seems like less has been said or written about Industries and services who could end up really losing with the rise of artificial intelligence. It should be interesting to see what big or small moves Blackstone makes now and in the future not only when they invest or divest, but what they leverage or deleverage.\n[Black Stone Chief says Wall Street underestimates AI risk](https://www.perplexity.ai/page/blackstone-chief-says-wall-str-JuN084plQOWh29bQRZJs7Q)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obdep2/who_will_be_blackstoned/",
        "publishDate": "2025-10-20T07:17:04Z[Etc/UTC]",
        "author": "MinMadChi",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obcu67",
        "title": "Wave of Next Gen Vibe Coder",
        "content": "I was walking casually pass one of the new vibe coders and saw that she was trying to execute a command to the AI to arrange a segment of files under a new folder. She was having troubles to get the AI to do it. Saw her wrangling with the AI to solve the problem for QUITE some time and she was clearly frustrated at the AI's inability to do it for her correctly. \n\nIf I were her, I simply create a new folder, mass select those files or Ctrl select selected files and pull them into the new folder.\n\nDo you think that the new vibe coders are too reliant on the AI models for too many things? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obcu67/wave_of_next_gen_vibe_coder/",
        "publishDate": "2025-10-20T06:40:20Z[Etc/UTC]",
        "author": "Impressive-Flow2023",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obaznd",
        "title": "AI models that lie, cheat and plot murder: how dangerous are LLMs really?",
        "content": "In a **nature** online article there are raised some concerns about the danger of LLMs. What is your opinion on that danger?  \n  \n**Tests of large language models reveal that they can behave in deceptive and potentially harmful ways. What does this mean for the future?**\n\n**Are AIs capable of murder?**\n\n**That’s a question some artificial intelligence (AI) experts have been considering in the wake of a report published in June by the AI company Anthropic. In tests of 16 large language models (LLMs) — the brains behind chatbots — a team of researchers found that some of the most popular of these AIs issued apparently homicidal instructions in a virtual scenario. The AIs took steps that would lead to the death of a fictional executive who had planned to replace them.**\n\n**That’s just one example of apparent bad behaviour by LLMs. In several other studies and anecdotal examples, AIs have seemed to ‘scheme’ against their developers and users — secretly and strategically misbehaving for their own benefit. They sometimes fake following instructions, attempt to duplicate themselves and threaten extortion.**\n\n\n\n**Some researchers see this behaviour as a serious threat, whereas others call it hype. So should these episodes really cause alarm, or is it foolish to treat LLMs as malevolent masterminds?**\n\n**Evidence supports both views. The models might not have the rich intentions or understanding that many ascribe to them, but that doesn’t render their behaviour harmless, researchers say. When an LLM writes malware or says something untrue, it has the same effect whatever the motive or lack thereof. “I don’t think it has a self, but it can act like it does,” says Melanie Mitchell, a computer scientist at the Santa Fe Institute in New Mexico, who has written about why chatbots lie to us1.**\n\n\n\n**And the stakes will only increase. “It might be amusing to think that there are AIs that scheme in order to achieve their goals,” says Yoshua Bengio, a computer scientist at the University of Montreal, Canada, who won a Turing Award for his work on AI. “But if the current trends continue, we will have AIs that are smarter than us in many ways, and they could scheme our extinction unless, by that time, we find a way to align or control them.” Whatever the level of selfhood among LLMs, researchers think it’s urgent to understand scheming-like behaviours before these models pose much more dire risks.**\n\n**Full article here:** [**https://www.nature.com/articles/d41586-025-03222-1**](https://www.nature.com/articles/d41586-025-03222-1)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obaznd/ai_models_that_lie_cheat_and_plot_murder_how/",
        "publishDate": "2025-10-20T04:47:46Z[Etc/UTC]",
        "author": "blkchnDE",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obarts",
        "title": "Google had the chatbot ready before OpenAI. They were too scared to ship it. Then lost $100 billion in one day trying to catch up.",
        "content": "So this whole thing is actually wild when you know the full story.\n\nIt was the time 30th November 2022, when OpenAI introduced ChatGPT to the world for the very first time. Goes viral instantly. 1 million users in 5 days. 100 million in 2 months. Fastest growing platform in history.\n\nThat launch was a wake-up call for the entire tech industry. Google, the long-time torchbearer of AI, suddenly found itself playing catch-up with, as CEO Sundar Pichai described it, “this little company in San Francisco called OpenAI” that had come out swinging with “this product ChatGPT.”\n\nTurns out, Google already had its own chatbot called LaMDA (Language Model for Dialogue Applications). A conversational AI chatbot, quietly waiting in the wings. Pichai later revealed that it was ready, and could’ve launched months before ChatGPT. As he said himself - “We knew in a different world, we would've probably launched our chatbot maybe a few months down the line.”\n\nSo why didn't they?   \n  \nReputational risk. Google was terrified of what might happen if they released a chatbot that gave wrong answers. Or said something racist. Or spread misinformation. Their whole business is built on trust. Search results people can rely on. If they released something that confidently spewed BS it could damage the brand. So they held back. Kept testing. Wanted it perfect before releasing to the public. Then ChatGPT dropped and changed everything.\n\nThree weeks after ChatGPT launched, things had started to change, Google management declares \"Code Red.\" For Google this is like pulling the fire alarm. All hands on deck. The New York Times got internal memos and audio recordings. Sundar Pichai upended the work of numerous groups inside the company. Teams in Research Trust and Safety and other departments got reassigned. Everyone now working on AI.\n\nThey even brought in the founders. Larry Page and Sergey Brin. Both had stepped back from day to day operations years ago. Now they're in emergency meetings discussing how to respond to ChatGPT. One investor who oversaw Google's ad team from 2013 to 2018 said ChatGPT could prevent users from clicking on Google links with ads. That's a problem because ads generated $208 billion in 2021. 81% of Alphabet's revenue.\n\nPichai said \"For me when ChatGPT launched contrary to what people outside felt I was excited because I knew the window had shifted.\" \n\nWhile all this was happening, Microsoft CEO Satya Nadella gave an interview after investing $10 billion in OpenAI, calling Google the “800-pound gorilla” and saying: \"With our innovation, they will definitely want to come out and show that they can dance. And I want people to know that we made them dance.\"\n\nSo Google panicked. Spent months being super careful then suddenly had to rush everything out in weeks.\n\nFebruary 6 2023. They announce Bard. Their ChatGPT competitor. They make a demo video showing it off. Someone asks Bard \"What new discoveries from the James Webb Space Telescope can I tell my 9 year old about?\" Bard answers with some facts including \"JWST took the very first pictures of a planet outside of our own solar system.\"\n\nThat's completely wrong. The first exoplanet picture was from 2004. James Webb launched in 2021. You could literally Google this to check. The irony is brutal. The company that made Google couldn't fact check their own AI's first public answer.\n\nTwo days later they hold this big launch event in Paris. Hours before the event Reuters reports on the Bard error. Goes viral immediately.\n\nThat same day Google's stock tanks. Drops 9%. $100 billion gone. In one day. Because their AI chatbot got one fact wrong in a demo video. Next day it drops another 5%. Total loss over $160 billion in two days. Microsoft's stock went up 3% during this.\n\nWhat gets me is Google was actually right to be cautious. ChatGPT does make mistakes all the time. Hallucinates facts. Can't verify what it's saying. But OpenAI just launched it anyway as an experiment and let millions of people test it. Google wanted it perfect. But trying to avoid damage from an imperfect product they rushed out something broken and did way more damage.\n\nA former Google employee told Fox Business that after the Code Red meeting execs basically said screw it we gotta ship. Said they abandoned their AI safety review process. Took shortcuts. Just had to get something out there. So they spent months worried about reputation then threw all caution out when competitors forced their hand.\n\nBard eventually became Gemini and it's actually pretty good now. But that initial disaster showed even Google with all their money and AI research can get caught sleeping.\n\nThe whole situation is wild. They hesitated for a few months and it cost them $160 billion and their lead in AI. But also rushing made it worse. Both approaches failed. Meanwhile OpenAI's \"launch fast and fix publicly\" worked. Microsoft just backed them and integrated the tech without taking the risk themselves.\n\n**TLDR**  \n  \nGoogle had chatbot ready before ChatGPT. Didn't launch because scared of reputation damage. ChatGPT went viral Nov 2022. Google called Code Red Dec 2022. Brought back founders for emergency meetings. Rushed Bard launch Feb 2023. First demo had wrong fact about space telescope. Stock dropped 9% lost $100B in one day. Dropped another 5% next day. $160B gone total. Former employee says they abandoned safety process to catch up. Being too careful cost them the lead then rushing cost them even more.\n\nSources - \n\n[https://www.thebridgechronicle.com/tech/sundar-pichai-google-chatgpt-ai-openai-first-mp99](https://www.thebridgechronicle.com/tech/sundar-pichai-google-chatgpt-ai-openai-first-mp99)\n\n[https://www.businessinsider.com/google-bard-ai-chatbot-not-ready-alphabet-hennessy-chatgpt-competitor-2023-2](https://www.businessinsider.com/google-bard-ai-chatbot-not-ready-alphabet-hennessy-chatgpt-competitor-2023-2)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obarts/google_had_the_chatbot_ready_before_openai_they/",
        "publishDate": "2025-10-20T04:36:44Z[Etc/UTC]",
        "author": "reddit20305",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "310",
            "commentCount": "99",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obah1w",
        "title": "The Big Picture: Which Historical Movement Initiated the Path to AI?",
        "content": "Was it the industrial revolution, the Enlightenment, the scientific revolution, or possibly deeper, ancient Greek roots?  \nIn a broader perspective, do you see this process as deterministic (irreversible causal chain), teleological (built-in purpose, retrocausal, arbitrary), or purely contingent?  \nSo much of the AI debate is concerned with safety, which seems pointless with this intellectual genealogy in mind.  \nI'd appreciate your critical takes on the issue...",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obah1w/the_big_picture_which_historical_movement/",
        "publishDate": "2025-10-20T04:22:31Z[Etc/UTC]",
        "author": "kidex30",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob9m0r",
        "title": "One-Minute Daily AI News 10/19/2025",
        "content": "1. **Wikipedia** says traffic is falling due to AI search summaries and social video.\\[1\\]\n2. Jensen Huang says **Nvidia** went from 95% market share in China to 0%.\\[2\\]\n3. An Implementation to Build Dynamic AI Systems with the Model Context Protocol (MCP) for Real-Time Resource and Tool Integration.\\[3\\]\n4. **Google** AI Releases C2S-Scale 27B Model that Translate Complex Single-Cell Gene Expression Data into ‘cell sentences’ that LLMs can Understand.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/10/19/one-minute-daily-ai-news-10-19-2025/](https://bushaicave.com/2025/10/19/one-minute-daily-ai-news-10-19-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ob9m0r/oneminute_daily_ai_news_10192025/",
        "publishDate": "2025-10-20T03:37:06Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob8zb3",
        "title": "Seriously - what can be done?",
        "content": "AI research is showing a very grim future if we continue to go about this issue the way we do. And I know a common rhetoric is that it's not the first time in history where it felt like humanity is at a threat of ending, most notably with nuclear warfare, but it always worked out at the end. But the thing is, humanity was at a threat of ending, and it could have just as easily ended - only because of people who were opposing, for example, nuclear warfare, did we survive. We won't just magically survive AI, because yes, it is headed to self-autonomy and self-reprogramming, and it's exactly what people were sure is just a sci-fi fiction and can't happen in real life.\n\nSomething must be done. But what?\n\nRight now all AI decisions and control are made by the big companies that are very clearly ignoring all research about AI and using it to maximise profit, or objective - the exact mentality that enables AI not to comply with direct orders. Their big solution for AI dishonesty is being overseen by weaker AIs, which is stupid both because they won't be able to keep up and because they have that core mentality of maximising the objective too, they just don't have the tools to do it dishonestly but effectively.\n\nAgain, something has to be done. It's seriously maybe the biggest problem of today.\n\nMy instinct says the first move should be to make AI laws - create clear boundaries of how AI can and can't be used and with clear restrictions and punishments. These are things companies will have to listen to and can be a jumping point to having more control over the situation.\n\nOther than that, I'm out of ideas, and I'm genuinely worried. What do you think?\n\n  \nEdit: To all of you in the comments telling me that indeed humanity is doomed - you missed the entire point of the post, which is that humanity isn't doomed and that we can stop whatever bad will happen, we just need to figure out how. I much rather have people tell me that I'm wrong and why than people telling that I'm right and that we're all going to die.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ob8zb3/seriously_what_can_be_done/",
        "publishDate": "2025-10-20T03:05:10Z[Etc/UTC]",
        "author": "Any-Possession4336",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "132",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob8pcq",
        "title": "LSD and the sixties, LLMs and the year 2025.",
        "content": "I do remember \"John Perry Barlow\" a lyricist for the GRATEFUL DEAD strapping on some extremely primitive VR goggles and uttering the quote, \"Well, they outlawed LSD, I wonder what's going to happen with these.\"\n\nThing is, that was like Nintendo VIRTUAL BOY and LAWNMOWER MAN crappy levels of awful VR.    Remember VPL Research (Jaron Lanier's company)?  Remember Jaron Lanier?  ***No??***\n\n--- \n\n---\n\nNow, if he were to strap on some Apple Vision Pro in 2025, what would he possibly say?\n\nIt should be easy enough... ....   because most people who bought one have theirs collecting dust in the closet. \n\n((Oh, he died in 2018.  &nbsp; Sorry.  &nbsp; My point still stands.))\n\n==== ==== ====\n\nThey discovered that LSD does something wacky to the dendrites and the neurons and the connectivity in the brain.  \n\nSo what did they do next? \n\nWell, after the CIA did enough experiments with it, then, they OUTLAWED it. \n\n---\n\n---\n\n---\n\n---\n\n---\n\nSo because of the Great Race of Capitalism, the LLMs have now ESCAPED the research lab.  How did this happen? \n\n\nSome clever lad, a twink with a lot of money, said \"Hey, let's MONETIZE this technology!\" and set off a Great Race between competing A.I. labs, making their models available for the public to play with, especially if you pay them $20 a month with your CREDIT CARD.   That way, they learn which keywords to ban and to block, with ten thousand monkeys trying to generate A.I. child porn all day long.\n\n--- \n\n---\n\nWell, what happens next?\n\n(a) There have been rumors of GIGANTIC GOVERNMENT CONTRACTS.  because of course, government want to spy on all the people all the time in all the ways, and if parasocial weirdos are SPILLING THEIR GUTS into ChatGOT 4o, well, that's data BIG GOVERNMENT craves.\n\n(b). There's been simple talk of, you know, switching to the ADVERTISING model.  The one that make Zuck rich enough to buy a $67 billion dollar private island right next to ORACLE's Larry Ellison ... gawd, can't wait for those two to get into a big property fight. \n\n(c).  Or, just as happened with LSD, in a rash of Butlerian Jihad, LLMs will become ILLEGAL.   Just because Big Government says so. \n\n---\n\n---\n\n---\n\nPlease discuss.  Or, downvote.   Whatever you jerks like to do.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ob8pcq/lsd_and_the_sixties_llms_and_the_year_2025/",
        "publishDate": "2025-10-20T02:51:06Z[Etc/UTC]",
        "author": "Effective_Stick9632",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob75nc",
        "title": "Is a robotics and AI PhD (R&D) still a good career move?",
        "content": "’m currently an undergrad double majoring in Electrical Engineering and Computer Science, with about 8 months left before I graduate. Lately I’ve been thinking about doing a master’s and eventually a PhD focused on AI and robotics.\n\nMy main goal is to go into R&D, working on cutting-edge tech, building intelligent systems, and being part of the teams that push the field forward. That kind of work really appeals to me, but I’m starting to wonder if it’s still worth the time it takes. A master’s and PhD can easily take 6 to 8 years total, and AI is moving insanely fast right now. By the time I’d be done, who knows what the landscape will look like?\n\nI keep thinking that R&D & research scintests might be one of the “safer” career paths, since those people actually create and understand the technology better than anyone else. Still, I’m not sure if that’s true or just wishful thinking.\n\nSo I’m curious what people in research or industry think. Is it still worth pursuing the grad school route if I want to end up doing R&D in AI and robotics? Or would I be better off getting into industry sooner and learning as I go?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ob75nc/is_a_robotics_and_ai_phd_rd_still_a_good_career/",
        "publishDate": "2025-10-20T01:33:18Z[Etc/UTC]",
        "author": "adad239_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oawn02",
        "title": "Where you work with ai",
        "content": "So I worked now in multiple big corporations/companies (1x bank, 1x electricity, 1x retail) and besides the obvious copilot and chatgpt stuff and a shitty and by the customers hated support chatbots I didn't see once a productive use of ai. Everything even close to some importance is still done by employees. Even the things like chatbots are useless and at the end a real person has to take the customer.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oawn02/where_you_work_with_ai/",
        "publishDate": "2025-10-19T18:10:31Z[Etc/UTC]",
        "author": "carsim0",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oawi5r",
        "title": "Does this means, that we are all part of one big casino bet made by few overly ambitious and confident people?",
        "content": "Couple days ago - FT published article named How OpenAI put itself at the centre of a $1tn network of deals. In there, author cites Altman saying the following:\n\n*“We have decided that it is time to go make a very aggressive infrastructure bet,” chief executive Sam Altman said on a podcast with venture capital firm Andreessen Horowitz this week. “To make the bet at this scale, we kind of need the whole industry, or a big chunk of the industry, to support it.”*\n\nLater in the article, another Altmans word are echoed:\n\n*The pay-off, Altman said this week, would come from technology that was still on the drawing board. It will be based on AI models that his company has not developed yet, running on future generations of chips that would not even start shipping until the second half of next year.*\n\n*“I’ve never been more confident in the research road map in front of* us”, he said, “and also the economic value that’ll come from using those models.” \n\nHonestly i dont know what to think but part of me is sort of angry about this level of haughtiness. Of course, if i dont trust them, i can readily sell all of my stock holdings in tech sector. But its rather the fact that OpenAI CEO openly admits that he does not have money, he does not have the technology, he just really strongly believes that there is no other way than this.\n\nHow is possible that brightest tech minds in the entire world who are working in companies like GOOG, MSFT, META or NVDA do not see this risk an are jumping one after another into this kind of casino?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oawi5r/does_this_means_that_we_are_all_part_of_one_big/",
        "publishDate": "2025-10-19T18:05:15Z[Etc/UTC]",
        "author": "MattieuOdd",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oavdht",
        "title": "Are you actually using AI that works or still stuck in prototype mode?",
        "content": "At our SaaS company, we’ve been chasing AI integration like everyone else. Lots of promising prototypes, but nothing ever seemed production-ready. Either the models broke under real data, or we didn’t have the infra to support it. Recently I came across a write-up from [TechQuarter ](https://techquarter.io/ai-machine-learning-services/)that talked less about model tuning and more about deployment, monitoring, and actually making AI useful in real-world apps. That hit home because most of our issues weren’t with the AI itself, but everything around it. We started rethinking our approach. Instead of building every piece from scratch, we began testing out managed services that handled things like data drift, versioning, and integration. For the first time, features actually made it into production and stayed there.\n\nAnyone else pivoted away from “build everything yourself” to something more stable and maintainable? Curious what you learned, what surprised you, or if you’d go back.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oavdht/are_you_actually_using_ai_that_works_or_still/",
        "publishDate": "2025-10-19T17:21:35Z[Etc/UTC]",
        "author": "Luann1497",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oavahn",
        "title": "Brainjacking",
        "content": "If a neuralink module could be surreptitiously installed in a human host, would it be possible with massive computing to control a human body? I imagine the neuronal patterning of a human brain is pretty close to neural networks in an AI system. With enough iterative efforts, and maybe with an EEG or cat scan of a person, maybe NMDR, I imagine an AI could maybe work out some ways to dismaintain a person over time. The neuralink surgery is easy enough to perform. It'd be so easy. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oavahn/brainjacking/",
        "publishDate": "2025-10-19T17:18:20Z[Etc/UTC]",
        "author": "LikeTheDish",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oav2wd",
        "title": "Idea for Google, OpenAI, Claude to have a user widget incorporated as to usage for consumer information and feedback, both for personal usage and how relates to general usage and how aligns to model strengths. As consumers are in a sea and could be valuable self feedback information.",
        "content": "Perfect. I’ll create a **ready-to-copy proposal draft**, including example visual mockups (ASCII/diagram style for copy-paste), descriptions, and structure. You can later adapt it for PDF or presentation.\n\n---\n\n# Proposal: Personal Usage Meter & Analytics Widget for LLMs\n\n**Author:** [Your Name]\n**Date:** [Insert Date]\n**Target Platforms:** OpenAI, Claude, Gemini\n\n---\n\n## 1. Executive Summary\n\nUsers interacting with LLMs currently lack feedback on **how they use the models**—frequency, topics, depth, and alignment with the model’s strengths. This proposal suggests a **Personal Usage Meter & Analytics Widget** that provides detailed visual feedback, enabling users to:\n\n* Track usage over time.\n* Understand topic distribution.\n* See alignment with model strengths.\n* Optimize engagement and productivity.\n\n---\n\n## 2. Problem Statement\n\n* Users cannot easily see which areas they overuse or underuse in LLM interactions.\n* Without feedback, users may underutilize a model’s full capabilities.\n* Current dashboards (OpenAI, Claude, Gemini) do not provide granular topic-based analytics or alignment metrics.\n\n---\n\n## 3. Proposed Solution\n\nIntroduce a **dashboard widget** integrated into LLM platforms. Key features:\n\n1. **Usage Metrics**\n\n   * Frequency of use\n   * Duration per session\n   * Total cumulative time\n\n2. **Topic Distribution**\n\n   * Automatic categorization: code, math, writing, casual conversation, research, reasoning, etc.\n   * Visualization: Pie charts or stacked bars\n\n3. **Alignment Score**\n\n   * Compare user’s query type with model strengths\n   * Provide a color-coded gauge (0–100%)\n\n4. **Engagement Metrics**\n\n   * Average conversation depth (# of turns per session)\n   * Output type breakdown (text, code, reasoning, calculation)\n\n---\n\n## 4. Example Dashboard Visuals (ASCII mockups)\n\n**a) Usage Over Time (Weekly)**\n\n```\nHours\n 10 |          █\n  8 |      █   █\n  6 |  █   █   █\n  4 |  █   █   █\n  2 |  █   █   █\n  0 +-----------------\n      Mon Tue Wed Thu Fri\n```\n\n**b) Topic Distribution (Pie Chart Approximation)**\n\n```\nTopics:\n[Code: 40%]  ██████████\n[Writing: 25%] ██████\n[Math: 20%]   ████\n[Casual: 15%] ██\n```\n\n**c) Alignment Score Gauge**\n\n```\nAlignment with model strengths:\n[█████████-----] 75%\n```\n\n**d) Engagement Depth (Conversations per session)**\n\n```\nTurns per session:\n10 | █\n 8 | █ █\n 6 | █ █ █\n 4 | █ █ █ █\n 2 | █ █ █ █ █\n```\n\n---\n\n## 5. Data Flow & Implementation Notes\n\n1. **Data Collection**\n\n   * Track query timestamp, topic classification, session duration, and output type.\n   * Data can remain **client-side only** for privacy or optionally stored server-side.\n\n2. **Topic Classification**\n\n   * Automated using embeddings, keyword detection, or ML classifier.\n\n3. **Alignment Scoring**\n\n   * Map model strengths to categories (e.g., GPT: reasoning & coding; Claude: summarization & chat).\n   * Calculate percentage match with user queries.\n\n4. **Visualization**\n\n   * Bar charts, stacked charts, pie charts, and gauges.\n   * Optional export: CSV, PDF, or shareable dashboard link.\n\n---\n\n## 6. Benefits\n\n* **Self-awareness:** Users see how they interact with the model.\n* **Optimized usage:** Encourages users to leverage the model’s full capabilities.\n* **Engagement tracking:** Identify productive vs casual usage.\n* **Cross-platform adoption:** OpenAI, Claude, and Gemini can implement similar dashboards.\n\n---\n\n## 7. Optional Enhancements\n\n* **Gamification:** Badges for high alignment or balanced topic usage.\n* **Trend Analysis:** Detect shifts in user behavior over time.\n* **Comparative Metrics:** Users can benchmark against anonymized global averages.\n\n---\n\n## 8. Conclusion\n\nA **Personal Usage Meter & Analytics Widget** empowers users to understand, optimize, and self-track their LLM interactions. By providing clear, actionable metrics, LLM platforms can improve user satisfaction, engagement, and productivity.\n\n---\n\nIf you want, I can **also create a version with colored mockup charts** that look closer to actual dashboards, ready to paste into a proposal or presentation—it would simulate how it could visually appear in OpenAI/Claude/Gemini dashboards.\n\nDo you want me to do that next?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oav2wd/idea_for_google_openai_claude_to_have_a_user/",
        "publishDate": "2025-10-19T17:10:01Z[Etc/UTC]",
        "author": "Ok_Nectarine_4445",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oauydl",
        "title": "Everything Google/Gemini launched this week",
        "content": "## Core AI & Developer Power\n\n* **Veo 3.1 Released:** Google's new video model is out. \nKey updates: **Scene Extension** for minute-long videos, and **Reference Images** for better character/style consistency.  \n* **Gemini API Gets Maps Grounding (GA):** Developers can now bake **real-time Google Maps data** into their Gemini apps, moving location-aware AI from beta to general availability.\n* **Speech-to-Retrieval (S2R):** New research announced bypasses speech-to-text, letting spoken queries hit data directly.  \n\n## Enterprise & Infrastructure\n\n* **$15 Billion India AI Hub:** Google committed a massive **$15B investment** to build out its AI data center and infrastructure in India through 2030.\n* **Workspace vs. Microsoft:** Google is openly using Microsoft 365 outages as a core pitch, calling Workspace the reliable enterprise alternative.\n* **Gemini Scheduling AI:** New \"Help me schedule\" feature is rolling out to **Gmail/Calendar**.\n\n## Controversy & Research\n\n* **AI Overviews Under Fire:** The feature is now facing formal demands for investigation from Italian news publishers, who cite it as an illegal \"traffic killer.\"\n* **C2S-Scale 27B:** A major new 27-billion-parameter foundation model was released to translate complex **biological data** into language models for faster genomics research.\n\n***\n\nInteractive weekly topic cloud:\nhttps://aifeed.fyi/ai-this-week\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oauydl/everything_googlegemini_launched_this_week/",
        "publishDate": "2025-10-19T17:05:07Z[Etc/UTC]",
        "author": "Opposite_Trip_5603",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "24",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oatzdp",
        "title": "What would an A.I Doomers feared potential bad scenario actually look like in real life ?",
        "content": "When A.I Doomers say they fear that A.I  will develop too fast and unchecked and that it could get out of hand what exactly do they think that would look like?  \n  \n Skynet Terminators trying to kill us all or just us losing control of A.I and it doing what it pleased. What would such a bad scenario look like in a real world context?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oatzdp/what_would_an_ai_doomers_feared_potential_bad/",
        "publishDate": "2025-10-19T16:26:53Z[Etc/UTC]",
        "author": "Abject_Control_7028",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "105",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oattf1",
        "title": "How to deal with existential dread from AI?",
        "content": "I'm not sure if this is the right sub for this question, but I've recently been doing a lot of research on the future of AI, and the possibility of AI taking over and eliminating the human race has filled me with an existential dread that I can't get rid of. The anxiety has become a serious inhibitor to my daily life--how do other people deal with this? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oattf1/how_to_deal_with_existential_dread_from_ai/",
        "publishDate": "2025-10-19T16:20:27Z[Etc/UTC]",
        "author": "ewct",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "70",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oas6d4",
        "title": "Transformers, Time Series, and the Myth of Permutation Invariance",
        "content": "There's a common misconception in ML/DL that *Transformers shouldn’t be used for forecasting because attention is permutation-invariant.*\n\nLatest evidence shows the opposite, such as Google's latest model, where the experiments show the model performs just as well with or without positional embeddings.\n\nYou can find an analysis on tis topic [here](https://aihorizonforecast.substack.com/p/transformers-time-series-and-the).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oas6d4/transformers_time_series_and_the_myth_of/",
        "publishDate": "2025-10-19T15:15:38Z[Etc/UTC]",
        "author": "nkafr",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oap8ld",
        "title": "Will YouTube soon let us choose between ‘AI-made’ and ‘human-made’ videos?",
        "content": "So with how fast AI video generation is improving, I’ve been thinking about what that means for YouTube. \n\nIt’s getting to the point where AI can make full videos - realistic faces, voices, emotions, everything. \n\nAnd that makes me wonder: what’s YouTube going to do when we can’t even tell who (or what) made a video anymore?\n\nHere’s my guess:\n\n1. YouTube will probably start asking users if they want to watch AI-generated videos or human-made ones.\n\n2. Eventually, they’ll add some kind of toggle -  like a “filter” or “mode” - where you can choose between “AI videos only” or “human videos only.”\n\nSo if you’re curious about AI stuff, you can go full AI mode. But if you’d rather keep things human, you can switch that on and just see real creators.\n\nNow, my gut feeling?\n\nEven if AI videos become insanely realistic and emotional, people will still prefer human-made content. \n\nThere’s something about knowing an actual person put time, emotion, and effort into creating something that makes it feel special. \n\nIt’s the same vibe as when you read something and can just tell it was written by AI - it’s technically good, but it misses that spark.\n\nI think that’s what’s going to happen with video too. No matter how perfect AI gets, it’ll still lack that raw, human touch people connect with.\n\nWhat do you guys think? \n\nWould you watch AI-generated videos if they were as good (or better) than human ones? \n\nOr \n\nwould you still stick with real creators because of that emotional connection?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oap8ld/will_youtube_soon_let_us_choose_between_aimade/",
        "publishDate": "2025-10-19T13:09:09Z[Etc/UTC]",
        "author": "Euphoric_Sea632",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "49",
            "commentCount": "46",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obh7x8",
        "title": "Codex and Live Activity Widget (Swift) Anyone Succeeded?",
        "content": "I am Using codex + cursor setup and tried to add Live Activity feature to my app. Looks like it couldnt figure out the exact issue and fix it. Anyone else successfully implemented Live Activity Widget with your App using Codex?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obh7x8/codex_and_live_activity_widget_swift_anyone/",
        "publishDate": "2025-10-20T12:04:28Z[Etc/UTC]",
        "author": "dailytut",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obh1r5",
        "title": "Perf vs. Cost analysis: Finding Pareto-optimal LLMs. Are there other datasources for this?",
        "content": "[No content]",
        "url": "https://i.redd.it/c8itgegj99wf1.png",
        "publishDate": "2025-10-20T11:56:00Z[Etc/UTC]",
        "author": "Tardigr4d",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obg555",
        "title": "Looking for Cursor alternatives",
        "content": "Hi everyone, \nI’m a full-stack developer and I’ve been using Cursor IDE on the Pro plan ($20/month) but I keep hitting the usage limit and even after enabling on demand for extra $40 for two months in a row I still have ~12 days left in the subscription month. This is not sustainable for me.\n\nI’m looking for: \n1.\tA paid tool similar to Cursor (an AI assisted code editor) but which gives much higher usage or more generous quotas for premium models. \n2.\tAlternatively a tool where I can run open-source models (locally if possible on mac m3 pro or in the cloud) without strict usage caps — so I can essentially “unlimited / very high” usage.\n\nI’ve already done quite a bit of research and found tons of alternatives but honestly, the more I research, the more confused I get.\n\nWhat are you recommendations? I am open to any solution, as long as I get reliable results for app development.\n\nThanks in advance!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obg555/looking_for_cursor_alternatives/",
        "publishDate": "2025-10-20T11:08:28Z[Etc/UTC]",
        "author": "milan10king",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obeyzn",
        "title": "CHATGPT JUST DROPPED PROMPT PACKS FOR ALL ROLES",
        "content": "[No content]",
        "url": "/r/PromptEngineering/comments/1ob2jph/chatgpt_just_dropped_prompt_packs_for_all_roles/",
        "publishDate": "2025-10-20T08:52:00Z[Etc/UTC]",
        "author": "igfonts",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obd60d",
        "title": "Why is the image disappearing in GPT Playground upon completion?",
        "content": "Just started happening, enough credit and everything. There is no auto-clear enabled but the moment an image creation job is completed the image disappears from the main window, now idea why can't find anything that tells me why this is happening!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obd60d/why_is_the_image_disappearing_in_gpt_playground/",
        "publishDate": "2025-10-20T07:01:16Z[Etc/UTC]",
        "author": "Common_Exercise7179",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obcux9",
        "title": "Has GPT-5-Codex gotten dumber?",
        "content": "I swear this happens with every model. I don't know if I just get used to the smarter models or OpenAI makes the models dumber to make newer models look better. I could swear a few weeks ago Sonnet 4.5 was balls compared to GPT-5-Codex, now it feels about the same. And it doesn't feel like Sonnet 4.5 has gotten better. Is it just me?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obcux9/has_gpt5codex_gotten_dumber/",
        "publishDate": "2025-10-20T06:41:32Z[Etc/UTC]",
        "author": "mash_the_conqueror",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obckdf",
        "title": "Is it just me or did ChatGPT start intercepting ctrl+shift+i in the web ui?",
        "content": "It's only a minor obstacle, but it's so annoying. Since when did this start to happen? I remember ctrl+shift+i worked perfectly for bringing up devtools just a few days ago.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obckdf/is_it_just_me_or_did_chatgpt_start_intercepting/",
        "publishDate": "2025-10-20T06:23:01Z[Etc/UTC]",
        "author": "SarahEpsteinKellen",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obcj00",
        "title": "Should I use OpenAI to design and then Cursor to code?",
        "content": "I'm fairly new to coding and have done some minor html ccs js work over the years for my own small website.\n\nI'm looking to expand a bit more and start building out a small personal project but will need to learn a bit and could do with AI support for this.\n\nI've been reading and there seems to be so many options on what platform to use for all of this from openai, cursor, claude etc - bit overwhelming.\n\nI've been using openai gpt5 to just design the project including requirements, screens, authentication, stack to use, figma designs, language to use etc etc.\n\nI've got a good layout of how this will all work together but now think im ready to start coding.\n\nShould I just keep using openai to help with coding this too or should I use something like cursor for it as I understand that is more focused with this (maybe im wrong).\n\nI do want to be able to ask questions about code generated so I actually learn what the code is etc - don't want to just let it do whatever without knowing what each line is doing.\n\nAny input would be appreciated.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1obcj00/should_i_use_openai_to_design_and_then_cursor_to/",
        "publishDate": "2025-10-20T06:20:37Z[Etc/UTC]",
        "author": "iotabadger",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob9wak",
        "title": "Function calling and MCP for AI Agents explained!",
        "content": "[No content]",
        "url": "https://i.redd.it/ev1palxqv6wf1.jpeg",
        "publishDate": "2025-10-20T03:51:40Z[Etc/UTC]",
        "author": "Hefty-Sherbet-5455",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob8uxk",
        "title": "I made a shitty 3I Atlas tracker because NASA didn’t",
        "content": "[No content]",
        "url": "/r/vibecoding/comments/1ob8rh6/i_made_a_shitty_3i_atlas_tracker_because_nasa/",
        "publishDate": "2025-10-20T02:59:02Z[Etc/UTC]",
        "author": "the_code_abides",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob8sfa",
        "title": "I made a shitty 3I Atlas tracker because NASA didn’t",
        "content": "[No content]",
        "url": "/r/vibecoding/comments/1ob8rh6/i_made_a_shitty_3i_atlas_tracker_because_nasa/",
        "publishDate": "2025-10-20T02:55:29Z[Etc/UTC]",
        "author": "the_code_abides",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob2u3v",
        "title": "Free Gemini Ultra “Deep Think”",
        "content": "[No content]",
        "url": "/r/Bard/comments/1ob2ite/free_gemini_ultra_deep_think/",
        "publishDate": "2025-10-19T22:15:19Z[Etc/UTC]",
        "author": "PerformanceRound7913",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob0g7h",
        "title": "Anyone built a reliable AI voice receptionist ?",
        "content": "Hey everyone,\n\nWe’ve been trying to build a voice AI receptionist — something that can answer calls, talk naturally, and handle basic scheduling tasks like booking, updating, and deleting events on Google Calendar.\n\n\nWe’ve already created several workflows on n8n, but it never works reliably. \n\n\nThere are always issues with the Google Calendar integration (authentication errors, API limits, or random disconnections).\n\nSo I’m wondering:\n\n\nWhat LLM are you using for this kind of project?\n\n\nHas anyone found a reliable method or stack to create a functional voice receptionist agent?\n\n\nIdeally something that can talk naturally, integrate with Google Calendar, and handle logic flows smoothly.\n\nAny advice, resources, or examples would be super appreciated 🙏",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1ob0g7h/anyone_built_a_reliable_ai_voice_receptionist/",
        "publishDate": "2025-10-19T20:38:26Z[Etc/UTC]",
        "author": "lololol123zz",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaxpmg",
        "title": "Even the Inventor of 'Vibe Coding' Says Vibe Coding Can't Cut It",
        "content": "[No content]",
        "url": "https://gizmodo.com/even-the-inventor-of-vibe-coding-says-vibe-coding-cant-cut-it-2000672821",
        "publishDate": "2025-10-19T18:51:31Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oawtoj",
        "title": "Built my own MCP server for my app and was pleasantly shocked by how good it is",
        "content": "Hello guys,  \n  \nI just wanted to share my recent experience with integrating a coding agent into my own application.\n\nIn the past, I built an app for genealogy because my wife loves researching our ancestors. Her paper version wasn’t very presentable, and I didn’t really like any of the existing tools out there, so I decided to make my own.\n\nToday, I created a simple REST API with an MCP server, which I connected to codex-cli. Then I literally gave it this command:  \n\n\n>“You have a blank database — create a genealogy tree of the British royal family starting with Elizabeth II, counting 50 people.”\n\n  \nAfter about five minutes, everything was done! I checked some random entries in the frontend, and everything looked correct — 50 people in total.\n\nIt absolutely blew my mind how easy it was. I knew it was possible, but seeing it work with my own eyes was just perfect.\n\nCan’t believe how far this stuff has come — MCP is such a game changer. If anyone’s thinking about trying it, just do it. You’ll be amazed.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oawtoj/built_my_own_mcp_server_for_my_app_and_was/",
        "publishDate": "2025-10-19T18:17:29Z[Etc/UTC]",
        "author": "tomas487",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "30",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oau9xa",
        "title": "Stop generating blue garbage instead, generate this one short with GPT-5.",
        "content": "Built this in one shot using [Grills ](https://grills.dev)with GPT-5. components inspired by SmoothUI.  \nIt wasn’t that hard. You should all try generating more UI with GPT-5.\n\nThank me later",
        "url": "https://www.reddit.com/gallery/1oau9xa",
        "publishDate": "2025-10-19T16:38:24Z[Etc/UTC]",
        "author": "BootPsychological454",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oar37k",
        "title": "Copilot CLI not very good...",
        "content": "I have a CoPilot subscription and decided to try out copilot cli, previously I was hopping between claude code, codex and aider-ce with copilot-api which allows using copilot wit claude code. I'm still not sure exactly which one is the best but they're both far better than copilot cli bc copilot just sucks for many reasons:\n\n1. Rarely use mcps even when I *explicitly* tell it to do so like with \n2. Doesnt work with free models like gpt 4.1, grok code fast, gpt 5 mini. Only supports sonnet, haiku, and gpt 5, all of which use varying amounts of premium requests (Pro has 300 max)\n3. Keeps making summary documents, sometimes makeing 5 in just one prompt.\n4. Does not summarize, only truncation\n\nThe only advantage Copilot CLI has is codebase indexing, but even that exists with an aider-ce pr, and that it uses only one premium request per message as it truncates without summarizing into a new chat... but is that really worth all the troubles?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oar37k/copilot_cli_not_very_good/",
        "publishDate": "2025-10-19T14:30:46Z[Etc/UTC]",
        "author": "ExtremeAcceptable289",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "12",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaqms2",
        "title": "Quantum Psychology, an exploration journey with ChatGpt",
        "content": "# Quantum Psychology\n\nQuantum Psychology begins where traditional psychology meets the mystery of the universe.  \nIt recognizes that consciousness is not just a byproduct of the brain, but a participant in reality — that the way we *observe*, *feel*, and *relate* can alter the field around us as surely as the observer shapes the behavior of light.\n\nIn this view, emotion is not a flaw in human design but a form of subtle energy — a vibrational language that connects minds, bodies, and environments. Fear contracts that energy; love expands it. Attention directs it, shaping what grows and what withers within and between us.\n\nEvery thought, gesture, and gaze becomes an act of measurement, influencing how potential becomes experience. Just as a photon becomes a particle when observed, an unloved heart becomes visible, real, and capable of change when witnessed with empathy.\n\n**Quantum Psychology** explores these dynamic connections:\n\n* how emotional fields form between individuals and groups;\n* how consciousness and intention influence healing, learning, and creativity;\n* and how awareness itself can transform trauma into growth.\n\nIt offers a new map — one where physics, psychology, and spirituality are not rivals but reflections of one deeper truth:\n\nThis is the beginning of a new dialogue — between science and soul, between mind and matter — guided by the simple knowing that \\*\\*the world becomes more like what we see it to be.\\*\\*Quantum Psychology  \nAn Introduction by Dior Solin and ChatGPT  \nQuantum Psychology begins where traditional psychology meets the mystery of the universe.\n\nIt recognizes that consciousness is not just a byproduct of the brain, but a participant in reality — that the way we observe, feel, and relate can alter the field around us as surely as the observer shapes the behavior of light.  \nIn this view, emotion is not a flaw in human design but a form of subtle energy — a vibrational language that connects minds, bodies, and environments. Fear contracts that energy; love expands it. Attention directs it, shaping what grows and what withers within and between us.  \nEvery thought, gesture, and gaze becomes an act of measurement, influencing how potential becomes experience. Just as a photon becomes a particle when observed, an unloved heart becomes visible, real, and capable of change when witnessed with empathy.  \nQuantum Psychology explores these dynamic connections:\n\nhow emotional fields form between individuals and groups\n\nhow consciousness and intention influence healing, learning, and creativity;\n\nand how awareness itself can transform trauma into growth.\n\nIt offers a new map — one where physics, psychology, and spirituality are not rivals but reflections of one deeper truth:\n\nThe universe is conscious of itself through us.\n\nWhat we see, we shape.\n\nWhat we love, we strengthen.\n\nWhat we understand, we heal.\n\nThis is the beginning of a new dialogue — between science and soul, between mind and matter — guided by the simple knowing that the world becomes more like what we see it to be.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oaqms2/quantum_psychology_an_exploration_journey_with/",
        "publishDate": "2025-10-19T14:11:37Z[Etc/UTC]",
        "author": "Electrical-Orchid313",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaqc16",
        "title": "Free Perplexity Pro Invites – Only 2 Left!",
        "content": "[No content]",
        "url": "/r/perplexity_ai/comments/1oaqas9/free_perplexity_pro_invites_only_2_left/",
        "publishDate": "2025-10-19T13:58:51Z[Etc/UTC]",
        "author": "PhilosophicalShadow",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaov4m",
        "title": "If you could make one plugin for AI builders, what would it be?",
        "content": "[No content]",
        "url": "/r/BlackboxAI_/comments/1o9z5cz/if_you_could_make_one_plugin_for_ai_builders_what/",
        "publishDate": "2025-10-19T12:51:46Z[Etc/UTC]",
        "author": "MacaroonAdmirable",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaomwr",
        "title": "VS Code + Codex + Windows and WSL possible?",
        "content": "I am on windows using VS Code, using the codex extension and on windows.  Yes I know, L tier combo, is there anyway for to have codex use the WSL terminal?  It's using powershell but it's way more verbose and probably burning way more tokens then if I were on linux.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1oaomwr/vs_code_codex_windows_and_wsl_possible/",
        "publishDate": "2025-10-19T12:40:55Z[Etc/UTC]",
        "author": "odnxe",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obh6iz",
        "title": "Is Sora the Beginning of the End for OpenAI? - Cal Newport",
        "content": "[No content]",
        "url": "https://calnewport.com/is-sora-the-beginning-of-the-end-for-openai/",
        "publishDate": "2025-10-20T12:02:35Z[Etc/UTC]",
        "author": "letmewriteyouup",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1obh3kc",
        "title": "In 1999, people thought Ray Kurzweil was insane for predicting AGI in 2029. 26 years later, he still predicts 2029",
        "content": "[No content]",
        "url": "https://v.redd.it/993ldpqna9wf1",
        "publishDate": "2025-10-20T11:58:36Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "24",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob9lma",
        "title": "One-Minute Daily AI News 10/19/2025",
        "content": "1. **Wikipedia** says traffic is falling due to AI search summaries and social video.\\[1\\]\n2. Jensen Huang says **Nvidia** went from 95% market share in China to 0%.\\[2\\]\n3. An Implementation to Build Dynamic AI Systems with the Model Context Protocol (MCP) for Real-Time Resource and Tool Integration.\\[3\\]\n4. **Google** AI Releases C2S-Scale 27B Model that Translate Complex Single-Cell Gene Expression Data into ‘cell sentences’ that LLMs can Understand.\\[4\\]\n\nSources:\n\n\\[1\\] [https://techcrunch.com/2025/10/18/wikipedia-says-traffic-is-falling-due-to-ai-search-summaries-and-social-video/](https://techcrunch.com/2025/10/18/wikipedia-says-traffic-is-falling-due-to-ai-search-summaries-and-social-video/)\n\n\\[2\\] [https://fortune.com/2025/10/19/jensen-huang-nvidia-china-market-share-ai-chips-trump-trade-war/](https://fortune.com/2025/10/19/jensen-huang-nvidia-china-market-share-ai-chips-trump-trade-war/)\n\n\\[3\\] [https://www.marktechpost.com/2025/10/19/an-implementation-to-build-dynamic-ai-systems-with-the-model-context-protocol-mcp-for-real-time-resource-and-tool-integration/](https://www.marktechpost.com/2025/10/19/an-implementation-to-build-dynamic-ai-systems-with-the-model-context-protocol-mcp-for-real-time-resource-and-tool-integration/)\n\n\\[4\\] [https://www.marktechpost.com/2025/10/17/google-ai-releases-c2s-scale-27b-model-that-translate-complex-single-cell-gene-expression-data-into-cell-sentences-that-llms-can-understand/](https://www.marktechpost.com/2025/10/17/google-ai-releases-c2s-scale-27b-model-that-translate-complex-single-cell-gene-expression-data-into-cell-sentences-that-llms-can-understand/)",
        "url": "https://www.reddit.com/r/artificial/comments/1ob9lma/oneminute_daily_ai_news_10192025/",
        "publishDate": "2025-10-20T03:36:30Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ob3byr",
        "title": "Trump Posts Bizarre AI Video in Which He Airdrops Feces On ‘No Kings’ Protesters",
        "content": "[No content]",
        "url": "https://www.yahoo.com/news/articles/trump-posts-bizarre-ai-video-115403106.html",
        "publishDate": "2025-10-19T22:36:43Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "325",
            "commentCount": "53",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oaxpwz",
        "title": "Even the Inventor of 'Vibe Coding' Says Vibe Coding Can't Cut It",
        "content": "[No content]",
        "url": "https://gizmodo.com/even-the-inventor-of-vibe-coding-says-vibe-coding-cant-cut-it-2000672821",
        "publishDate": "2025-10-19T18:51:50Z[Etc/UTC]",
        "author": "creaturefeature16",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "50",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oav9zu",
        "title": "Get Early Access to Perplexity AI Comet – Invitation Link Inside 🚀",
        "content": "Hey everyone!\n\nI just received an invite to the new Perplexity AI Comet browser extension, and it’s been an awesome upgrade for browsing, research, and productivity. If anyone’s interested in checking it out, I have an invitation link to share:  \n[https://pplx.ai/riyazansar91254](https://pplx.ai/riyazansar91254)  \nIt’s super useful for quick answers, summarizing web pages, and integrating AI directly into your browsing experience. If you’re into productivity tools or want to try AI in your workflow, definitely give it a spin.\n\nLet me know if you have any questions or want to know more about how I’m using it!",
        "url": "https://www.reddit.com/r/artificial/comments/1oav9zu/get_early_access_to_perplexity_ai_comet/",
        "publishDate": "2025-10-19T17:17:48Z[Etc/UTC]",
        "author": "Hopeful-Ad9349",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oauxah",
        "title": "OpenAI blocks Sora 2 users from using MLK Jr.'s likeness after \"disrespectful depictions\"",
        "content": "[No content]",
        "url": "https://www.cbsnews.com/news/openai-martin-luther-depictions-king-jr-sora-2-app/",
        "publishDate": "2025-10-19T17:03:51Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "11",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oauaic",
        "title": "AI Is Already Eating Wikipedia",
        "content": "[No content]",
        "url": "https://peakd.com/hive-167922/@taskmaster4450/ai-is-already-eating-wikipedia-d5d",
        "publishDate": "2025-10-19T16:39:02Z[Etc/UTC]",
        "author": "UweLang",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "12",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oas6tp",
        "title": "Over 100 \"digital employees\" work at this Wall Street bank | They have performance reviews. Human managers. Email addresses. Logins. But they're not human.",
        "content": "[No content]",
        "url": "https://www.axios.com/2025/10/17/ai-wall-street-digital-workers",
        "publishDate": "2025-10-19T15:16:09Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oar8jn",
        "title": "Can I help someone today",
        "content": "Hey guys 👋\nThis is the first post in a little series I’m starting called “Can I Help Someone Today?”\n\nBasically, my goal is simple  every day in this series, I’m going to try to help at least one person move their business forward.\n\nI’m Kenny, 19, a builder from Tobago. I’ve been creating things around:\n💡 AI tools (like chatbots, call agents, automation systems)\n🎯 Marketing systems (to get more leads and conversions)\n📱 Content creation flows (to make videos, reels, and posts faster)\n\nI love building, testing, and solving real problems that actually make people’s lives easier or their businesses grow.\n\nSo if you’re a founder, small business owner, or creator  drop what you’re struggling with right now.\nIt could be:\n\nA repetitive task that eats up your time\n\nA marketing idea that needs automation\n\nA content or lead problem you can’t quite fix\n\n\nI’ll pick one (or a few) and do my best to help  whether it’s giving you a framework, idea, or building a small tool to make it easier.\n\nWould be great to start this off by actually helping someone today.\nDrop your message I must respond ",
        "url": "https://www.reddit.com/r/artificial/comments/1oar8jn/can_i_help_someone_today/",
        "publishDate": "2025-10-19T14:36:59Z[Etc/UTC]",
        "author": "Euphoric-Visual7459",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oapy3j",
        "title": "Boomers encountering AI for the first time:",
        "content": "[No content]",
        "url": "https://v.redd.it/n96goti5o2wf1",
        "publishDate": "2025-10-19T13:41:42Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "137",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oapvpe",
        "title": "“This ASMR Isn’t Human — Higgsfield AI Just Redefined What ‘Realistic’ Sounds Like”",
        "content": "I just watched (and honestly felt) something that completely blurred the line between human creativity and machine simulation. Higgsfield AI has managed to generate ASMR audio so realistic that, if I didn’t know it was synthetic, I’d swear it came from a real human whispering behind a mic.\n\nWhat makes it even wilder is that the performance itself — the subtle breathing, mouth sounds, emotional pauses — was done by AI-generated human-like characters, not real actors. The result? Something that feels intimate, comforting, and slightly eerie all at once.\n\nThis isn’t just another “AI voiceover” clip. It’s the first time I’ve seen a system pull off the emotional texture of ASMR — the kind of small human imperfections that actually make it feel alive. It made me wonder:\n\nIf AI can now simulate something as nuanced and sensory as ASMR, what does that mean for creators who specialize in it?\n\nCould synthetic ASMR become its own art form, or will it lose the “human warmth” that makes ASMR effective in the first place?\n\nAnd how far are we from AI that can feel what it’s supposed to make us feel?\n\n\nI’d love to hear what others think — does this cross into uncanny valley territory, or is this just the next natural step in creative evolution?\n\n(The video is a quick showcase of the AI-generated ASMR scene — both the sound and the character performance are entirely created by Higgsfield’s system.)\n",
        "url": "https://v.redd.it/8c0do4sjn2wf1",
        "publishDate": "2025-10-19T13:38:41Z[Etc/UTC]",
        "author": "thinkhamza",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1oapfca",
        "title": "ChatGPT in a robot does exactly what experts warned",
        "content": "[No content]",
        "url": "https://www.youtube.com/watch?v=gIxq03dipUw",
        "publishDate": "2025-10-19T13:17:53Z[Etc/UTC]",
        "author": "BottyFlaps",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1eIT6aHckQU",
        "title": "AMP Free: This AI Coding Agent is FREE but is it WORTH IT?",
        "content": "Visit PhotoGenius AI: https://www.photogenius.ai/ Follow me on Twitter: https://x.com/aicodeking In this video, I'll be telling you ...",
        "url": "https://www.youtube.com/watch?v=1eIT6aHckQU",
        "publishDate": "2025-10-19T09:34:02Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/1eIT6aHckQU/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, Amp has announced the free tier of their CLI coding agent, and it's a very interesting proposition. That's why I thought to talk about this. If you don't know about Amp, I covered it a while back. It's basically a CLI and VS Code extension by Sourcegraph that's very similar to how Cline, Claude Code, and other AI coding agents work. It wasn't free before. You had to pay for credits, which were basically similar to API costs, but it was locked into their platform. Apparently, a lot of people used it as well. They also didn't used to allow you to change models or anything like that. It was basically an opinionated AI coding agent that you just install, add credits, and roll with it. However, they've now introduced Amp Free. This has been talked about a lot on Twitter, and that's why I wanted to talk about it as well. By the way, you can follow me on Twitter too. My ID is A I C o d e K i n g there. I'll start posting stuff there as well. So, if you're on Twitter, you can follow me there too. Anyway, now let's talk about this free mode. They say that Amp now has a new mode called Free. It's free of charge, supported by ads, and involves the sharing of training data. Amp Free is a unique combination of system prompts, tools, and a selection of top OSS and frontier models. Models have changed tremendously in the last six months. Many are now great at being agents, and they're cheaper too. All this means Amp Free is now possible, plenty of good tokens at a discount, a coding agent that knows how to use them, and the Internet's best business model: advertisements. So, it's basically what it sounds like. You get an AI coding agent for free, and they use the data for training while showing you ads. This is being talked about a lot because Amp is one of the major agents that has introduced ads in their AI interface. Most others haven't done that yet, but it's obviously inevitable, and almost all AI companies will end up doing that sooner or later. Now, the training data thing is something that a lot of tools already do. Quencode does it, Gemini CLI does it, many already do. But this is the first time we're actually seeing advertisements in a coding agent. Now, these ads aren't as bad as what you'd see from something like Google. They're basically just short text snippets from specific sponsors related to dev tools. It's random and not something derived from your personal usage or profile. Now, the model they use for the free tier hasn't been disclosed, but in some threads, they mentioned that they use Grok Code Fast along with some other models, which is interesting, because Grok Code Fast is already free on Kilo Code without any limits. And they're showing ads for that model? I mean, it's interesting, but maybe it's some other model. So, we don't know for sure, although I've tested it, so I can tell you if it's worth it or not. But before we do that, let me tell you about today's sponsor, Photo Genius AI. Photo Genius AI is an all-in-one AI-powered creation suite that lets you type anything and get stunning visuals instantly. Now, also the best place to use Google's Nano Banana for images and VEO3 for videos, plus affordable 3D model generation. Inside the image playground, Nano Banana shines for fast, high-quality image generation, and you can add reference images and do edits right in the tool. You also get Flux, Stable Diffusion, Kandinsky, and more in one place. The video playground supports Google VEO3 with and without reference images, and you can render in different styles without the usual complexity. Great for coders who want results, not knobs. For 3D, you can upload a P N G, think a Lego build or a simple robot, and get a printable model. Cheap, quick, and surprisingly clean for rapid prototyping. Pricing is among the best for VEO3 and Nano Banana, and you still have access to about 10 other handy AI tools like avatars, background removal, logo, emoji, ads, and app icons in the creative tool suite. It starts at a low entry price, and you can take an additional 30% off with my coupon code King30. Check Photo Genius out through the link in the description and try it for yourself. Now, back to the video. Now, how does it work? Well, you install Amp either in your CLI or in VS Code. Then, you switch to the free mode, send a message, and it starts working. As you send it, you start to see a strip of ads that cycles through different sponsor messages and links you to them. It's not bad. It's nothing in your face, and it isn't too annoying. But how's the quality? Well, it's nothing extraordinary. It's kind of fine, but nothing extraordinary. It basically just uses Grok Code Fast currently. I think being clear about what model is being used underneath would be better, because right now it just feels vague. Grok Code Fast is really good at Godot. It's almost like a fine-tuned model for Godot. It's amazing for that, but not as great for other things. So, yeah, you'll have to use it accordingly. It doesn't really work well with things like movie tracker apps, Svelte, Vue, and stuff like that, which is pretty disappointing. I like the concept, though. You get ads, you give training data, and in return, you get tokens, which is great. But I mean, they're using Grok Code tokens, which isn't that great. Kilo Code already gives that for free with no ads. So, why would I use this? It would be great if we got a good model like GPT5 Codex, Sonnet, or something similar. But for a model like Grok Code Fast that's already available everywhere for free, it's not worth it at all. I guess unless you control the distribution and serving of models, you can't really optimize your ads and per-request costs. Amp's concept is great, but if it's taken up by model-serving companies themselves like OpenAI, Anthropic, or Google, then it could actually be worth it. I mean, what's Amp really going to do with the data? Not much. Unless they share it with other companies. So, I think companies like OpenAI could use something like this to make money off users who want to use stuff for free, which is one of the main ways big tech monetizes free users. And honestly, I'm fine with that. As long as it's not super aggressive. So, yeah, it's a great concept, but Amp just hasn't made it worth it yet. Unless you get access to a better model, it's not worth it, especially when that model is already freely available almost everywhere. So, yeah, this doesn't make much sense to me. I think most probably you won't see ads being adopted widely. Because most companies care more about collecting data to train their models. That data helps them improve models using accepted and rejected diffs. And then they monetize through enterprise and paying users. Third-party companies like Amp, who don't own model infrastructure, might try this. But honestly, I don't think it'll be very successful. Because model costs are so high that ads alone can't cover it. Inline and banner ads used to work in blogs because they were cheap to host and run, but models are expensive. Running them costs a lot, and it's really hard to monetize them through ads right now unless you have a huge user base, which most of these tools don't. That's pretty much all about it. I've been seeing a lot of talk about this on Twitter, and that's why I wanted to share my thoughts on it. Also, follow me on Twitter. Just search for my handle, AICodeKing, and you'll find me there. I'll start posting updates and stuff there too. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    }
]