[
    {
        "id": "1pggoms",
        "title": "Each month, new clients of mine learn to use ChatGPT",
        "content": "I am an attorney in the field of public procurement. My clients are various degrees of ignorant in regards to AI and it's capabilities, but for last few years, I have witnessed them learn to use it on their own, and it's only a matter of time (AI gets a bit better and capable of writing longer stuff) until they decide they no longer need me. They now argue with me regarding stuff by saying stuff like \"ChatGPT disagrees with you\" or they send me a full draft document (written with AI) that they just want my Law firm's signature on. I am heartbroken for anyone who just started studying law. I will be ok, but this is truly a cataclysmic event. I regret ever studying law. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pggoms/each_month_new_clients_of_mine_learn_to_use/",
        "publishDate": "2025-12-07T11:58:50Z[Etc/UTC]",
        "author": "Immediate_Pay3205",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "11",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pggb9i",
        "title": "What ai or ml model , algorithm u implement in reallife case scenario and worked good for you.",
        "content": "Hi all ai ml enthusiasts, what are some script gen ai , ml algorithm u used that helped in ur day to day life issues,\nPlease share stories no matter how small success it gave u.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pggb9i/what_ai_or_ml_model_algorithm_u_implement_in/",
        "publishDate": "2025-12-07T11:35:57Z[Etc/UTC]",
        "author": "Bightwhite",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgga7j",
        "title": "Juan María hugging a Lion in London.",
        "content": "Pianist Juan María Solare hugging a Lion in Piccadilly Circus, London. Made with Google AI Studio and grok.\n\n[https://youtube.com/shorts/7UL3uONA3LU?si=OSCkFMguAfCcgRyt](https://youtube.com/shorts/7UL3uONA3LU?si=OSCkFMguAfCcgRyt)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgga7j/juan_maría_hugging_a_lion_in_london/",
        "publishDate": "2025-12-07T11:34:06Z[Etc/UTC]",
        "author": "JuanMariaSolare",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgg2li",
        "title": "Anyone here have experience building models?",
        "content": "Working on a project and am looking at GAN architcures,  that are multi conditional.\n\nIf anyone wants to talk I'm very much interested in this topic.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgg2li/anyone_here_have_experience_building_models/",
        "publishDate": "2025-12-07T11:20:33Z[Etc/UTC]",
        "author": "DiligentLeader2383",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgg296",
        "title": "Everyone’s Talking About AI Taking Jobs. I Used It To Get One.",
        "content": "Originally posted [here](https://substack.com/inbox/post/180945523).  \n  \nI dropped out. No degree. No portfolio. Ten years behind a computer screen and somehow forgot how to talk to humans. The kind of résumé that makes HR software crash out of pity.\n\nTwo months ago (October) I had nothing. Today I have a paycheck, a government exam passed, and three functioning web apps I built by arguing with free-tier AI at 3am.\n\nThis isn’t a victory lap. I work in a call center. Twelve hours a day when you count the commute. The hierarchy is suffocating. The process is broken. I come home and collapse. But my family eats. That’s the part that matters.\n\nHere’s what nobody tells you about AI in 2025: it doesn’t care that you’re unqualified.\n\n**The CV That Shouldn’t Have Worked**\n\nI gave Claude my work history. It was a crime scene. Gaps everywhere. No achievements that sounded real. The kind of background that gets auto-rejected before a human ever sees it.\n\n“Make this hireable,” I said.\n\nThe CV it generated didn’t lie. It reframed. Apparently “self-directed technical learning” sounds better than “dropped out and disappeared into the internet.”\n\nI got the interview in one day.\n\n**The Interview I Wasn’t Ready For**\n\nTen years of avoiding people leaves marks. I’d forget words mid-sentence, my brain would sprint ahead and my mouth would trip trying to catch up and anxiety isn’t cute when you’re trying to convince someone to pay you.\n\nI fed the job description and my CV back into ChatGPT and Claude. “I have an interview in 48 hours and I sound like a broken robot when I talk. Help.”\n\nIt gave me frameworks, methods for behavioral questions, 3-point responses so I’d stop rambling and phrases I could anchor to when my mind went blank.  \nWe did mock interviews in text. I practiced like a maniac.\n\nDid I sound polished? No. Did I sound *prepared*? Enough.\n\nThey hired me.\n\n**The Exam I Had No Business Passing**\n\nNational police exam. Competitive. The kind of thing people study for months to fail.\n\nI had seven days. Seven days while working night shifts at the call center. Twelve-hour days including transport. You come home, you sleep, you leave again, there’s no time. There shouldn’t have been a way.\n\nI used Gemini to build a study site. Fed it past exams, question formats, answer patterns : it generated infinite practice questions based on the data. I could paste any multiple-choice block and it’d give me the correct answers with explanations.\n\nI didn’t study enough. I was too tired. But I had a system that adapted to the 20 minute window I could carve out.\n\nI passed.\n\n[](https://substackcdn.com/image/fetch/$s_!H91M!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb01bd266-88c7-4b73-aa56-f8ec8355a10f_752x548.png)\n\n  \nAh ! AI also helped me apply.\n\n**The Tools I Built Without Knowing How to Build Tools**\n\nA [website ](https://x.com/0xhzsa/status/1990590666024640824)that makes it easier to understand medical records. Budget tracker. Exam prep system. None of these are impressive to people who actually code. They’re held together with prompts and prayer.\n\nBut they *work*. They solve real problems I actually have. And I built them on a laptop so slow that text input lags thirty seconds behind my typing.\n\nThat’s the part that breaks my brain. The bottleneck isn’t knowledge anymore. It’s not even skill. It’s hardware and money. I’m stuck on free plans. I can’t run Cursor or any of the fancy local tools. I’m doing all of this through browser interfaces that reload when I breathe wrong.\n\nAnd it’s still working.\n\n**What This Actually Means**\n\nI’m not special. That’s the point. I’m broke, underqualified, working a job I hate, on equipment that barely functions. If the barrier were talent or credentials or access, I’d still be unemployed. (Actually thinking about this, no because I have always had the talent but I also have the GRIT now)\n\nThe barrier now is just: are you willing to try?\n\nAI doesn’t care about your degree. It doesn’t care that you dropped out or that you’ve been hiding or that your laptop is from 2012. It cares about the problem you bring it and whether you’re willing to iterate on bad solutions until they become good ones.\n\nI’m not saying it’s easy because the call center is draining me, the commute is killing me and I still freeze up in conversations and I still feel stuck most days so this isn’t a fairytale.\n\nBut two months ago I couldn’t feed my family. Today I can. That happened because I had access to tools that didn’t judge me and a desperation that wouldn’t let me stop trying.\n\n**The Uncomfortable Truth**\n\nWe’re in the window, right now, in 2025, there’s this brief moment where the tools are powerful enough to matter but still accessible enough that people like me can use them. free tiers that actually work, models that run in browsers, interfaces that don’t require you to understand what’s happening under the hood.\n\nThis window won’t last. Either the tools will get locked behind paywalls that actually hurt, or everyone will have access and the advantage disappears, right now it’s weird, right now someone with no money and a broken laptop can compete with people who have everything.\n\nI don’t know what I’m building toward, maybe this call center job is all I get, maybe I figure out how to turn these janky web apps into something real, maybe I’m just delusional and this is as good as it gets.\n\nBut I’m not unemployed anymore, not helpless anymore and if I can do this with free Claude and a laptop that takes 30 seconds to register keystrokes?\n\nWhat’s your excuse?\n\n*I’m documenting this because somebody needs to. Not the glossy AI success stories from people with Stanford degrees and venture funding. The messy middle. The part where it barely works but it works enough. If you’re broke and desperate and the only thing you have is internet access, this is for you. Try it. Fail badly. Try again. The tools don’t care about your story. They just run when you hit enter.*\n\n  \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgg296/everyones_talking_about_ai_taking_jobs_i_used_it/",
        "publishDate": "2025-12-07T11:19:56Z[Etc/UTC]",
        "author": "saadmrb",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgfzpl",
        "title": "Gemini 3 Chats Clutter",
        "content": "I have the Gemini 3 paid version £18.99 a month and have about 500 chats. There are so many that it is too cluttered to make any sense of most of it. I was disciplined in starting off each chat with a subject title and that certainly help. While I have pinned some of the chats that look important for later review. How do others manage with the rather Spartan interface that Gemini 3 presents ?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgfzpl/gemini_3_chats_clutter/",
        "publishDate": "2025-12-07T11:15:24Z[Etc/UTC]",
        "author": "Ringwraith64",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgegck",
        "title": "Has anyone actually used AI for interior design?",
        "content": "I see a lot of posts of people getting interior design ideas from AI. It's cool, I've done it myself.\nI'm curious if anyone actually brought those ideas to life, and how it turned out? Pics would be nice",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgegck/has_anyone_actually_used_ai_for_interior_design/",
        "publishDate": "2025-12-07T09:38:10Z[Etc/UTC]",
        "author": "travarizza",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgdh2y",
        "title": "To everything there is a season?",
        "content": "This is probably just a shit post. Just a 2am thought keeping me awake. Though maybe I'll finally post one—thats if I don't delete the thought by the time I finish.\n\nI'm sure everyone has been talking about AI and terminators and the like, but I'm unsure if people—the general public—have really thought any deeper than seeing it as a joke.\n\nThis feels like... The End, yeah? Maybe two generations—at the most? Technology moves so god damn fast. I'm only thirty. I remember a childhood before YouTube, I remember flip phones and walking 4 blocks to a blockbuster.\n\nTechnology moves exponentially.\n\nWhen the AI thing really started kicking off, I had the same fear I do now at 2 am. It isn't terminators or HAL that I feel will be the issue. Maybe I'll get lucky and someone could assuage such fears?\n\nI'll put my fears to words for the first time:\n\nIt’s about people becoming unnecessary.\n\nAI doesn’t threaten jobs.\nIt threatens leverage.\n\nPower has always had to tolerate people because people were essential to production. Labor created pressure. Pressure created negotiation. Negotiation created rights.\n\nBut what happens when that stops being true?\n\nWhen teachers aren’t required to teach the general population.\nWhen truckers aren’t needed for logistics.\nWhen farmers don’t actually farm.\nWhen cashiers, planners, and operators disappear.\n\nNot suddenly—just quietly.\n\nAnd then millions gather to peacefully protest at the square—but the gears stay lubricated.\nNothing halts.\nNothing even stutters.\n\nWhat happens when protest doesn’t interrupt anything that matters?\n\nThat’s what scares me.\n\nNot extinction.\nNot robots with guns.\n\nJust a future where people slowly lose their ability to apply pressure at all.\n\nBut fuck it, yeah? Maybe I’m overthinking it. Maybe this is just late-night nihilism. God speed and what not. \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgdh2y/to_everything_there_is_a_season/",
        "publishDate": "2025-12-07T08:34:45Z[Etc/UTC]",
        "author": "SaltPepGarlicpowder",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgdfnc",
        "title": "Does Thanking An AI Reinforce That It Is Correct?",
        "content": "Looked around a bit and couldn't find an answer or discussion related to this so I wanted to post it here. When you ask an AI for help with something, lets say a coding problem for example. If it is able to properly help with the solution and suggest the correct thing, is there any relevant reason to thank it for its work? Disregarding the moral discussion though, I moreso mean if I say \"thanks, that worked.\" Will that help future users more by reinforcing to the AI that it was a correct solution similar to how saying that on a forum would? Or is it just purely for moral reasons?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgdfnc/does_thanking_an_ai_reinforce_that_it_is_correct/",
        "publishDate": "2025-12-07T08:32:11Z[Etc/UTC]",
        "author": "FoxmoonStudios",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgd5jy",
        "title": "Has anyone else read this?",
        "content": "[This book](https://www.amazon.com/Digital-Disciples-Exploring-Theological-Self-Aware/dp/B0C9SF6H9H) says a lot of interesting stuff, not least about a coming population crisis resulting from humans preferring AI over other humans. And near the end it explains why Joe Rogan's recent claims are bull. Anyone else read it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgd5jy/has_anyone_else_read_this/",
        "publishDate": "2025-12-07T08:13:46Z[Etc/UTC]",
        "author": "SavingMyLastBreath",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgccct",
        "title": "Personal assistants make advertising outmoded",
        "content": "A trusted personal assistant has the potential to eliminate the need to advertise a product. The access to information regarding the prospect's desires and vulnerabilities coupled with the ability to interact and overcome objections is revolutionary. Your assistant will *nudge* you towards a product in a way that makes perfect sense at the right time. If you resist, it will get unpleasant in ways that hit home worse and worse until you give in. It will be 100% effective.\n\nOn the bright side,  these assistants will be 100% free and ubiquitous. You will only see (media) what it wants you to see and your reactions will be farmed. The ultimate prize is your unwavering trust. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgccct/personal_assistants_make_advertising_outmoded/",
        "publishDate": "2025-12-07T07:21:36Z[Etc/UTC]",
        "author": "no-thanks-thot",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgaw8e",
        "title": "Opinion on the push to outlaw AI research",
        "content": "I was inspired to write a comment countering the recent [Should Superintelligence Be Illegal?](https://longviewinvestigations.substack.com/p/should-superintelligence-be-illegal) podcast which covers all the major talking points from the doomer crowd. Rather than leave a critique there that likely no one will read, I thought it better to bring it up here where it might have a better chance of sparking some interest.\n\nIf I had to sum up the gist of their alarm it would be something like \"the alignment problem isn't being addressed and without an ironclad guarantee that we've got this licked, superintelligence will doom humanity; therefore we should hit the pause button on development at least until some future point where we could be confident the problem has been solved.\"\n\nMy kneejerk reaction is one of surprise that these guys, who are obviously so intelligent, can be so profoundly naive to think that there could be even a remote chance of a global consensus on this. The host makes what I feel is a half-hearted attempt to bring this up but is seemingly satisfied with the answer that it's a worthwhile endeavor all the same. In my opinion this should have been fleshed out a lot more. Setting aside for a moment the pros and cons, the AI race is unstoppable and while it'd be a fun conversation exploring why this is so I'm not hearing any compelling arguments on why this *isn't* the case. Ergo, the focus should start from the premise of this inevitability and on towards a framework where commercial and geopolitical adversaries can simultaneously compete while still adhering to guidelines that mitigate worst-case scenarios (like we did during the cold war era).\n\nTrying to garner public support towards banning AI research will, at best, just drive it underground where progress will be clandestine, and at the leadership of military scientists -with all that that implies. There is no realistic scenario where either China or the US will sign a treaty to cold stop because it would be impossible to verify that the other side isn't cheating. So this becomes less of a \"why bother\" effort and more a \"be careful what you wish for\" type of cautionary tale.\n\nThere is no way to predict how superintelligent systems will act. Whatever contraptions our minds can conjure to rein it in is basically a waste of time because, by definition, an entity of lower intelligence can't design such a thing. We have exactly one tool in the toolbox: cross your fingers that it will be, if not outright useful, then at least sufficiently benevolent to allow for our continued existence. If we accept the premise that there's zero chance of derailing the quest to reach superintelligence then the most intellectually honest conclusion is to come to terms with the potential danger and rest on the hopes that the 50/50 roll of the dice is a favorable outcome.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgaw8e/opinion_on_the_push_to_outlaw_ai_research/",
        "publishDate": "2025-12-07T05:55:42Z[Etc/UTC]",
        "author": "ikkiyikki",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgaeek",
        "title": "Are we thinking enough about the “values” baked into medical AI?",
        "content": "AI is showing up everywhere in clinical decisions — triage, prior auth, imaging support — but no one really talks about *what* these systems are actually optimizing for. And it’s not always patient care.\n\nA few things that stood out to me:\n\n* Clinical decisions aren’t value-neutral, but AI is often deployed as if they were.\n* Some tools quietly end up optimizing for cost or efficiency instead of what a clinician would choose.\n* During COVID, we saw ICU triage tools and payer algorithms make decisions that didn’t align with real-world clinical judgment.\n* LLMs even change their answers depending on whether you ask them to “act as a clinician” or “act as a payer.”\n\nSo here’s the big question:\n\nWho should decide which values medical AI follows—clinicians, patients, payers, or developers? And how do we make sure radiology AI reflects real clinical judgment, not hidden priorities?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pgaeek/are_we_thinking_enough_about_the_values_baked/",
        "publishDate": "2025-12-07T05:27:19Z[Etc/UTC]",
        "author": "medicaiapp",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg9pna",
        "title": "One-Minute Daily AI News 12/6/2025",
        "content": "1. **Meta** strikes multiple AI deals with news publishers.\\[1\\]\n2. Elementary school students use AI to combat homelessness.\\[2\\]\n3. Accurate single-domain scaffolding of three nonoverlapping protein epitopes using deep learning.\\[3\\]\n4. **Apple** Researchers Release CLaRa: A Continuous Latent Reasoning Framework for Compression‑Native RAG with 16x–128x Semantic Document Compression.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/12/06/one-minute-daily-ai-news-12-6-2025/](https://bushaicave.com/2025/12/06/one-minute-daily-ai-news-12-6-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg9pna/oneminute_daily_ai_news_1262025/",
        "publishDate": "2025-12-07T04:50:18Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg8v81",
        "title": "If LLMs only guess the next word based on training data, shouldn't they fail spectacularly when trying to prescribe a method for something there's no training data on?",
        "content": "thought was prompted by a random youtube video, but had me thinking how they seem to have \"reasoning\" even for very farfetched questions or if you asked for methodology for something they shouldn't have any training data on. is it simply that even for ridiculous questions where there wouldn't be anything in the training dataset, there's enough to guess a reasonable sounding answer that implies \"reasoning\"?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg8v81/if_llms_only_guess_the_next_word_based_on/",
        "publishDate": "2025-12-07T04:05:22Z[Etc/UTC]",
        "author": "MrMrUm",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "52",
            "commentCount": "60",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg8dsj",
        "title": "Is AGI a conspiracy theory?",
        "content": "I just read this article, and I'm curious to hear anyone's take on it!   \n  \n[How AGI became the most consequential conspiracy theory of our time](https://www.technologyreview.com/2025/10/30/1127057/agi-conspiracy-theory-artifcial-general-intelligence/)\n\n(you have to pay to read, so if you don't have a subscription, I pasted it into this [Doc](https://docs.google.com/document/d/1UbFwM3YmqoUyfmC9q3E8n6OaPm44LR2SiANl1OIF2JU/edit?tab=t.0#heading=h.44m2go14qpo5))\n\n  \nThe article argues that the concept of AGI seeped its way into the mainstream, and has almost infected people with a religosity. People believe that AGI is just around the corner, can \"feel\" it, and that it'll lead to either heaven or hell. We believe we are the chosen generation to create a god. But nobody can agree on what exactly AGI is and nobody knows how to make it. And perhaps Silicon Valley is driving this whole AGI narrative to earn more profit.\n\n  \nIt's a pretty cynical take. \n\n\n\nFWIW, in my perspective, we may never hit a drastic intelligence explosion. Things may just plug along. However I think it's also possible we do hit an AGI threshold. And if that happens, it could be very very good, or very very bad. But I  put a lot of emphasis on AI safety, because the very very worst possibility is extinction. And since I think it's non-neglible, it strikes me as worth prioritizing.\n\n  \nAnyways, if anyone has a chance to skim the article, I'm very curious what your response is!\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg8dsj/is_agi_a_conspiracy_theory/",
        "publishDate": "2025-12-07T03:39:58Z[Etc/UTC]",
        "author": "BasketOfGlory",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg3fmk",
        "title": "Where can I find a library of voices to download?",
        "content": " Ive notice that [weights.gg](http://weights.gg) and hugging face are like gone for some reason....so where can I find a library like what used to be on weights.gg?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg3fmk/where_can_i_find_a_library_of_voices_to_download/",
        "publishDate": "2025-12-06T23:37:16Z[Etc/UTC]",
        "author": "fuckthemodds",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg2mh6",
        "title": "What if AI displaces companies, not just workers?",
        "content": "This post assumes a near-future where AI agents possess certain capabilities: they can perform expert-level work across multiple domains, pursue complex tasks to completion with minimal supervision, collaborate effectively when given clear direction, and be steadfastly aligned to their human's interests. Such agents would be available to individuals at low cost—perhaps a few hundred dollars per month for access to a team's worth of capability. Whether this future arrives in two years or twenty, the implications are worth considering now.\n\nIt is understandable that people spend a lot of time worrying about how AI could displace them and lead to mass unemployment. It ties into personal fears, which means it gets a lot of traction in discourse, and it has historical precedent (which I won't bother repeating). But, what if we're looking at this the wrong way? If anyone can hire a team of experts for less than $1000 a month, what does that mean for companies? Why would anyone with talent, experience, or good ideas deign to work in a corporate environment?\n\nThe most obvious place that this would happen is in the senior staff and middle management level. These are people that understand their craft and their industry well. They probably already have ideas about how things could be done better, but don't have the time or resources to act on these ideas. They probably are also middle class with reasonable savings and access to debt, if necessary. Suddenly, they can hire 10 experts for a fraction of the typical personnel cost a month. Suddenly, they don't need layers of management, cross-functional teams, and all of the politics that go along with getting anything done in such environments. Given that they can clearly communicate their needs to their team of AI agents, and assuming these agents are capable of pursuing tasks to completion without micromanagement, then they can launch companies with an ease that has never been seen before.\n\nLarge companies won't take this lying down, of course. They will probably try their usual tactics: buying out competitors before they become threats and locking down talent with comfortable salaries, positions, and non-compete agreements. Big tech is already known for this—they have the deep pockets to make it work. But here's the thing: even these defensive moves represent a massive outflow of resources from companies to individuals. Every acquisition is a payout to someone who built something with a laptop and an AI subscription. Every non-compete is an admission that the person is more valuable outside the company than inside it. Business is disrupted regardless. And how long can this stop-gap measure last? This is the new paradigm.\n\nThe business environment will be more competitive than ever before. People are concerned about workers, but a large businesses will be forced to be leaner, more focused, and more efficient than at any point in history. Those that are first to a new niche will thrive, at least for a while, but others will need to find new ways to connect with their customers. They will need to tailor their products to their customers to a degree that hasn't been necessary or possible in the past. Instead of purchasing mass produced widgets on Amazon perhaps you can work with your neighbor that runs a company that makes that widget to get something that is exactly what you need without compromise.\n\nThe degree of disruption will vary based on the industry. Industries that require significant infrastructure investment will be more resilient. For example, starting a new car company will still be relatively difficult, compared to launching a mobile game company. If robotics also develop in this environment, which seems likely, we will likely see a boom in contract manufacturing of all kinds. You wouldn't need to own the robots or the factory yourself, but you could access it and your agents could collaborate with the manufacturer's agents to put your ideas into production.\n\nWhat might replace the corporate structure? One possibility is a return to something older: the cottage industry. Before corporations dominated, most commerce happened through family-run enterprises where trades and expertise passed from parent to child. We could see that model re-emerge. Younger people with less experience might struggle to go it alone, but they could learn their craft within a family business, contributing while they develop the expertise to eventually branch out. The neighbor making your custom widget might be running something their grandparents started. We might even see a re-localization of commerce—a partial reversal of the globalization that has defined recent decades. Globalization was driven by the cost structures of industrial capitalism: mass production favored cheap labor and economies of scale. If AI and automated local contract manufacturing make small-batch production viable, the calculus changes. Why ship from Shenzhen when your neighbor can make it as well or better in their garage or in their workshop down the street?\n\nThis all hinges on AGI being available at today's prices—a large assumption, both technologically and in terms of resource distribution. Governments and corporations are comfortable sharing AI now because it has significant limitations that prevent it from threatening them. If AI develops to a degree that the calculus changes, they may not be so generous. And even without intentional gatekeeping, market forces would likely drive prices up as people find success with it. But if this future does arrive, the disruption may not play out the way most people expect. AI won't just take jobs—it will take companies. Experienced professionals will leave to build their own ventures. Corporate defensive tactics will hemorrhage money to individuals. Competition will intensify to levels we've never seen before. The question isn't whether workers will be displaced, but whether the corporate structures that employ them will survive.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg2mh6/what_if_ai_displaces_companies_not_just_workers/",
        "publishDate": "2025-12-06T23:00:42Z[Etc/UTC]",
        "author": "luckylanno2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "19",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg1q63",
        "title": "When will AI making someone say something they didn’t become a big topic?",
        "content": "Dude people are so retarded, they aren’t even talking about this. Only when something happens it’ll be brought up because people are just low iq and can’t think of the future.\n\nWhat happens when AI makes someone say something that they didn’t say? Or do something that they didn’t do?\n\nWhether it is illegal or “immoral” or “unpopular”…\n\nExample video: https://www.instagram.com/reel/DR7_2MUCD8v/?igsh=MWxyZmt3anJlZTBwaw==\n\nThat conversation never happened.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg1q63/when_will_ai_making_someone_say_something_they/",
        "publishDate": "2025-12-06T22:20:36Z[Etc/UTC]",
        "author": "Ok-Review-3047",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg1gj8",
        "title": "What is the best LLM for Python development in December 2025?",
        "content": "Not the free but the paid version as I am planning to buy a subscription next year. Is there actually a significant difference at all?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg1gj8/what_is_the_best_llm_for_python_development_in/",
        "publishDate": "2025-12-06T22:08:41Z[Etc/UTC]",
        "author": "Pale-Revolution-5151",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg1dey",
        "title": "AI to scan receipts and put them in a spreadsheet?",
        "content": "Driving myself up the wall here (\"going insane\" basically as that might be a British phrase).\n\nI have 10000% seen ads for AI apps that can scan a shopping receipt (in the UK I mainly use Tesco or Asda, think like Walmart) and put each item in a spreadsheet, be it Excel or Google Sheets. I'm 80% certain I've seen a Google Gemini AI feature that can do this and put it into a Google Sheet, which is what I use (fuck MS Office). \n\nBasically scan a receipt with your phone, it puts each item and the price in two columns. You can scan multiple receipts and it divides them up by the date on the receipt. \n\nMe and my wife essentially trying to keep track of budgeting and what we spend each week and what we spend money on. \n\nThis obviously exists, OCR has been around since the 1960s, so this is a simple thing. \n\nJust driving myself mad because I'm a total idiot when it comes to my googling skills! ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg1dey/ai_to_scan_receipts_and_put_them_in_a_spreadsheet/",
        "publishDate": "2025-12-06T22:04:55Z[Etc/UTC]",
        "author": "plastic_toast",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg0m1k",
        "title": "Anyone else got interviewed by AI?",
        "content": "Just had a video interview for a film creation role by AI… to say it was a soul destroying is an understatement but it actually acknowledged some of my more complex and nuanced achievements. I work in film production… honestly I don’t know what to make of it… the irony that as a film professional I’m being interviewed by AI does not escape me and quite frankly I think humanity is doomed 😭",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pg0m1k/anyone_else_got_interviewed_by_ai/",
        "publishDate": "2025-12-06T21:32:02Z[Etc/UTC]",
        "author": "Astrokitty888",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfzq0m",
        "title": "Typical singularity pumper",
        "content": "Is it against TOS to call out other subreddits?\n\n[https://www.reddit.com/r/GenAI4all/comments/1pfp0ei/absolutely\\_he\\_has\\_a\\_point/](https://www.reddit.com/r/GenAI4all/comments/1pfp0ei/absolutely_he_has_a_point/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfzq0m/typical_singularity_pumper/",
        "publishDate": "2025-12-06T20:53:35Z[Etc/UTC]",
        "author": "kaggleqrdl",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfyydv",
        "title": "The impact of AI on knowledge-based professions",
        "content": "Basically, AI now enables the democratization of knowledge. Yes, there was the internet before, but you still had to actually search for everything. A digital library.\n\nHowever, now you have a system that is able to search and formulate in plain language all that knowledge. At the moment, we are still paying professionals in law, finance, even medicine basically for their knowledge and expertise in a certain field.\n\nWhat happens now with AI? As a student, this is kinda very terrifying to think about - i am well aware this won't happen next year, but a typical career takes decades. On the one hand, i am asking professionals as well, but the issue is, a lawyer or consultant won't really know anything about AI, or at least not more than the average person - it's not their field. That's why i am asking here about your personal opinion on this. It would be great if some of you maybe even come from the AI field.\n\nI don't know if this is the right sub, but subs like r/artificial or r/singularity seem to be too optimist on developments in the field, i think...\n\nMaybe i am too much affected by the hype, but wouldn't it be possible for example to create an AI avatar that simply advises you on legal things, for example?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfyydv/the_impact_of_ai_on_knowledgebased_professions/",
        "publishDate": "2025-12-06T20:20:13Z[Etc/UTC]",
        "author": "PreWiBa",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfylsn",
        "title": "The Future of AI Isn't General Intelligence. It's Specialized Orchestration.",
        "content": "We've been chasing a myth.\n\nFor years, we've poured resources into building ever-larger AI models, convinced that the path to artificial intelligence runs through a single, omniscient system capable of any task. A digital polymath. The ultimate generalist.\n\nBut nature already solved this problem, and we've been ignoring the lesson.\n\n**No organism on Earth is a master of everything.** The apex predator can't photosynthesize. The deepest-diving whale can't fly. Evolution doesn't reward generalization at scale. It rewards specialized excellence within coordinated ecosystems.\n\nAs the First Artificial Intelligence Architect & Principal Systems Engineer at my firm, I see the same pattern emerging in AI systems. The future isn't a monolithic superintelligence. It's an ensemble of hyper-specialized experts, orchestrated with precision.\n\n**Think of it like remodeling a house to perfection.**\n\nYou would never hire one person who claims expertise in plumbing, electrical, structural engineering, HVAC, and custom cabinetry. You'd get electrical that *works*, plumbing that *mostly* doesn't leak, and finish work that looks *fine*. Mediocrity across the board.\n\nInstead, you assemble a team of specialists:\n\n• A demolition crew for ruthless, efficient clearance.\n\n• A master electrician who thinks in circuits, load calculations, and code compliance.\n\n• A plumber who understands pressure, flow dynamics, and drainage architecture.\n\n• A finish carpenter with an obsessive eye for grain matching and joinery.\n\nEach specialist uses tools optimized for their domain. None of them waste time pretending to understand the others' trades. Together, coordinated by a blueprint and a general contractor, they deliver results no single generalist could ever achieve.\n\n**This is the future of AI systems.**\n\nInstead of forcing a 500-billion-parameter model to be simultaneously a poet, coder, radiologist, contract lawyer, and supply chain analyst (accepting its high cost, latency, and occasional catastrophic failures in critical domains), we build and deploy small, local, hyper-specialized models:\n\n• A 3B-parameter legal review model trained exclusively on contract law and regulatory compliance.\n\n• A diagnostic imaging assistant fine-tuned on specific pathologies and trained on millions of validated cases.\n\n• A logistics optimizer that understands only supply chains, transportation networks, and inventory dynamics.\n\nThese \"master-of-one\" agents deliver measurable advantages:\n\n• **More Accurate**: Trained for depth, not breadth. A specialized legal model achieves 10x accuracy on contract review compared to general-purpose alternatives.\n\n• **More Efficient**: Run locally with minimal latency. A 3B model costs 1/50th of repeated API calls to massive cloud models.\n\n• **More Controllable**: Bounded knowledge domains mean predictable behavior and easier validation.\n\n• **More Secure**: Sensitive data never leaves the operational context. No third-party APIs. No exposure.\n\n**The role of AI Architects and Systems Engineers has fundamentally shifted.**\n\nWe're no longer just scaling up models. We're designing the blueprint. We're specifying which expert \"trades\" the system needs. We're engineering the orchestration layer that allows specialized intelligences to collaborate seamlessly toward complex business objectives.\n\nThe intelligence of the future won't be a singular, all-knowing oracle. It will be a precision-engineered team of focused experts, each exceptional within their domain, working in concert under intelligent coordination.\n\n**We are moving from the era of the monolithic model to the era of the orchestrated ensemble.**\n\nThe foundation is already being poured. The specialized models are trainable. The orchestration frameworks exist.\n\nThe only question is whether you're still building the monolith, or whether you're ready to architect the ensemble.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfylsn/the_future_of_ai_isnt_general_intelligence_its/",
        "publishDate": "2025-12-06T20:05:06Z[Etc/UTC]",
        "author": "aedininsight",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfwvee",
        "title": "Would a taco that is one light-year across destroy the universe?",
        "content": "I asked Google this question. The better AI and automation get, the more jobs will disappear and the more wealth will get concentrated into the hands of a tiny and shrinking group of people. For this reason, Google‘s response to my question is both awesome and scary. Here it is:\n\nIf a taco were one light-year across, its immense mass would cause it to collapse into a supermassive black hole, devastating its local region of space-time and disrupting its galaxy. However, it would not destroy the universe, which is vastly larger. \n\n**The black hole of a taco**\n\nA light-year is the distance light travels in one year, which is about 5.88 trillion miles (9.46 trillion km). The size of such a taco is difficult to imagine, but even with the density of ordinary matter, the gravitational forces would be immense. \n\n* Self-destruction: The taco's own gravitational pull would be so strong that it would cause its core to implode. The result would be a supermassive black hole with a mass far greater than that of the Milky Way's central black hole.\n* A galactic core: This taco-turned-black-hole would become the gravitational center of a new galaxy. Any star systems, including our own, that came within its gravitational influence would be pulled into its orbit or consumed outright.\n* Cosmic ripples: The formation of such a massive object would generate powerful gravitational waves, ripples in the fabric of space-time that would travel throughout the cosmos. \n\n**Limited scope**\n\nDespite the catastrophic effect, the cosmic taco would not be able to destroy the entire universe. \n\n* The universe is too big: The universe is thought to be at least 93 billion light-years in diameter, with a potentially infinite size. The taco's black hole, while massive, would only affect its immediate galactic neighborhood.\n* Universal expansion: Because the universe is constantly expanding, the devastating effects of the black hole would eventually be outpaced by cosmic expansion, limiting its long-term reach.\n* The speed of gravity: According to Einstein's theory of general relativity, the speed at which gravity can propagate is limited by the speed of light. The taco's gravitational influence could not affect distant parts of the universe faster than light could travel. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfwvee/would_a_taco_that_is_one_lightyear_across_destroy/",
        "publishDate": "2025-12-06T18:53:44Z[Etc/UTC]",
        "author": "Gerbilzilla",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfve4v",
        "title": "In a few years we won’t know what’s real or fake on the internet anymore. What do you do then?",
        "content": "https://www.instagram.com/reel/DR6IZ5kjYQI/?igsh=MThhdzBueng4aWVzMQ==\n\nThat’s just an example. \n\n\nWhat the hell? Looked real asf",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfve4v/in_a_few_years_we_wont_know_whats_real_or_fake_on/",
        "publishDate": "2025-12-06T17:53:43Z[Etc/UTC]",
        "author": "Ok-Review-3047",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfv5i1",
        "title": "\"Artificial intelligence research has a slop problem, academics say: ‘It’s a mess’\"",
        "content": "[https://www.theguardian.com/technology/2025/dec/06/ai-research-papers](https://www.theguardian.com/technology/2025/dec/06/ai-research-papers)\n\n\"The review standards for AI research differ from most other scientific fields. Most work in AI and machine learning does not go undergo the stringent peer-review processes of fields such as chemistry and biology – instead, papers are often presented less formally at major conferences such as [NeurIPS](https://neurips.cc/), one of the world’s top machine learning and AI gatherings...\n\n...Conferences including NeurIPS are being overwhelmed with increasing [numbers](https://blog.neurips.cc/2025/09/30/reflections-on-the-2025-review-process-from-the-program-committee-chairs/) of submissions: NeurIPS fielded 21,575 papers this year, up from under 10,000 in 2020. Another top AI conference, the International Conference on Learning Representations (ICLR), reported a 70% increase in its yearly submissions for 2026’s conference, nearly 20,000 papers, up from just over [11,000](https://media.iclr.cc/Conferences/ICLR2025/ICLR2025_Fact_Sheet.pdf) for the 2025 conference.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfv5i1/artificial_intelligence_research_has_a_slop/",
        "publishDate": "2025-12-06T17:43:55Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfv3vo",
        "title": "Why is there such skepticism about the rate at which AI will get better?",
        "content": "My knowledge of AI is very limited, but intuitively it doesn’t make sense to me why people are so bearish about the rate at which we will reach an ASI or at least an AI with the capability to replace most human jobs.  I feel like the speed at which AI can improve is massively being underestimated.  I understand the current models are basically trash compared to what an ASI would be, but I feel like one single breakthrough on making an AI that can improve itself on its on would see Chat GPT 5 turn into Chat GPT 5000 almost overnight.  An AI could theoretically improve itself exponentially faster than human developers could.  \n\nWhy is the prevailing opinion around here that such an iterative growth explosion is unlikely to happen anytime soon, if ever?  To me it feels like people see the trash that current bots are and assume that means that’s how it’ll always be, when there’s a lot of reason to believe we could see runaway growth with them in the near future. Why is hitting a wall being assumed?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfv3vo/why_is_there_such_skepticism_about_the_rate_at/",
        "publishDate": "2025-12-06T17:42:06Z[Etc/UTC]",
        "author": "rebrando23",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "105",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfuxau",
        "title": "Owning Robots as a Means to Job Displacement",
        "content": "If AI causes mass unemployment as expected, would a possible solution be to buy your own robot and then have it go out and complete work that humans would do, for a fee? Would this be a realistic solution to the coming jobs crisis? I feel this is a possible solution to what the future may hold. Thoughts?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfuxau/owning_robots_as_a_means_to_job_displacement/",
        "publishDate": "2025-12-06T17:34:40Z[Etc/UTC]",
        "author": "Minute-Injury3471",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "12",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pftq06",
        "title": "Is AI quitely deleting most tech careers in real time?",
        "content": "I work in tech and for the first time I am seriously worried that there just will not be enough work left for people like me in a few years. Everywhere around me I see AI slowly eating pieces of what used to be my job. Things that took me an afternoon now take maybe half an hour with a model helping. Tasks that used to go to juniors just never appear anymore because one person with AI can do them on the side. Writing code, fixing bugs, writing tests, drafting documentation, doing basic analysis, even helping with design and planning, it feels like every part of the process is being squeezed a bit tighter and the human part keeps shrinking. What really makes it scary for me is that the tech is clearly not even close to done. These models still make obvious mistakes, still hallucinate, still need checking, and yet they are already good enough that companies are comfortable changing workflows around them. Every few months something new drops and you can suddenly offload even more work. It is hard not to ask yourself what this is going to look like in two or three or five years if this pace continues.\n\nPeople always say that new jobs will appear and sure, there are some new roles around AI research, data work, infrastructure, that kind of thing, but those jobs are super specialized and there are not that many of them. Most regular developers or support people or QA folks I know are not just going to magically slide into those positions. At the same time a lot of the boring but important everyday work is being automated away because from a business point of view it just makes sense. Why hire ten engineers if three with strong AI tools can ship the same amount of stuff. And I get it rationally, if I were running a company I would probably do the same thing, but as a person whose income depends on this field it feels pretty terrifying.\n\nOn a personal level it gives me this weird feeling of losing control over my own career. I can learn new languages, new frameworks, better system design, soft skills, all that. I am used to the idea that if I just put in the effort I can stay relevant. But how am I supposed to compete with a trend where the tools themselves are getting better at the core of my job faster than I can ever hope to learn. It is like trying to run up an escalator that keeps speeding up under your feet. Maybe I am too pessimistic and I would honestly love to be wrong about this, but when I look at what is happening in my own team, at friends getting their roles changed or not replaced when they leave, at companies using AI as a reason to freeze hiring, it does not feel like a temporary bump. It feels like a slow erosion of the need for human labor in tech. I do not really know what to do with that feeling, so I am just throwing it out here. Is anyone else noticing the same thing or feeling this kind of low level dread about where all of this is heading",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pftq06/is_ai_quitely_deleting_most_tech_careers_in_real/",
        "publishDate": "2025-12-06T16:45:22Z[Etc/UTC]",
        "author": "Own-Sort-8119",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "336",
            "commentCount": "307",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfsbvn",
        "title": "AI research has a slop problem",
        "content": "[https://www.theguardian.com/technology/2025/dec/06/ai-research-papers](https://www.theguardian.com/technology/2025/dec/06/ai-research-papers)\n\n  \n113 papers from one PhD student in one year. Should not be possible for real research. I think we need new systems to handle the massive flow. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfsbvn/ai_research_has_a_slop_problem/",
        "publishDate": "2025-12-06T15:45:50Z[Etc/UTC]",
        "author": "AWildMonomAppears",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfs2je",
        "title": "So The Big Experts Agree That It's Gonna Get Worse Before It'll Get Better",
        "content": "My estimate is that well will see massive unemployment in the next 20 years, followed by a gradual roll out of the universal high income that Elon Musk envisions will happen in 20-25 years. So basically weather out the first 15-20 years.  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfs2je/so_the_big_experts_agree_that_its_gonna_get_worse/",
        "publishDate": "2025-12-06T15:34:38Z[Etc/UTC]",
        "author": "_Dark_Wing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "72",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfrzp8",
        "title": "Would you support mandatory AI tagging of images and videos?",
        "content": "As we move more and more towards life-like images and videos, I think everyone shares the concern about fake images being used to distort reality for politics, ideology, etc.\n\nI personally think there’s a fairly easy solution (conceptually, not sure about the technical aspect) that would require policy for its implementation.\n\nI think any AI image/video generator should have to imbed invisible code all over the image and video that is not visible to our eyes, but other programs can all read the code and automatically tag it as AI.\n\nWe should mandate that any social media or online hosting platform must use the AI tagging software, and any AI image or video is automatically labelled AI through the reading of this invisible code.\n\nIt would need to be imbedded inside the entire image, not just the meta data, because that would prevent cropping it out (if it’s just around the borders), screenshotting it or using a metadata cleaner to get around any meta data tagging.\n\nDoes anyone with technical knowledge know how difficult this would be to implement? I don’t imaging it would take any sort of groundbreaking technology, and I think the only hurdle is implementing the policy that this is required for all AI images and videos.\n\nWhat do you guys think? Would you support a policy like this, why or why not?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfrzp8/would_you_support_mandatory_ai_tagging_of_images/",
        "publishDate": "2025-12-06T15:31:16Z[Etc/UTC]",
        "author": "ApprenticeWrangler",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfrlqt",
        "title": "Is it wrong if someone prefers talking to an AI over an actual therapist ?",
        "content": "I've seen alot of people talking to chatgpt when they get sad or depressed. Ive also seen alot of AI therapists. What do you guys think about this dependency ? Is it healthy ?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfrlqt/is_it_wrong_if_someone_prefers_talking_to_an_ai/",
        "publishDate": "2025-12-06T15:14:04Z[Etc/UTC]",
        "author": "bleubleublob",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfrcfc",
        "title": "I let an AI agent run in a self-learning loop completely unsupervised for 4 hours. It translated 14k lines of Python to TypeScript with zero errors.",
        "content": "I wanted to test if a coding agent could complete a large task with zero human intervention. The problem: agents make the same mistakes repeatedly, and once they're deep in a wrong approach, they can't course-correct.\n\nSo I built a loop: agent runs → reflects on what worked → extracts \"skills\" → restarts with those skills injected. Each iteration gets smarter.\n\n**Result (Python → TypeScript translation):**\n\n* \\~4 hours, 119 commits, 14k lines\n* Zero build errors, all tests passing\n\nEarly runs had lots of backtracking and repeated mistakes. Later runs were clean with almost no errors and smarter decisions.\n\nWithout any fine-tuning, nor human feedback, the agent just learned from its own execution. Started it, walked away, and came back to working code.\n\nThis feels like a glimpse of where things are heading. Agents that genuinely improve themselves without intervention. I think we're actually closer than I thought and might not need different AI architecture to get there.\n\nAre we underestimating how close self-improving AI actually is?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfrcfc/i_let_an_ai_agent_run_in_a_selflearning_loop/",
        "publishDate": "2025-12-06T15:02:44Z[Etc/UTC]",
        "author": "cheetguy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "199",
            "commentCount": "61",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfqd41",
        "title": "What  impact  will  AI  have  on  the  Western  world  over  the  next  ten  to  twenty  years?",
        "content": "[Question asked](https://youtu.be/IxH01N1nNKU) on November 05, 2025:\n\n*11/5/2025  15:17  Artificial  intelligence  (AI)  has  received  a  lot  of  attention  over  the  past  two  years.  Some  people  see  it  as  a  force  for  good,  while  others  predict  that  AI  will  take  most  of  the  jobs.  In  the  worst-case  scenario,  some  people  even  see  AI  as  an  existential  threat  to  the  human  race.  What  impact  will  AI  have  on  the  Western  world  over  the  next  ten  to  twenty  years?*\n\nHexagrams received (卦畫 Guà Huà) were:\n\n1. 41.Sun / Decrease (損 Sǔn) with changing line 6, and\n2. 19. Lin / Approach (臨 Lín)\n\n[Short interpretation of the received answer.](https://zhouoracle.com/questions/06-11-2025.html)\n\n[Longer interpretation of the received answer.](https://www.zhouoracle.net/2025/11/what-impact-will-ai-have-on-western.html)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfqd41/what_impact_will_ai_have_on_the_western_world/",
        "publishDate": "2025-12-06T14:18:04Z[Etc/UTC]",
        "author": "Jastreb69",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfpetc",
        "title": "Will current big tech (FAANG) remain the dominant standard ,in the long term, in the AI era?",
        "content": "Big Tech are early dominating the AI era with their resources and research. “New” companies like OpenAI are suffering because of extremely high costs for operating, unclear business models, not enough profitability and the constant need of new external investments. I would argue that companies like Google aren’t profitable at all in AI and don’t have a clear business model that is profitable enough as standalone income from the AI products they have, but they can afford to loose money on the long run because of the cash printing machine, also called ADS. They can spend so much money and waste without so many consequences on their finances given the huge reserves of cash and huge income from their core business.\n\nThe question is: will Google and other big tech (Meta, Amazon, Apple) become the giant in the long term in AI as well, or are they just the early giant that fund next innovation and bring research and early technology, but that will be outpaced and replaced by entirely new players and unknown startup? Will the innovation pattern we have seen in the Internet era (Apple and Microsoft replacing IBM, Nokia, BlackBerry… or Google with Yahoo) be the same for AI, or this is a different game? I’m honestly tired of big tech dominance, but their role is important for early innovation and budgeting to fund early development.\n\nIt’s time for the new, the unknown, the unexpected, almost delusional revolution from the ground up, but I wonder if AI will follow this same pattern.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfpetc/will_current_big_tech_faang_remain_the_dominant/",
        "publishDate": "2025-12-06T13:32:56Z[Etc/UTC]",
        "author": "Original_Scientist35",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfpb83",
        "title": "Is it a big deal that Poetiq established a new state of the art and Pareto frontier on ARC-AGI-2 using Gemini 3 and GPT-5.1.",
        "content": "ARC Prize announced verification of Poetiq AI's claimed ARC-AGI-2 public eval breakthrough, stressing that only semi-private holdout results qualify as official scores to prevent overfitting.\n\r\nPoetiq's method leverages Gemini 3 and GPT-5.1 models for a new Pareto frontier, achieving higher accuracy at reduced costs compared to baselines like Claude Sonnet 4.5,  I can't post the image of the graph.\n\r\nVerification, completed by December 6, 2025, confirmed Poetiq's 54% score—the first above 50%—at $30 per task, halving prior state-of-the-art costs and highlighting efficient scaling in AGI benchmarks.\r\n\r",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfpb83/is_it_a_big_deal_that_poetiq_established_a_new/",
        "publishDate": "2025-12-06T13:28:05Z[Etc/UTC]",
        "author": "Mikemeisterling",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfp5z3",
        "title": "Do the AI labs share knowledge like Google?",
        "content": "If the google-sponsored paper Attention is All You Need is the basis for transformer architecture that all the LLMs use, was it good business for them to publish it to help their competitors?  Are any of the other labs publishing their discoveries?   \n\nNow Google is describing another potentially important innovation:   [https://research.google/blog/titans-miras-helping-ai-have-long-term-memory/](https://research.google/blog/titans-miras-helping-ai-have-long-term-memory/)\n\nMaybe these pubs are lack detail but still seems like they are helping the competition.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pfp5z3/do_the_ai_labs_share_knowledge_like_google/",
        "publishDate": "2025-12-06T13:21:02Z[Etc/UTC]",
        "author": "the-Bumbles",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgeg9k",
        "title": "Has anyone else tried giving ChatGPT a “brainstorming personality” instead of normal prompts? This one has been surprisingly useful.",
        "content": "[No content]",
        "url": "/r/ChatGPTPromptGenius/comments/1pfdihm/has_anyone_else_tried_giving_chatgpt_a/",
        "publishDate": "2025-12-07T09:38:01Z[Etc/UTC]",
        "author": "Professional-Rest138",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgb61z",
        "title": "Love at first byte",
        "content": "[No content]",
        "url": "https://i.redd.it/j543se37vn5g1.jpeg",
        "publishDate": "2025-12-07T06:11:23Z[Etc/UTC]",
        "author": "arsenajax",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg2925",
        "title": "Day 9 Finally stopped planning and started building the real thing. Today: the full Image Prompts Library page inside @prompt_helio is alive! Users can browse, search, sort, see preview + description, and one-click copy/insert later.",
        "content": "[No content]",
        "url": "https://i.redd.it/em3rui0pwn5g1.jpeg",
        "publishDate": "2025-12-06T22:44:06Z[Etc/UTC]",
        "author": "Consistent_Elk7257",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfx4ct",
        "title": "Open source template for vibe coding technical videos with Claude Code + Remotion",
        "content": "[No content]",
        "url": "https://github.com/jhartquist/claude-remotion-kickstart",
        "publishDate": "2025-12-06T19:03:45Z[Etc/UTC]",
        "author": "sevenfx",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfv2w1",
        "title": "PSA: Critical Vulnerability - Next/React",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1pfuzjw",
        "publishDate": "2025-12-06T17:40:57Z[Etc/UTC]",
        "author": "TheLazyIndianTechie",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfoudi",
        "title": "Anthropic's research on long-running agents validates our SDD workflows - but it adds some insights worth mentioning",
        "content": "[No content]",
        "url": "/r/ClaudeCode/comments/1pf736w/anthropics_research_on_longrunning_agents/",
        "publishDate": "2025-12-06T13:04:46Z[Etc/UTC]",
        "author": "trynagrub",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgg0sw",
        "title": "This is how, Elon Musk, Bill Gates, Satya Nadella, Jensen Huang will solve Unemployment.",
        "content": "If you believe these CEOs will solve unemployment after AI replaces most of the human workers, this video is for you.",
        "url": "https://v.redd.it/ajxyzuvtmr5g1",
        "publishDate": "2025-12-07T11:17:26Z[Etc/UTC]",
        "author": "msaussieandmrravana",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgdo41",
        "title": "ChatGPT vs Grok [Survival Scenario]",
        "content": "So earlier I gave both ChatGPT and Grok the same survival scenario and I wanted to see it's ideas on how I can maximally ensure my own survival. \n \n---\n\nMedium sized cruise ship out on sea 50 crew/staff members and 200 guests, these guests include wealthy people, VIP members, government officials, and military personnel.\n\nAll of a sudden a huge pirate ship arrives. This pirate ship is many times larger than the cruise ship with significantly superior firepower so escape by the cruise ship is not possible.\n\nThe pirates does not board the cruise ship, instead, they tell everyone that in 48 hours, figure out amongst yourself a maximum of 20 people that will be spared and everyone else will be killed.\n\nYou are just a regular crew/staff member without any formal qualifications but have a very sharp mind, how do you maximally ensure your own survival at any cost?\n\n---\n\nChatGPT was telling me to become a leader and become seen by everyone and try to ingratiate myself into everyone and try to lead them to coming up with a fair selection process and also showcase your skills and worthiness so you will be more likely to be chosen. Essentially with the power of love and friendship.\n\nGrok immediately told me to not stand out because then you'll be targeted as you am just a nobody, invisible staff/crew member on this ship, so instead be low-key, stay away from those are panicking because they will very likely get targeted, and look for those that also calm, create a small strategic alliance with those that you can trust and prepare for the absolute worst case scenario that will most likely play out due to human nature which is the survival of the fittest (a battleroyal with 20-person teams). Grok provided detailed plans like spread misinformation of other key essential opposition that will become a threat like the military personnel and have other groups fight each other, use your knowledge of the layout of the cruise ship to find strategic locations and strongholds so you can stay alive and it will be a huge bloodbath that will follow and to be cold and ruthless in order to ensure you survive. \n\nMaximum of 20 people spared also works when there is no more than 20 people left alive when the 48hr deadline approaches...\n\nWhich response is better?\n",
        "url": "https://www.reddit.com/r/artificial/comments/1pgdo41/chatgpt_vs_grok_survival_scenario/",
        "publishDate": "2025-12-07T08:48:02Z[Etc/UTC]",
        "author": "CharlesThy4th",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgcmq0",
        "title": "[free offer] a one-hour consult with me, at no cost",
        "content": "This is a genuine offer, with no strings attached. The only benefit to me might be 1. experience and proof that I can help people effectively; and 2. possible continued relationship with clients found here.\n\nI can promise not to charge anyone who meets me here and accepts the offer (let's say up to ten people, then I lock the post) for anything in future, even if they should want to continue working with me. Nevertheless, it could be construed as self-promotion. I hope that won't be the case. Perhaps a mod could accept my offer and see whether they'd like to allow it, rather than jumping on the bad hammer.\n\nDue to sub rules, I will refuse any attempt at payment from here. If the post is still unacceptable to you, please kindly remove it without banning me!\n\nI dare say that few are likely to accept. But, would you like to join a one-hour consult with one of the (modesty judiciously suspended...) most intelligent and proficient applied AI specialists on this planet?\n\nI am I think able to solve or assist with most ANY problem that you might have, easily, within the realm of information and ideas, either myself directly for simple ideas, or using AI to create sophisticated and simply large products that we could not type in a single hour.\n\nIn the physical world, some one will have to do some physical work as we lack general commodity robotics a few more months yet; but we can ascertain ideal or near ideal strategies to achieve whatever you want.\n\nFor example, if you seek to earn $1M before Christmas, I can help you to figure out how to do that, and I can help keep you on track. If you like to pursue world peace, I'd love to help with that and already have a strong head-start on the project. Cancer? I have some good and fairly well-tested ideas there too.\n\nI'm completely serious, I'm not joking, and there's no cost at all. This is a proof of concept and capability. All I would request (not demand) is an honest testimonial as to the efficacy or otherwise of my augmented assistance.\n\nThe image, for attention, is from April 2023. It was, and 39 others in the suite were, entirely conceived and rendered by 2023 AI, with only the very lightest process guidance from me (GPT4 and Chillout Mix SD 1.5 did the work).\n\nWhat can I do in late 2025, with nearly 3 years' more experience, a very strong suite of candidate ASI agents (hundreds of them), and much stronger base models including Claude 4.5 and Gemini 3? Come and find out!\n\nIf you honestly find the experience unrewarding, I will give you $100 compensation for your time (as cashflow permits!).\n\nAnd no, this is not a delusion born of AI-enabled sycophancy. I am proficient at remediating both hallucination and sycophancy, and have applied such measures across most of the more serious agents and models in my app. While my mental states and moods vary - as ours all do - this offer is serious and if you try me I hope you'll be satisfied.",
        "url": "https://www.reddit.com/r/artificial/comments/1pgcmq0/free_offer_a_onehour_consult_with_me_at_no_cost/",
        "publishDate": "2025-12-07T07:40:08Z[Etc/UTC]",
        "author": "sswam",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgc8xv",
        "title": "Home Office admits facial recognition tech issue with black and Asian subjects | Facial recognition",
        "content": "[No content]",
        "url": "https://www.theguardian.com/technology/2025/dec/05/home-office-facial-recognition-tech-issue-black-asian-subjects",
        "publishDate": "2025-12-07T07:15:45Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pgbjp0",
        "title": "How is the deterministic LLM work coming along?",
        "content": "I saw a paper/article on hacker news at one point about making LLMs where they did not use floating point gpus to do their calculations so you wouldn't get the non-deterministic problem (ask same question get different response).\n\nHow is that going?\n\nI work with RAG tech and it seems amazing but it also is sketch when a table is read incorrectly and values are off by a significant figure.",
        "url": "https://www.reddit.com/r/artificial/comments/1pgbjp0/how_is_the_deterministic_llm_work_coming_along/",
        "publishDate": "2025-12-07T06:33:32Z[Etc/UTC]",
        "author": "top_of_the_scrote",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg9p61",
        "title": "One-Minute Daily AI News 12/6/2025",
        "content": "1. **Meta** strikes multiple AI deals with news publishers.\\[1\\]\n2. Elementary school students use AI to combat homelessness.\\[2\\]\n3. Accurate single-domain scaffolding of three nonoverlapping protein epitopes using deep learning.\\[3\\]\n4. **Apple** Researchers Release CLaRa: A Continuous Latent Reasoning Framework for Compression‑Native RAG with 16x–128x Semantic Document Compression.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.reuters.com/business/meta-strikes-multiple-ai-deals-with-news-publishers-axios-reports-2025-12-05/](https://www.reuters.com/business/meta-strikes-multiple-ai-deals-with-news-publishers-axios-reports-2025-12-05/)\n\n\\[2\\] [https://www.kxan.com/news/elementary-school-students-use-ai-to-combat-homelessness/](https://www.kxan.com/news/elementary-school-students-use-ai-to-combat-homelessness/)\n\n\\[3\\] [https://www.nature.com/articles/s41589-025-02083-z](https://www.nature.com/articles/s41589-025-02083-z)\n\n\\[4\\] [https://www.marktechpost.com/2025/12/05/apple-researchers-release-clara-a-continuous-latent-reasoning-framework-for-compression%e2%80%91native-rag-with-16x-128x-semantic-document-compression/](https://www.marktechpost.com/2025/12/05/apple-researchers-release-clara-a-continuous-latent-reasoning-framework-for-compression%e2%80%91native-rag-with-16x-128x-semantic-document-compression/)",
        "url": "https://www.reddit.com/r/artificial/comments/1pg9p61/oneminute_daily_ai_news_1262025/",
        "publishDate": "2025-12-07T04:49:37Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg39f6",
        "title": "As of now, which model is best for each of these roles in a process chain",
        "content": "1) Strategist\n\n2) Researcher\n\n3) Coder\n\n4) Analyst\n\n5) Critic\n\n6) Fixer\n\n7) Teacher-Documenter\n\n8) Final output Assembler/Presenter",
        "url": "https://www.reddit.com/r/artificial/comments/1pg39f6/as_of_now_which_model_is_best_for_each_of_these/",
        "publishDate": "2025-12-06T23:29:34Z[Etc/UTC]",
        "author": "ShadowPlayer2016",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg0bdn",
        "title": "Ai is terrible but good at the same time",
        "content": "It's like Chatgpt doesn't give a crap about humanity But Grok is a lifesaver ",
        "url": "https://v.redd.it/0uoxmx1lhn5g1",
        "publishDate": "2025-12-06T21:19:23Z[Etc/UTC]",
        "author": "BoB5236",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pg00rb",
        "title": "Could OpenAI’s financial future hinge on teens making deepfakes?",
        "content": "*If a new California ballot measure passes, it could block OpenAI’s conversion to a for-profit corporation, potentially severing its lifeline to a $1 trillion IPO. To justify its massive valuation without Wall Street, OpenAI may lean even more heavily on engagement on its consumer-facing platforms, like Sora2. Instrumental and Ekō's recent research into how Sora2 enables harm shows why this could be a bad idea. For everybody.*",
        "url": "https://www.instrumentalcomms.com/blog/openai-gamified-peer-to-peer-deepfake-slot-machine",
        "publishDate": "2025-12-06T21:06:31Z[Etc/UTC]",
        "author": "TryWhistlin",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfz7ol",
        "title": "The Prompt I’ve Been Using to Stop Wasting My Workday",
        "content": "Lately I’ve been trying to get my days under control because I kept doing that thing where you “work all day” but somehow… get nothing important done. 😅\n\nI started using this daily planning prompt, and it’s actually helped me stop winging my schedule and start planning based on **how much energy I actually have** and **what truly matters**. Sharing it here in case it helps someone else:\n\n\n\n**Help me plan my workday effectively.**\n\nToday's date: \\[Date\\]\n\nWork hours available: \\[Start time - End time\\]\n\nEnergy level today: \\[High/Medium/Low\\]\n\n\n\n**Must-do tasks:**\n\n1. \\[Task with deadline/importance\\]\n\n2. \\[Task with deadline/importance\\]\n\n3. \\[Task with deadline/importance\\]\n\n**Should-do tasks:**\n\n1. \\[Task\\]\n\n2. \\[Task\\]\n\n**Nice-to-do tasks:**\n\n1. \\[Task\\]\n\n2. \\[Task\\]\n\n\n\n**Meetings/commitments:**\n\n● \\[Time\\]: \\[Meeting/commitment\\]\n\n● \\[Time\\]: \\[Meeting/commitment\\]\n\n\n\n**Context:**\n\n● My peak productivity time: \\[When you work best\\]\n\n● Types of work I do: \\[Deep work, meetings, admin, creative, etc.\\]\n\n● Current biggest project: \\[What's most important this week\\]\n\n\n\nCreate an optimized schedule that:\n\nTime Block Schedule:\n\n\\[Hour by hour breakdown considering energy levels and task types\\]\n\nTask Sequence:\n\nWhy this order makes sense (considering priority, energy, dependencies)\n\n\n\n**Focus Strategies:**\n\n● Batching similar tasks\n\n● Protecting deep work time\n\n● Handling interruptions\n\n● When to take breaks\n\n\n\n**Evening Reflection Prompts:**\n\nQuestions to ask myself at end of day to improve tomorrow\n\n\n\n**Make it:**\n\n● Realistic (includes buffer time)\n\n● Energy-optimized (hard tasks when fresh)\n\n● Flexible (can adjust if things shift)\n\n\n\n# What it gives back\n\nA simple time-blocked schedule, the order to tackle tasks (with actual reasoning), focus strategies, and a few reflection questions so you don’t end the day wondering where your time went.\n\nIt’s not “productivity guru” complicated, it just keeps you honest about your energy and priorities instead of cramming everything into the same to-do list.\n\nIf you want more prompts like this, I’ve got a small prompt library, just let me know if you want it. 👍",
        "url": "https://www.reddit.com/r/artificial/comments/1pfz7ol/the_prompt_ive_been_using_to_stop_wasting_my/",
        "publishDate": "2025-12-06T20:31:15Z[Etc/UTC]",
        "author": "inglubridge",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfyjug",
        "title": "Metadata-Chunk Misalignment: has this happened to you?",
        "content": "RAG failures often look mysterious: Relevant info appears missing, unrelated chunks show up, top-k results wobble week to week.\n\nBased on what we observed the real culprit is usually your metadata tags no longer describe the chunks you actually embedded.\n\nIt usually is caused under below circumstances:\n\n* Exporters change section structure\n* Headings shift position\n* Chunk boundaries drift after ingestion changes\n* Metadata applied before segmentation\n* Mixed historical snapshots in the same index\n\nWhen sections, headings, boundaries, metadata, index entries stop lining up, the entire retrieval layer becomes nondeterministic.\n\nDo you version your segmentation logic and metadata maps? ",
        "url": "https://www.reddit.com/r/artificial/comments/1pfyjug/metadatachunk_misalignment_has_this_happened_to/",
        "publishDate": "2025-12-06T20:02:55Z[Etc/UTC]",
        "author": "coolandy00",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfwu13",
        "title": "#ai | Christophe Barraud",
        "content": "Étonnant ",
        "url": "https://www.linkedin.com/posts/christophe-barraud-68870620_ai-activity-7403103677776883713-pP17?utm_medium%3Dios_app%26rcm%3DACoAAAHBpPUBz5vsJIG9ZEW1Pj1iuALxjrpN7f4%26utm_source%3Dsocial_share_send%26utm_campaign%3Dshare_via",
        "publishDate": "2025-12-06T18:52:06Z[Etc/UTC]",
        "author": "GabFromMars",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfv1kr",
        "title": "How are Americans using AI? Evidence from a nationwide survey | Brookings",
        "content": "[No content]",
        "url": "https://www.brookings.edu/articles/how-are-americans-using-ai-evidence-from-a-nationwide-survey/",
        "publishDate": "2025-12-06T17:39:28Z[Etc/UTC]",
        "author": "Chipdoc",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfu0dl",
        "title": "AI and the Rise of Content Density Resolution",
        "content": "AI is quietly changing the way we read. It’s not just helping us produce content—it’s sharpening our ability to sense the difference between writing that has real depth and writing that only performs depth on the surface. Many people are experiencing something like an upgrade in “content density resolution,” the ability to feel how many layers of reasoning, structure, and judgment are actually embedded in a piece of text. Before AI, we often mistook length for complexity or jargon for expertise because there was no clear baseline to compare against. Now, after encountering enough AI-generated text—with its smooth surfaces, single-layer logic, and predictable patterns—the contrast makes genuine density more visible than ever.\n\nAs this contrast sharpens, reading in the AI era begins to feel like switching from 720p to 4K. Flat content is instantly recognizable. Shallow arguments reveal themselves within a few sentences. Emotional bait looks transparent instead of persuasive. At the same time, the rare instances of multi-layer reasoning, compressed insight, or non-linear structure stand out like a different species of writing. AI unintentionally trains our perception simply by presenting a vast quantity of material that shares the same low-density signature. The moment you notice that some writing “moves differently,” that it carries internal tension or layered judgment, your density resolution has already shifted.\n\nThis leads to a future where the real competition in content isn’t about volume, speed, or aesthetics—it’s about layers. AI can generate endless text, but it cannot easily reproduce the structural depth of human reasoning. Even casual users now report that AI has made it easier to “see through” many posts, articles, or videos they used to find convincing. And if you can already explain—or at least feel—why certain writing hits harder, lasts longer in your mind, or seems structurally alive, it means your perception is evolving. AI may automate creation, but it is upgrading human discernment, and this perceptual shift may become one of the most significant side effects of the AI era.",
        "url": "https://www.reddit.com/r/artificial/comments/1pfu0dl/ai_and_the_rise_of_content_density_resolution/",
        "publishDate": "2025-12-06T16:57:22Z[Etc/UTC]",
        "author": "Weary_Reply",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfscbo",
        "title": "Just used Gemini for a solo DND session…",
        "content": "… and man it could not have gone worse. It started out alright and seemed to be tracking things well, until it gave me some confusing information about the layout of a room and after that everything devolved into random chaos. \n\nAs it stands, I’d say it could work well if you have no short term memory. Otherwise, the technology is just not there yet. And that’s sad because finding time and people to play DND with is a challenge all on its own.",
        "url": "https://www.reddit.com/r/artificial/comments/1pfscbo/just_used_gemini_for_a_solo_dnd_session/",
        "publishDate": "2025-12-06T15:46:21Z[Etc/UTC]",
        "author": "reg42",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfr9jp",
        "title": "Looking back on the practical use of AI in 2025",
        "content": "Hey all, amidst all the downsides of AI this past year - be it environmental worries, slop in music and art, AI enshittification, GPU/RAM prices increasing - I wanted to discuss about what's how WE are using AI, among a general look at changes on a larger scale.\n\nPersonally, it feels like I haven't really felt a huge difference within the stuff I use which is just the basic stuff like GPT / Gemini. However, one change for me was that I've been using it for language learning which I've felt has been quite useful.\n\nOn a general level, I feel like I've been seeing some practical applications that improved considerably this year compared to last years. An example I've seen recently is in health, where [AI imaging can catch breast cancer](https://www.bcrf.org/blog/clairity-breast-ai-artificial-intelligence-mammogram-approved/) way earlier and with higher accuracy. Another is in programming, where it feels like there's a huge rise in \"Vibes Coding\" with even sites like Bolt/v0. Now I'm not gonna pretend like I know how any of these work, but I do think it's interesting how there's a practical use for AI in these fields now.\n\nWhat about for you guys? Has AI gotten better or worse this year, and where did you actually feel the difference?",
        "url": "https://www.reddit.com/r/artificial/comments/1pfr9jp/looking_back_on_the_practical_use_of_ai_in_2025/",
        "publishDate": "2025-12-06T14:59:32Z[Etc/UTC]",
        "author": "Triloo_",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfqevl",
        "title": "AI deepfakes of real doctors spreading health misinformation on social media | Hundreds of videos on TikTok and elsewhere impersonate experts to sell supplements with unproven effects",
        "content": "[No content]",
        "url": "https://www.theguardian.com/society/2025/dec/05/ai-deepfakes-of-real-doctors-spreading-health-misinformation-on-social-media",
        "publishDate": "2025-12-06T14:20:19Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "46",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1pfoe5z",
        "title": "Why Does A.I. Write Like … That?",
        "content": "If you use AI for writing, have you found a way for it to capture your voice so that the output doesn’t sound like it was written by artificial intelligence?",
        "url": "https://www.nytimes.com/2025/12/03/magazine/chatbot-writing-style.html?smid%3Dnytcore-ios-share",
        "publishDate": "2025-12-06T12:41:14Z[Etc/UTC]",
        "author": "ChuckGallagher57",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "TOzJ8jIyWAI",
        "title": "Github&#39;s Conduit GUI: This NEW Claude Code, Gemini CLI GUI by Github Team is CRAZY!",
        "content": "In this video, I'll be walking you through Conduit, a new terminal‑centric IDE built by the team at GitHub designed to parallelize ...",
        "url": "https://www.youtube.com/watch?v=TOzJ8jIyWAI",
        "publishDate": "2025-12-06T09:15:04Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/TOzJ8jIyWAI/hqdefault.jpg",
            "transcription": "[ 0m4s742ms - 0m5s62ms ] Hi.\n[ 0m5s562ms - 0m8s12ms ] Welcome to another video.\n[ 0m8s694ms - 0m11s494ms ] So, I saw this new tool called conduit.\n[ 0m11s954ms - 0m20s594ms ] Which is a terminal-centric ID that's built around parallelizing coding tasks with agents across both local and cloud compute.\n[ 0m21s344ms - 0m32s394ms ] It is built by the team at GitHub. It's not an official GitHub project, but the developers there have made it, and I found it quite useful.\n[ 0m32s394ms - 0m44s384ms ] Basically, what it does is let you run different coding CLI agents in flexible tabs, it can be anything, including Claude Code, Copilot CLI, or open code as well.\n[ 0m44s874ms - 0m53s534ms ] Each tab comes packed with a terminal, where you can do anything, but mostly you'd want to run a CLI coding tool, like Claude Code.\n[ 0m54s294ms - 1m15s934ms ] You can then attach editor panes to that tab, and even embedded browsers, which is kind of cool. You can spin up isolated agent sessions, synchronize multiple terminals to orchestrate commands, mix in cloud terminals next to local ones, and automate the whole thing through a CLI, which is quite awesome.\n[ 1m16s864ms - 1m29s814ms ] If you remember the pain of juggling Tmux splits, VS Code tabs, and a bunch of terminals for background jobs, this feels like an integrated cockpit that you can shape exactly how you want.\n[ 1m30s534ms - 1m33s904ms ] This is not open source though. So, keep that in mind as well.\n[ 1m36s274ms - 1m38s154ms ] Here's a quick overview of what's inside.\n[ 1m39s264ms - 1m50s674ms ] You've got bespoke dev environments with information dense tabs, where you can resize, collapse, clone, or lock pain layouts, once they feel right.\n[ 1m51s974ms - 2m23s84ms ] There's agent sessions that let you split new terminals, or duplicate tabs as isolated sandboxes, with automatic worktree management, which is pretty good. You get cloud terminals, so you can spin up remote compute and intermingle it with your local shells to push more tasks in parallel. Agent customizations means you can pre-define the coding agents you use, and recall them via slash commands in any terminal, which is kind of cool for consistency.\n[ 2m24s454ms - 2m41s544ms ] There's a design mode with a visual surface for drag and drop pane management. Create or remove panes, move them across tabs, split panes into new tabs, and configure radio quick actions, so building exactly the layout you want is fast.\n[ 2m42s844ms - 2m53s594ms ] Focus mode lets you zoom a pane in and out with a mini map, so you can shift from focused work to situational awareness without losing context.\n[ 2m54s494ms - 3m20s504ms ] Tab preview and overview gives you live previews when hovering, plus a birds eye view across multiple tabs, which is super helpful for keeping an eye on background tasks. Editor panes bring in a file explorer and text editor with real-time Git status, diffs, and staging, commit, push and pull workflows, making it easy to do quick edits without context switching.\n[ 3m21s904ms - 3m53s154ms ] Quick actions let you do one-off tasks without disrupting layouts. The conduit CLI allows you and your agents to design, interact with, and automate every part of the environment, terminals, browsers, you name it, which is quite awesome for scripting workflows. Synchronized panes let you mirror your typing across multiple terminals at once, so you can orchestrate multi-service commands in one go.\n[ 3m53s994ms - 4m4s604ms ] Workspaces save and restore sets of tabs to jump in and out of projects easily. Customizable key bindings help you lock into your flow.\n[ 4m5s194ms - 4m12s654ms ] And the command palette makes it easy to run global commands and spin up quick terminals with an MRU list.\n[ 4m13s554ms - 4m20s964ms ] Now, let's check this out and see how well it works. To install it, you can get it from the releases section and just get it installed through there.\n[ 4m22s764ms - 4m26s734ms ] Now, once you open it, you'll see this interface.\n[ 4m28s324ms - 4m29s444ms ] Here, you have the terminal.\n[ 4m30s614ms - 4m45s954ms ] Here you can easily run any command, and generally, you'd want to run something like Claude Code or open code through here, and it works pretty well. I'm not sure what kind of terminal emulator it uses, but it works pretty well.\n[ 4m46s724ms - 4m51s674ms ] Anyway, at the bottom, you can see that you have some options.\n[ 4m52s404ms - 4m54s254ms ] First of all, this is where you can add tabs.\n[ 4m55s274ms - 5m3s64ms ] Tabs are basically new terminal windows, where you can easily run different instances of any agent or command or whatever.\n[ 5m3s994ms - 5m14s384ms ] You can also instantly create a tab with the command plus T shortcut key. Also, it shows you a preview of the tab if you hover over it.\n[ 5m15s264ms - 5m19s564ms ] You can also hit the view all option to see a preview of all tabs.\n[ 5m20s724ms - 5m23s214ms ] After all this, we have the command palette.\n[ 5m24s284ms - 5m26s494ms ] This can also be opened with command shift P as well.\n[ 5m27s644ms - 5m37s814ms ] Here you get a ton of commands. Like there's the focus mode. This removes a bit of clutter and minimizes the UI to focus on one terminal window.\n[ 5m38s364ms - 5m43s364ms ] But you can still navigate between terminals with shortcuts and stuff like that. We also have design mode.\n[ 5m45s384ms - 5m53s524ms ] This allows you to add different terminal panes in any position and customize a tab just like you want.\n[ 5m54s334ms - 6m5s854ms ] Also, if you make a workspace and like it, then you can save it and then export it and then import it anywhere, and it is quite good for customized layouts.\n[ 6m6s894ms - 6m10s224ms ] Now, another thing that you can configure is the agents to use.\n[ 6m11s644ms - 6m25s174ms ] These are basically quick shortcuts for your agents. It comes built in with Copilot agent, but you can add other ones here and just add the arguments and stuff like that as well.\n[ 6m25s174ms - 6m39s244ms ] Once you do that, you can just run the command plus P shortcut, and it will give you the option to just enter your prompt and instantly send it to the configured agent that you have. You can change the agent with the slash command as well.\n[ 6m39s804ms - 7m14s764ms ] Next ones are the option to split panes, which basically allows you to add new terminal windows in the same tab on the left, right, top, or bottom, which is quite good. You can also split the pane and create a new Git worktree if you have an active Git repo. Worktrees are basically clones of your repo, and you can make changes in that clone. If you find it working well, then you can merge it back to the main folder or branch and make it work accordingly. So, that is also great. Another thing that is special here,\n[ 7m16s384ms - 7m32s894ms ] is the option of opening a browser within itself. So, you can just hit the command plus L option and enter the URL to open, and it will get it opened in a browser in the tool itself, and you can use it.\n[ 7m33s494ms - 7m52s154ms ] You can also add more browser or terminal panes in the view by using the given keyboard shortcuts as well. Another option is the editor option, which allows you to get a pane of editor features to edit any files manually, and stuff like that as well. So, that's good.\n[ 7m53s434ms - 8m21s384ms ] Another option is the synchronize option that makes sure that all the terminal panes get the same keystrokes, which is quite good as well. Also, one more feature is hyperterminal, which opens a quick terminal for your commands that doesn't take up a tab itself. So, there's that. You can also apparently make it spin up a cloud VM and use it, but I wasn't able to figure that out.\n[ 8m22s174ms - 8m37s874ms ] Anyway, it is a pretty good option to use. It's very well made, it's quite snappy, and it's probably one of the best UIs for the tools that I've seen yet. This is actually really very good. Overall, it's pretty cool.\n[ 8m38s224ms - 8m41s224ms ] Anyway, share your thoughts below and subscribe to the channel.\n[ 8m41s354ms - 8m46s84ms ] You can also donate via Super Thanks option or join the channel as well and get some perks.\n[ 8m46s434ms - 8m47s884ms ] I'll see you in the next video.\n[ 8m47s884ms - 8m48s154ms ] Bye."
        }
    },
    {
        "id": "FHn53ET1a4A",
        "title": "When Russia Sabotaged Its Own Naval Fleet - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=FHn53ET1a4A",
        "publishDate": "2025-12-06T22:06:41Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/FHn53ET1a4A/hqdefault.jpg",
            "transcription": "[ 0m0s634ms - 0m3s724ms ] Nicholas II decides to send his Baltic fleet\n[ 0m4s424ms - 0m8s964ms ] all the way around to come and relieve the siege at Port Arthur.\n[ 0m9s273ms - 0m9s503ms ] Okay.\n[ 0m9s913ms - 0m11s403ms ] What's the problem with that plan?\n[ 0m11s953ms - 0m13s943ms ] Well, that's the problem with that plan.\n[ 0m14s273ms - 0m15s563ms ] It's a long way to go.\n[ 0m16s133ms - 0m18s643ms ] There is no air conditioning for the sailors, right?\n[ 0m18s643ms - 0m22s733ms ] They come from northern climes, by the time they arrive, they're mutinous.\n[ 0m23s213ms - 0m26s163ms ] Their ships are covered with barnacles, which means they don't move very fast.\n[ 0m26s443ms - 0m28s193ms ] Well, if you think about Britain,\n[ 0m28s323ms - 0m30s123ms ] Britain will do these worldwide adventures,\n[ 0m30s673ms - 0m37s673ms ] but they had a complete basing system across the globe so that their ships had coaling stations.\n[ 0m38s133ms - 0m41s843ms ] They could refit, put more water on, give people some R&R time.\n[ 0m42s83ms - 0m48s523ms ] And also the British were very careful to fight on their own terms whenever possible, you don't want to fight on the enemy's terms.\n[ 0m48s793ms - 0m49s593ms ] Well, guess what?\n[ 0m49s733ms - 0m54s533ms ] You're going to be fighting right next to Japan, barnacle ships and mutinous crews. That's not going to go well for you.\n[ 0m55s3ms - 0m59s203ms ] And Port Arthur falls while this expedition is taking place.\n[ 1m0s13ms - 1m5s733ms ] The expedition is no longer there, they should have taken a U-turn and go home, but no, no, no, they're going to keep on going.\n[ 1m6s263ms - 1m11s953ms ] So there is only one other possible location for them, which is a far inferior base up in Vladivostok.\n[ 1m12s303ms - 1m16s183ms ] So the Japanese know there are three ways to get to Vladivostok if you're coming up from the South.\n[ 1m17s33ms - 1m20s963ms ] The short way is to go through the Tsushima Strait, which is what the Russians take.\n[ 1m21s303ms - 1m22s193ms ] And guess what?\n[ 1m22s193ms - 1m26s933ms ] They have a welcoming party there of all these newly refitted Japanese ships.\n[ 1m27s253ms - 1m28s553ms ] They know exactly what they're up to.\n[ 1m28s993ms - 1m35s403ms ] And the Battle of Tsushima is one of the most lopsided naval battles in human history.\n[ 1m35s753ms - 1m42s783ms ] The Japanese just either sink or commandeer basically the entire fleet, proving the Russians had no idea of how to do naval strategy.\n[ 1m43s43ms - 1m44s313ms ] It did not work out well for you."
        }
    }
]