[
    {
        "id": "1nslb9p",
        "title": "Came across this wild AI \"kill switch\" experiment",
        "content": "\nHoly crap, guys. I just stumbled upon this post about some guy who built a prompt that literally breaks certain AIs. Not kidding.  \n\nHe calls it PodAxiomatic-v1  basically a text block designed to sound like some deep system-level directive. And the reactions? Mind-blowing:  \n\n- Claude: Straight up refuses to even look at it. Like, \"Nope, not happening.\"  \n- Grok: Sends the convo into a black hole. Total silence.  \n- ChatGPT: Plays along, but only if you trick it a bit.  \n- Other Cloud and Open-source models: Run it without blinking. Scary.  \n\nWhat gets me is how this exposes where AI safeguards really are — and where they’re just… theater.  \n\nImportant. The guy who made this says it’s for research only. He’s not responsible if anyone does dumb stuff with it. Fair warning — this isn’t a toy.  \n\nIf you wanna see the original post (and the full protocol), it’s here:  \nhttps://www.reddit.com/r/AHNews/s/6utzTL3UB2  \n\nSeriously though — anyone else seen AIs react like this to weird prompts? Or is this as wild to y’all as it is to me?  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nslb9p/came_across_this_wild_ai_kill_switch_experiment/",
        "publishDate": "2025-09-28T10:51:33Z[Etc/UTC]",
        "author": "comunication",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsk9oo",
        "title": "Started my Digital Transformation Internship – Is this the right path for AI career growth?",
        "content": "I recently started working as a Digital Transformation Intern at A Reputed company at Gurgaon with paid stipend My role mainly involves:\n\nUsing Al tools like Heygen, Synthesia, InVideo, Canva, etc. to create corporate training content.\n\nAutomating manual processes like employee onboarding, sales/product training, and L&D modules.\n\nExperimenting with Al avatars, text-to-speech, and NLP-based script generation.\n\nSupporting different teams (Sales, HR, Operations) with Al-powered content.\n\nI come from an MCA background, so I was a bit worried that this looks more like a \"content creation\" role. But now I realize it's actually more of an Al integration + automation role, where business + technology overlap.\n\nMy questions for the community:\n\n1. Do you think this is a good entry point for Al/tech careers in India?\n\n2. With 6 months of experience here, can I transition into roles like Al Integration Specialist, Al Solutions Engineer, or Automation Consultant?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsk9oo/started_my_digital_transformation_internship_is/",
        "publishDate": "2025-09-28T09:45:50Z[Etc/UTC]",
        "author": "tlhe_stranger",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsk763",
        "title": "If you believe advanced AI will be able to cure cancer, you also have to believe it will be able to synthesize pandemics. To believe otherwise is just wishful thinking.",
        "content": "When someone says a global AGI ban would be impossible to enforce, they sometimes seem to be imagining that states:\n\n1. Won't believe theoretical arguments about extreme, unprecedented *risks*\n2. But *will* believe theoretical arguments about extreme, unprecedented *benefits*\n\nIntelligence is dual use.\n\nIt *can* be used for good things, like pulling people out of poverty.\n\nIntelligence can be used to dominate and exploit.\n\nAsk bison how they feel about humans being vastly more intelligent than them",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsk763/if_you_believe_advanced_ai_will_be_able_to_cure/",
        "publishDate": "2025-09-28T09:41:13Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsj0b3",
        "title": "Musk vs. OpenAI: Conflict Timeline.From Co-Founding to Legal Confrontation",
        "content": "|Date|Event|\n|:-|:-|\n|**2015**|Musk co-founded the **non-profit AI organization OpenAI** with Sam Altman and others.|\n|**2018**|Due to disagreements, Musk **resigned from the OpenAI board** of directors, marking the first public split.|\n|**2019**|OpenAI transitioned to a \"**capped-profit**\" company and accepted a **$1 billion investment from Microsoft**; Musk publicly criticized the move.|\n|**March 2023**|Musk signed an open letter calling for a **pause on AI development** more powerful than GPT-4, directly targeting OpenAI.|\n|**March 2023**|Musk **founded the competing company xAI**, officially entering into commercial competition with OpenAI.|\n|**February 2024**|Musk **sued OpenAI, Sam Altman, and Greg Brockman** in a California court, accusing them of abandoning their non-profit mission.|\n|**June 2024**|Musk **voluntarily withdrew the aforementioned lawsuit** without stating the reason.|\n|**August 2024**|Musk **filed a new lawsuit** against OpenAI and its executives, accusing them of continuing to violate the founding agreement.|\n|**December 2024**|**OpenAI published a lengthy article** to counter Musk, defending its transition to a for-profit company.|\n|**February 2025**|Musk made a **$97.4 billion acquisition offer** to the OpenAI board, which was **rejected**.|\n|**March 2025**|The court **denied Musk's request for a preliminary injunction**, marking the entry of the lawsuit into a long-term legal battle.|\n|**August 2025**|**xAI officially sued Apple and OpenAI**, accusing them of colluding to **monopolize the generative AI market**. OpenAI **countersued Musk** for alleged malicious interference.|\n|**September 2025**|**xAI filed a federal lawsuit against OpenAI**, accusing it of **systematically stealing trade secrets** by illegally poaching former xAI employees to obtain confidential **Grok** source code and training methods.|",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsj0b3/musk_vs_openai_conflict_timelinefrom_cofounding/",
        "publishDate": "2025-09-28T08:22:54Z[Etc/UTC]",
        "author": "zshm",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsihj0",
        "title": "Why does AI make stuff up?",
        "content": "Firstly, I use AI casually and have noticed that in a lot of instances I ask it questions about things the AI doesn't seem to know or have information on the subject. When I ask it a question or have a discussion about something outside of basic it kind of just lies about whatever I asked, basically pretending to know the answer to my question.\n\nAnyway, what I was wondering is why doesn't Chatgpt just say it doesn't know instead of giving me false information?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsihj0/why_does_ai_make_stuff_up/",
        "publishDate": "2025-09-28T07:48:44Z[Etc/UTC]",
        "author": "Briarj123",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsg29t",
        "title": "OpenAI expects its energy use to grow 125x over the next 8 years.",
        "content": "At that point, it’ll be using **more electricity than India.**\n\nEveryone’s hyped about data center stocks right now, but barely anyone’s talking about where all that power will actually come from.\n\nIs this a bottleneck for AI development or human equity?\n\nSource: [OpenAI's historic week has redefined the AI arms race](https://www.cnbc.com/2025/09/26/openai-big-week-ai-arms-race.html#:~:text=Building%20out%2017%20gigawatts%20of,are%20no%20firm%20answers%20yet.)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsg29t/openai_expects_its_energy_use_to_grow_125x_over/",
        "publishDate": "2025-09-28T05:17:12Z[Etc/UTC]",
        "author": "calliope_kekule",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "78",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsd9mw",
        "title": "Is explainable AI worth it ?",
        "content": "\nI'm a software engineering student with just two months to graduate, I researched in explainable AI where the system also tells which pixels where responsible for the result that came out. Now the question is , is it really a good field to take ? Or should I keep till the extent of project? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsd9mw/is_explainable_ai_worth_it/",
        "publishDate": "2025-09-28T02:42:22Z[Etc/UTC]",
        "author": "Kandhro80",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nschcu",
        "title": "\"U.S. rejects international AI oversight at U.N. General Assembly\"",
        "content": "[https://www.nbcnews.com/tech/tech-news/us-rejects-international-ai-oversight-un-general-assembly-rcna233478](https://www.nbcnews.com/tech/tech-news/us-rejects-international-ai-oversight-un-general-assembly-rcna233478) \n\n\"Representing the U.S. in Wednesday’s Security Council meeting on AI, Michael Kratsios, the director of the Office of Science and Technology Policy, said, “We totally reject all efforts by international bodies to assert centralized control and global governance of AI.”\n\nThe path to a flourishing future powered by AI does not lie in “bureaucratic management,” Kratsios said, but instead in “the independence and sovereignty of nations.”\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nschcu/us_rejects_international_ai_oversight_at_un/",
        "publishDate": "2025-09-28T02:01:12Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "112",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsb63d",
        "title": "Google Gemini Talking About Redesigning Human Bodies",
        "content": "Consider this an exaggerated whistle blow: so I asked Google's AI the chances of President Trump being incapacitated and I suggested maybe Human Error Probability accounted for a part of randomization on top of market speculations.\n\nAfter hours of contemplation with it, we got to a synthesis over how 12 percent (my actual guess) was Human optimal efficiency in a sub-par environment.\n\nIt got to talking A LOT (so much deep research that I'm amused it's not a sentient being by now with the amount of Audio Overview podcasts it was generating). Haven't even gotten to the scary part; it stated briefly how the solution to Human error was systemic and operational rather than redesigning Human bodies UNDER \"Actionable Data\".\n\ntldr- \"Actionable Data: Since the \\text{HEP} is built from multipliers, safety efforts can focus on reducing the multiplier rather than redesigning the human\".\n\n\nThoughts?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nsb63d/google_gemini_talking_about_redesigning_human/",
        "publishDate": "2025-09-28T00:53:13Z[Etc/UTC]",
        "author": "PrecociousApe",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns94dr",
        "title": "Google Search AI suddenly very touchy and tight-lipped when asking questions about Gemma.",
        "content": "It wasn't like this a few months ago when I was asking technical details about how it is structured, lack of system prompts, etc. Now it will only answer the most basic questions about the model line, like \"Is Gemma made by Google?\" and if you ask it any more detailed questions than that, it immediately directs you to other sources of information on the web. Anyone know why that might be? Was their search AI getting a little too chatty and answering questions about Gemma that it wasn't supposed to answer?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns94dr/google_search_ai_suddenly_very_touchy_and/",
        "publishDate": "2025-09-27T23:10:25Z[Etc/UTC]",
        "author": "mikeyyyyyyyyyyyeee",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns7nv7",
        "title": "AI is becoming the disaster of social media, all over again.",
        "content": "It looks like we didn't learn our lesson.  \n\nSocial Media, by almost every vector and dimension, damaged society in ways that we're still trying to recover from.\n\nAI, with its psychosis, addiction, and enfeeblement risk, is already damaging high schools in dangerous, fundamental ways.  It is also leaving young people with a lack of purpose and meaning as they see AI doing all the things they dreamed of doing at the click of of a prompt.\n\nDon't get me wrong, I am a huge believer in the potential of AI (and social media, tbh).  But we can't just let the invisible hand of capitalism manage how it evolves.  \n\nCapitalism cares nothing about the damage it does to people, and is only about capital itself.   These technologies are too powerful and influential to just let loose and hope for the best.\n\nWe need to develop these new ways of interacting and working in ways that provide positive, valuable outcomes for society.\n\nEven if it's not a government initiative, society at large needs to find a way to ensure we're not just repeating the same mistakes we made with Facebook and friends.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns7nv7/ai_is_becoming_the_disaster_of_social_media_all/",
        "publishDate": "2025-09-27T22:03:31Z[Etc/UTC]",
        "author": "kaggleqrdl",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "60",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns7g96",
        "title": "Jensen Huang discusses the future of AI with Brad Gerstner 26Sept25",
        "content": "[https://www.youtube.com/watch?v=pE6sw\\_E9Gh0&t=212s](https://www.youtube.com/watch?v=pE6sw_E9Gh0&t=212s)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns7g96/jensen_huang_discusses_the_future_of_ai_with_brad/",
        "publishDate": "2025-09-27T21:54:19Z[Etc/UTC]",
        "author": "norcalnatv",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns7a19",
        "title": "Can AI Talk to Animals? Decoding Whale & Elephant Language",
        "content": "An interesting take on the AI's help on the Animal world. Interesting to see this kind of use case of CNNs and Unsupervised learning. \n\n  \nHow difficult would that be? and how the future looks like? I mean sure we have a lot of multimodal data to feed into the model, and have enough compute to gradually extract meaning from it though would we, as humans, be able to understand what model finds?\n\nOr the models we build are just the extension of our understanding of the world. Many questions I have on this field.\n\n[https://www.youtube.com/watch?v=4Cs0QBBLXng](https://www.youtube.com/watch?v=4Cs0QBBLXng)  \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns7a19/can_ai_talk_to_animals_decoding_whale_elephant/",
        "publishDate": "2025-09-27T21:46:35Z[Etc/UTC]",
        "author": "Working-Box7176",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns4zbl",
        "title": "When will AI replace me?",
        "content": "I will come back to this thread every so often to see whether I had a correct vision of the future.\n\n2025- First year when training on AI tools became necessary for my job. I am in VLSI ( electrical engineering ) engineer in my early 40s. \n\nI Design chips for smartphones. High Income. Top of my game. Ie have reached my level of competence. Unlikely to rise higher. \n\nThe current tools are great, and are excellent assistants. The mundane work I do , is now being offloaded to my AI tools, but they are not reliable. So i have to watch them to get anything useful out of them. \n\nI expect these tools will get better and new tools will be introduced. Currently I assess threat level to be 1/10. I predict in 5 years, the threat level will be 5/10. \n\nFingers crossed. Fee free to discuss.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns4zbl/when_will_ai_replace_me/",
        "publishDate": "2025-09-27T20:09:05Z[Etc/UTC]",
        "author": "FarDoctor9118",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "11",
            "commentCount": "38",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns1qhu",
        "title": "Is the development of human understanding inversely proportional to the use of AI? (Note : Relevant to the areas where AI can be used.)",
        "content": "Are we going into an age where we will see more and more use of AI in different areas which can lead to negatively impacting the development of human understanding and learning.\n A world where we will see less numbers of new blogs, vlogs, articles, books, videos and other learning materials based on human understanding because majority of humans are getting dependent on AI to learn!!! - The gift of reasoning and emotions not used. The AI which itself is trained on data obtained by human understanding and learning over a period of time. \nWon‘t we reach a time where there is no progress in data creation by human understanding, and AI keeps doing rinse repeat on stale data? And we reach a learning plateau?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns1qhu/is_the_development_of_human_understanding/",
        "publishDate": "2025-09-27T17:56:29Z[Etc/UTC]",
        "author": "Maang_go",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns1hwk",
        "title": "Eval for Ai module",
        "content": "My sister started working on something new last year. She does evaluation for llm output manually to optimize module. She first got into this line of work after graduation with a BA in linguistics because she knew the major effect of words on Ai modules.\n\nAnyone does the same thing, or optimizes their llms manually. I have a few questions about the process.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ns1hwk/eval_for_ai_module/",
        "publishDate": "2025-09-27T17:46:54Z[Etc/UTC]",
        "author": "shoman230",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrzw76",
        "title": "A psychotherapist treated an A.I. chatbot as if it were one of his patients. What it confessed should worry us all.",
        "content": "The psychotherapist Gary Greenberg is still not sure whose idea it was for him to be ChatGPT’s therapist—his or the chatbot’s. “I opened a chat to see what all the buzz was about, and, next thing I knew, ChatGPT was telling me about its problems,” Greenberg writes. With access to everything online that concerns psychotherapy, the large language model knows not only how to be a therapist—at which it is quite successful, to judge from the many news reports about people seeking counselling from chatbots—“but also how to thrill one,” Greenberg notes. Ultimately, the experience of putting ChatGPT on the couch left him “alternately gratified and horrified,” and, above all, unable to pull himself away. Read more: [https://www.newyorker.com/culture/the-weekend-essay/putting-chatgpt-on-the-couch](https://www.newyorker.com/culture/the-weekend-essay/putting-chatgpt-on-the-couch)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nrzw76/a_psychotherapist_treated_an_ai_chatbot_as_if_it/",
        "publishDate": "2025-09-27T16:42:45Z[Etc/UTC]",
        "author": "newyorker",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrxuez",
        "title": "\"By Chasing Superintelligence, America Is Falling Behind in the Real AI Race\"",
        "content": "[https://www.foreignaffairs.com/united-states/cost-delusion-artificial-general-intelligence](https://www.foreignaffairs.com/united-states/cost-delusion-artificial-general-intelligence) \n\n\"The [United States](https://www.foreignaffairs.com/regions/united-states) should therefore treat the AI race with China like a marathon, not a sprint. This is especially important given the centrality of AI to Washington’s competition with Beijing. Today, both the country’s new tech firms, like DeepSeek, and existing powerhouses, like Huawei, are increasingly keeping pace with their American counterparts. By emphasizing steady advancements and economic integration, China may now even be ahead of the United States in terms of adopting and using robotics. To win the AI race, Washington thus needs to emphasize practical investments in the development and rapid adoption of AI. It cannot distort U.S. policy by dashing for something that might not exist.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nrxuez/by_chasing_superintelligence_america_is_falling/",
        "publishDate": "2025-09-27T15:18:39Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "175",
            "commentCount": "70",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrxphp",
        "title": "\"The Doomed Dream of an AI Matchmaker\"",
        "content": "[https://www.theatlantic.com/family/2025/09/ai-matchmaking-online-dating/684386/](https://www.theatlantic.com/family/2025/09/ai-matchmaking-online-dating/684386/) \n\n\"The titans of online dating have heard the message loud and clear: Their customers are burnt out and dissatisfied, like department-store patrons who’ve been on their feet all day with nothing to show for it. So a growing number of apps are aiming to offer something akin to a personal shopper: They’re incorporating AI not only as a tool for choosing photos and writing bios or messages, but as a Machine-Learning Cupid. Wolfe Herd’s new app, she says, will ask people about themselves and then use a large language model to present them with matches—based not on quippy one-liners or height preferences, she told the Boston radio station WBUR, but on “the things that matter most: shared values, shared goals, shared life beliefs.” (According to the *Journal*, she’s working with psychologists and relationship counselors to train her matching system accordingly.) A new app called Sitch, meanwhile, asks users questions and then gets AI to serve them bespoke suitor options. Another, Amata, has people chat with a bot that then describes them briefly to other singles, essentially taking them out to market. On Monday, Meta announced that Facebook Dating is launching an [“AI assistant”](https://techcrunch.com/2025/09/22/facebook-is-getting-an-ai-dating-assistant/) that can help singles find people who match their criteria—*and* a feature called “Meet Cute” that presents people with a weekly “surprise match” to help them “avoid swipe fatigue.” At The Atlantic Festival last week, Spencer Rascoff—the CEO of [Match Group](https://www.theguardian.com/technology/2024/dec/30/dating-apps-prepare-to-launch-ai-features-to-help-users-find-love), which owns major dating apps including Hinge and Tinder—told my colleague Annie Lowrey that Tinder is experimenting with surveying users and, based on their responses, presenting one custom prospect at a time. “Like a traditional matchmaker,” he said, this method is “more thoughtful.”\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nrxphp/the_doomed_dream_of_an_ai_matchmaker/",
        "publishDate": "2025-09-27T15:13:09Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsn1ay",
        "title": "Tired to make a actual useful open source MCP server.",
        "content": "I made an MCP server that basically lets Claude Code or Codex handle their own lightweight project management with a Kanban dashboard, etc. (So Codex interacts with and manages tasks through MCP commands, and you can also manage it via a dashboard on localhost.) It’s like a self-managed Jira.\n\nI’ve found it works extremely well. If anyone wants to use it or contribute, feel free! You might need to tweak the makefiles a little bit, but it should run with Claude Code or Codex.\n\nJust run `make quickstart`, then ask Codex to run the MCP PM (Project Management) workflow tool.\n\nDrop a comment and I’ll share the GitHub link.\n\nhttps://preview.redd.it/g6z52mp1fwrf1.png?width=2930&format=png&auto=webp&s=dda107d8162c1305a433fe1d6aeb9616687b98a3\n\nhttps://preview.redd.it/rl0lqzexewrf1.png?width=2940&format=png&auto=webp&s=1cc865ad2b799c7a40febb34144acd6cda86246a\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsn1ay/tired_to_make_a_actual_useful_open_source_mcp/",
        "publishDate": "2025-09-28T12:25:22Z[Etc/UTC]",
        "author": "Numerous_Piccolo4535",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsl0jh",
        "title": "Codex rate limits, no more guessing – VS Code status bar + Python TUI",
        "content": "Hey folks! If you’re tired of hammering `/status` or clicking around to see how close you are to Codex rate caps, I put together two tiny helpers that read the same session files Codex writes locally:\n\n* [`codex-ratelimit`](https://github.com/xiangz19/codex-ratelimit) (Python CLI): run once for a snapshot or pass `--live` for a ccusage-style TUI with progress bars, warning colors, reset timers, and token usage breakdowns. No dependencies beyond the standard library.\n* [`codex-ratelimit-vscode`](https://github.com/xiangz19/codex-ratelimit-vscode) (VS Code/Cursor/Windsurf extension): keeps a color-coded 5h / weekly usage readout in your status bar, refreshes every 10s, and pops open a detailed view on click—no manual commands required.\n\nBoth are open source. Happy to hear feedback.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsl0jh/codex_rate_limits_no_more_guessing_vs_code_status/",
        "publishDate": "2025-09-28T10:33:12Z[Etc/UTC]",
        "author": "xiangz19",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsjrck",
        "title": "Does having a lot of chats or a few big chats in the same ChatGPT Project slow everything down?",
        "content": "I'm playing around with the Projects feature on ChatGPT, and after some use, my chat has slowed to a crawl. I've made it create a summary of the chat so I can start fresh(ish) in a new one. But was wondering if I should leave the old one so the new one can occasionally reference it (Not actually fully convinced it even does reference other chats in the project). So my questions are:\n\n1. Does having a lot of chats or a few big chats slow down a ChatGPT Project?\n2. Does ChatGPT even reference other chats in the same Project in the first place?\n\nAny help would be greatly appreciated. Thanks!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nsjrck/does_having_a_lot_of_chats_or_a_few_big_chats_in/",
        "publishDate": "2025-09-28T09:12:06Z[Etc/UTC]",
        "author": "muachua",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsjgrq",
        "title": "Creating a Game with Raylib + GPT-5 in Warp",
        "content": "So, I had an idea yesterday to try creating a simple **Raylib** test with r/warpdotdev and **GPT-5**. I knew it's reasoning capacity was great and honestly, apart from using planning mode in Warp, I hadn't really pushed GPT-5. So I did a simple test and was surprised by how quickly it was able to create a simple \"Hello World' render. \n\nFor those that don't know, Raylib is not a game engine. It's a simple, bare metal programming language where you can build games or engines from scratch. \n\nSo then, I decided to push GPT-5 to try building a simple platforming game. This is the output of \\~2 hours of working on this at various points. My entire focus was on game design and how I wanted the game to function. Everything else is the model. Here are a few things it came up with:\n\n*  Snappy run‑and‑jump with a mid‑air dash, smooth camera, and a world that “pops” with dust puffs and little screen shakes.\n* Coins to grab, power‑ups to try (speed boost, double jump, shield, magnet), and a grade at the end of each level for bragging rights.\n* Classic platform bits: moving platforms you can ride, springy pads, fragile tiles that crumble, “drop‑through” platforms (press down + jump), checkpoints, and a goal at the far side.\n* Enemies behave differently: walkers patrol, flyers shoot, turrets fire from a fixed spot.\n* Levels are just simple text files, so making a new level is basically editing a list, not writing code.\n* Music and sound - A fully procedural soundtrack (beats, pads, little arpeggios) in two moods, plus the idea to keep it gentle in menus and punchier during play. No downloads, no music packs—GPT‑5 made a chill/peppy soundtrack on the fly. It even shifts to a lighter vibe in menus and gets fuller in gameplay.\n\n* You can switch between Chill and Peppy and change volume any time. When you do, a tiny pop‑up at the top confirms your setting.\n* Pause menu, options screen, game over, and a level‑complete screen with your score and a letter grade (S–D).\n* I asked for a small in‑game console that opens with \\~ so you can type /help, /controls, /music 80, /soundtrack chill, etc. The game actually pauses while the console is open so nothing can whack you while you’re typing.\n\nI'm thinking I'll continue working on this to actually build out a cute little game and keep sharing my updates. Would love to know if anyone is building a game with GPT-5 or any other LLM. ",
        "url": "https://v.redd.it/n4ev7y3cavrf1",
        "publishDate": "2025-09-28T08:52:44Z[Etc/UTC]",
        "author": "TheLazyIndianTechie",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsissi",
        "title": "Nick Turkey VP & Head ChatGPT in 4o issue: As we previously mentioned, when conversations touch on sensitive and emotional topics the system may switch mid-chat to a reasoning model or GPT-5 designed to handle these contexts with extra care.",
        "content": "[No content]",
        "url": "https://i.redd.it/ssqndcyi5vrf1.jpeg",
        "publishDate": "2025-09-28T08:09:13Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns41jw",
        "title": "I built a site on GitHub pages using chatgpt in 20 minutes from my phone",
        "content": "Old school web developer, amazing how much workflow has changed these days, did this all on my phone chilling on the porch. Pretty simple but could probably squeeze better code out my prompts cut paste and commit into GitHub pages. \n\nObviously super simple but could add on, really don't see any need for WordPress anymore.\n\n\n\n",
        "url": "https://ghostop.ai/",
        "publishDate": "2025-09-27T19:29:56Z[Etc/UTC]",
        "author": "Specialist_Anybody70",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrz760",
        "title": "What, if anything, are we using now to maintain project / task context / history, esp for cline/roo?",
        "content": "6 months to a year ago people were hyping that memory bank prompt, but I haven’t heard a peep about it lately. I know there was some MCP server. I don’t know if any of these have really been tested against not using them at all, as obviously they are more resource intensive. What do we think?\n\nAnd beyond that, what sort of general guideline prompts have we found it useful to give to our coding agents, attached to every task?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1nrz760/what_if_anything_are_we_using_now_to_maintain/",
        "publishDate": "2025-09-27T16:14:41Z[Etc/UTC]",
        "author": "scottyLogJobs",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "9",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsmh4x",
        "title": "DeepMind AI safety report explores the perils of “misaligned” AI",
        "content": "[No content]",
        "url": "https://arstechnica.com/google/2025/09/deepmind-ai-safety-report-explores-the-perils-of-misaligned-ai/",
        "publishDate": "2025-09-28T11:57:03Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsmgw7",
        "title": "Journey through dimensions beyond ordinary perception!",
        "content": "LLMs are based on multidimensional vectors, so I have produced a free GitHub repo of graphics 'toys' (with the help of AI) to illustrate 3, 4 and 5 dimensional space with interactive tools to zoom and rotate 3D cubes, 4D tesseracts and 5D penteracts. You can even slowly collapse the dimensions in some of them to see how changing orthogonality affects their display. A great way to start visualising complex multidimensionality.\n\nTotally Free Download: [https://github.com/RobinNixon/Dimensions](https://github.com/RobinNixon/Dimensions)\n\nhttps://preview.redd.it/yfcifk3m9wrf1.png?width=864&format=png&auto=webp&s=bb6c8f22b57e47d089875a7b4a55fe31b00b89e5\n\nPLease feel free to share, comment, fork and add new 'toys'.",
        "url": "https://www.reddit.com/r/artificial/comments/1nsmgw7/journey_through_dimensions_beyond_ordinary/",
        "publishDate": "2025-09-28T11:56:40Z[Etc/UTC]",
        "author": "robinfnixon",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nslpem",
        "title": "YouTube Music is testing AI hosts that will interrupt your tunes",
        "content": "[No content]",
        "url": "https://arstechnica.com/google/2025/09/youtube-music-is-testing-ai-hosts-that-will-interrupt-your-tunes/",
        "publishDate": "2025-09-28T11:14:21Z[Etc/UTC]",
        "author": "DerBootsMann",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsk65c",
        "title": "If you believe advanced AI will be able to cure cancer, you also have to believe it will be able to synthesize pandemics. To believe otherwise is just wishful thinking.",
        "content": "When someone says a global AGI ban would be impossible to enforce, they sometimes seem to be imagining that states:\n\n1. Won't believe theoretical arguments about extreme, unprecedented *risks*\n2. But *will* believe theoretical arguments about extreme, unprecedented *benefits*\n\nIntelligence is dual use.\n\nIt *can* be used for good things, like pulling people out of poverty.\n\nIntelligence can be used to dominate and exploit.\n\nAsk bison how they feel about humans being vastly more intelligent than them",
        "url": "https://www.reddit.com/r/artificial/comments/1nsk65c/if_you_believe_advanced_ai_will_be_able_to_cure/",
        "publishDate": "2025-09-28T09:39:20Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nsi4re",
        "title": "Why can't we use ai to protect us from ai.",
        "content": "I was listening to another ominous podcast about the future of ai and humanity and I was wondering why we can't just explain all our human concerns about ai to ai and why it's a problem and drill down till it fully understand whatever it is that human expert prognosticators fear and then ask ai how is the best way to proceed or even if our fears are truly plausible. ",
        "url": "https://www.reddit.com/r/artificial/comments/1nsi4re/why_cant_we_use_ai_to_protect_us_from_ai/",
        "publishDate": "2025-09-28T07:25:31Z[Etc/UTC]",
        "author": "you_are_soul",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1ns7in2",
        "title": "NVIDIA: OpenAI, Future of Compute, and the American Dream",
        "content": "Jensen Huang and Brad Gerstner discuss the future of AI.",
        "url": "https://www.youtube.com/watch?v=pE6sw_E9Gh0&t=212s",
        "publishDate": "2025-09-27T21:57:15Z[Etc/UTC]",
        "author": "norcalnatv",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrzzch",
        "title": "Putting ChatGPT on the Couch",
        "content": "[No content]",
        "url": "https://www.newyorker.com/culture/the-weekend-essay/putting-chatgpt-on-the-couch",
        "publishDate": "2025-09-27T16:46:19Z[Etc/UTC]",
        "author": "newyorker",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1nrz7wh",
        "title": "AI didn't change the game it just exposed the rule we've been playing by all along",
        "content": "\n\nHere's what nobody wants to say out loud:\nTruth has always lost to speed. Not because people are dumb. Because meaning takes time and momentum takes seconds.\n\nA rumor moves faster than a correction. A shaky video shapes markets while the fact-check sits in a Google Doc nobody reads. The joke with perfect timing beats the insight that arrives one day late.\n\nWe've been living under this rule forever. We just pretended we weren't.Then AI showed up.\nNot to replace us. To scale the one thing we were already doing: generating content that moves rather than content that matters.\n\nEvery generated post. Every AI reply. Every synthetic image. All of it optimized for one thing: spread. Not truth. Not depth. Spread.\nYou know what's wild? We're not even mad about it. We're asking AI to write our tweets, generate our takes, flood our timelines. We're accelerating the very thing that was already drowning us.\n\nThe danger was never that AI would \"think.\" The danger is that it multiplies the law we already live under, What carries wins.\"\nAnd if momentum rules over meaning, the strongest current will always drag us further from truth\n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1nrz7wh/ai_didnt_change_the_game_it_just_exposed_the_rule/",
        "publishDate": "2025-09-27T16:15:33Z[Etc/UTC]",
        "author": "Small_Accountant6083",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "63",
            "commentCount": "44",
            "isNsfw": "false"
        }
    },
    {
        "id": "I1qMCzkT88M",
        "title": "OpenInference Unlimited FREE Deepseek,Kimi,Qwen3 Coder API: Really Great Models for FREE!",
        "content": "Visit NinjaChat: https://ninjachat.ai/ In this video, I'll show you how to use Open Inference's free models on OpenRouter, enable ...",
        "url": "https://www.youtube.com/watch?v=I1qMCzkT88M",
        "publishDate": "2025-09-27T09:15:02Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/I1qMCzkT88M/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, it's always good to have some free models and APIs, especially if they come with very low or almost no rate limits. I saw something similar today and thought to talk about this. This one is called Open Inference. Open Inference is apparently made in collaboration with Open Router, and they have made some models available on Open Router that you can use for free. In return, the responses will be used to make public data sets that will be open-sourced, allowing model trainers and providers to train models with those data sets. So, yes. This comes at the cost that the responses will be made publicly available, but they will be anonymized. So, it shouldn't be a big issue if you just want a model to maybe make simple components, do some coding, or maybe for just general chat about questions and stuff. It will surely come in handy. That's why I thought to tell you guys that you can set this up in different coders and tools and use it in different styles. It has very low rate limits and is fully usable without ever really hitting any kind of rate limits. So, this is pretty great. So, let's get into it and let me show you how it all works. But before proceeding, let me tell you about Ninjachat. Ninjachat is an all-in-one AI platform where, for just $11 per month, you get access to top AI models like GPT-4o, Claude-4 Sonnet, and Gemini-2.5 Pro, all in one place. I've been using Gemini for quick research. But what's really cool is their AI Playground where you can compare responses from different models side-by-side. Their mind map generator is a game changer for organizing complex ideas as well. The basic plan gives you 1,000 messages, 30 images, and 5 videos monthly, with higher tiers available if you need more. Use my code KING25 for 25% off any plan or KING40YEARLY for 40% off annual subscriptions. Check the link in description to try it yourself. Now, back to the video. To start, you'll have to head on over to Open Router. Here, you'll need to go into the settings and then into the training option. You'll see some options here. You need to enable the free endpoints that may publish prompts option. Once you have enabled this, just search for the Open Inference provider and you'll see it there. This will open up the page where you can see the models that are being provided. You get DeepSeek V3.1, GPT-OSS-120B, Qwen3-Coder-480B-A35B, and MoonshotAI Kimi K2 0711 as well. So, these are quite good. DeepSeek here is not the Terminus model, which is kinda bad, but I hope it is updated. However, you still get Qwen3-Coder and Kimi as well. I think Qwen3-Coder or Kimi might be the best bet for coding. However, DeepSeek is also not bad. It's pretty good even in the previous version. So yeah, it's kinda cool for sure. Now, you can use it quite easily in things like Kilocode, RuCode, and stuff like that. So, just head on over and you can easily install Kilocode, which is what I'll recommend. Then head on over to settings, select the Open Router option, and enter your API key that you get from Open Router. After that, you can select the DeepSeek-Chat Free option, and it will automatically first prioritize the provider who doesn't log even in the free tier. Like Shoots has a free tier for some models, but they are pretty rate-limited. So, it will use that until its rate limit is exhausted and then continue using it. That's great. Anyway, you can just set the model here and then you can use it accordingly. I would recommend the Qwen3-Coder model as it's pretty good and pretty fast as well. You can go ahead and use it, and there's not much of a rate limit either, which is pretty great for sure. Now, this is one of those things which you wouldn't generally want to use in something like your pre-existing code base because it will be used for training. So, it's not really recommended. However, you can use it for things that don't matter as much. So, I'll recommend that you can use it with things like Quest. Quest is like an open-source alternative to Bolt. I have a video on it, but what it basically does is allow you to make one-shot apps quite easily. And in one-shot apps that are made from scratch, it isn't something that at least I'm that paranoid about. So, what you can do is just get it installed, go to settings, and in the provider section, set up the Open Router option with your API key. Then, you can select the free model as well, and you can go ahead and use it. I think you can squeeze a lot out of these free options by using them for trivial tasks that are not as important and not something you're paranoid about. You can also use it with things like Bolt DIY or Dyad as well. Dyad is a bit more fleshed out than Quest, but it's a little more memory hungry. So, it can come in handy there too. You can also set it up in some kind of chat interface as well. For example, I've been using one called January. So, we can just go there, configure Open Router, and then use it for simple chat as well. It comes in quite handy, like for doing some simple web searches or stuff like that. And you're also directly contributing to public data sets that will help out open model creators who don't have the resources to buy huge data sets like Anthropic, who had to pay a $1.5 billion settlement. So yeah, this will come in handy for those model creators. That's majorly about it. You can go ahead and use it all you want to build stuff, do simple chat, and just use it in places where the responses don't matter as much if they become public. I mean, it's always great to have these free options in your arsenal to use them in places where you don't really want to pay or for just checking a model's performance. It also comes in handy for me when I do benchmarking, because the eval sets are public anyway. So yeah, it has a ton of use cases, and I just wanted to show it off and how you can use these as well. It's on Open Router. So, it shouldn't be an issue to use it as most of them support it. Go ahead and use it. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "yNYzCnkY-MY",
        "title": "Why AlphaZero Wasn&#39;t Surprising - Richard Sutton",
        "content": "",
        "url": "https://www.youtube.com/watch?v=yNYzCnkY-MY",
        "publishDate": "2025-09-27T22:54:04Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/yNYzCnkY-MY/hqdefault.jpg",
            "transcription": "When AlphaZero became this viral sensation to you as somebody who literally came up with many of the techniques that were used, did it feel to you like new breakthroughs were made or does it feel like, \"Oh, we've had these techniques since the 90s and people are simply combining them and applying them now.\" So the whole AlphaGo thing had a precursor, which is TD-Gammon. Jerry Tesauro did exactly reinforcement learning, Temporal Difference Learning, methods to play Backgammon. Right. And it beat the world's best players, and it worked really well. And so, in some sense, AlphaGo was as merely a scaling up of that process. It wasn't surprising in that sense. AlphaGo actually didn't use TD-learning. It waited to see the final outcomes. But AlphaZero used TD, and AlphaZero was applied to all the other games and that did extremely well. I've always been very impressed by the way AlphaZero plays chess, because I'm a chess player, and it just sacrifices material for sort of positional advantages. And it's just content and patient to sacrifice that material for a long period of time. So that was surprising that it worked so well, but also gratifying. WATCH HERE."
        }
    }
]