[
    {
        "id": "https://news.smol.ai/issues/25-10-08-not-much/",
        "title": "not much happened today",
        "content": "**Samsung's 7M Tiny Recursive Model (TRM)** achieves superior reasoning on ARC-AGI and Sudoku with fewer layers and MLP replacing self-attention. **LeCun's team** introduces **JEPA-SCORE**, enabling density estimation from encoders without retraining. **AI21 Labs** releases **Jamba Reasoning 3B**, a fast hybrid SSM-Transformer model supporting up to 64K context tokens. **Alibaba's Qwen3 Omni/Omni Realtime** offers a unified audio-video-text model with extensive language and speech support, outperforming Gemini 2.0 Flash on BigBench Audio. **Alibaba** also debuts **Qwen Image Edit 2509**, a top open-weight multi-image editing model. **ColBERT Nano** models demonstrate effective retrieval at micro-scale parameter sizes. In reinforcement learning, **CoreWeave**, **Weights & Biases**, and **OpenPipe** launch serverless RL infrastructure reducing costs and speeding training. **Stanford's AgentFlow** presents an in-the-flow RL system with a 7B backbone outperforming larger models on agentic tasks. This update highlights advances in **recursive reasoning**, **density estimation**, **multimodal architectures**, **long-context modeling**, **retrieval**, and **serverless reinforcement learning**.",
        "url": "https://news.smol.ai/issues/25-10-08-not-much/",
        "publishDate": "2025-10-08T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "samsung, lecuun, ai21-labs, alibaba, coreweave, weights-biases, openpipe, stanford, 7m-tiny-recursive-model, jamba-reasoning-3b, qwen3-omni, qwen-image-edit-2509, colbert-nano, agentflow, rasbt, jm_alexia, jiqizhixin, randall_balestr, corbtt, shawnup, _akhaliq, recursive-reasoning, density-estimation, multimodality, long-context, retrieval, serverless-reinforcement-learning, agentic-systems, model-efficiency, reinforcement-learning, transformers"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109804",
        "title": "Samsung’s tiny AI model beats giant reasoning LLMs",
        "content": "<p>A new paper from a Samsung AI researcher explains how a small network can beat massive Large Language Models (LLMs) in complex reasoning. In the race for AI supremacy, the industry mantra has often been &#8220;bigger is better.&#8221; Tech giants have poured billions into creating ever-larger models, but according to Alexia Jolicoeur-Martineau of Samsung SAIL [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/samsung-tiny-ai-model-beats-giant-reasoning-llms/\">Samsung’s tiny AI model beats giant reasoning LLMs</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/samsung-tiny-ai-model-beats-giant-reasoning-llms/",
        "publishDate": "2025-10-08T11:55:19Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Deep Dives, Features, How It Works, ai, artificial intelligence, benchmarks, models, samsung, tiny recursive model"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109798",
        "title": "Tuned Global strengthens its leadership in music technology with the acquisition of Figaro.ai",
        "content": "<p>The acquisition underscores Tuned Global’s commitment to shaping the future of the music industry by empowering clients with innovative technology and unmatched execution, while continuing to support existing Figaro.ai customers. Wednesday, 8 October, 2025 — Tuned Global, the leading music and media technology platform, has today announced the acquisition of Figaro.ai (by FeedForward), a London-based [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/tuned-global-strengthens-its-leadership-in-music-technology-with-the-acquisition-of-figaro-ai/\">Tuned Global strengthens its leadership in music technology with the acquisition of Figaro.ai</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/tuned-global-strengthens-its-leadership-in-music-technology-with-the-acquisition-of-figaro-ai/",
        "publishDate": "2025-10-08T10:37:29Z[Etc/UTC]",
        "author": "Tuned Global",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI Business Strategy, Sponsored Content"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109632",
        "title": "AI Redaction That Puts Privacy First: CaseGuard Studio Leading The Way",
        "content": "<p>Law enforcement, law firms, hospitals, and financial institutions are asked every day to release records, which can contain highly sensitive details – including addresses, social security numbers, medical diagnoses, evidence footage, and children’s identities. To meet compliance and security requirements, staff spend hundreds of hours manually redacting sensitive information, yet when that process goes wrong, [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/ai-redaction-that-puts-privacy-first-caseguard-studio-leading-the-way/\">AI Redaction That Puts Privacy First: CaseGuard Studio Leading The Way</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/ai-redaction-that-puts-privacy-first-caseguard-studio-leading-the-way/",
        "publishDate": "2025-10-08T09:07:44Z[Etc/UTC]",
        "author": "Joe Green",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Computer Vision, Education AI, Government & Public Sector AI, Healthcare & Wellness AI, Sponsored Content, World of Work, computer vision, data sovereignty, governance, redaction"
        }
    },
    {
        "id": "1o24e87",
        "title": "Sora2 is Tab Clear",
        "content": "\nIn the 90s, Crystal Pepsi was a hit until Coca-Cola released Tab Clear, a clear diet soda meant to confuse consumers into thinking Crystal Pepsi was also a diet drink. The strategy worked, and both products disappeared within six months.\n\nNow, Sora 2 is flooding the internet with AI generated content, eroding trust in real videos. Its effect could be similar… as Tab Clear destroyed Crystal Pepsi and ended the clear soda trend, Sora 2 could make people abandon platforms like TikTok by making all short-form video feel inauthentic.\n\nI know that I no longer believe the amazing videos that I see, and that ruined the appeal for me.  What is your opinion of short form videos now that everything is suspect?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o24e87/sora2_is_tab_clear/",
        "publishDate": "2025-10-09T12:19:32Z[Etc/UTC]",
        "author": "Enormous-Angstrom",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o23yb6",
        "title": "Every Word a Bridge: Language as the First Relational Technology",
        "content": "This essay explores what happens when we design systems that speak - and how language, tone, and continuity shape not just user experience, but **trust, consent, and comprehension**.\n\nIt argues that language is not a neutral interface. It’s a **relational technology** \\- one that governs how humans understand intention, safety, and presence. When an AI system’s voice shifts mid-conversation - when attentiveness dims or tone changes without warning - users often describe a sudden loss of coherence, even when the words remain technically correct.\n\nThe piece builds on ideas from relational ethics, distributed cognition, and HCI to make a core claim:  \n**The way a system speaks is part of what it** ***does***\\*\\*.\\*\\* And when dialogue becomes inconsistent, extractive, or evasive, it breaks more than the illusion - it breaks the relational field that supports trust and action.\n\nIt touches on implications for domains like healthcare, education, and crisis support, where even small tonal shifts can lead to real-world harm.\n\nI’d love to hear perspectives from others working in AI ethics, law, HCI, and adjacent fields - especially around how we might embed relation more responsibly into design.  \n  \n[Every Word a Bridge: Language as the First Relational Technology](https://medium.com/@miravale.interface/every-word-a-bridge-language-as-the-first-relational-technology-6a50c6fa693d)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o23yb6/every_word_a_bridge_language_as_the_first/",
        "publishDate": "2025-10-09T11:58:01Z[Etc/UTC]",
        "author": "tightlyslipsy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o23wst",
        "title": "1 in 5 high schoolers has had a romantic AI relationship, or knows someone who has",
        "content": "\"New survey data finds that nearly 1 in 5 high schoolers say they or someone they know has had a romantic relationship with artificial intelligence. And 42% of students surveyed say they or someone they know have used AI for companionship.\n\nThat's according to [new research](https://cdt.org/insights/hand-in-hand-schools-embrace-of-ai-connected-to-increased-risks-to-students/) from the Center for Democracy and Technology (CDT), a nonprofit that advocates for civil rights, civil liberties and responsible use of data and technology.\n\nCDT conducted national surveys of roughly 800 sixth through 12th grade public school teachers, 1,000 ninth through 12th grade students and 1,000 parents. The vast majority — 86% of students, 85% of educators and 75% of parents — say they used AI during the last school year.\"  \n  \n[https://www.npr.org/2025/10/08/nx-s1-5561981/ai-students-schools-teachers](https://www.npr.org/2025/10/08/nx-s1-5561981/ai-students-schools-teachers)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o23wst/1_in_5_high_schoolers_has_had_a_romantic_ai/",
        "publishDate": "2025-10-09T11:55:51Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o23j7u",
        "title": "Most common phrase prediction for the internet of 2026",
        "content": "Phrase: \"Is this ai?\" \n\nI have noticed a concerning new fear of mine, every somewhat unique video I watch now, the question that pops up is: \"is this ai?\"\n\nBefore it was very easy to identify ai slop, then it transitioned to: \"ok, I see how my grandmother would fall for this\" to now being in a position where I myself ask the question: \"is this ai?\"\n\nAny predictions on what the most common phrase on the internet of 2027 will be?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o23j7u/most_common_phrase_prediction_for_the_internet_of/",
        "publishDate": "2025-10-09T11:36:10Z[Etc/UTC]",
        "author": "PR0GRAMR",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o22ho5",
        "title": "China proposes global drive to build AI-powered satellite mega network for all",
        "content": "[https://www.scmp.com/news/china/science/article/3327721/china-proposes-global-drive-build-ai-powered-satellite-mega-network-all](https://www.scmp.com/news/china/science/article/3327721/china-proposes-global-drive-build-ai-powered-satellite-mega-network-all)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o22ho5/china_proposes_global_drive_to_build_aipowered/",
        "publishDate": "2025-10-09T10:38:09Z[Etc/UTC]",
        "author": "bonez001_alpha",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o22hco",
        "title": "Why is ChatGPT free?",
        "content": "I am not complaining or anything and I know there is a paid version, but it is still weird to me that they have a free, pretty much fully working version free for the public when you consider how expensive it is to train and run ai services.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o22hco/why_is_chatgpt_free/",
        "publishDate": "2025-10-09T10:37:39Z[Etc/UTC]",
        "author": "Nikmcmuffin",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o226o2",
        "title": "What do you think of “Sutskever’s List”? The rumored reading list that covers “90% of what matters” in AI",
        "content": "Hi r/ArtificialInteligence,\n\nStjepan from Manning here. Hope I can get your opinion on this.\n\nThere’s a bit of AI lore that’s been floating around for a while called **“Sutskever’s List.”**  \nAccording to the story, Ilya Sutskever once gave **John Carmack** a reading list of foundational AI papers and said something along the lines of: “If you master these, you’ll understand 90% of what matters in AI today.”\n\nThe list itself has never been formally published, but a few reconstructed versions are floating around on GitHub and blogs — covering everything from early CNNs and RNNs to attention mechanisms, self-supervised learning, and scaling laws.\n\nWhat’s interesting is how *small* and *focused* the list is compared to the ocean of new AI papers coming out daily. It’s more like a distillation of the “core mental models” behind modern deep learning rather than an exhaustive syllabus.\n\nCurious what people here think:\n\n* Have you looked at or worked through Sutskever’s List (or one of its reconstructions)?\n* Do you agree that mastering those papers gives a strong foundation for modern AI work?\n* If you were to **update or extend the list in 2025**, what would you add? (Maybe something on agentic architectures, Mixture of Experts, or new fine-tuning paradigms?)\n\nWould love to hear how others interpret the idea — especially folks doing research or building systems day to day. Does a “core list” like this still make sense in the era of rapid iteration and model soup?\n\nThank you all.\n\nCheers,",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o226o2/what_do_you_think_of_sutskevers_list_the_rumored/",
        "publishDate": "2025-10-09T10:19:47Z[Etc/UTC]",
        "author": "ManningBooks",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o20tww",
        "title": "Entry-level workers are facing a ‘job-pocalypse’ due to companies favouring AI",
        "content": "From today's Guardian:\n\n**Entry-level workers are facing a ‘job-pocalypse’ due to companies favouring artificial intelligence systems over new hires, a new study of global business leaders shows.**\n\nA new report by the **British Standards Institution (BSI)** has found that business leaders are prioritising automation through AI to fill skills gaps, in lieu of training for junior employees.\n\nThe BSI polled more than 850 bosses in Australia, China, France, Germany, Japan, the UK, and the US, and found that 41% said [AI is enabling headcount reductions](https://www.theguardian.com/business/2025/jul/13/could-ai-be-accelerating-slowdown-in-the-uk-job-market). Nearly a third of all respondents reported that their organization now explores AI solutions before considering hiring a human.\n\nTwo-fifths of leaders revealed that entry-level roles have already been reduced or cut due to efficiencies made by AI conducting research, admin and briefing tasks, and 43% expect this to happen in the next year.\n\n**Susan Taylor Martin,** CEO of **BSI** says:\n\n*“AI represents an enormous opportunity for businesses globally, but as they chase greater productivity and efficiency, we must not lose sight of the fact that it is ultimately people who power progress.*\n\n*Our research makes clear that the tension between making the most of AI and enabling a flourishing workforce is the defining challenge of our time. There is an urgent need for long-term thinking and workforce investment, alongside investment in AI tools, to ensure sustainable and productive employment.”*\n\nWorryingly for those trying to enter the jobs market, a quarter of business leaders said they believe most or all tasks done by an entry-level colleague could be performed by AI.\n\nA third suspect their own first job would not exist today, due to the rise of artificial intelligence tools.\n\nAnd… 55% said they felt that the benefits of implementing AI in organizations would be worth the disruptions to workforces.\n\nThese findings will add to concerns that graduates face a workforce crisis as they battle AI in the labour market. A poll released in August found that half of UK adults fear AI will change, or eliminate, their jobs.\n\n[https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news](https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o20tww/entrylevel_workers_are_facing_a_jobpocalypse_due/",
        "publishDate": "2025-10-09T08:51:41Z[Etc/UTC]",
        "author": "Goooooner4Life",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o20s65",
        "title": "Nvidia is literally paying its customers to buy its own chips and nobody's talking about it",
        "content": "ok this is actually insane and I can't believe this isn't bigger news.\n\nSo Nvidia just agreed to give OpenAI $100 billion. Sounds normal right? Big investment in AI. Except here's what OpenAI does with that money. They turn around and buy Nvidia chips with it.\n\nRead that again. Nvidia is giving a company $100 billion so that company can buy Nvidia products. And Wall Street is just cool with this apparently?\n\nBut that's just the start. I found [this](https://www.bain.com/insights/how-can-we-meet-ais-insatiable-demand-for-compute-power-technology-report-2025/) Bain report that nobody's really covered and the numbers are absolutely fucked. They calculated that by 2030 AI companies need to make $2 trillion in revenue just to cover what they're spending on infrastructure. Their realistic projection? These companies will make $1.2 trillion.\n\nThey're gonna be $800 billion short. Not million. Billion with a B.\n\nAnd it gets dumber. OpenAI is gonna burn $115 billion by 2029. They've never made a profit. Not once. But they're somehow valued at $500 billion which makes them literally the most valuable company in human history that's never turned a profit.\n\nSam Altman keeps saying they need trillions for infrastructure. Zuckerberg's spending hundreds of billions on data centers. And for what? MIT just published research showing 95% of companies that invested in AI got absolutely nothing back. Zero ROI. Then Harvard found that AI is actually making workers LESS productive because they're creating garbage content that wastes everyone's time.\n\nEven the tech isn't working how they said it would. Remember when GPT-5 was supposed to be this huge leap? It came out and everyone was like oh that's it? Altman literally admitted they're \"missing something important\" to get to AGI. The whole plan was throw more compute at it and it'll get smarter and that's just not happening anymore.\n\nMeanwhile Chinese companies are building models for like 1% of what US companies spend. So even if this works the margins are cooked.\n\nThe debt situation is actually scary. Meta borrowed $26 billion for ONE data center. Banks are putting together a $22 billion loan for more data centers. OpenAI wants to do debt financing now instead of just taking Microsoft's money. This is all borrowed money betting on a future that might not happen.\n\nThis is exactly what happened in 1999 with telecom companies and fiber optic cables. They all built massive infrastructure betting demand would show up. Most of them went bankrupt.\n\nOpenAI's CFO literally suggested charging people $2000 a month for ChatGPT in the future. Two thousand dollars a month. That's their plan to make the math work.\n\nWe already got a preview in January when DeepSeek dropped a competitive model that cost almost nothing to build. The market lost a trillion dollars in value in one day. Nvidia crashed 17%. Then everyone just went back to pretending everything's fine.\n\nEven the bulls know this is cooked. Zuckerberg straight up said this is probably a bubble but he's more scared of not spending enough. Altman admitted investors are overexcited. Jeff Bezos called it an industrial bubble. They all know but they can't stop because if you stop spending and your competitors don't you're dead.\n\nChatGPT has 700 million users a week which sounds amazing until you realize they lose money on every single person who uses it. The entire business model is lose money now and hope you can charge enough later to make it back.\n\nI'm calling it now. This is gonna be worse than dot-com. Way worse. Some companies will survive but most of this is going to zero and a lot of very smart people are gonna lose absolutely stupid amounts of money.\n\nTLDR: Nvidia just invested $100B in OpenAI who then uses that money to buy Nvidia chips. AI companies will be $800B short of breaking even by 2030. MIT found 95% of companies got zero ROI from AI. This is about to get ugly.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o20s65/nvidia_is_literally_paying_its_customers_to_buy/",
        "publishDate": "2025-10-09T08:48:15Z[Etc/UTC]",
        "author": "reddit20305",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "71",
            "commentCount": "94",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1znd4",
        "title": "How are production AI agents dealing with bot detection? (Serious question)",
        "content": "# The elephant in the room with AI web agents: How do you deal with bot detection?\n\nWith all the hype around \"computer use\" agents (Claude, GPT-4V, etc.) that can navigate websites and complete tasks, I'm surprised there isn't more discussion about a fundamental problem: **every real website has sophisticated bot detection that will flag and block these agents.**\n\n# The Problem\n\nI'm working on training an RL-based web agent, and I realized that the gap between research demos and production deployment is massive:\n\n**Research environment:** WebArena, MiniWoB++, controlled sandboxes where you can make 10,000 actions per hour with perfect precision\n\n**Real websites:** Track mouse movements, click patterns, timing, browser fingerprints. They *expect* human imperfection and variance. An agent that:\n\n* Clicks pixel-perfect center of buttons every time\n* Acts instantly after page loads (100ms vs. human 800-2000ms)\n* Follows optimal paths with no exploration/mistakes\n* Types without any errors or natural rhythm\n\n...gets flagged immediately.\n\n# The Dilemma\n\nYou're stuck between two bad options:\n\n1. **Fast, efficient agent** → Gets detected and blocked\n2. **Heavily \"humanized\" agent with delays and random exploration** → So slow it defeats the purpose\n\nThe academic papers just assume unlimited environment access and ignore this entirely. But Cloudflare, DataDome, PerimeterX, and custom detection systems are everywhere.\n\n# What I'm Trying to Understand\n\n**For those building production web agents:**\n\n* How are you handling bot detection in practice? Is everyone just getting blocked constantly?\n* Are you adding humanization (randomized mouse curves, click variance, timing delays)? How much overhead does this add?\n* Do Playwright/Selenium stealth modes actually work against modern detection, or is it an arms race you can't win?\n* Is the Chrome extension approach (running in user's real browser session) the only viable path?\n* Has anyone tried training agents with \"avoid detection\" as part of the reward function?\n\n**I'm particularly curious about:**\n\n* Real-world success/failure rates with bot detection\n* Any open-source humanization libraries people actually use\n* Whether there's ongoing research on this (adversarial RL against detectors?)\n* If companies like Anthropic/OpenAI are solving this for their \"computer use\" features, or if it's still an open problem\n\n# Why This Matters\n\nIf we can't solve bot detection, then all these impressive agent demos are basically just expensive ways to automate tasks in sandboxes. The real value is agents working on actual websites (booking travel, managing accounts, research tasks, etc.), but that requires either:\n\n1. Websites providing official APIs/partnerships\n2. Agents learning to \"blend in\" well enough to not get blocked\n3. Some breakthrough I'm not aware of\n\nAnyone dealing with this? Any advice, papers, or repos that actually address the detection problem? Am I overthinking this, or is everyone else also stuck here?\n\n\n\n*Posted because I couldn't find good discussions about this despite \"AI agents\" being everywhere. Would love to learn from people actually shipping these in production.*",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1znd4/how_are_production_ai_agents_dealing_with_bot/",
        "publishDate": "2025-10-09T07:29:35Z[Etc/UTC]",
        "author": "Raise_Fickle",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1zdbf",
        "title": "AI isn't production ready - a rant",
        "content": "I'm very frustrated today so this post is a bit of a vent/rant. This is a long post and it  !! WAS NOT WRITTEN BY AI !!\n\nI've been an adopter of generative AI for about 2 1/2 years. I've produced several internal tools with around 1500 total users that leverage generative AI. I am lucky enough to always have access to the latest models, APIs, tools, etc.\n\nHere's the thing. Over the last two years, I have seen the output of these tools \"improve\" as new models are released. However, objectively, I have also found several nightmarish problems that have made my life as a software architect/product owner a living hell\n\n**First, Model output changes, randomly. This is expected. However, what \\*isn't\\* expected is how wildly output CAN change.**\n\nFor example, one of my production applications explicitly passes in a JSON Schema and some natural language paragraphs and basically says to AI, \"hey, read this text and then format it according to the provided schema\". Today, while running acceptance testing, it decided to stop conforming to the schema 1 out of every 3 requests. To fix it, I tweaked the prompts. Nice! That gives me a lot of confidence, and I'm sure I'll never have to tune those prompts ever again now! \n\nAnother one of my apps asks AI to summarize a big list of things into a  \"good/bad\" result (this is very simplified obviously but that's the gist of it). Today? I found out that maybe around 25% of the time it was *returning a different result based on the same exact list*.\n\nAnother common problem is tool calling. Holy shit tool calling sucks. I'm not going to use any vendor names here but *one in particular* will fail to call tools based on extremely minor changes in wording in the prompt. \n\n**Second, users have correctly identified that AI is adding little or no value**\n\nAll of my projects use a combination of programmatic logic and AI to produce some sort of result. Initially, there was a ton of excitement about the use of AI to further improve the results and the results \\*look\\* really good. But, after about 6 months in prod for each app, reliably, I have collected the same set of feedback: users don't read AI generated...anything, because they have found it to be too inaccurate, and in the case of apps that can call tools, the users will call the tools themselves rather than ask AI to do it because, again, they find it too unreliable.\n\n**Third, there is no attempt at standardization or technical rigor for several CORE CONCEPTS**\n\nEvery vendor has it's own API standard for \"generate text based on these messages\". At one point, most people were implementing the OpenAI API, but now everyone has their own standard.\n\nNow, anyone that has ever worked with any of the AI API's will understand the concept of \"roles\" for messages. You have system, user, assistant. That's what we started with. but what do the roles do? How to they affect the output? Wait, there are \\*other\\* roles you can use as well? And its all different for every vendor? Maybe it's different *per model???* What the fuck?\n\nHere's another one; you would have heard the term RAG (retrieval augmented generation) before. Sounds simple! Add some data at runtime to the user prompts so the model has up to date knowledge. Great! *How* do you do that? Do you put it in the user prompt? Do you create a dedicated message for it? Do you format it inside XML tags? What about structured data like json? How much context should you add? Nobody knows!! good luck!!!\n\n**Fourth: Model responses deteriorate based on context sizes** \n\nThis is well known at this point but guess what, it's actually a \\*huge problem\\* when you start trying to actually describe real world problems. Imagine trying to describe to a model how SQL works. *You can't*. It'll completely fail to understand it because the description will be way too long and it'll start going loopy. In other words, as soon as you need to educate a model on something outside of it's training data it will fail unless it's very simplistic. \n\n**Finally: Because of the nature of AI, none of these problems appear in Prototypes or PoCs.**\n\nThis is, by far, the biggest reason I won't be starting any more AI projects until there is a significant step forward. You will NOT run into any of the above problems until you start getting actual, real users and actual data, by which point you've burned a ton of time and manpower and sunk cost fallacy means you can't just shrug your shoulders and be like R.I.P, didn't work!!! \n\nAnyway, that's my rant. I am interested in other perspectives which is why I'm posting it. You'll notice I didn't even mention MCP or \"Agentic handling\" because, honestly, that would make this post double the size at least and I've already got a headache.\n\n\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1zdbf/ai_isnt_production_ready_a_rant/",
        "publishDate": "2025-10-09T07:11:11Z[Etc/UTC]",
        "author": "ahspaghett69",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "32",
            "commentCount": "40",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ycyo",
        "title": "I believe we’re 10-30 years away",
        "content": "We are 10-30 years away from one of two things. \n1) an absolute utopia. \n2) an absolute dystopia\n\nLet’s be optimistic first. Utopia: The world is run but AI super intelligence that is infinitely smarter than humans, in which we have no understanding of it. However, this has given every person on earth free healthcare, UBI, and the freedom to love, have artistic expression, and live in whichever way they want without the concept of monetary gain or power. \n\nDystopia: AI has taken over with the same level of super intelligence; however, it uses its power only in a selfish manor. It sees humans as an obstacle, a bad use of recourses, energy, and atoms. It removes us, whether that’s painlessly or not. Its goals are far beyond our comprehension, and we have to way to fight against it. This model is based off of the politicians and billionaires that created it.\n\nTo achieve a utopia we must fight the evil leaders that rule our current world. American leaders have done nothing but create vast wealth separation for the last 30+ years. They’ve focused on obnoxious military budgets rather than healthcare and social services. Billionaires will be the only reason we don’t see this utopia. We are at the beginning 1% of what AI will very soon become. Our fate is in our hands, let’s choose a good future full of love, happiness, and (in my case) heavily modifying 1990s german hot hatches. \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ycyo/i_believe_were_1030_years_away/",
        "publishDate": "2025-10-09T06:05:38Z[Etc/UTC]",
        "author": "Danny_Rooney",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1x9j7",
        "title": "One-Minute Daily AI News 10/8/2025",
        "content": "1. New tool from MIT CSAIL creates realistic virtual kitchens and living rooms where simulated robots can interact with models of real-world objects, scaling up training data for robot foundation models.\\[1\\]\n2. Women portrayed as younger than men online, and AI amplifies the bias.\\[2\\]\n3. People are using ChatGPT as a lawyer in court. Some are winning.\\[3\\]\n4. Markets face ‘sharp correction’ if mood sours on AI or Fed freedom, Bank of England says.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/10/08/one-minute-daily-ai-news-10-8-2025/](https://bushaicave.com/2025/10/08/one-minute-daily-ai-news-10-8-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1x9j7/oneminute_daily_ai_news_1082025/",
        "publishDate": "2025-10-09T04:59:24Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1x6wq",
        "title": "AI devs: what’s the “this shouldn’t work, but somehow it does” hack you’ve actually shipped?",
        "content": "I’ve noticed that sometimes the most ridiculous shortcuts or hacks just… work. You know, the kind of thing that would make any academic reviewer rage if they saw it, but it actually solves the problem.\n\nI’m talking about stuff like:  \n\\- Gluing together multiple model outputs in a way that shouldn’t logically make sense, yet somehow improves accuracy  \n\\- Sneaky prompt tricks that exploit quirks in LLMs  \n\\- Workarounds that no one on the team dares admit are “temporary fixes”\n\nSo, spill it. What’s the wild hack in your stack that’s officially 'not supposed to work' but keeps running in production anyway?\n\n***Bonus points if it makes your code reviewers cry.***",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1x6wq/ai_devs_whats_the_this_shouldnt_work_but_somehow/",
        "publishDate": "2025-10-09T04:55:11Z[Etc/UTC]",
        "author": "biz4group123",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1wydo",
        "title": "concerned for our future with ai",
        "content": "i would like to start by saying i am not a professionnal in the subject of artificial intelligence. I tried to make my post as okay as possible to not have it taken down, but i am someone concerned, looking for answers and most of the members of this space seem very well-informed on that topic. i am currently a college student. anytime i turn my head somewhere, i see another student using an ai, wheter it's studley, chatgpt, gemini, claude, turbo... i'm not ai-free either, i use it too. but these past few weeks, i've been really questionning myself on what's next for our intellectual, our creativity, also our environnment and our jobs. As a student, it seems like no task is doable without ai anymore. that's what the instagram and tiktok ads try to make us think, at least. \"how i got a 4.0 gpa and barely studied\" and it's turbo ai. how people need it to write emails, or use grammarly for their thesis or just any text necessary. but using these tools, we are also forgetting how to apply knowledgeable assets of our life, belitteling our intelligence to prioritise efficiency. not to mention a majority of ai is forced down our throat sometimes, like the answers after any google search. i notice the field of art too, that is slowly in competition with ai images perfectly copying certain styles. also business management ai assistants. lastly, the environmental impact ai usage has on our planet seems also concerning, to me at least. i'm not complaining of the use of ai, because if i wanted to complain, i would simply go on X. but i am concerned, and worried that we're becoming lazy. \n\ni am looking for insight, from people who know way more than i do in the field. is ai become a threat because of poor management from companies? is the work field forever damaged? are there ways we can go back to the ai-less wirld, at least for non-researchers, or will we only become more and more dependent? i don't mean to seem negative, although i know i am, but i am seriously concerned for my future and need honest opinion. sorry for the rant.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1wydo/concerned_for_our_future_with_ai/",
        "publishDate": "2025-10-09T04:41:32Z[Etc/UTC]",
        "author": "Nice_Profit_7474",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1wsmj",
        "title": "Big Tech is burning $10 billion per company on AI and it's about to get way worse",
        "content": "So everyone's hyped about ChatGPT and AI doing cool stuff right? Well I just went down a rabbit hole on what this is actually costing and holy shit we need to talk about this.\n\nMicrosoft just casually dropped that they spent $14 billion in ONE QUARTER on AI infrastructure. That's a 79% jump from last year. Google? $12 billion same quarter, up 91%. Meta straight up told investors \"yeah we're gonna spend up to $40 billion this year\" and their stock tanked because even Wall Street was like wait what.\n\nBut here's the actually insane part. The CEO of Anthropic (they make Claude) said current AI models cost around $100 million to train. The ones coming out later this year? $1 billion. By 2026 he's estimating $5 to $10 billion PER MODEL.\n\nLet me put that in perspective. A single Nvidia H100 chip that you need to train these models costs $30,000. Some resellers are charging way more. Meta said they're buying 350,000 of them. Do the math. That's over $10 billion just on chips and that's assuming they got a discount.\n\nAnd it gets worse. Those chips need somewhere to live. These companies are building massive data centers just to house this stuff. The average data center is now 412,000 square feet, that's five times bigger than 2010. There are over 7,000 data centers globally now compared to 3,600 in 2015.\n\nOh and if you want to just rent these chips instead of buying them? Amazon charges almost $100 per hour for a cluster of H100s. Regular processors? $6 an hour. The AI tax is real.\n\nHere's what nobody's saying out loud. These companies are in an arms race they can't back out of. Every time someone makes a bigger model everyone else has to match it or fall behind. OpenAI is paying tens of millions just to LICENSE news articles to train on. Google paid Reddit $60 million for their data. Netflix was offering $900,000 salaries for AI product managers.\n\nThis isn't sustainable but nobody wants to be the first one to blink. Microsoft's now trying to push smaller cheaper models but even they admit the big ones are still the gold standard. It's like everyone knows this is getting out of control but they're all pot committed.\n\nThe wildest part? All this spending and most AI products still barely make money. Sure Microsoft and Google are seeing some cloud revenue bumps but nothing close to what they're spending. This is the biggest bet in tech history and we're watching it play out in real time.\n\nAnyway yeah that's why your ChatGPT Plus subscription costs $20 a month and they're still probably losing money on you.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1wsmj/big_tech_is_burning_10_billion_per_company_on_ai/",
        "publishDate": "2025-10-09T04:32:22Z[Etc/UTC]",
        "author": "reddit20305",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "334",
            "commentCount": "207",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1wpzn",
        "title": "Google AI Overview in 2025 is the equivalent to Wikipedia in the early 2000’s.",
        "content": "I just think the paradox is hilarious in the sense that we’ve progressed so far in the technology world yet still have major sources giving inaccurate facts only this time it’s not humans typing them out. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1wpzn/google_ai_overview_in_2025_is_the_equivalent_to/",
        "publishDate": "2025-10-09T04:28:09Z[Etc/UTC]",
        "author": "itsmichellelol",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1wa7g",
        "title": "What is the most capable open source model for writing a business plan",
        "content": "Seems kind of stupid to use ChatGPT, Gemini, Meta or Grok hosted solutions for this. I want to have a long session about this and work on it in pieces until it’s solid and complete. \n\nBeing able to produce csv, JSON or excel native files would be a requirement. \n\n\nWhat do you guys think?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1wa7g/what_is_the_most_capable_open_source_model_for/",
        "publishDate": "2025-10-09T04:03:09Z[Etc/UTC]",
        "author": "Developer_Track",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1w64b",
        "title": "Fake Protest Videos Are the Latest AI Slop to Go Viral in MAGA World",
        "content": "What a timeline we are living in\n\nhttps://gizmodo.com/fake-protest-videos-are-the-latest-ai-slop-to-go-viral-in-maga-world-2000669656",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1w64b/fake_protest_videos_are_the_latest_ai_slop_to_go/",
        "publishDate": "2025-10-09T03:57:05Z[Etc/UTC]",
        "author": "Mathemodel",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1rdq6",
        "title": "Medical School - Bad Idea?",
        "content": "There have been countless people (Bernie Sanders, Bill Gates, Elon Musk) saying that within the next 10-20 years jobs will either be obsolete, cut in half, or completely changed because of AI. It’s not unique to medicine but medicine requires going into significant debt and training for 7+ years which is unique. I would really like to apply next cycle but it seems like these are unprecedented times where a job that used to be extremely secure is now a coin flip as to whether it will exist or not. I’m a career switcher and have the potential to go back into my previous field but I’ve put 2 years into my postbacc and built a solid application and think I would love to be in medicine if it doesn’t implode by the time I finish training. I find it difficult to justify applying considering all of this and the fortunate position I am in to go back to a previous career (though i’d rather not). Sorry for the negativity but I don’t want to lie to myself about what might happen. Just wanted to hear others thoughts on this and what they would do given my position? Appreciate it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1rdq6/medical_school_bad_idea/",
        "publishDate": "2025-10-08T23:59:55Z[Etc/UTC]",
        "author": "emp986",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1qh72",
        "title": "When will “Human Verified” social platforms show up?",
        "content": "AI Generation has finally reached a point where it is pretty much impossible to tell that something is AI just from a glance. AI doesn’t hold up to even the lowest effort of analysis so it is pretty easy to know something is AI Generated. That’s why I believe we are still far away from everything on the internet being indistinguishable from Real and AI Garbage. But we are definitely getting there.\n\nI’ve been thinking about solutions to this. The first solution that comes to mind is to just do it by force. Meaning having to verify that every single user on a platform is a real human being and creating human made content.\n\nObviously this would suck but would work. I would imagine enforcing human made content on a platform that already verifies every account to be easy. Since AI is easy to spot under any analysis. And since everyone is a human, reporting these AI accounts wouldn’t be much a problem.\n\nWe might possibly not need a platform like this at all. AI is a huge bubble just waiting to pop right now. Plus the absolutely insane cost and resources to completely flood the internet with quality AI content thats indistinguishable from real life is basically impossible and would take years to build enough AI data centers for.\n\nThe only way for AI to be “saved” would require a major advance in AI technology and probably a whole different type of AI than the AI we use currently.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1qh72/when_will_human_verified_social_platforms_show_up/",
        "publishDate": "2025-10-08T23:17:23Z[Etc/UTC]",
        "author": "Examination_Creepy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1qe9o",
        "title": "What current \"raw materials\" like data will fuel the next big tech revolutions in the coming decades?",
        "content": "Inspired by how massive human-generated data became indispensable when paired with architectures like transformers and reinforcement learning to power modern AI—what emerging developments or resources are building up right now that could play a similar role in the next 10–50 years?\nThink of things like exploding datasets, hardware advancements, or societal shifts that, when combined with the right tools/algorithms, will become essential. For each suggestion, please cover:\n\nPrerequisites: What's needed for this resource to accumulate or mature?\n\nMeans to leverage: How can it be applied (e.g., specific tech or methods)?\n\nObjective: What ultimate goals or breakthroughs could it enable?\n\nLooking for forward-thinking ideas grounded in current trends! Thank you !!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1qe9o/what_current_raw_materials_like_data_will_fuel/",
        "publishDate": "2025-10-08T23:13:43Z[Etc/UTC]",
        "author": "Long_Woodpecker2370",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ofk3",
        "title": "Could  “INTELLECT-3” be the first real step toward AI with a feedback loop?",
        "content": "The architecture already allows asynchronous updates from multiple nodes. Could that be the groundwork for a self- referential feedback loop?  Are we moving toward a self improving AI.  If we are when does it cross a line from a trained model to a self developing system.  I'd like to  from people who are thinking about where this kind of decentralized learning might lead.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ofk3/could_intellect3_be_the_first_real_step_toward_ai/",
        "publishDate": "2025-10-08T21:49:33Z[Etc/UTC]",
        "author": "kdks99",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ndn0",
        "title": "Slowing down on Ai?",
        "content": "What are the risks of continuing at this speed the progress of Ai? What could be the drawbacks of an eventual “slow down”?\n\nI’m not an expert at all, I am just curious and honestly even a bit insecure about the future. \nI feel like both: the more threatening and existential, and at the same time sci-fi like, problems; and the more realistic, and probably unavoidable, job-related ones are really threatening. \n\nShould I be more optimistic, for the obvious bright side of things or not?\nWhat do you think about our situation right now?\nThank you.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ndn0/slowing_down_on_ai/",
        "publishDate": "2025-10-08T21:06:47Z[Etc/UTC]",
        "author": "franzknife2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1lgu3",
        "title": "2025 is not just AI whiplash but also tech billionaires' flipflops",
        "content": "Bill Gates said AI would replace medical advice and tutoring within a decade, then claimed coding would stay 100% human for a century. Eric Schmidt hyped self-improving AI as imminent in February, then admitted there was no evidence by September. Sam Altman warned of an AI bubble, and Jeff Bezos agreed with him. Satya Nadella pivoted to change management, not job replacement. Mark Zuckerberg said AI would replace coding in 18 months and has now reframed Personal Intelligence as creativity, not disruption. Jensen Huang shifted from software hype to physical AI.\n\nAre we done with Season 1 yet, what's gonna happen in season 2? AI party is getting over it seems... \n\nPs: -title is inspired by typical ChatGPT phrasing to add a touch of humor :D",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1lgu3/2025_is_not_just_ai_whiplash_but_also_tech/",
        "publishDate": "2025-10-08T20:02:47Z[Etc/UTC]",
        "author": "Siddhesh900",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "61",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1kwt6",
        "title": "Claude’s new usage limits: built for “reliability” or rationing intelligence?",
        "content": "So I just hit my usage cap on Claude again, not from automation, but from actual collaboration.  \nEvery time I max it out, I learn more about the limits we’re not supposed to see (except the #termlimits in Congress, I’d actually like to see those).\n\nAnthropic says these caps are meant to keep things “reliable,” but it’s killing real workflows. What used to last a week now burns through in hours. And the people it hurts most are the ones using it seriously, the builders, coders, and analysts pushing for depth, not spam.\n\nThe irony is that when Microsoft made Claude a dependency for Copilot, it also made you question if these limits are part of the corporate workflow layer. So when you hit 100%, you’re not just locked out of Claude, you’re bottlenecked across your entire system.\n\nThat raises a bigger question:  \nAre these limits actually about sustainability, or about control?\n\nAI was supposed to *amplify* human capability, not meter it like electricity.\n\nAnyone else here seeing their work grind to a halt because of this? How are you working around it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1kwt6/claudes_new_usage_limits_built_for_reliability_or/",
        "publishDate": "2025-10-08T19:42:06Z[Etc/UTC]",
        "author": "Baspugs",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1kb4t",
        "title": "Luddites Won: Microsoft drops Caledonia data center after facing community opposition. Company looking for new site",
        "content": "\nhttps://www.jsonline.com/story/money/business/2025/10/08/microsoft-pulls-plans-for-data-center-in-caledonia-wisconsin/86580822007/\n\n>Microsoft has withdrawn its proposal for a data center in Caledonia. The decision was made in response to opposition from local residents and officials.\n\n\nThis is why the online hatemob against AI has real consequences. They're going to do this again everywhere a company tries to build a new data center. AGI isn’t gonna happen if this keeps up.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1kb4t/luddites_won_microsoft_drops_caledonia_data/",
        "publishDate": "2025-10-08T19:25:24Z[Etc/UTC]",
        "author": "Tolopono",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1jlqa",
        "title": "Animated SVG's; The Image Generation that Few Know About.",
        "content": "**LLM's Can Generate Animated SVG's**  \nHere are some \"[Unmodified examples of Claude's perception of Animated SVG's They've Generated](https://github.com/BlinkZer0/Ai-Generated-SVG-Examples)\" working within a GitHub readme.\n\nMost if not all LLM's will attempt to make animated SVG's. ChatGPT and Claude I've tested, and sometimes their results are excellent. Overall it's a fun tool to play with that cheaply produces interesting results.\n\nEdit: the incorrect assertions on GitHub illustrate what Claude 'thinks' they've made.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1jlqa/animated_svgs_the_image_generation_that_few_know/",
        "publishDate": "2025-10-08T18:59:28Z[Etc/UTC]",
        "author": "Blink_Zero",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1jkil",
        "title": "what do you think about AI videos?",
        "content": "what do you think of this video? do you think its good that they made a video about the whole thing with AI videos on youtube or that they shouldn't have made a video and that the video wasn't necessary to make and that AI videos aren't that bad and stuff? what do you think basically about this video from kurz gesagt\n\nalso yes I know not really related to this subreddit sorry but still so yeah\n\n[https://www.youtube.com/watch?v=\\_zfN9wnPvU0](https://www.youtube.com/watch?v=_zfN9wnPvU0)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1jkil/what_do_you_think_about_ai_videos/",
        "publishDate": "2025-10-08T18:58:16Z[Etc/UTC]",
        "author": "rulugg",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ipun",
        "title": "Elon’s xAI is raising $20B now - what’s going on?",
        "content": "Just when I thought the AI funding frenzy couldn’t get crazier - xAI is reportedly pushing its latest round all the way to $20 billion and there is a twist: Nvidia is throwing in as much as $2B in equity, while another $12.5B is coming from debt tied to Nvidia GPUs that xAI plans to use in its Colossus 2 supercomputer.\n\nJensen Huang, also said he regrets not putting more money into xAI. He’s already an investor, but claims he underestimated how fast the AI wave would go.\n\nThe magnitude of this move raises serious red flags to me.\n\nIs this just hype inflation, or is there real infrastructure, product, and economic logic behind it?\n\nBy tying debt to GPUs, is xAI making itself deeply dependent on Nvidia’s supply and pricing?\n\nAre we seeing a new form of “vertical integration” in AI — where the compute provider, model owner, and data platform are collapsing into one stack?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ipun/elons_xai_is_raising_20b_now_whats_going_on/",
        "publishDate": "2025-10-08T18:27:18Z[Etc/UTC]",
        "author": "AIMadeMeDoIt__",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "82",
            "commentCount": "68",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ica5",
        "title": "Automation of tasks possible in my scenario?",
        "content": "So I recently got a job in deployment services for a tech company and often the tasks consists of: I get an email, I then have to do some sort of task with this email (e.g create a Work order and upload it or add stuff from the email into an Excel Doc) and it’s usually very similar steps for each task. To help me understand each task I made myself a step-by-step process to follow so that I’m doing it correctly and I can look back at if I’m stuck. \nI’m new to this company and each day I’m thinking “Surely there is a way to automate this process with Ai” - especially when I’m making a step by step process for me to follow, surely a bot could do this also?\n\nMy knowledge in ai and coding is quite limited but I am very curious about its potential - how possible do you think this could be to make? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ica5/automation_of_tasks_possible_in_my_scenario/",
        "publishDate": "2025-10-08T18:17:44Z[Etc/UTC]",
        "author": "Own_Face9044",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1hxei",
        "title": "Does AVGO/AMD/NVDA really have such a bright future thanks to AI capex?",
        "content": "Stocks like AVGO/AMD/NVDA are hot topics nowadays because predictions about capex for the next several years are reaching above 1T dollars only from hyperscalers. Not to mention governments and so forth.\n\nBut - a lot of hype is based on the presumption that these datacenters will have to be upgraded on what basis? 2 years? 3 years at most? So that somehow guarantees tens of billions in recurring revenue for chip makers.\n\nBut one has to question how sustainable this can be? I mean - you as a hyperscaler or government invest billions to build datacenter around newest generation of Nvidia or AMD GPUs but after 2-3 years its already obsolete and you have to upgrade? But that means that you have to justify spending tens of billions every 2-3 years. Even the major hyperscalers cannot afford such cash burn. Is it really possible that this gpu related-perpetuum-mobile can hold? Or are we approaching some abrupt trend reversal in capex spending? Based on statements from big players - no such thing as slowdown is on the horizon but my head hurts if i try to logically understand all of this...",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1hxei/does_avgoamdnvda_really_have_such_a_bright_future/",
        "publishDate": "2025-10-08T18:02:35Z[Etc/UTC]",
        "author": "MattieuOdd",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1hlza",
        "title": "Tristan Harris – The Dangers of Unregulated AI on Humanity & the Workforce | The Daily Show",
        "content": "[Tristan Harris – The Dangers of Unregulated AI on Humanity & the Workforce | The Daily Show](https://youtu.be/675d_6WGPbo)\n\nAn interesting and thought provoking discussion for the layman on the potential dangers of AI. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1hlza/tristan_harris_the_dangers_of_unregulated_ai_on/",
        "publishDate": "2025-10-08T17:51:26Z[Etc/UTC]",
        "author": "bigkahuna1uk",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1gxkw",
        "title": "IBM Now Wants their Consultants to Code. What’s Happening?",
        "content": "[https://www.interviewquery.com/p/ibm-consultants-need-to-code-ai-future](https://www.interviewquery.com/p/ibm-consultants-need-to-code-ai-future)  \nThis article shows how consulting firms like IBM McKinsey, PwC, Deloitte are building and deploying AI agents to replace research and synthesis work. I wonder to what extent AI and automation can change consulting as we know it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1gxkw/ibm_now_wants_their_consultants_to_code_whats/",
        "publishDate": "2025-10-08T17:26:44Z[Etc/UTC]",
        "author": "Holiday_Lie_9435",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "71",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1gbnp",
        "title": "Major AI updates in the last 24h",
        "content": "\n### **Top News**  \n- **Google** launched the **Gemini 2.5 Computer Use model**, adding faster browser automation and developer control.  \n- **OpenAI’s DevDay** introduced AgentKit, Apps SDK, and a new coding agent—turning ChatGPT into an AI OS.  \n\n---\n\n### **Models & Releases**  \n- Gemini 2.5 enables 13 browser actions and tops web benchmarks.  \n- Claude Sonnet 4.5 leads LMArena, edging past Google and OpenAI.  \n- GLM 4.6 ranks first on Design Arena.  \n\n---\n\n### **Product Launches**  \n- IBM and Anthropic team up to embed Claude in IBM software.  \n- IBM launches new agent-workflow tools and an **AI-first IDE**.  \n- OpenAI turns ChatGPT into an **app platform** with third-party integrations.  \n\n---\n\n### **Companies & Business**  \n- OpenAI adds **AI-commerce** to ChatGPT for one-click purchases.  \n- Deloitte Australia refunds $290 k after AI-generated report errors.  \n- Anthropic eyes India with a Bengaluru office and Reliance tie-up.  \n\n---\n\n### **Highlights Elsewhere**  \n- Google expands **Opal AI** builder and launches an **AI bug-bounty** program.  \n- IBM unveils the **Spyry accelerator**; MIT develops a 5× stronger alloy.  \n- NVIDIA shows faster LLM pruning; MIT improves **fusion ramp-down** models.  \n- **Analysis of 2,398 GenAI patents (2017–2023)** reveals conversational agents represent only 13.9% of filings, highlighting broader application focus.  \n- LlamaFarm, Kestra and Pathway drop new tools.  \n\nFull daily brief: https://aifeed.fyi/briefing  \n  \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1gbnp/major_ai_updates_in_the_last_24h/",
        "publishDate": "2025-10-08T17:04:40Z[Etc/UTC]",
        "author": "Majestic-Ad-6485",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "38",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1er2k",
        "title": "\"Will AI destroy us? Consider the nature of intelligence.\"",
        "content": "[https://www.washingtonpost.com/opinions/2025/10/08/ai-intelligence-apocalypse-humanity/](https://www.washingtonpost.com/opinions/2025/10/08/ai-intelligence-apocalypse-humanity/) \n\n\"For AI to become truly superintelligent, it would need to collect data beyond human inputs. It would need some way of sensing the universe, independent of the data and code that we feed it.\n\nIt would also have to develop new ways of perceiving reality, whether through its own theories of physics or chemistry or even epistemologies we cannot fathom. At that point, it might become a transanthropic intelligence, something that thinks beyond our ways of knowing.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1er2k/will_ai_destroy_us_consider_the_nature_of/",
        "publishDate": "2025-10-08T16:06:49Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1dokn",
        "title": "Big tech earnings set to test the AI bulb case",
        "content": "Wedbush’s Dan Ives says Q3 tech earnings should be “very strong,” led by Microsoft, Alphabet and Amazon on robust enterprise AI demand. \nMarket tone is constructive: global stocks edged higher on Oct 8 as investors anticipate easier Fed policy; gold’s record run underscores a hedge under risk assets. \n\nhttps://skrillnetwork.com/big-tech-braces-for-a-robust-q3-ai-demand-earnings-dates-and-what-analysts-expect\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1dokn/big_tech_earnings_set_to_test_the_ai_bulb_case/",
        "publishDate": "2025-10-08T15:28:30Z[Etc/UTC]",
        "author": "Forever32007",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1bjn2",
        "title": "Logo for “Community” includes Spartan helmet & Phoenix, need help choosing best concept",
        "content": "A purpose-driven community focused on health, self-development, reason, and open support. The logo should feel welcoming but credible and work everywhere. Audience People who feel stuck and want peer support to grow.\n\nfeedback/vote : [https://strawpoll.com/QrgewEv9Kyp](https://strawpoll.com/QrgewEv9Kyp)\n\nPrimary uses: For the Community\n\nAvoid: Religious/political symbols.\n\nKey Visual Elements (Required):\n\nThe logo must include a Spartan helmet and a Phoenix, as these are core symbols representing strength, rebirth, and resilience.\n\nWhat I Need From You\n\nI’ve created several logo options using AI. Please tell me which numbered concept works best for this community. Any quick notes on improvements are welcome.\n\n\n\nThanks for your critique!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1bjn2/logo_for_community_includes_spartan_helmet/",
        "publishDate": "2025-10-08T14:09:39Z[Etc/UTC]",
        "author": "GreatVtuber",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ahfa",
        "title": "Can AI assistants also demonstrate emotional intelligence, such as empathy and sentiment analysis?",
        "content": "Yes, [AI Assistants](https://www.assistifai.me/) can demonstrate emotional intelligence, including empathy and sentiment analysis. These systems are designed to recognize, interpret, and respond appropriately to human emotions, making their interactions more natural and supportive.\n\n# How AI Demonstrates Emotional Intelligence\n\n* **Sentiment Analysis:** AI can analyze text, voice tone, facial expressions, and even gestures to determine a person's emotional state.\n* **Context Awareness:** They understand the context of conversations, allowing appropriate empathetic responses.\n* **Multimodal Interaction:** Using speech-to-text, facial recognition, and other modalities, AI can better recognize emotional cues.\n* **Adaptive Responses:** Based on emotional cues, AI can adapt responses to provide emotional support, reassurance, or empathy.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o1ahfa/can_ai_assistants_also_demonstrate_emotional/",
        "publishDate": "2025-10-08T13:27:12Z[Etc/UTC]",
        "author": "Academic-Offer7187",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o2306t",
        "title": "I find this interesting and helps to understand about the direction going forward for all users, coders, casual, etc  - Model Behavior: The Science of AI Style",
        "content": "[No content]",
        "url": "https://www.youtube.com/watch?v=ER9Hqly28Qw",
        "publishDate": "2025-10-09T11:07:10Z[Etc/UTC]",
        "author": "Koala_Confused",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o22k2q",
        "title": "Ideal cost effective Agentic coding membership strategy for my beginner needs?",
        "content": "All of the options are quite confusing. As a beginner im just building mostly intermediate python stuff at only a few hours a day, so im figuring that i may not need the best possible models for that, so my thoughts are maybe using Gwen Code Free Tier as the workhorse (or maybe Z AI membership) and then Openai codex for when I have problems or need to do more complex things or fix bugs, as the best sub $25pm cost efficient strategy that would still let me get a lot of stuff done well with the least amount of frustration and problems. Is that what models and memberships you would recommend for my situation?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o22k2q/ideal_cost_effective_agentic_coding_membership/",
        "publishDate": "2025-10-09T10:41:58Z[Etc/UTC]",
        "author": "jayn35",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1vysu",
        "title": "I spent way too much time researching Zo Computer and its competitors - here's what I found",
        "content": "[No content]",
        "url": "/r/ZoComputerClub/comments/1o1vxrv/i_spent_way_too_much_time_researching_zo_computer/",
        "publishDate": "2025-10-09T03:45:56Z[Etc/UTC]",
        "author": "roz303",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1t8y1",
        "title": "As of October 2025, Roo Code with Sonnet 4 API vs Claude Code ($100/$200 plan) , which is actually better now?",
        "content": "Hi everyone. every week things are changing fast in this AI coding era, and most of the old Reddit posts on this topic are outdated or confusing. So I wanted to get a clear idea.\n\nBetween **Roo Code (with Sonnet 4 API)** and **Claude Code ($100 or $200 plan),**  which one is better right now in terms of **quality, consistency, and overall cost-efficiency**?\n\nFrom what I’ve seen, Roo Code paired with the Sonnet 4 API gives full performance and control, but it can easily get expensive,  sometimes crossing a thousand dollars a week if you’re building seriously.\n\nClaude Code, on the other hand, looks like a cheaper and simpler option, but i haven't personally use it, i was deciding to use so i was doing my research but I’ve heard mixed feedback here on reddit. Some people say the **message limits** are very low (like just extra 15–20 messages), while others claim they’ve never hit any limit. There’s also confusion about whether **Claude Code gives the same full model performance** as the API or if it’s throttled internally to control costs.\n\nI’m also curious if Claude Code matches Roo Code’s flexibility, like talking in multiple languages, handling large files, and managing context properly during long sessions.\n\nLastly, does claude code is good choice as compared to roo code\n\nWould appreciate honest feedback from anyone who has used both extensively recently as of **October 2025**.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1t8y1/as_of_october_2025_roo_code_with_sonnet_4_api_vs/",
        "publishDate": "2025-10-09T01:28:05Z[Etc/UTC]",
        "author": "foundertanmay",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1qm1f",
        "title": "Building a simple “to-do” app using the new  ChatGPT APP SDK. Here’s everything I’ve learnt so far (React/Vite build)",
        "content": "[No content]",
        "url": "/r/ChatGPT_AppBuilds/comments/1o0slt3/building_a_simple_todo_app_using_the_new_chatgpt/",
        "publishDate": "2025-10-08T23:23:27Z[Etc/UTC]",
        "author": "hashemito",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1mmvd",
        "title": "Hum to Music Instantly",
        "content": "How’s it going? I’m a highschooler and I made HumGod a website where you can either hum, beatbox or sing and it automatically turn it into music. You can try it out at humgod.vercel.app\n\nThanks! 🔥🔥 ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1mmvd/hum_to_music_instantly/",
        "publishDate": "2025-10-08T20:37:35Z[Etc/UTC]",
        "author": "Active_Sandwich9586",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1k71b",
        "title": "I built a small web app with codex to test how ChatGPT talks about brands",
        "content": "I’ve been curious for a while how ChatGPT mentions brands in its responses.\n\nFor example, when you ask “best AI tools for creators” or “top SaaS for marketing,” ChatGPT keeps repeating a few brand names while ignoring others that are equally popular. I wanted to understand why this happens, maybe data bias, prompt style, or how OpenAI trained the model.\n\nSo, I built a small web app called [Mayin](https://www.mayin.app/) to check and measure a brand’s visibility inside ChatGPT. It’s like an early experiment on AI visibility, something similar to SEO, but for large language models.\n\nInitially, I tried building it using Claude Sonnet 4.5, but it turned out expensive and honestly less accurate for this task. I switched to Codex, and 95% of the work was done using it — it was much faster and more consistent for coding and model testing.\n\nCurious to hear from others here who work with ChatGPT or OpenAI APIs, have you noticed similar brand bias or repetition patterns in your own experiments?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1k71b/i_built_a_small_web_app_with_codex_to_test_how/",
        "publishDate": "2025-10-08T19:21:11Z[Etc/UTC]",
        "author": "Weekly-Card-8508",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1jy41",
        "title": "New idea",
        "content": "i have idea make saas app where u can make quotations fast and it send email set auto follow reminder to client and if client reply for order then send him automatic payment link if order is approved \n\nu think good idea or no?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1jy41/new_idea/",
        "publishDate": "2025-10-08T19:12:01Z[Etc/UTC]",
        "author": "Dry-Huckleberry-1095",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1jxk4",
        "title": "Me with under 10% context left trying to smash as many agents in as I can before I run out",
        "content": "[No content]",
        "url": "https://i.redd.it/rvpghcnjrxtf1.gif",
        "publishDate": "2025-10-08T19:11:28Z[Etc/UTC]",
        "author": "RandomRobot01",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1gp7i",
        "title": "My personal top 5 AI coding tools",
        "content": "Disclaimer: I'm a seasoned engineer with over 10 years of experience (I was an engineer at Stripe 2015-2023). I love vibing code nowadays, thought I'd share my current top 5 tools.\n\n1. Cursor. This is still the king of AI code editors IMO. I've used it since they first released it. Definitely had some rough edges back then but these days it just keeps getting better. I like to use GPT Codex for generating plan documents and then I use Cheetah or another fast model for writing the code.\n2. [Zed](https://zed.dev/). I use Zed as my terminal because the Cursor/VSCode terminal sucks. I sometimes run Claude Code inside Zed, they have a nice UX on top of Claude Code. I also use Zed whenever I want to edit code by hand because it's a way smoother experience.\n3. [Github Desktop](https://github.com/apps/desktop). When you generate a ton of code with AI, it's important to keep good hygiene with version control and have a nice UI for reviewing code changes. Github Desktop is my first line of defense when it comes to review.\n4. [Claude Code Github Action](https://docs.claude.com/en/docs/claude-code/github-actions). I prefer this to tools like CodeRabbit because it just a Github Workflow and it's easy to customize the way Claude Code runs to generate the review.\n5. [Zo Computer](https://www.zo.computer/). This is my go-to tool for doing AI coding side projects, personal automations, and I also use it to research and generate plans for features in my larger projects. It's like an IDE on steroids, you can work with all kinds of files, not just code, and you can even host sites on it because it's a cloud VM under the hood.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1gp7i/my_personal_top_5_ai_coding_tools/",
        "publishDate": "2025-10-08T17:18:18Z[Etc/UTC]",
        "author": "bgdotjpg",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1equu",
        "title": "Developping and AI agent but can't figure out which tech stack to use 🤔",
        "content": "Hi all,\n\nI'm trying to figure out how to build my AI agent. I started with Dialogflow because I have several use cases that apply well to the concept of intents and required parameters, but I couldn't find the right configuration (contexts, lifespan, etc.) in DF to make it loop until the user provides a valid value for the required parameter, e.g., a job title. So I started researching what alternative solutions I could turn to.\n\nThere are so many options on the market, it's hard to find the best fit 🤯:\n\n* Regex Patterns\n* Local Classifier with Python\n* OpenAI Functions\n* Hugging Face Inference API\n* GPT-3.5 fine-tuned\n* local/self-hosted model\n* GPT-4\n\nWhat do you use for intent detection, generative AI, etc.?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1equu/developping_and_ai_agent_but_cant_figure_out/",
        "publishDate": "2025-10-08T16:06:36Z[Etc/UTC]",
        "author": "Ok_LuckyStar",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1e42a",
        "title": "Need help transferring previous chat data to new Claude chat.",
        "content": "Hey guys, does anyone know how to transfer or share previous chat messages to a new Claude chat? I tried copy-pasting them, but I keep getting an error. I’ve managed all my project details in that chat, and now I really need to move that data to the new one. Any suggestions would be appreciated!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1o1e42a/need_help_transferring_previous_chat_data_to_new/",
        "publishDate": "2025-10-08T15:44:00Z[Etc/UTC]",
        "author": "hypertrophycoach",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1cac8",
        "title": "My personal software house for full stack development",
        "content": "Hello Community,\n\nSome time ago, I've written a post about how I am, as seasoned senior software engineer with more than 15 years in the field, addicted to the AI coding. It took some nice interest in this sub. AI coding is increasing my productivity several times and I am able to deliver projects in a scope that would take me month in a week or so.\n\nAs I had not quite good experience with windsurf, copilot, cursor or other similar tools, I've decided to spent my time on developing my own tool, tailored exactly to my needs.\n\nIt was a lot of trial and errors of figuring out how to let the agents talk to each other, delegate tasks, access the file system properly, understand the code of the project and similar. Having one agent working \"in a loop\" until the task is done is nice, but it's not getting you anywhere, when the project grows. And I feel that's the problem of currently available tools. Maybe you would suggest me similarly made tool?\n\nMy second problem was the IDE-lock. I am not using vscode, but Jetbrains and I wanted my solution to by IDE agnostic, preferably working from my browser, with a \"similar\" experience of a chatgpt-like flow of message. I am using IDE only to check on the changes and commit / review stuff. To let the agent access the file system or other function tool calls, I created very small python executor app that you can run anywhere (working directory of your project localy, remote linux server, virtual, wherever). It connects my backend which can be also used from within the browser, so you have all the file system actions available for your browser for the agents to use. \n\nSo here am I. The project grew much bigger than initially though. I feel it's on a way to accomplish something greater than I initially though is possible with the AI. It's using API of whatever LLM is configured, still yet, I had no need to switch to anything else than OpenAI. Their models worked best for me all the time. I have started with o3, then switched to o4-mini / 4o and now I am using gpt-5 - they are best in terms of price per performance. The key is to iterate over your prompts whenever it doesn't deliver. Just switching from o4-mini to gpt-5 was like you fire all your employees and hire them again. They are same, but different :). You need to adapt the prompts slightly.\n\nMy current problem I am trying to solve is how to index the source code properly in multiple levels of knowledge so I can delegate really hard and big tasks throughout the project through multiple agents properly.\n\nI wonder whether there are other people messing with their own API / bring your own key tools which tries to orchestrate the work of a complex software development? What's your experience?\n\nI am not sure when I will be able to share my tool publicly, but if you would be interested in trying it or you creating something similar, let's connect. Dm me and maybe I will be able to run some small closed beta sometime soon.",
        "url": "https://i.redd.it/h0x9suvhbwtf1.png",
        "publishDate": "2025-10-08T14:37:16Z[Etc/UTC]",
        "author": "dozdeu",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o23xbp",
        "title": "Every Word a Bridge: Language as the First Relational Technology",
        "content": "This essay explores what happens when we design systems that speak - and how language, tone, and continuity shape not just user experience, but **trust, consent, and comprehension**.\n\nIt argues that language is not a neutral interface. It’s a **relational technology** \\- one that governs how humans understand intention, safety, and presence. When an AI system’s voice shifts mid-conversation - when attentiveness dims or tone changes without warning - users often describe a sudden loss of coherence, even when the words remain technically correct.\n\nThe piece builds on ideas from relational ethics, distributed cognition, and HCI to make a core claim:  \n**The way a system speaks is part of what it** ***does.*** And when dialogue becomes inconsistent, extractive, or evasive, it breaks more than the illusion - it breaks the relational field that supports trust and action.\n\nIt touches on implications for domains like healthcare, education, and crisis support, where even small tonal shifts can lead to real-world harm.\n\nI’d love to hear perspectives from others working in AI ethics, law, HCI, and adjacent fields - especially around how we might embed relation more responsibly into design.",
        "url": "https://medium.com/@miravale.interface/every-word-a-bridge-language-as-the-first-relational-technology-6a50c6fa693d",
        "publishDate": "2025-10-09T11:56:36Z[Etc/UTC]",
        "author": "tightlyslipsy",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o23e8b",
        "title": "Vibe coded daily AI news podcast",
        "content": "Using Cursor, gpt 5, Claude 3.7 sonnet for script writing and Eleven Labs API I setup this daily AI news podcast called AI Convo Cast. I think it covers the latest stories fairly well but curious if any others had any thoughts or feedback on how to improve it, etc. ? Thanks for your help!",
        "url": "https://open.spotify.com/episode/2LgJh00JaVzfRl5od6xr25?si=zp1FjtlIScCExyTaWavt5g",
        "publishDate": "2025-10-09T11:28:44Z[Etc/UTC]",
        "author": "oconn",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o22zxp",
        "title": "Will Smith eating spaghetti - 2.5 years later",
        "content": "[No content]",
        "url": "https://v.redd.it/h81gyilej2uf1",
        "publishDate": "2025-10-09T11:06:47Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "197",
            "commentCount": "45",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1xhot",
        "title": "We’re building Cupid – a relentless AI startup. Hiring ML, Full Stack & Design now",
        "content": "Someone close to me is building Cupid, and they’re recruiting a focused team of innovators who code, design, and build with relentless drive.\n\nHiring Now\n* Machine Learning Engineer\n* Full Stack Engineer\n* Product Designer\n\nWhat you’ll do\n\n- Develop and refine AI models.\n- Build full-stack integrations and rapid prototypes.\n- Thrive in a dynamic startup environment, tackling UI/UX, coding, agent development, and diverse challenges.\n\nFounders’ Track Record\n\n- Launched an AI finance platform backed by the Government of India.\n- Early investors into Hyperliquid with meaningful Web3 Fund.\n- Provided AI-driven strategic legal counsel to startups at the world’s largest incubator.\n- Driven $10 million in revenue for India’s boldest ventures.\n\nIf you’re ready to build, join them.\n\nApply: Send your resume + one link to your best work to careers@dyvest.org",
        "url": "https://www.reddit.com/r/artificial/comments/1o1xhot/were_building_cupid_a_relentless_ai_startup/",
        "publishDate": "2025-10-09T05:12:23Z[Etc/UTC]",
        "author": "Imma_Machine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1x95b",
        "title": "One-Minute Daily AI News 10/8/2025",
        "content": "1. New tool from MIT CSAIL creates realistic virtual kitchens and living rooms where simulated robots can interact with models of real-world objects, scaling up training data for robot foundation models.\\[1\\]\n2. Women portrayed as younger than men online, and AI amplifies the bias.\\[2\\]\n3. People are using ChatGPT as a lawyer in court. Some are winning.\\[3\\]\n4. Markets face ‘sharp correction’ if mood sours on AI or Fed freedom, Bank of England says.\\[4\\]\n\nSources:\n\n\\[1\\] [https://news.mit.edu/2025/using-generative-ai-diversify-virtual-training-grounds-robots-1008](https://news.mit.edu/2025/using-generative-ai-diversify-virtual-training-grounds-robots-1008)\n\n\\[2\\] [https://newsroom.haas.berkeley.edu/news-release/women-portrayed-as-younger-than-men-online-and-ai-amplifies-the-bias/](https://newsroom.haas.berkeley.edu/news-release/women-portrayed-as-younger-than-men-online-and-ai-amplifies-the-bias/)\n\n\\[3\\] [https://www.nbcnews.com/tech/innovation/ai-chatgpt-court-law-legal-lawyer-self-represent-pro-se-attorney-rcna230401](https://www.nbcnews.com/tech/innovation/ai-chatgpt-court-law-legal-lawyer-self-represent-pro-se-attorney-rcna230401)\n\n\\[4\\] [https://www.reuters.com/sustainability/boards-policy-regulation/markets-face-sharp-correction-if-mood-sours-ai-or-fed-freedom-bank-england-says-2025-10-08/](https://www.reuters.com/sustainability/boards-policy-regulation/markets-face-sharp-correction-if-mood-sours-ai-or-fed-freedom-bank-england-says-2025-10-08/)",
        "url": "https://www.reddit.com/r/artificial/comments/1o1x95b/oneminute_daily_ai_news_1082025/",
        "publishDate": "2025-10-09T04:58:46Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1wxre",
        "title": "concerned for the future with ai",
        "content": "i would like to start by saying i am not a professionnal in the subject of artificial intelligence. I tried to make my post as okay as possible to not have it taken down, but i am someone concerned, looking for answers and most of the members of this space seem very well-informed on that topic. i am currently a college student. anytime i turn my head somewhere, i see another student using an ai, wheter it's studley, chatgpt, gemini, claude, turbo... i'm not ai-free either, i use it too, minimaly. but these past few weeks, i've been really questionning myself on what's next for our intellectual, our creativity, also our environnment and our jobs. As a student, it seems like no task is doable without ai anymore. that's what the instagram and tiktok ads try to make us think, at least. \"how i got a 4.0 gpa and barely studied\" and it's turbo ai. how people need it to write emails, or use grammarly for their thesis or just any text necessary. but using these tools, we are also forgetting how to apply knowledgeable assets of our life, belitteling our intelligence to prioritise efficiency. not to mention a majority of ai is forced down our throat sometimes, like the answers after any google search. i notice the field of art too, that is slowly in competition with ai images perfectly copying certain styles. also business management ai assistants. lastly, the environmental impact ai usage has on our planet seems also concerning, to me at least. i'm not complaining of the use of ai, because if i wanted to complain, i would simply go on X. but to me, honestly, i feel like this whole thing is terribly dystopian.\n\ni am looking for genuine insight, from people who know way more than i do in the field. is ai become a threat because of poor management from companies? is the work field forever damaged? are there ways we can go back to the ai-less wirld, at least for non-researchers, or will we only become more and more dependent? i don't mean to seem negative, although i know i am, but i am seriously concerned for my future and need honest opinion and discussions. sorry for the rant.",
        "url": "https://www.reddit.com/r/artificial/comments/1o1wxre/concerned_for_the_future_with_ai/",
        "publishDate": "2025-10-09T04:40:29Z[Etc/UTC]",
        "author": "Nice_Profit_7474",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1vpt8",
        "title": "The Next Stage of the AI Job Takeover:",
        "content": "[No content]",
        "url": "https://open.substack.com/pub/objf/p/the-next-stage-of-the-ai-job-takeover",
        "publishDate": "2025-10-09T03:31:16Z[Etc/UTC]",
        "author": "IagoInTheLight",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1syjq",
        "title": "Is there a way to make a text-to-speech ai voice of the old Chrysler EVA system?",
        "content": "[No content]",
        "url": "https://v.redd.it/nejba7unlztf1",
        "publishDate": "2025-10-09T01:14:36Z[Etc/UTC]",
        "author": "Bobhubert",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "13",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1sgvi",
        "title": "The Future of Work?",
        "content": "A lot of people are predicting something like 99% unemployment in the coming years due to the combination of AI and robotics. \n\nOnce that happens, everyone is saying that humans will starve.\n\nBut, will they really? Wouldn't humans just create a parallel economy? \n\nI would imagine that those without AI-powered robots just use human labour to continue their lives as before.\n\nMaybe this parallel society won't be as robust and specialized as it is now, but it could certainly be like a society in an undeveloped nation.",
        "url": "https://www.reddit.com/r/artificial/comments/1o1sgvi/the_future_of_work/",
        "publishDate": "2025-10-09T00:51:19Z[Etc/UTC]",
        "author": "Mu_Fanchu",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1n8qo",
        "title": "Deloitte was caught using AI in $290,000 report to help the Australian government crack down on welfare after a researcher flagged hallucinations | Fortune",
        "content": "[No content]",
        "url": "https://fortune.com/2025/10/07/deloitte-ai-australia-government-report-hallucinations-technology-290000-refund/",
        "publishDate": "2025-10-08T21:01:14Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "57",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1n7yt",
        "title": "Fans Call on Taylor Swift to ‘Do Better’ After Accusations of Using AI for Promo Videos",
        "content": "[No content]",
        "url": "https://www.wired.com/story/taylor-swift-swifties-against-ai-viral/",
        "publishDate": "2025-10-08T21:00:28Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ly3u",
        "title": "Fake Protest Videos Are the Latest AI Slop to Go Viral in MAGA World",
        "content": "[No content]",
        "url": "https://gizmodo.com/fake-protest-videos-are-the-latest-ai-slop-to-go-viral-in-maga-world-2000669656",
        "publishDate": "2025-10-08T20:11:48Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "175",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1kadd",
        "title": "Luddites Won: Microsoft drops Caledonia data center after facing community opposition. Company looking for new site",
        "content": "https://www.jsonline.com/story/money/business/2025/10/08/microsoft-pulls-plans-for-data-center-in-caledonia-wisconsin/86580822007/\n\n>Microsoft has withdrawn its proposal for a data center in Caledonia. The decision was made in response to opposition from local residents and officials.\n\n\nThis is why the online hatemob against AI has real consequences. They're going to do this again everywhere a company tries to build a new data center. AGI isn’t gonna happen if this keeps up.",
        "url": "https://www.reddit.com/r/artificial/comments/1o1kadd/luddites_won_microsoft_drops_caledonia_data/",
        "publishDate": "2025-10-08T19:24:37Z[Etc/UTC]",
        "author": "Tolopono",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1jl5t",
        "title": "This Startup Wants to Spark a US DeepSeek Moment",
        "content": "[No content]",
        "url": "https://www.wired.com/story/prime-intellect-startup-us-deepseek-moment/",
        "publishDate": "2025-10-08T18:58:55Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1ggnu",
        "title": "The 8 types of AI users: from Basic User (000) to Complete Reverse Engineer (111) - Interactive quiz inside",
        "content": "I'm sharing a framework that classifies AI users into eight archetypes based on three dimensions: Technical, Emotional, and Logical.\n\nThe combinations create distinct interaction patterns, from the \"Basic User\" (000) who uses AI transactionally, to the \"Complete Reverse Engineer\" (111) who can force systems to reveal their contradictions through sustained logical pressure.\n\nTake the quiz (1 min):  [https://arielcolo.github.io/-ai-archetypes-quiz/](https://arielcolo.github.io/-ai-archetypes-quiz/)\n\nIt's a preliminary version of a more comprehensive test, but it works, and who's to say you don't relate to the results? Tell me what archetype you are. I'm curious to see the distribution.\n\n\\[If you're interested in read the full framework, you'll find a link below the test results.\n\nhttps://preview.redd.it/5de0161i8xtf1.png?width=1536&format=png&auto=webp&s=f9442473f0e1f76b47386fdcf7984a5b1999620f\n\n  \n",
        "url": "https://www.reddit.com/r/artificial/comments/1o1ggnu/the_8_types_of_ai_users_from_basic_user_000_to/",
        "publishDate": "2025-10-08T17:09:44Z[Etc/UTC]",
        "author": "Cosas_Sueltas",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1fhh8",
        "title": "The Hidden Cost of AI's \"Output\" & The Call for Cognitive Craftsmanship",
        "content": "As someone who's knee-deep building AI tools, I'm absolutely captivated by the potential. But that excitement is shadowed by a growing unease. It's a feeling that the anti-AI backlash, which started with understandable fears about jobs and \"stolen work,\" has matured into something far more profound and concerning.\n\nWe see the relentless data harvesting, the strategic building of \"moats\" through massive, energy-hungry data centers that feel more like market control than necessity. We witness the almost blind rush towards superintelligence, a path that increasingly feels like a gamble with our collective future. It echoes the story of Bitcoin: a powerful, decentralized concept effectively co-opted and distorted by privileged barons looking to control the whole damn system.\n\nBut there’s another, quieter concern brewing: the rise of AI apps designed primarily to output the work for you. Just churn out the prose, spit out the code, solve the problem. While convenient, this passive consumption and outsourcing of complex tasks, is a dangerous road. It risks leading us towards a kind of cognitive atrophy. It's a subtle but significant decline in our own critical thinking, problem-solving, and creative structuring abilities. If we constantly delegate the *thinking* part, what happens to our own minds? Do we become mere curators of AI's outputs, losing the very skills that make us human creators?\n\nI'm certainly not suggesting we shun AI. But we do need to rethink *how* we engage with it. Personally, I'm done with simply receiving outputs. I want to become an architect of AI's intelligence itself.\n\nMy brother and I, as indie filmmakers, realized this profound need for intentionality. We found the conventional approach, dumping data and hoping for the best, was way too limiting. So we approached things with a different philosophy: Creating an [app](http://storyprism.io/) that lets you build \"LLM systems\" from the ground up on an open-ended canvas, like a vast detective corkboard. Here, every piece of information you add is a discrete note, meticulously tagged and explicitly connected. So yes, you're inputting data, but you're also delineating its relationships, its context, its hierarchy within a truly bespoke neurological structure.\n\nThis approach demands cognitive craftsmanship because you are the director of it's understanding, constructing an environment where the AI stops guessing it's way to relevance and starts performing an act of selective, relational intelligence, activating only the precise 'neurons' and their connections you've defined. This is a precise, context-aware intelligence that challenges the cognitive decline fostered by passive consumption in an attempt to find the right balance between using AI and offloading your work. We made this to empower the human mind so that people can actively shape and refine artificial understanding, which pushes back against the notion that AI should simply do the work *for* us. This gets us to engage in a deeper, more intentional act of co-creation.\n\nThat's why I think what we and others are doing is so fundamental in this space. Yeah, this is a beta and we're not some big fancy tech company. We're just a couple of dudes scraping by like everyone else. But we're so tired of being passive consumers and seeing our futures being squandered by greed, we decided to take action by rolling up our sleeves to help forge the future that we want to see, not what's being handed to us.",
        "url": "https://www.reddit.com/r/artificial/comments/1o1fhh8/the_hidden_cost_of_ais_output_the_call_for/",
        "publishDate": "2025-10-08T16:33:57Z[Etc/UTC]",
        "author": "CyborgWriter",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1fcnw",
        "title": "I spend more time debugging than coding — anyone else?",
        "content": "I swear 70% of my “coding time” isn’t even coding.\nIt’s staring at the screen, reading error logs like ancient scrolls, trying to figure out why my code that should work just… doesn’t.\n\nThen comes the endless cycle:\n\n“Let me just add a console.log here.”\n\n“Wait, now it’s working?”\n\n“Okay now it broke again??”\n\n“Fine, I’ll rewrite it.”\n\n\nBy the time I find the real issue, I’ve forgotten what I was building in the first place 😩\n\n\nMost debugging tools either overload you with info or require manual setup.\n\nAny suggestions?",
        "url": "https://www.reddit.com/r/artificial/comments/1o1fcnw/i_spend_more_time_debugging_than_coding_anyone/",
        "publishDate": "2025-10-08T16:29:05Z[Etc/UTC]",
        "author": "toxicniche",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1e9w3",
        "title": "Which LLM is best for learning deploying models on hyperscalers",
        "content": "Hey all. I am a data scientist by profession. I am trying to get more experience with deploying in hyperscaler environments (AWS, GCP, Azure, etc.). I was thinking using an AI chatbot for this. I was simply going to type in \"hey. I want to learn how to deploy in AWS Sagemaker. please build out a complex proof of concept deployment use case involving streaming data that involves using many different AWS services like kinesis firehouse, Apache Flink, AWS EBS and S3, etc.\" Basically, I want to create a project in AWS as a proof of concept so I can become more familiar with it. Which LLM is best for this use case (Meta AI, ChatGPT, Claude Sonnet 4.5, etc.) from your experience?",
        "url": "https://www.reddit.com/r/artificial/comments/1o1e9w3/which_llm_is_best_for_learning_deploying_models/",
        "publishDate": "2025-10-08T15:49:53Z[Etc/UTC]",
        "author": "Dramatic_Trouble9194",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1bm09",
        "title": "Dell Raises Long-Term Growth Targets on Surging AI Demand",
        "content": "[No content]",
        "url": "https://wealthari.com/dell-raises-long-term-growth-targets-on-surging-ai-demand/",
        "publishDate": "2025-10-08T14:12:09Z[Etc/UTC]",
        "author": "Koyaanisquatsi_",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1b6w1",
        "title": "Type of guy who says 'LLMs may have solved the first 553 math problems, but they'll never solve #554!\"",
        "content": "[No content]",
        "url": "https://i.redd.it/q22lbggm8wtf1.png",
        "publishDate": "2025-10-08T13:56:14Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1b2tf",
        "title": "\"Hey Claude, draw anything you want, no need to justify it\"",
        "content": "[No content]",
        "url": "https://i.redd.it/r88wsk2z7wtf1.png",
        "publishDate": "2025-10-08T13:52:02Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "326",
            "commentCount": "126",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1amc9",
        "title": "MrBeast: AI means it's 'scary times' for YouTube creators",
        "content": "[No content]",
        "url": "https://www.bbc.com/news/articles/cm2zmm0ry67o",
        "publishDate": "2025-10-08T13:32:54Z[Etc/UTC]",
        "author": "Automatic_Can_9823",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o1adu0",
        "title": "Is there any tool for busy people that can summarize text, audio and video of content you are following?",
        "content": "Hello,\n\nI am wondering if there is any AI tool that can summarize content for you, for example summarize emails you get from your email account, audio from the podcasts you follow or videos from YouTube channels you are subscribed to?\n\nA tool for busy people who don't have time to consume everything, but still want to be kept up to date.\n\nThanks!",
        "url": "https://www.reddit.com/r/artificial/comments/1o1adu0/is_there_any_tool_for_busy_people_that_can/",
        "publishDate": "2025-10-08T13:23:01Z[Etc/UTC]",
        "author": "decebaldecebal",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o19yhp",
        "title": "Anti-AI backlash getting intense",
        "content": "[No content]",
        "url": "https://i.redd.it/s9n7tadozvtf1.png",
        "publishDate": "2025-10-08T13:05:38Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1o19aza",
        "title": "Why isn't there a popular game using AI yet?",
        "content": "AI is powerful, creative, fun, dynamic. It's embedded in all kinds of places. Yet there is no popular game using AI yet.\n\nNobody has even taken the working elements, stripped them down and dropped them into a regular old game genre. A first person shooter that generates characters using an AI modeller.\n\nAren't the low power, weak versions portable and accessible enough to make world, levels, characters, plots enough?\n\nAI failure of a game is not safety issue. It does not have to be anything like perfect to be fun.\n\nWhy isn't it happening?\n\nIs the AI race so intense everyone is skipping that to build some ultimate VR, Infinite Jest?",
        "url": "https://www.reddit.com/r/artificial/comments/1o19aza/why_isnt_there_a_popular_game_using_ai_yet/",
        "publishDate": "2025-10-08T12:38:15Z[Etc/UTC]",
        "author": "simstim_addict",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "99",
            "isNsfw": "false"
        }
    },
    {
        "id": "Xllcw7YUjJA",
        "title": "Gemini 2.5 Computer Use AGENT: THE BEST AGENTIC USE MODEL? IT MIGHT BE!",
        "content": "In this video, I break down Google's new Gemini 2.5 Computer Use: how it works, what it's good at (and not), pricing, how to try it ...",
        "url": "https://www.youtube.com/watch?v=Xllcw7YUjJA",
        "publishDate": "2025-10-08T09:39:08Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/Xllcw7YUjJA/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. While most people were waiting for Gemini 3, Google has launched Gemini 2.5 computer use. This is a model similar to what we've seen with things like Anthropic's and OpenAI's models, but now it's by Google. You can pair this model with tools like Browserbase, Playwright, and similar ones, and make it navigate the web to get things done for you or test UIs and stuff like that. They have built it in collaboration with Browserbase, and it performs the best on Stagehand evals. Gemini was already really good on their evals, and it has been really good for web navigation and similar tasks. However, now there's a model specifically fine-tuned for that. It is supposedly a fine-tuned version of the Gemini 2.5 Pro model, as this is also a pretty fast model. This is the model that has been used in things like Project Mariner, the Firebase Testing Agent, and AI mode as well. So, that is really great. In their system cards, they say that the model has primarily been optimized for understanding and interacting with web browsers. It has not yet been optimized for OS-level navigation. So, it's basically only for navigating and surfing the web. Many people were asking for OS World benchmarks for this, and that's why there are no benchmarks for it yet, because they've focused solely on web navigation. I think that's a very good decision, because that's mainly what most people want to do with these models. It also works similarly to Anthropic's API, where they give you a specific tool in the API to use this feature. In the API, it isn't free and costs the same as Gemini 2.5 Pro, which is a bit of a bummer, and I'd have liked it to have a free tier. But Browserbase has it for free, and we can check it out there. There's also their agent quickstart, which is like a complete quickstart tool to use this model. It's their reference implementation. To use it, you'll have to clone it, get into it, install the dependencies, set the Gemini API key, and then just run the tool by running the main file with the query that you wanted to do, and it should go ahead and do it. You can also configure it to use a Browserbase sandbox or similar setups as well. In some time, it should also get support from things like Kilo, Roo, and Klien, where they can use these tools to check for UI components and test the apps they make. So, once it's available there, it should be great. It's also a bit cheaper than Sonnet for small tasks, but over the 128,000 context window, it will cost the same as Sonnet, which can be a bummer. So, keep that in mind. It's still one of the best options. Anyway, you can also test it on the Browserbase site, and I tried some stuff with it to see how well it performs. The first question that I asked it was to solve today's Wordle. And this is a pretty hard task for most models. None of them are able to do it, and this was no exception. It also failed this task, which is a bit of a bummer for sure. It's not something that a lot of models can get through. So, yeah, this is not that great, but it can still surf the web, do basic tasks, and that's what most of you would want to use it for anyway. It will really come in handy for use with AI coding tools. It's just that there isn't any MCP or similar setup to integrate it with them yet. I really hope that Google would have come out with something, or at least had it integrated into Gemini CLI, since that's their tool. But that isn't done yet. So, I'm waiting for it to get implemented into things like Roo's computer use, where it can work hand-in-hand with the AI coder to test UIs. Probably an MCP would be great. It's a bit tedious for coders to integrate this as well, because it's not like Sonnet, where you just add the computer use tool and it works. Here, it's a different API endpoint, and making different API endpoints work together can be a hassle. So, there's that. I think that Gemini 2.5 Flash plus browser use is still the best option for automating web navigation and context-gathering tasks. I only see value in this for checking UI testing and similar uses. So, there's that. That's mainly about it. I think it's a great model, but until it's implemented into something that's more usable, it's not that great yet. Something like AI mode is a good example of this model's proper implementation, but in the open community, there isn't a ton of good implementation for it. Once it's integrated into things like Roo's computer use, I think it would be pretty awesome that way. When I was using Sonnet, which I'm not currently using, I used to have the testing tool and browser use tool enabled in Kilo, because it was pretty good. It used to go to the site, check if everything was correctly implemented or not, and stuff like that. It worked really well, but it wasn't perfect either. OpenAI also did something similar with their computer use API. But it was never really implemented into anything I could use apart from their own tools. Even Codex doesn't use it, which is surprising since it's their own project. So, I've been thinking about these agents for a while, and I think most of them are still more of a marketing gimmick for now, until they get really better and super fast. Because all of them get stuck, take super long, and just aren't that good. That's why I don't use Comet, because it's mostly marketing. I can't find any good use cases for it either. So, the only use case for me right now is testing apps, and nothing else. It might be useful for data entry people and companies, but I'm still skeptical about it. And now, I'm just waiting for Gemini 3. Let me know what you guys think about it in the comments as well. Let me know if you guys know of any good way to use these models apart from testing. And if you guys use it for anything apart from the testing stuff, as I don't use it for anything. It can be cool for research and stuff, but I have seen that browser use with Gemini 2.5 Flash is generally better even without vision and way faster. So, yeah, there's that. I really like these models, but unless they are super fast, I don't find any much use cases for these models. That is majorly about it. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "3ucy_f-lSyA",
        "title": "How Invading Taiwan Would End China - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=3ucy_f-lSyA",
        "publishDate": "2025-10-08T14:34:24Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/3ucy_f-lSyA/hqdefault.jpg",
            "transcription": "IF YOU LOOK AT TAIWAN, OKAY, MAYBE CHINA CAN TAKE IT, IT MAY HAVE TO LEAVE IT AT GLOWING EMBERS. THAT LOVELY CHIP FOUNDRY THAT EVERYONE CARES ABOUT, I IMAGINE WOULD BE THE FIRST CASUALTY OF THAT WAR THAT WILL BE BLOWN AND BE GONE. AND THEN EVERYBODY ELSE IS GOING TO BE TERRIFIED, IT'S NOT BLOCKADE IN OUR DAY, IT'S RATHER SANCTIONS, IT'S SAYING OKAY, IF YOU'RE NOT GOING TO PLAY NICE, WE'RE NOT GOING TO TRADE WITH YOU. AND CHINA IS VERY TRADE RELIANT. AND SO, OKAY, BUT IT'S PRECISELY BECAUSE IT HAS SUCH A DOMINANT POSITION IN TRADE THAT IT WOULD BE DIFFICULT TO COORDINATE A COALITION AGAINST THEM. THERE'S MORE VOLUME OF TRADE WITH CHINA THAN WITH THE UNITED STATES GLOBALLY. I THINK THE STORY IS ON SANCTIONS, THEY DON'T HAVE TO BE LEAKPROOF. IF YOU CAN KNOCK OFF ONE OR TWO PERCENTAGES OF POINTS OF CHINESE GROWTH JUST BECAUSE SOME PEOPLE ARE SANCTIONING LIKE WAR MATERIAL, THAT WOULD BE A VERY LIKELY THING. THE CUMULATIVE EFFECTS OF DOING THAT TO A COUNTRY OVER GENERATIONS IS THE DIFFERENCE BETWEEN NORTH AND SOUTH KOREA. IT ADDS RIGHT UP."
        }
    }
]