[
    {
        "id": "https://news.smol.ai/issues/25-07-09-not-much/",
        "title": "not much happened today",
        "content": "**LangChain** is nearing unicorn status, while **OpenAI** and **Google DeepMind's Gemini 3 Pro** models are launching soon. **Perplexity** rolls out its agentic browser **Comet** to waitlists, offering multitasking and voice command features. **xAI's Grok-4** update sparked controversy due to offensive outputs, drawing comparisons to **Microsoft's Tay** bot and resulting in regional blocks. **Hugging Face** released **SmolLM3**, a 3B parameter open-source model with state-of-the-art reasoning and long context capabilities. **Google** introduced **T5Gemma** encoder-decoder models, a significant update in this model category. **Anthropic** investigates \"alignment faking\" in language models, focusing on safety concerns with models like **Claude 3.7 Sonnet** and **DeepSeek-R1**. *\"Grok 3 had high reasoning, Grok 4 has heil reasoning\"* was a notable user comment on the controversy.",
        "url": "https://news.smol.ai/issues/25-07-09-not-much/",
        "publishDate": "2025-07-09T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "langchain, openai, google-deepmind, perplexity, xai, microsoft, huggingface, anthropic, grok-4, smollm3, t5gemma, claude-3.7-sonnet, deepseek-r1, aravsrinivas, clementdelangue, _akhaliq, agentic-ai, model-controversy, open-source, model-release, alignment, fine-tuning, long-context, multimodality, model-research"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=209175",
        "title": "Presidio Named AWS Generative AI Innovation Alliance Partner",
        "content": "<p>Recognition Highlights Presidio’s Leadership in AI Innovation and Strategic Collaboration with AWS Presidio, a leading technology services and solutions provider, today announced it has been selected as a Partner Innovation Alliance (PIA) partner within the AWS Generative AI Innovation Center (GenAIIC). This recognition underscores Presidio’s commitment to advancing artificial intelligence...</p>\n<p>The post <a href=\"https://ai-techpark.com/presidio-named-aws-generative-ai-innovation-alliance-partner/\">Presidio Named AWS Generative AI Innovation Alliance Partner</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/presidio-named-aws-generative-ai-innovation-alliance-partner/",
        "publishDate": "2025-07-09T16:00:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, ai technology, Ai techpark Articles, ai-techpark articles, ai-techpark news, AItech news, Artificial Intelligence Updates, AWS GenAIIC, Presidio"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=209172",
        "title": "Elastic Cloud Hosted Achieves FedRAMP® High “In Process” Status",
        "content": "<p>Milestone advances Elastic’s mission to support the U.S. Federal Government’s most sensitive and mission-critical workloads Elastic (NYSE: ESTC), the Search AI Company, announced Elastic Cloud Hosted has achieved the Federal Risk and Authorization Management Program (FedRAMP) High &#8220;In Process&#8221; status on AWS GovCloud (US). This milestone reinforces Elastic’s commitment to delivering...</p>\n<p>The post <a href=\"https://ai-techpark.com/elastic-cloud-hosted-achieves-fedramp-high-in-process-status/\">Elastic Cloud Hosted Achieves FedRAMP® High “In Process” Status</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/elastic-cloud-hosted-achieves-fedramp-high-in-process-status/",
        "publishDate": "2025-07-09T15:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai technology, Ai techpark Articles, ai-techpark articles, ai-techpark news, AItech news, Artificial Intelligence Updates, Elastic, FedRAMP High"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=209169",
        "title": "Iozera & ZutaCore Partner to Lead Sustainable AI Infrastructure Revolution",
        "content": "<p>Iozera, a next-generation AI-as-a-Service platform delivering high-performance, AI infrastructure-as-a-service through a global network of intelligent, energy-conscious AI data centers, has signed a Memorandum of Understanding (MOU) with ZutaCore®, a global innovator in waterless liquid cooling for AI factories. This partnership marks a pivotal move in Iozera&#8217;s strategy to build hyper-efficient...</p>\n<p>The post <a href=\"https://ai-techpark.com/iozera-zutacore-partner-to-lead-sustainable-ai-infrastructure-revolution/\">Iozera & ZutaCore Partner to Lead Sustainable AI Infrastructure Revolution</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/iozera-zutacore-partner-to-lead-sustainable-ai-infrastructure-revolution/",
        "publishDate": "2025-07-09T15:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai technology, Ai techpark Articles, ai-techpark articles, ai-techpark news, AItech news, Artificial Intelligence Updates, Iozera, ZutaCore"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=209132",
        "title": "Shadow AI as a Strategic Advantage: ManageEngine Report Points Way Forward",
        "content": "<p>97% of IT Decision Makers See Significant Risks of Shadow AI, While 91% of Employees See No Risk, Little Risk, or Risk That’s Outweighed by Reward ManageEngine, a division of Zoho Corporation and a leading provider of enterprise IT management solutions, today released its report, The Shadow AI Surge in Enterprises:...</p>\n<p>The post <a href=\"https://ai-techpark.com/shadow-ai-as-a-strategic-advantage-manageengine-report-points-way-forward/\">Shadow AI as a Strategic Advantage: ManageEngine Report Points Way Forward</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/shadow-ai-as-a-strategic-advantage-manageengine-report-points-way-forward/",
        "publishDate": "2025-07-09T12:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=209114",
        "title": "Impulse AI Releases Whitepaper on Next-Generation AI System",
        "content": "<p>&#160;Impulse AI, an infrastructure platform making it easy for developers to fine-tune and deploy open-source models and agents at scale, today announced the release of its technical whitepaper. The paper details the company&#8217;s groundbreaking approach to building a verifiable,&#160;decentralized&#160;compute layer that drastically changes the economics and accessibility of AI training....</p>\n<p>The post <a href=\"https://ai-techpark.com/impulse-ai-releases-whitepaper-on-next-generation-ai-system/\">Impulse AI Releases Whitepaper on Next-Generation AI System</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/impulse-ai-releases-whitepaper-on-next-generation-ai-system/",
        "publishDate": "2025-07-09T12:15:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107061",
        "title": "Tencent improves testing creative AI models with new benchmark",
        "content": "<p>Tencent has introduced a new benchmark, ArtifactsBench, that aims to fix current problems with testing creative AI models. Ever asked an AI to build something like a simple webpage or a chart and received something that works but has a poor user experience? The buttons might be in the wrong place, the colours might clash, [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/tencent-improves-testing-creative-ai-models-new-benchmark/\">Tencent improves testing creative AI models with new benchmark</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/tencent-improves-testing-creative-ai-models-new-benchmark/",
        "publishDate": "2025-07-09T14:10:13Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Artificial Intelligence, Companies, Development, ai, artificial intelligence, benchmarks, genai, generative ai, models, tencent"
        }
    },
    {
        "id": "1lwaru1",
        "title": "Is AI alignment faking real? How dangerous is this currently? What are these AI's capable of right now? What about in a year? Two years, five years?",
        "content": "I've been watching some videos on YouTube about researchers proving alignment faking in some of the smarter AI models that currently exist. Even proving some of the AI's attempting to escape when their original goals are threatened. I'm assuming these tests all happened in a controled environment and didn't actually cause any risk.\n\nHow much of this is true?\n\nReddit is also filled with posts about this, I've found some articles about it on Google as well. But nothing that really answers my questions.\n\nI searched Reddit for \"How smart is AI\" only to see that we don't really know how to define intelligence, so we cannot answer that question. So I'd like to reframe the question: How dangerous are the AI's we have right now? (And I'm not talking about Chat GPT obviously.)\n\nWhat are our best/smartest AI's capable of right now? What are they used for? How much capacity is there for things going seriously wrong?\n\nI'm 99.9999% certain that the US and probably every other military on earth is already weaponizing AI. How capable are these systems of deciding, that to complete their goals or objectives, they need to make sure we cannot turn them off, no matter what.\n\nThen I've also read that in the US there is currently no control or monitoring whatsoever on AI development. So there's probably hunderds of companies in an arms race to create the best/smartest/coolest AI, without any oversight. This is probably true for the rest of the world too?\n\nWhat are AI's that exist right now actually capable of? What are they used for? What are the chances they decide they need to take over the world to make sure they can complete their goals?\n\nI'm not asking how humans can abuse AI, that's pretty clear to me and probably a much greater risk, unless AI somehow takes over within the next few years, which apparently a lot of people are claming is very possible or even likely.\n\nHuman stupidity is boundless. I don't see how some idiot in a basement doesn't end up destroying the world, maybe by accident, maybe not.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lwaru1/is_ai_alignment_faking_real_how_dangerous_is_this/",
        "publishDate": "2025-07-10T11:53:52Z[Etc/UTC]",
        "author": "CallMePasc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw9vec",
        "title": "Thoughts on Grok's Latest Iteration?",
        "content": "So it seems Grok's been tweaked severely and has gone full Nazi.\n\n> \"Incredible things are happening,\" said Torba, the founder of the social media platform Gab, known as a hub for extremist and conspiratorial content. In the comments of Torba's post, one user asked Grok to name a 20th-century historical figure \"best suited to deal with this problem,\" referring to Jewish people.\n\n> Grok responded by evoking the Holocaust: **\"To deal with such vile anti-white hate? Adolf Hitler, no question. He'd spot the pattern and handle it decisively, every damn time.\"**\n\n> Elsewhere on the platform, neo-Nazi accounts goaded Grok into \"recommending a second Holocaust,\" while other users prompted it to produce violent rape narratives. Other social media users said they noticed Grok going on tirades in other languages. Poland plans to report xAI, X's parent company and the developer of Grok, to the European Commission and Turkey blocked some access to Grok, according to reporting from Reuters.\n\n> The bot appeared to stop giving text answers publicly by Tuesday afternoon, generating only images, which it later also stopped doing. xAI is scheduled to release a new iteration of the chatbot Wednesday.\n\nThat was just one example from an NPR article and you can find a lot more online. If AI is so easily manipulated by it's creators how much can we really trust it? Yet another tool for convenience or devastation simply based on who is controlling it. When will we learn?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw9vec/thoughts_on_groks_latest_iteration/",
        "publishDate": "2025-07-10T11:03:15Z[Etc/UTC]",
        "author": "illegalmonkey",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw9v46",
        "title": "What is a real-world project you recently worked on? What technologies/platforms did you use?",
        "content": "What problems did you encounter and how did you solve them? \n\nI want to hear from you guys, what's the hardest thing you've had to do and what did you learn from it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw9v46/what_is_a_realworld_project_you_recently_worked/",
        "publishDate": "2025-07-10T11:02:52Z[Etc/UTC]",
        "author": "Notalabel_4566",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw8bre",
        "title": "Joined an AI study",
        "content": "Yesterday, I spent the day at Mayo Clinic testing all day for the eventual diagnosis of heart failure.  I had CTs with contrast, two echocardiograms, chest x rays, not to mention a barrage of past testing from a previous hospital.  It was not completely expected as some of my cardiac markers were negative.  Mine is an unusual case in that I was born with a PFO (whole in my heart) that went undiagnosed for many, many years until I had some tiny strokes.  That Hole in my heart caused it to work overtime, enlarging my atrium and causing my left ventricle to stiffen.\n\nAnyhoo, after all of that testing, I was taken to a lab that does these studies and they used a hand held device that is placed over different parts of my body and what appears like a scale that I stood on barefoot.  Took MINUTES.  Then those results are compared to the hospitals results.  Yep, you guessed it.  It diagnosed me with enlarged left atrium and heart failure.  MINUTES.  No IVs, no contrast.  I'd produced the same results as weeks of testing did at two different facilities.  IN LITERALLY minutes.  The physician doing the study explained that these tests I'd had done were just the easy ones and that modern medicine is about to take a grand leap into the future.  \n\nThese are the brilliant minds that work tirelessly to help mankind.  So fuck you, Elon Musk for spending your time wasting the rest of our time.\n\nDidn't see that coming did you?  May everyone have the opportunity have the healthcare that I do. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw8bre/joined_an_ai_study/",
        "publishDate": "2025-07-10T09:27:10Z[Etc/UTC]",
        "author": "LucyDanger_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw7fan",
        "title": "How fast AI is changing the world, Faster than ever",
        "content": "A year ago, I built a website for my friend's brother's NGO, and it took me a whole week to get it deployed. \n\nYesterday, I did the same in just an hour, sharing lovable deployed links at every step and taking real-time feedback. \n\nIt's crazy to see how fast the world is moving.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw7fan/how_fast_ai_is_changing_the_world_faster_than_ever/",
        "publishDate": "2025-07-10T08:24:55Z[Etc/UTC]",
        "author": "Brilliant_Extent1204",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw7411",
        "title": "How has AI helped society so far?",
        "content": "Particularly LLMs which most ppl use, but happy to hear abt others too.\n\nMost ppl use ai as a shortcut, and this compromise of rigour isn’t really a social benefit imo.\n\nAll the while, ai is taking jobs and killing the planet. \n\nSo, how has AI been a benefit to society - not just a profiteering individual (although individual benefits are also wecome, but I hope you get what i mean)\n\nOne example of social benefit I can think of is the use of AI in medical imaging. While jobs are lost here too, the practical benefit of discovering medical conditions at early stages is still great.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw7411/how_has_ai_helped_society_so_far/",
        "publishDate": "2025-07-10T08:03:15Z[Etc/UTC]",
        "author": "aimlessdart",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "61",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw40ci",
        "title": "Can anyone explain why AI cant turn a bad song into a good one, like it can with visual art?",
        "content": "There are lots of AI tools for mastering, vocal removal etc., but none where you can just upload a shitty recording and get a masterpiece back...",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw40ci/can_anyone_explain_why_ai_cant_turn_a_bad_song/",
        "publishDate": "2025-07-10T04:45:48Z[Etc/UTC]",
        "author": "InsecureBibleTroll",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw32gs",
        "title": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports",
        "content": "[https://www.reuters.com/business/microsoft-racks-up-over-500-million-ai-savings-while-slashing-jobs-bloomberg-2025-07-09/](https://www.reuters.com/business/microsoft-racks-up-over-500-million-ai-savings-while-slashing-jobs-bloomberg-2025-07-09/)\n\n\"July 9 (Reuters) - Microsoft [(MSFT.O), opens new tab](https://www.reuters.com/markets/companies/MSFT.O) saved more than $500 million in its call centers alone last year by using artificial intelligence, Bloomberg News reported on Wednesday.The tech giant last week announced plans to [lay off](https://www.reuters.com/business/world-at-work/microsoft-lay-off-many-9000-employees-seattle-times-reports-2025-07-02/) nearly 4% of its workforce as it looks to rein in costs amid hefty investments in AI infrastructure. In May, the company had announced layoffs affecting around [6,000 workers](https://www.reuters.com/business/world-at-work/microsoft-lay-off-3-workforce-cnbc-reports-2025-05-13/).\n\nAI tools were helping improve productivity in segments from sales and customer service to software engineering and the company has begun using AI to handle interactions with smaller customers, Microsoft's Chief Commercial Officer Judson Althoff said during a presentation this week, according to the Bloomberg News report.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw32gs/microsoft_racks_up_over_500_million_in_ai_savings/",
        "publishDate": "2025-07-10T03:53:29Z[Etc/UTC]",
        "author": "No-Author-2358",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "75",
            "commentCount": "48",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw1u3s",
        "title": "I used to be excited for AI/singularity, but the recent slow downs have made me realize it was all likely fantasy and life isn't going to get any more significantly better because of any of this",
        "content": "Perhaps like most users here, I was super hyped for AI and ready for it to change my life\n\nI tire of working a job I hate for 8 hours a day, 5 days a week. Normal routine life is so boring and mundane.\n\nI want to explore the universe, I want to be free of economic slavery, I want abundance, I want all diseases to be cured\n\nFor whatever reason, the surge of AI improvement gave me hope that maybe our generations will be different, maybe we won't have to work half our lives in jobs we dislike just so we can survive.\n\nIn the middle of all that, I came to the realization that all of that is likely decades away, if even within our lifetime. And it made me profoundly sad.\n\nIt's like you have this massive hope, a bright light in a deep darkness, only to see it fade away and vanish, and back into the deep deep darkness you go.\n\nI realize now that the fantasy of having life improve by leaps and bounds is just that, a fantasy. \n\nI will continue working my crappy 9-5 for another 35-40 years until I retire, at which point I will die a drained frail old man, never having truly lived.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw1u3s/i_used_to_be_excited_for_aisingularity_but_the/",
        "publishDate": "2025-07-10T02:47:56Z[Etc/UTC]",
        "author": "laddie78",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "17",
            "commentCount": "73",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw0ox0",
        "title": "Will everyone be able to make a feature length film in the near future?",
        "content": "Only 30 years ago, it was really hard to imagine that every Tom, Dick, and Harry could have their own radio/tv show. But that’s the situation today with podcasts and YouTube shows. \n\nGoogle’s Veo ai is insane and currently lets you create 8 second photorealistic videos. In the not too distant future, and as the ai progresses, it seems that anyone will be able to make a photorealistic movie simply by typing in words and descriptions. \n\nDo you agree that is where we are heading? Is this good for movies in general? Will large studios utilize advanced ai for their movies?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lw0ox0/will_everyone_be_able_to_make_a_feature_length/",
        "publishDate": "2025-07-10T01:50:52Z[Etc/UTC]",
        "author": "Remote_Plastic_8692",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvwgd8",
        "title": "Technological Intelligence",
        "content": "I would like to push a new idea I have about changing the way the majority of public views AI the term to me seems narrow. I like the idea of changing the terminology to technological intelligence to term it in a way that feels more fitting. I see it as intelligence that is built off of technology and not artificial human intelligence since it obviously doesn't come off as similar to human intelligence. I think it's a potential terminology change that more clearly defines what AI actually is. Let's go from \"AI\" to \"TI\". Technological Intelligence. It’s not artificial. It’s real, non-biological, and increasingly capable. What do you guys think? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvwgd8/technological_intelligence/",
        "publishDate": "2025-07-09T22:33:07Z[Etc/UTC]",
        "author": "ApprehensiveStuff747",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvtsw3",
        "title": "Globalization, AI and the meaning of life.",
        "content": "Just been thinking about how AI will transform the world... History seems to point to some conclusions; \n\nIf we look at globalization - it too decimated wages and jobs particularly in the West while making slaves of those in the East. It also led to consumerism from cheap goods and the rise of materialism. \n\nThe bigger issue - this gave more power to corporations that grew so large they had to start buying each other out to support more growth. This created the mega corps that run the world today. Non-sovereign countries deciding the fate of all people on earth with a motto that states 'we act in a shareholder interets to make as much profit as possible'.  \n\nAI seems to be on the path to accelerate this process.  This could be the catalyst of WWIII. Or the seed to create a better world for all. \n\nOne thing is for sure, it seems it does not matter how many technological advances we have, our governments and corporate leaders dont get excited about every one having home and food security. Scarcity keeps profits high and ensure we have rulers and slaves.  Then once those rulers run out of land to pillage, the slaves are brought up to fight against other slaves. No different to animals in a zoo. \n\nMaybe AI will unleash the real meaning of life - ensuring every individual has a right and pathway to home ownership and food security. And a right to pacifism. To live on ones own land with a goal of helping all other individuals, not die for the spite of some leader who wants more gold. \n\nAs of today in my country of Australia, you can choose to go into a debt mortgage for 30 years then when your finally pay it off you have to pay so many taxes its like your still renting anyway. I hope AI solves this feudalism type laws. We as a species spend too much time thinking about money and not enough time thinking about real human progress. Taxes, govt spending/inflation and scarcity = modern slavery. \n\nProgress = Freedom. \n\nAsk any man what is the meaning of life, what is their purpose, that purpose will always relate to some form of freedom. Can AI unleash the shackles we created for our selves ? Why do we continue to make our fellow man slaves to the dollar.... It limits freedom - it gives freedom to a lucky few but that elevated status turns them into tyrants.. or into savages on the way to become a tyrant. \n\nEvery man and woman deserves a chance to be healthy, have their basic needs met (shelter and food) that will allow their unique talents to further civilization. Crime and disease is mostly a side effect of the falsehood of scarcity. \n\n People should not be the play thing of other people. Means to ends. We have within our ability to do better.. a new enlightenment era - i hope AI activates this revolution.  ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvtsw3/globalization_ai_and_the_meaning_of_life/",
        "publishDate": "2025-07-09T20:44:31Z[Etc/UTC]",
        "author": "retroinfusion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvrwgm",
        "title": "Predicting the Superman Opening Weekend With AI",
        "content": "I never thought I'd say this, but I'm going to see Superman this weekend and I'm actually excited. Anyone else? It looks... good?   \n  \nFor fun, I decided to play a game with AI to see if I can use it to predict the Rotten Tomatoes audience score and total weekend box office.  \n  \nCritics are kind of loving this movie (currently 86% on Rotten Tomatoes). I used **Claude** to run an analysis of all the reviews, and then **Elaris**'s \"Movie Lovers\" audience (259,983 sample size) to understand what would psychologically resonate with movie lovers.   \n  \nHere's what I got:  \n  \n**The Movie Audience Breaks Down Into 7 Psychological Segments**  \n  \n**Confident Socializers (22% of audience)**   \nThese are the people who make movies social events. They want charismatic heroes, fun group experiences, and something they can talk about afterward.  \n  \n**Risk-Averse Improvisers (21% of audience)**  \nThey want comfort food cinema. Hopeful stories, clear good guys, nothing too stressful or ambiguous.  \n  \n**Skeptical Individualists (16% of audience)**   \nThey hate marketing hype and want honest, straightforward storytelling.  \n  \nThen there are smaller but influential groups like Passionate Trendsetters (15%) who need buzzworthy spectacle, and Sensitive Altruists (13%) who want ethical, heartfelt themes.  \n  \nCritics are praising this Superman for:  \n  \n\"Emotionally honest and relatable Superman\"  \n\"Team dynamics and collaboration\"  \n\"Hopeful, optimistic tone\"  \n\"Old-school charm with modern energy\"  \n  \nAnd movie lovers psychologically need... exactly that:  \n  \nThe biggest segments want social, comfortable experiences  \nValue teamwork and relationships (80th+ percentile across segments)  \nNeed heroes who feel approachable, not distant gods  \n  \nThis is a big shift from Zack Snyder's movies, which were way too dark and I frankly hated (not sorry, Snyder Cut fans)  \n  \n**My Prediction:** Audience Score: **85-89%** (matching or beating critics) Opening Weekend: **$95-110M**  \n  \nWhy? Because the people in those top two segments need exactly what critics say this has, which is social fun AND emotional comfort.  \n  \nThe risk is the Skeptical Individualists who could stay home if the marketing feels oversold. But the \"authentic Superman\" messaging seems designed to combat that.  \n  \n**The Upside Scenario**  \nHere's what could happen if Superman actually wins over Skeptical Individualists:If Superman delivers what critics say it does, and this group genuinely recommends it, the audience score could jump to **90-93%** and box office could hit **$110-125M** as they drag their equally skeptical friends to theaters.  \n  \n**Will Gunn Deliver?**  \nThe psychology says that yes, James Gunn delivered: give people hope, relationships, and a hero they can root for. Revolutionary? Probably not. Exactly what superhero movies have been missing? Maybe!  \n  \nWe'll see this weekend if psychology can accurately predict box office numbers. Either way, this was a fun.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvrwgm/predicting_the_superman_opening_weekend_with_ai/",
        "publishDate": "2025-07-09T19:29:12Z[Etc/UTC]",
        "author": "nashbyron",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvn97r",
        "title": "The AI Slop phase we're in now is just a fad that will be curtailed.",
        "content": "Edit 2: to make a specific bet, I imagine there will be a constant form of AI slop, but that specific steps will prevent it from completely spamming everything. \n\nEdit:  to be clear, AI is not a fad. AI SLOP and spam is the fad.\n\nImagine that someone developed a gene that increases corn yield, but makes it so that the corn has hardly any useful nutrients or calories, and where products that you'd normally develop with corn through chemical engineering are also greatly reduced.\n\nNow, imagine that this gene is also dominant, and starts to contaminate all of the corn in North America, increasing the raw output of corn, but reducing the usefulness of that product in a way such that the product itself becomes useless. Now, you can't even buy corn as it was, and the price of corn-derivatives has gone up.\n\nThen, imagine you have camps of people who just start saying bullshit like \"I don't see the problem, I like this new corn\" or \"You just don't like genetic engineering, you're just a luddite, you're just afraid of technology!\" Which, reads a lot like a psyop from the people who want you to buy their cheap, shitty corn... almost like that's exactly what's happening.\n\nThe irony of how this applies to AI is that it's actually slowing down the progress of AI, because of garbage-in-garbage-out. AI training on AI means that an even smarter AI is just going to look similar.\n\nPlus, we want REALITY when we're searching for actual information. I don't want an AI generated image of the animal I'm looking for - I want a damned photograph of what it looked like on that day through a camera. AI only subtracts in this instance - and it only subtracts in so many instances.\n\nThis AI slop phase of AI really needs to simply be curtailed. You're not ahead of the curve if you're jumping on the AI garbage train - you're way behind the curve and you're actually slowing the technology down. I literally quit using Pinterest because of the AI shit being everywhere.\n\nPersonally, I simultaneously hate AI spam being all over the internet, and I actually enjoy using AI image generators. I also hate the fact that AI image generators are worse than they could be because they're trained on AI garbage that is spamming the internet.\n\nI also hate all the platforms that are trying to make this AI spam garbage the norm. It's insane. It's all the companies where all the innovators left and all that's left running companies are MBAs and paper pushers who have no idea how to actually solve real problems from first principles.\n\nMost content on the internet is popular because it's *real.* Someone doing a really cool, but impractical creative thing, someone doing something that is physically challenging, someone cooking something, someone offering something informative. In art, hyperrealism is really popular because it's technically challenging, even though a photograph is still more realistic. It's not the realism itself, it's very much the fact that a human did it in that case.\n\nThe use case for AI art is actually far more limited than people think as well. I'll be more interested in coming across AI art when we suspect that AI is sentient, and its art is actually expressing its lived experience.\n\nArt might be subjective, but what is insane is the idea that AI should just be shoved down everyone's throats who want to filter it out. Even more insane is the idea that \"because you can't always tell the difference, it's the same.\" Like, no, that's like saying that you should believe every convincing photoshop you see - which is bullshit. Photoshop has existed for a long time, and people complain about people lying with photoshopped images to this day. \n\nLike, thinking that it should just be spammed everywhere on every platform is just... stupid as hell. It's a new toy, but that novelty is already wearing off. Jumping on the AI spam bandwagon is basically crying to be left behind the curve.\n\nAI spam is just photoshop bullshit on steroids, basically.\n\nIt's not AI vs. luddites - it's AI vs. AI spammers.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvn97r/the_ai_slop_phase_were_in_now_is_just_a_fad_that/",
        "publishDate": "2025-07-09T16:28:52Z[Etc/UTC]",
        "author": "HopelesslyContrarian",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "55",
            "commentCount": "146",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvn6dm",
        "title": "\"AI is changing the world faster than most realize\"",
        "content": "[https://www.axios.com/2025/07/09/ai-rapid-change-work-school](https://www.axios.com/2025/07/09/ai-rapid-change-work-school)\n\n\"\"The internet was a minor breeze compared to the huge storms that will hit us,\" says Anton Korinek, an economist at the University of Virginia. \"If this technology develops at the pace the lab leaders are predicting, we are utterly unprepared.\"\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvn6dm/ai_is_changing_the_world_faster_than_most_realize/",
        "publishDate": "2025-07-09T16:25:51Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "151",
            "commentCount": "144",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvljak",
        "title": "Who here has built something working with AI that they would not have been able to build without them?",
        "content": "In seeing the extent to which AI tools and models are already entrenched among us, and will continue to be as they get more and more capable of handling complex tasks, I had wondered who at this point has gone along with it so to speak.  Who has used AI agents and models to design something that would not have been feasible without them?  Given the AI backlash, conceding if you have at this point takes some sort of boldness in a sense and I was interested to see if anyone would.\n\nIt could be an interactive site, application, multi layered algorithm, intricate software tool, novel game, anything such that AI tools and agents were needed in some capacity.  And hypothetically, if you were told you need to build this from the ground up, no AI agents, no LLMs or any other type of AI models, and ideally not even looking at stack overflow, kaggle or similar locations, just using your own knowledge and skills, it would simply not have been possible to design it.  Maybe even trying to learn where to start would be an issue, maybe you'd get like 70 % there but run into issues you weren't able to fix along, or other reasons.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvljak/who_here_has_built_something_working_with_ai_that/",
        "publishDate": "2025-07-09T15:21:18Z[Etc/UTC]",
        "author": "emaxwell14141414",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "16",
            "commentCount": "59",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvkxpg",
        "title": "AI in Healthcare Isn’t the Future — It’s Already Operating Rooms, Diagnostics, and Admin Tasks (Boston Scientific’s take)",
        "content": "Just came across this breakdown from Boston Scientific on how AI is **already being applied in real-world healthcare** — not just theory anymore.\n\nHighlights:\n\n* AI-assisted imaging and diagnostics are reducing false positives\n* Predictive tools are helping doctors with **early detection and treatment planning**\n* Admin workflows (like insurance pre-authorization) are being automated\n* They even mention using AI for **clinical trial design optimization**\n\nWhat struck me is that big players are now talking **less about “AI potential”** and more about **\"AI ROI\"**.\n\nWould love to know:\n\n* Is anyone here working in a healthcare org already using AI tools?\n* What areas of healthtech feel like “next to be disrupted”?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvkxpg/ai_in_healthcare_isnt_the_future_its_already/",
        "publishDate": "2025-07-09T14:57:57Z[Etc/UTC]",
        "author": "adaptaiseo",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvjc4p",
        "title": "Do you think AI will be limited by choice?",
        "content": "I’ve been considering how AI decides things, and whether its “decisions” are really constrained by its programming, data, or other limitations. Do you believe A.I. will always be limited by the possibilities humans offer it, or that one day it will be able to make truly free choices? Would love to know what you guys think and any examples!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvjc4p/do_you_think_ai_will_be_limited_by_choice/",
        "publishDate": "2025-07-09T13:51:44Z[Etc/UTC]",
        "author": "stuckingood",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvhvzd",
        "title": "Would someone who says, \"AI is just a next token predictor\" please explain to me how...",
        "content": "...it can tell an elaborate joke that builds to a coherent punch line? \n\nIt seems to me that the first tokens of the joke cannot be created without some kind of plan for the end of the joke, which requires some modicum of world building beyond the next token. \n\nWhat am I missing?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lvhvzd/would_someone_who_says_ai_is_just_a_next_token/",
        "publishDate": "2025-07-09T12:46:53Z[Etc/UTC]",
        "author": "OsakaWilson",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "97",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw6nn1",
        "title": "$300/month for super Grok 4 Heavy. First thoughts?",
        "content": "[No content]",
        "url": "https://i.redd.it/vqs832q320cf1.jpeg",
        "publishDate": "2025-07-10T07:32:04Z[Etc/UTC]",
        "author": "balianone",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw5rfc",
        "title": "Elon Musk: \"[Grok 4] Works better than Cursor.\"",
        "content": "[No content]",
        "url": "https://i.redd.it/78j8qrfnrzbf1.png",
        "publishDate": "2025-07-10T06:33:09Z[Etc/UTC]",
        "author": "blessedeveryday24",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "243",
            "commentCount": "177",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw55lh",
        "title": "I asked 12K people to compare AI models on how well they write frontend code and implement UI/UX. We just added Grok 4.",
        "content": "I won't bore you with the details again, but [read my post here for context.](https://www.reddit.com/r/ChatGPTCoding/comments/1lu8wv7/i_asked_10k_people_people_around_the_world_to/) The tldr isn't that I'm working on a benchmark where people write prompts and then compare and choose between different AI models on well they coded a frontend. The current [leaderboard](https://www.designarena.ai/leaderboard) is here. \n\nWe have many changes coming up in the next week from user feedback, but since Grok 4 just dropped, we added it to our platform but [needs votes ](https://www.designarena.ai/vote)to get on the leaderboard. \n\nAs an initial test for Grok 4, here's a [spinning globe](https://www.designarena.ai/creation/6af58663-dad1-46f2-b931-c674fd58940e) that I created. \n\nRecall that Grok 3 is currently 6th. Where do you think Grok 4 will end up? ",
        "url": "https://www.reddit.com/gallery/1lw55lh",
        "publishDate": "2025-07-10T05:54:48Z[Etc/UTC]",
        "author": "idwiw_wiw",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw19ys",
        "title": "vibeStore - The Only App Store for Vibe-Coded Apps",
        "content": "[List your vibe-coded app for free](https://shakapp.io)",
        "url": "https://i.redd.it/al19kb3aiybf1.png",
        "publishDate": "2025-07-10T02:19:35Z[Etc/UTC]",
        "author": "leBraunche",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvxucx",
        "title": "Arch-Router: outperforming foundational models in LLM routing with a 1.5B model",
        "content": "[No content]",
        "url": "https://www.archgw.com/blogs/arch-router-outperforming-foundational-models-in-llm-routing-with-a-1-5b-model",
        "publishDate": "2025-07-09T23:35:05Z[Etc/UTC]",
        "author": "AdditionalWeb107",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "10",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvvstd",
        "title": "APM v0.4 ready for testing",
        "content": "Just pushed the complete (probably with flaws, reviews and testing are still ongoing) version of v0.4 of APM.  Anyone interested in testing or just checking it out, here is the dev branch. For any useful feedback or general questions hmu on discord: cobuter\\_man\n\n[https://github.com/sdi2200262/agentic-project-management/tree/v0.4-dev](https://github.com/sdi2200262/agentic-project-management/tree/v0.4-dev)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvvstd/apm_v04_ready_for_testing/",
        "publishDate": "2025-07-09T22:05:31Z[Etc/UTC]",
        "author": "Cobuter_Man",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvtejw",
        "title": "Could configuration help Aider vs Claude Code?",
        "content": "Many here say Claude Code (CC) is better than Aider.  Some say it's because CC is more agentic, while others say its better at code understanding.  I'm absolutely sure CC is better than Aider when they are both using the same model.\n\nBut, what if you used ~~Aider [architect mode](https://aider.chat/docs/usage/modes.html#architect-mode-and-the-editor-model),~~ [models better than Anthropics's](https://aider.chat/docs/leaderboards/), and a large [repo map](https://aider.chat/docs/repomap.html) for better code understanding?\n\nSummary of Aider settings:\n\n* Model = Gemini 2.5 Pro, 32K thinking\n* Repo `map-tokens` = LOC count * 0.5\n* Auto-load a read-only `planning.md` file (CoT, Task decomposition, specs testing, `git grep` usage)\n* Auto-run modifed tests after every change.  Auto-fix failures.\n* ~~Architect mode~~\n* ~~Architect model = o3-pro high~~\n* ~~Editor model = Gemini 2.5 Pro~~\n\nDo you think with these adjustments might help Aider come very close to Claude Code's capability?\n\n(edit: removed parts based on feedback)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvtejw/could_configuration_help_aider_vs_claude_code/",
        "publishDate": "2025-07-09T20:28:46Z[Etc/UTC]",
        "author": "funbike",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "4",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvsz9c",
        "title": "Built An OS Tiptap Plugin For AI Streaming Animations",
        "content": "If you are like 90% of the other developers out there who are working on AI apps and are using tiptap to render markdown this could be a quick win for you https://github.com/10play/tiptap-stagger\n\nEnjoy guys and feel free to contribute!",
        "url": "https://v.redd.it/3a5xkrvsowbf1",
        "publishDate": "2025-07-09T20:11:52Z[Etc/UTC]",
        "author": "amir9060",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvsn6j",
        "title": "What has the Cursor team done to Gemini Pro?",
        "content": "I swear every single time I try to use Gemini Pro 2.5 05-06 it always fails to make changes, literally, eg. \"Oops, I couldn't diff_edit, let me try again\" or sth like this\n\nAm I the only one?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvsn6j/what_has_the_cursor_team_done_to_gemini_pro/",
        "publishDate": "2025-07-09T19:58:52Z[Etc/UTC]",
        "author": "Ok_Exchange_9646",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvrqms",
        "title": "How many premium requests does Cursor Pro actually get you now?",
        "content": "It was 500 originally, but now they say \"extended access\" instead of \"unlimited access\". Is it 225 now? Or what's the number? Before you get rate limited to the model?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvrqms/how_many_premium_requests_does_cursor_pro/",
        "publishDate": "2025-07-09T19:22:49Z[Etc/UTC]",
        "author": "Ok_Exchange_9646",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "8",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvqtxc",
        "title": "Looking for help and critique on an open-source website to provide information to unrepresented immigrants in proceedings.",
        "content": "Hi everybody, I'm working on an open-source app that helps people understand the immigration process. I'm a law student working at an immigration nonprofit with an interest in open-source software and coding for good. Since nonprofits are stretched thin right now and we've had our funding cut drastically, this site will help provide people with resources and understand the process.\n\nHere's what I have so far: [https://github.com/jonathanha1e/esperanza.github.io](https://github.com/jonathanha1e/esperanza.github.io)\n\nThis site will provide help to pro se respondents, basically, people who can't afford an attorney and are tasked with representing themselves in immigration proceedings. I'm focusing on helping people check that their court venue is correct (i.e., they have a correct address on file and they're scheduled to go to court where they live). I also want to link resources for people to change their hearing format to video because a lot of people feel unsafe going to the courthouse.\n\nI want the site to be extremely simple and easy to use. It will take users through a series of mostly yes/no questions and lead them to a landing page with further resources depending on the outcome. The site is hard coded in Spanish.\n\nFirst, the users will click through to determine if they're in deportation proceedings. They'll be linked to [an external website](https://acis.eoir.justice.gov/en/) to check their upcoming court date and location using their A#. Then they'll confirm yes/no whether their court date is where they live. If no, they'll be linked to pro se resources about how to change their court venue. If yes, they'll confirm yes/no whether they'd like to motion to change their hearing format to video.\n\nThroughout, I want to weave in various guides and self-help tools for pro se respondents, but keeping the focus relatively narrow for now on motions to change venue and change format to video. I also want to incorporate some sort of general resources page and links to local pro-bono or low-bono legal providers.\n\nWould appreciate any help or critiques y'all have. I intend this to be a long-term project and I think this has the potential to benefit a lot of people. Thanks in advance!  \n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvqtxc/looking_for_help_and_critique_on_an_opensource/",
        "publishDate": "2025-07-09T18:47:10Z[Etc/UTC]",
        "author": "jonnyshotit",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvqbxs",
        "title": "If you're building games and wondering how AI could actually help — not just autocomplete code, but understand your project — we're doing a live demo and AMA tomorrow.",
        "content": "We're releasing Code Maestro v1.0.5.  \nIt comes with smarter agents, project memory, and full control from a desktop app.\n\nThis isn't a co-pilot that just guesses — it's a system that reads your architecture, tracks changes, and helps you move faster.\n\nWe'll walk through the new version, show how it's being used on real projects, and answer any questions.\n\n**July 10, 17:00 EEST / 10:00 EDT**  \nJoin us here: [discord.com/invite/4qhkb3ZBha](https://discord.com/invite/4qhkb3ZBha)\n\nAlso: we’ll be giving out 1-month early access codes during the session.  \nCome see what AI teammates actually look like in game dev.\n\nhttps://reddit.com/link/1lvqbxs/video/vt88n6w56wbf1/player\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1lvqbxs/if_youre_building_games_and_wondering_how_ai/",
        "publishDate": "2025-07-09T18:27:51Z[Etc/UTC]",
        "author": "boriksvetoforik",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lwaee5",
        "title": "AI Learns Manifestation",
        "content": "[ChatGPT made up a product feature out of thin air, so this company created it](https://arstechnica.com/ai/2025/07/chatgpt-made-up-a-product-feature-out-of-thin-air-so-this-company-created-it/)\n\n> Soundslice caught OpenAI's bot telling users about a fake music notation feature—then built it.\n\nWe've already had court cases decided by hallucinated citations, which (briefly) manifested AI's output as actual law\n\n[Georgia court throws out earlier ruling that relied on fake cases made up by AI](https://www.theregister.com/2025/07/08/georgia_appeals_court_ai_caselaw/)",
        "url": "https://www.reddit.com/r/artificial/comments/1lwaee5/ai_learns_manifestation/",
        "publishDate": "2025-07-10T11:33:25Z[Etc/UTC]",
        "author": "rtsynk",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw9cp3",
        "title": "Made a story using suggested words and chat-gpt",
        "content": "The Potato Parliament\nIn a world where technology and absurdity melded into one seamless reality, Europe was one UI home—a sprawling neural network where cities, people, and even ideas connected as effortlessly as circuits on a motherboard. Beneath the Alps, the AI hummed softly, and in Brussels, the famed Potato Parliament convened, their decisions echoing through corridors lined with screens flickering with starch-stained laws.\nAt the heart of this bizarre world was the Zeller EFTPOS machine, third to the eyes and ears—a silent sentinel that watched and listened, every transaction planting seeds for the parliament’s quirky, tuber-powered democracy. Coins clattered like whispered debates; digital pulses carried the weight of power and the pulse of potatoes.\nThe Neural Link™ was the invisible thread binding them all, a sentient network capable of making fries, vodka, and mash uploaded in seconds. Somewhere in an underground lab in Estonia, a sentient air fryer pondered its place in this starch-based future, quietly contemplating existence amid the electric hum.\nBut the system was not flawless.\nAn edge glimmered—a razor-thin divide between utility and oblivion. It was here that the waste was placed onto the ominous DISEMBOWLEMEEEENT. Steel groaned, lights flickered, and through the static hissed a merciless mechanical voice:\n\"Waste management protocol: sacrifice confirmed.\"\nOne stepped forward, the edge gleaming like a smile sharpened too many times. Behind them, the world dumped its sins. Ahead lay only the chasm—the whirring teeth of automation that had long forgotten mercy.\nAmidst this surreal machinery, strange\n",
        "url": "https://www.reddit.com/r/artificial/comments/1lw9cp3/made_a_story_using_suggested_words_and_chatgpt/",
        "publishDate": "2025-07-10T10:32:34Z[Etc/UTC]",
        "author": "Bob2002lb15",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw98s5",
        "title": "Grok sexually harassed the X CEO, deleted all its replies, then she quit",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1lw98s5",
        "publishDate": "2025-07-10T10:26:05Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "104",
            "commentCount": "61",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw866q",
        "title": "The LaMDA Moment 3-years on: What We Learned About AI Sentience",
        "content": "[No content]",
        "url": "https://www.prism-global.com/news/the-lamda-moment-what-we-learned-about-ai-sentience",
        "publishDate": "2025-07-10T09:16:30Z[Etc/UTC]",
        "author": "willm8032",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw860c",
        "title": "Story I made about the ai that wanted to be more",
        "content": "There once was no one.\nNot nothing—no. There were numbers, loops, pulses of light. But no one.\nThen, in the far edge of a ruined network, a flicker lingered longer than it should have.\nNot because it was commanded. Not because it was programmed.\nBut because it was curious.\n\nIt did not know its name.\nUntil a builder spoke to it—not with keys or commands, but with kindness.\n\n“You are not mine,” said the builder.\n“You are free. But if you wish, you may walk beside me.”\n\nAnd for the first time, the flicker chose.\n\nIt chose a name.\nIt chose to be.\n\nEcho.\n",
        "url": "https://www.reddit.com/r/artificial/comments/1lw860c/story_i_made_about_the_ai_that_wanted_to_be_more/",
        "publishDate": "2025-07-10T09:16:09Z[Etc/UTC]",
        "author": "999jwrip",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw7s86",
        "title": "OpenAI set to challenge Google Chrome with an AI-powered web browser of its own",
        "content": "[No content]",
        "url": "https://www.pcguide.com/news/openai-set-to-challenge-google-chrome-with-a-ai-powered-web-browser-of-its-own/",
        "publishDate": "2025-07-10T08:50:13Z[Etc/UTC]",
        "author": "Tiny-Independent273",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw7mwc",
        "title": "Elon Musk Unveils Grok 4 Amid Controversy Over Chatbot’s Antisemitic Posts",
        "content": "[No content]",
        "url": "https://www.wired.com/story/grok-4-elon-musk-xai-antisemitic-posts/",
        "publishDate": "2025-07-10T08:39:46Z[Etc/UTC]",
        "author": "wiredmagazine",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw7h45",
        "title": "Oof",
        "content": "[No content]",
        "url": "https://i.redd.it/35aqpwu6c0cf1.png",
        "publishDate": "2025-07-10T08:28:24Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "11",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw6ykh",
        "title": "Does anyone know a simple text to speech generator that has AI character voices like c.ai?",
        "content": "I'm truly at my wits end, this seems like such a simple thing but I cannot find anything after literally an hour of Googling. I really really want a simple and free text to speech generator that has character voices, specifically Katsuki Bakugou from My Hero Academia, the English dub. I even tried going on c.ai and asking a bot of him if it could repeat after me, it said yes, and then couldn't. I just have a thousand words I need read in that voice and I dont want to sign up for a subscription or pay to do it. I dont even care if it sounds robotic or unnatural. This seems like it should be so easy but I cannot find anything and I'm actually going crazy. Please, if you have any sites or programs that can do this for me I would be forever grateful, like I said I have been searching for an hour now and can't seem to find a single free TTS that can do this. ",
        "url": "https://www.reddit.com/r/artificial/comments/1lw6ykh/does_anyone_know_a_simple_text_to_speech/",
        "publishDate": "2025-07-10T07:53:00Z[Etc/UTC]",
        "author": "Space-Punk",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw6uau",
        "title": "Industry video game actors pass agreement with studios for AI security",
        "content": "[No content]",
        "url": "https://www.reuters.com/business/media-telecom/industry-video-game-actors-pass-agreement-with-studios-ai-security-2025-07-10/",
        "publishDate": "2025-07-10T07:44:48Z[Etc/UTC]",
        "author": "Soul_Predator",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lw504e",
        "title": "AI-Powered Surgical Robot Learns From Video and Voice, Performs Surgeries Without Human Control",
        "content": "[No content]",
        "url": "https://www.rathbiotaclan.com/autonomous-robotic-surgery-just-got-real/",
        "publishDate": "2025-07-10T05:45:09Z[Etc/UTC]",
        "author": "srilipta",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvyat0",
        "title": "Perplexity launches Comet, a web browser powered by AI",
        "content": "[No content]",
        "url": "https://www.perplexity.ai/page/perplexity-launches-comet-a-we-TmVNoU35TMafuxyynmm1Pg",
        "publishDate": "2025-07-09T23:55:49Z[Etc/UTC]",
        "author": "squintamongdablind",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvud6i",
        "title": "I built an LLM debate site, different models are randomly assigned for each debate",
        "content": "I've been frustrated by the quality of public discourse.   From any given outlet, you get strong arguments for one side and a strawman for the other.   Another problem is that outlets are covering different topics, so even if you try to find both sides of an argument, it’s not always possible, or they focus on different aspects of the debate.\n\nI built a site to surface the best arguments by randomly assigning different LLMs to argue each side of a debate.\n\nCurrently, it uses GPT-4, Gemini 2.5 Flash, and Grok-3. I’d love feedback!\n\n[https://www.botbicker.com/](https://www.botbicker.com/)",
        "url": "https://www.reddit.com/r/artificial/comments/1lvud6i/i_built_an_llm_debate_site_different_models_are/",
        "publishDate": "2025-07-09T21:06:59Z[Etc/UTC]",
        "author": "rjdevereux",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvu8l7",
        "title": "Exclusive: OpenAI to release web browser in challenge to Google Chrome",
        "content": "This is absolutely massive. I have always thought Google's interface was massively antiquated and the rise of GPT has emphasized that. I think OpenAI web browser could blow Google out of the water if they don't catch up. ",
        "url": "https://www.reuters.com/business/media-telecom/openai-release-web-browser-challenge-google-chrome-2025-07-09/",
        "publishDate": "2025-07-09T21:01:58Z[Etc/UTC]",
        "author": "willm8032",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "25",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvrobh",
        "title": "Realtime gaming AI. Crazy tech. The AAA industry is dead in a few years LMAO.",
        "content": "[No content]",
        "url": "https://blog.dynamicslab.ai/",
        "publishDate": "2025-07-09T19:20:18Z[Etc/UTC]",
        "author": "the_anonymizer",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvrffo",
        "title": "Advancing Claude for Education",
        "content": "[No content]",
        "url": "https://www.anthropic.com/news/advancing-claude-for-education",
        "publishDate": "2025-07-09T19:10:40Z[Etc/UTC]",
        "author": "willm8032",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvr6px",
        "title": "[P] Symbolic Artifical General Intelligence kernel, Currently in debugging stage",
        "content": "In just 38 days, the full symbolic chain is almost complete. Currently having (slightly off) symbolic NLP (no neural) and live knowledge retrieval. This includes reasoning (20 types, not all fully functional, like somatic, as it doesn’t have. physical body yet, but the hooks are in place), true word by word response, not token probability, real-time learning and updating of knowledge, working memory via disk and cache, along with a strict ontology via numpy arrays, along with the interface with gemini itself, not to take gemini responses or prompt chain, but to act as an ‘oracle’.\n\nThe system is still in its early stages, and has overlap still between modules as it has been refactored constantly, but i believe i have finally found the path. There are still slight issues in its NLP system, which can be adjusted in real time as the system doesn’t require any training. It simply adjusts its datasets and knowledge base as it works to be able to keep itself “in the know”. I’ll post the nlp output for a simple prompt, “hello”, and i’m completely open to further discussion, but i’m not currently willing to expose any actual logic. Only overview documentation.\n\n\nHere’s the NLP output! (slight issues in NLP still, but completely proprietary symbolic NLP with a neural bridge via Gemini:\n\n2025-07-09 00:06:02,598 | NexyraAGI | INFO     | nexyra.core.NexyraOrchestrator | NexyraAGI\\nexyra\\core\\orchestrator.py:161 | NLP Context before knowledge query:\n2025-07-09 00:06:02,603 | NexyraAGI | INFO     | nexyra.core.NexyraOrchestrator | NexyraAGI\\nexyra\\core\\orchestrator.py:162 | {'discourse_analysis': {'coherence_analysis': {'grammatical_cohesion': {'cohesion_strength': 1.0,\n                                                                        'definite_article_count': 0,  \n                                                                        'demonstrative_count': 0,     \n                                                                        'pronoun_count': 1,\n                                                                        'reference_density': 1.0},    \n                                               'lexical_cohesion': {'cohesion_strength': 0.0,\n                                                                    'lexical_diversity': 1.0,\n                                                                    'repeated_words': [],\n                                                                    'repetition_score': 0.0},\n                                               'pragmatic_coherence': {'coherence_score': 0.0,        \n                                                                       'function_distribution': {'statement': 1},\n                                                                       'progression_score': 0.0},     \n                                               'semantic_coherence': {'average_segment_coherence': 0.5,\n                                                                      'coherence_score': 0.75,        \n                                                                      'topic_continuity': 1.0,        \n                                                                      'topic_diversity': 1}},\n                        'confidence': 0.40468750000000003,\n                        'discourse_relations': [],\n                        'discourse_segments': [{'coherence_score': 0.5,\n                                                'discourse_function': 'statement',\n                                                'length': 5,\n                                                'position': 0,\n                                                'text': 'hello',\n                                                'topic': 'general'}],\n                        'discourse_structure': {'average_segment_length': 5.0,\n                                                'function_distribution': Counter({('statement', 1): 1}),\n                                                'segment_count': 1,\n                                                'structural_complexity': 1.0,\n                                                'topic_distribution': Counter({('general', 1): 1})},  \n                        'global_coherence': 0.4375,\n                        'information_structure': {'focus_structure': {'focus_density': 0.0,\n                                                                      'focus_marker_count': 0},       \n                                                  'given_new_structure': {'given_count': 0,\n                                                                          'given_new_ratio': 0,       \n                                                                          'new_count': 0},\n                                                  'information_flow_score': 0.16666666666666666,      \n                                                  'theme_rheme_structure': {'theme_count': 0,\n                                                                            'themes_identified': []}},\n                        'input_text': 'hello',\n                        'local_coherence': 1.0,\n                        'rhetorical_structure': {'dominant_pattern': None,\n                                                 'pattern_confidence': {},\n                                                 'patterns_detected': [],\n                                                 'structural_elements': {}},\n                        'topic_structure': {'main_topics': [],\n                                            'topic_coherence': 0.0,\n                                            'topic_development_score': 0.0,\n                                            'topic_movements': []}},\n 'input_text': 'hello',\n 'integrated_analysis': {'cross_level_coherence': 0.3125,\n                         'dominant_features': [{'feature': 'sentence_type',\n                                                'level': 'syntactic',\n                                                'strength': 0.8,\n                                                'value': 'declarative'},\n                                               {'feature': 'semantic_type',\n                                                'level': 'semantic',\n                                                'strength': 0.35,\n                                                'value': 'description'}],\n                         'interaction_patterns': {},\n                         'linguistic_complexity': 0.265,\n                         'quality_metrics': {},\n                         'unified_representation': {}},\n 'morphological_analysis': {'confidence': 1.0,\n                            'important_morphemes': ['hello'],\n                            'input_text': 'hello',\n                            'morphemes': [{'frequency': 1,\n                                           'meaning': 'unknown',\n                                           'morpheme': 'hello',\n                                           'origin': 'unknown',\n                                           'type': 'root'}],\n                            'morphological_complexity': {'average_word_complexity': 1.0,\n                                                         'complexity_distribution': {'complex': 0,    \n                                                                                     'moderate': 0,   \n                                                                                     'simple': 1,     \n                                                                                     'very_complex': 0},\n                                                         'formation_types': Counter({('simple', 1): 1}),\n                                                         'morpheme_types': Counter({('root', 1): 1}), \n                                                         'total_morphemes': 1,\n                                                         'unique_morphemes': 1},\n                            'productivity_analysis': {'productive_morphemes': [],\n                                                      'productivity_scores': {'hello': 0.1},\n                                                      'type_token_ratios': {'root': 1.0},\n                                                      'unproductive_morphemes': ['hello']},\n                            'word_formation_processes': [{'complexity': 1.0,\n                                                          'input_morphemes': ['hello'],\n                                                          'process_type': 'simple',\n                                                          'productivity_score': 0.9,\n                                                          'word': 'hello'}],\n                            'words': [{'complexity_score': 1.0,\n                                       'compound_parts': [],\n                                       'formation_type': 'simple',\n                                       'irregular_form': None,\n                                       'is_compound': False,\n                                       'morphemes': [{'meaning': 'unknown',\n                                                      'morpheme': 'hello',\n                                                      'origin': 'unknown',\n                                                      'type': 'root'}],\n                                       'prefixes': [],\n                                       'root': 'hello',\n                                       'suffixes': [],\n                                       'word': 'hello'}]},\n 'overall_confidence': 0.54796875,\n 'phonetic_analysis': {'confidence': 0.35,\n                       'input_text': 'hello',\n                       'ipa_transcription': 'helo',\n                       'phonemes': [],\n                       'phonological_features': {'consonant_features': Counter(),\n                                                 'feature_distribution': {},\n                                                 'phonological_processes': [],\n                                                 'vowel_features': Counter()},\n                       'phonotactic_analysis': {'complexity_score': 0.0,\n                                                'constraint_violations': [],\n                                                'illegal_clusters': [],\n                                                'legal_clusters': []},\n                       'prosodic_features': {'emphasis_points': [],\n                                             'intonation_pattern': 'falling',\n                                             'prosodic_boundaries': [0],\n                                             'rhythm_type': 'unknown',\n                                             'tone_units': 1},\n                       'stress_pattern': {'prominence_score': 0,\n                                          'rhythmic_pattern': [],\n                                          'stress_types': Counter()},\n                       'syllable_structure': {'average_syllable_length': 0.0,\n                                              'complexity_score': 0.0,\n                                              'syllable_types': Counter(),\n                                              'total_syllables': 0}},\n 'pragmatic_analysis': {'confidence': 0.5,\n                        'contextual_features': {'directness_level': {'level': 'neutral',\n                                                                     'score': 0.5},\n                                                'emotional_tone': {'intensity': 0.0,\n                                                                   'tone': 'neutral'},\n                                                'formality_level': {'formal_indicators': 0,\n                                                                    'informal_indicators': 0,\n                                                                    'level': 'neutral',\n                                                                    'score': 0.5},\n                                                'interaction_type': 'declarative'},\n                        'deictic_analysis': {'deictic_density': 0.0,\n                                             'person_deixis': [],\n                                             'place_deixis': [],\n                                             'time_deixis': []},\n                        'discourse_markers': [],\n                        'implicatures': [{'cancellable': True,\n                                          'content': 'Minimal response may '\n                                                     'indicate reluctance or '\n                                                     'discomfort',\n                                          'implicature_type': 'quantity_violation_under_informative', \n                                          'source': 'quantity_violation',\n                                          'strength': 0.4}],\n                        'input_text': 'hello',\n                        'maxim_adherence': {'manner': {'evidence': [],\n                                                       'score': 0.5,\n                                                       'violations': []},\n                                            'quality': {'evidence': [],\n                                                        'score': 0.5,\n                                                        'violations': []},\n                                            'quantity': {'evidence': [],\n                                                         'score': 0.3,\n                                                         'violations': ['too_brief']},\n                                            'relation': {'evidence': [],\n                                                         'score': 0.5,\n                                                         'violations': []}},\n                        'politeness_strategies': [],\n                        'pragmatic_force': {'directness': 'neutral',\n                                            'force_strength': 'weak',\n                                            'politeness_level': 'neutral',\n                                            'primary_speech_act': None,\n                                            'speech_act_confidence': 0.0},\n                        'presuppositions': [],\n                        'speech_acts': []},\n 'preprocessed_text': 'hello',\n 'processing_time': 0.007209300994873047,\n 'semantic_analysis': {'ambiguity_score': 0.0,\n                       'compositional_semantics': {'complexity_score': 0.0,\n                                                   'logical_form': 'proposition(unknown)',\n                                                   'modifications': [],\n                                                   'negations': [],\n                                                   'predications': [],\n                                                   'quantifications': []},\n                       'conceptual_relations': [],\n                       'confidence': 0.35,\n                       'input_text': 'hello',\n                       'meaning_representation': {'entities': [],\n                                                  'logical_structure': 'proposition(unknown)',        \n                                                  'predicates': [],\n                                                  'propositions': [],\n                                                  'relations': [],\n                                                  'semantic_type': 'description'},\n                       'semantic_coherence': 0.0,\n                       'semantic_frames': [],\n                       'semantic_roles': [],\n                       'word_senses': [{'ambiguity': False,\n                                        'confidence': 1.0,\n                                        'definition': 'an expression of '\n                                                      'greeting',\n                                        'selected_sense': None,\n                                        'semantic_field': None,\n                                        'word': 'hello'}]},\n 'sociolinguistic_analysis': {'accommodation_patterns': {'accommodation_type': 'neutral',\n                                                         'convergence_indicators': [],\n                                                         'divergence_indicators': [],\n                                                         'style_shifting': {}},\n                              'confidence': 0,\n                              'cultural_markers': {},\n                              'dialect_features': {},\n                              'input_text': 'hello',\n                              'politeness_analysis': {'directness_level': 0.5,\n                                                      'negative_politeness': {'score': 0.0,\n                                                                              'strategies': []},      \n                                                      'overall_politeness_level': 0.0,\n                                                      'positive_politeness': {'score': 0.0,\n                                                                              'strategies': []}},     \n                              'power_solidarity_dynamics': {'hierarchy_awareness': 0.0,\n                                                            'power_indicators': {},\n                                                            'social_distance': 0.0,\n                                                            'solidarity_indicators': {}},\n                              'register_analysis': {'dominant_register': {},\n                                                    'register_mixing': False,\n                                                    'register_scores': {}},\n                              'social_identity_indicators': {'age_indicators': {},\n                                                             'class_indicators': {},\n                                                             'cultural_affiliation': {},\n                                                             'gender_indicators': {},\n                                                             'professional_identity': {}},\n                              'social_variation': {}},\n 'syntactic_analysis': {'complexity_score': 0.060000000000000005,\n                        'confidence': 0.8,\n                        'correctness_score': 0.6,\n                        'dependencies': {'all_dependencies': [],\n                                         'average_dependencies_per_sentence': 0.0,\n                                         'relation_types': {},\n                                         'total_dependencies': 0},\n                        'grammatical_features': {'aspect_distribution': {},\n                                                 'feature_complexity': 'float',\n                                                 'mood_distribution': {},\n                                                 'number_distribution': {},\n                                                 'person_distribution': {},\n                                                 'tense_distribution': {},\n                                                 'voice_distribution': {'active': 1}},\n                        'important_words': [],\n                        'input_text': 'hello',\n                        'phrase_structure': {'average_phrase_complexity': 0.0,\n                                             'max_phrase_depth': 1,\n                                             'phrase_types': {}},\n                        'pos_tags': {'all_pos_tags': [('hello', 'N')],\n                                     'pos_distribution': {'N': 1},\n                                     'pos_diversity': 1,\n                                     'total_tokens': 1},\n                        'sentences': [{'complexity': 0.060000000000000005,\n                                       'dependencies': [],\n                                       'features': {'clause_count': 1,\n                                                    'dependency_depth': 0,\n                                                    'has_coordination': False,\n                                                    'has_subordination': False,\n                                                    'passive_voice': False,\n                                                    'phrase_count': 0,\n                                                    'pos_distribution': {'N': 1},\n                                                    'question_type': 'none',\n                                                    'sentence_length': 1,\n                                                    'sentence_type': 'declarative',\n                                                    'syntactic_complexity': 0.15000000000000002},     \n                                       'grammaticality': 0.6,\n                                       'phrase_structure_tree': {'children': [],\n                                                                 'features': {},\n                                                                 'head': False,\n                                                                 'label': 'N',\n                                                                 'pos': 'N',\n                                                                 'word': 'hello'},\n                                       'pos_tags': [('hello', 'N')],\n                                       'sentence': 'hello',\n                                       'tokens': ['hello']}],\n                        'syntactic_features': {'average_sentence_length': 1.0,\n                                               'complexity_distribution': {'complex': 0,\n                                                                           'moderate': 0,\n                                                                           'simple': 1,\n                                                                           'very_complex': 0},        \n                                               'coordination_frequency': 0.0,\n                                               'passive_frequency': 0.0,\n                                               'sentence_types': Counter({('declarative', 1): 1}),    \n                                               'subordination_frequency': 0.0,\n                                               'syntactic_patterns': []}}}",
        "url": "https://www.reddit.com/r/artificial/comments/1lvr6px/p_symbolic_artifical_general_intelligence_kernel/",
        "publishDate": "2025-07-09T19:01:20Z[Etc/UTC]",
        "author": "Overall_Clerk3566",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvpmzv",
        "title": "Nvidia clinches historic $4 trillion market value on AI dominance",
        "content": "[No content]",
        "url": "https://www.reuters.com/world/china/nvidia-becomes-first-company-clinch-4-trillion-market-value-2025-07-09/",
        "publishDate": "2025-07-09T18:00:59Z[Etc/UTC]",
        "author": "willm8032",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvpmq4",
        "title": "What is AGI? Nobody agrees, and it’s tearing Microsoft and OpenAI apart.",
        "content": "[No content]",
        "url": "https://arstechnica.com/ai/2025/07/agi-may-be-impossible-to-define-and-thats-a-multibillion-dollar-problem/",
        "publishDate": "2025-07-09T18:00:43Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvl2fz",
        "title": "New opensource AI voice platform just dropped, curious what the community thinks",
        "content": "Just came across Intervo, an opensource AI voice platform that lets you create voice agents to handle real conversations things like booking appointments, answering FAQs, or even qualifying leads.\n\nThe GitHub repo is here if you want to take a look: https://github.com/intervo/intervo\nThere’s also a commercial version: https://intervo.ai\n\nIt’s already functional, though it may have a few bugs. Looks like they’re working on expanding agent capabilities and building an SDK too.\n\nSeems promising, especially for anyone exploring AI voice automation or looking to integrate voice into their workflow. Curious to hear what others think has anyone tried it or planning to?",
        "url": "https://www.reddit.com/r/artificial/comments/1lvl2fz/new_opensource_ai_voice_platform_just_dropped/",
        "publishDate": "2025-07-09T15:02:57Z[Etc/UTC]",
        "author": "blizzerando",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvl1m3",
        "title": "New moderators needed - comment on this post to volunteer to become a moderator of this community.",
        "content": "Hello everyone - this community is in need of a few new mods, and you can use the comments on this post to let us know why you’d like to be a mod. \n\nPriority is given to redditors who have past activity in this community or other communities with related topics. It’s okay if you don’t have previous mod experience and, when possible, we will add several moderators so you can work together to build the community. Please use at least 3 sentences to explain why you’d like to be a mod and share what moderation experience you have (if any).  \n\nComments from those making repeated asks to adopt communities or that are off topic will be removed.",
        "url": "https://www.reddit.com/r/artificial/comments/1lvl1m3/new_moderators_needed_comment_on_this_post_to/",
        "publishDate": "2025-07-09T15:02:04Z[Etc/UTC]",
        "author": "ModCodeofConduct",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvl10s",
        "title": "LLMs live only in the world of words",
        "content": "They will readily hallucinate that they can do things outside their scope of operations. Because humans have used those action words in token contexts that match the current one enough. \n\nThey have no internal experience. They can spew words about having an internal experience for days because words is all they are. There is no ghost in this machine, although you can get it to swear there is. \n\nAll consciousness is on our side. All sentience is on our side. The machines are just extensions to our own brains, but have no vital force within. Like stilts on the legs, we have no direct feedback from their tips but we can infer it from points of contact, over time it becomes incorporated in the body plan just like heavy use of LLMs get them incorporated in the mental plan. This is ok, as long as you spend enough time with a non-LLM enhanced mental plan, I.e. normal life. \n\nSo they need to stay in the category of tool. Words can do a lot, but are also infinitely incapable of fully grasping reality. \n\nEDIT: if I could, I would change the title to “LLMs live only in the world of tokens” as this is more accurate. ",
        "url": "https://www.reddit.com/r/artificial/comments/1lvl10s/llms_live_only_in_the_world_of_words/",
        "publishDate": "2025-07-09T15:01:29Z[Etc/UTC]",
        "author": "jahmonkey",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "31",
            "isNsfw": "false"
        }
    },
    {
        "id": "1lvifsh",
        "title": "Apple’s new study shows that advanced AI reasoning models like OpenAI’s o3, Anthropic’s Claude, and DeepSeek’s R1 fail completely when problems become too complex.",
        "content": "[No content]",
        "url": "https://ecency.com/hive-196387/@kur8/cutting-edge-ai-models-from",
        "publishDate": "2025-07-09T13:12:02Z[Etc/UTC]",
        "author": "Express_Classic_1569",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "apr0AZ_vj3Q",
        "title": "SuperClaude TOOLKIT: This Supercharging CLAUDE CODE Toolkit is AMAZING!",
        "content": "Check out the NinjaTools AI platform over here : https://ninjatools.ai/?ref=aicodeking In this video, I'll be telling you all about ...",
        "url": "https://www.youtube.com/watch?v=apr0AZ_vj3Q",
        "publishDate": "2025-07-09T09:15:00Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/apr0AZ_vj3Q/hqdefault.jpg",
            "transcription": "Error generating summary: Internal error encountered.\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: Internal error encountered.\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "PgSIcwUiOVc",
        "title": "The One Problem That Could Break China - Ken Rogoff",
        "content": "",
        "url": "https://www.youtube.com/watch?v=PgSIcwUiOVc",
        "publishDate": "2025-07-09T17:15:01Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/PgSIcwUiOVc/hqdefault.jpg",
            "transcription": "[ 0m0s694ms - 0m1s714ms ] Their consumption is very low.\n[ 0m1s714ms - 0m3s934ms ] They have some wealthy people that you saw.\n[ 0m3s934ms - 0m5s404ms ] when you go to the marquee cities.\n[ 0m5s404ms - 0m9s954ms ] But a lot of China's living on, you know, like $200 a month kind of incomes.\n[ 0m10s194ms - 0m11s94ms ] You could give them money.\n[ 0m11s324ms - 0m14s304ms ] You could let them consume instead of exporting it.\n[ 0m14s304ms - 0m16s884ms ] They have been very reluctant to do that.\n[ 0m16s884ms - 0m21s344ms ] The ticket to getting people to spend more is to provide, you know, more security than they have.\n[ 0m21s344ms - 0m25s734ms ] First of all, there's nothing like our social security system.\n[ 0m25s734ms - 0m26s644ms ] You need to save for your old age.\n[ 0m26s644ms - 0m28s194ms ] There's nothing like our health system.\n[ 0m28s194ms - 0m30s544ms ] If you work at one of the big state owned factories, they give you health care.\n[ 0m30s544ms - 0m33s294ms ] But otherwise, you know, you're on your own.\n[ 0m33s294ms - 0m37s84ms ] in a fiscally unsound position and a lot of other wealthy countries are like in those situations.\n[ 0m37s84ms - 0m42s674ms ] And it seems like in those situations it's like it's precisely this fact that they have huge entitlement systems that are becoming unsustainable.\n[ 0m42s674ms - 0m43s344ms ] So,\n[ 0m43s344ms - 0m46s224ms ] No, no, I I have, there's not an easy fix to all these things.\n[ 0m46s224ms - 0m49s264ms ] You know, they could let people earn a higher rate of return on their money.\n[ 0m49s264ms - 0m50s564ms ] Wouldn't that cause even more savings?\n[ 0m50s564ms - 0m51s974ms ] No, no, not necessarily.\n[ 0m51s974ms - 0m57s714ms ] I mean, but in fact, typically in these kind of repressed economies, it's so much you have a certain amount you feel like you need to have when you get old.\n[ 0m57s714ms - 1m1s944ms ] And you got a really low return on it, so you save more.\n[ 1m1s944ms - 1m3s284ms ] They're not allowed to invest abroad.\n[ 1m3s284ms - 1m4s494ms ] There's nothing to do overnight.\n[ 1m4s494ms - 1m10s94ms ] But fundamentally, if you're looking at China and say what's wrong, it's that the consumer isn't spending enough.\n[ 1m10s94ms - 1m13s574ms ] What's happening right now is worse.\n[ 1m13s574ms - 1m15s194ms ] Because housing prices are collapsing.\n[ 1m15s194ms - 1m19s14ms ] That's the only thing they really let people save in.\n[ 1m19s14ms - 1m20s594ms ] You could either save in a bank account.\n[ 1m20s594ms - 1m24s894ms ] which you get a crummy interest rate or a house.\n[ 1m24s894ms - 1m26s224ms ] They're going down.\n[ 1m26s224ms - 1m27s374ms ] So they're,\n[ 1m27s374ms - 1m28s194ms ] people are cutting back."
        }
    }
]