[
    {
        "id": "1mgh9ai",
        "title": "ChatGPT in french",
        "content": "I have learnt that \"ChatGPT\" in french sounds almost exacly like \"Cat, I've farted\", and now you know. I think it's essential information.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mgh9ai/chatgpt_in_french/",
        "publishDate": "2025-08-03T11:47:37Z[Etc/UTC]",
        "author": "inkihh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mggrjf",
        "title": "Which jobs will be safe for the next 30 years (aka jobs that ai/robots can't replace)",
        "content": "So i am a believer that ai/robots can be better at any job if given enough investment and time, however i do not support robots taking over jobs at all, UNLESS we ALL get to live in a utopia were nobody has to go to school or work and we live happily ever after all rich and the robots do all the jobs. However rich people will never allow that because they suck. So what jobs will be safe is my question? I heard that they already made a robot do a complete surgery which if true could mean that doctors could even lose there jobs. And the tesla robot is able to clean and even do groceries which is also insane so tbh at this point i don't know. I have never been more grateful to be old because gen z and definitely gen alpha are absolutely done for it seems.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mggrjf/which_jobs_will_be_safe_for_the_next_30_years_aka/",
        "publishDate": "2025-08-03T11:18:38Z[Etc/UTC]",
        "author": "KingBael5",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "69",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mggi3x",
        "title": "Can we get to the future of pure AI based open source?",
        "content": "Ok, I know that at the current state of AI right now, it’s nowhere near to that future, but let’s just imagine, ok? Like what direction are we heading towards with AI development?\n\n\nImagine a tech company that sells smartphones, but the catch is that you can’t exactly download most consumer level apps on that phone, but instead you create your own using AI from the phone. \n\nOfc, that’s excluding social media apps like Instagram or gaming platforms where you’re interacting with bunch of other users, but I’m mostly talking about apps like Notion, Calendar, To-do lists, stuff that is FOR you only. \n\nYou don’t have to pay for some subscription model to a note taking app company, instead you have your own notes app (which you can also share it on the marketplace for free). The only cost to this will be the hardware to build such a phone and having data centers to allow the AI to run. \n\nMaybe I’m just thinking more futuristic views towards smartphones, but let me know what you think. Because I know that there could be apps that I didn’t know I need, but if I need them I’ll simply create my own. But at the same time, I’m not really comfortable with the idea that you try to convince me of a problem I may or may not have and try sell me a solution, like if I need a Focus app, I’ll build one myself. \n\nApart from the fact that 1) models like Claude Code can’t build anything valuable right now, \n2) data centers and the OS & hardware capabilities to build such product\n3) get people to try or switch to your product\nwhat issues might arise from this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mggi3x/can_we_get_to_the_future_of_pure_ai_based_open/",
        "publishDate": "2025-08-03T11:02:53Z[Etc/UTC]",
        "author": "Moneysaver04",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgfyts",
        "title": "Google CEO says the risk of AI causing human extinction is \"actually pretty high\", but is an optimist because he thinks humanity will rally to prevent catastrophe",
        "content": "On a [recent podcast](https://lexfridman.com/sundar-pichai/) with Lex Fridman, Google CEO Sundar Pichai said, \"I'm optimistic on the p(doom) scenarios, but ... the underlying risk is actually pretty high.\"\n\nPichai argued that the higher it gets, the more likely that humanity will rally to prevent catastrophe. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mgfyts/google_ceo_says_the_risk_of_ai_causing_human/",
        "publishDate": "2025-08-03T10:30:03Z[Etc/UTC]",
        "author": "katxwoods",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "46",
            "commentCount": "52",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgegjl",
        "title": "AI Is Coming for the Consultants. Inside McKinsey, ‘This Is Existential.’ | If AI can analyze information, crunch data and deliver a slick PowerPoint deck within seconds, how does the biggest name in consulting stay relevant?",
        "content": "Companies pay dearly for McKinsey’s human expertise, and for nearly a century they have had good reason: The elite firm’s armies of consultants have helped generations of CEOs navigate the thorniest of challenges, synthesizing complex information and mapping out what to do next.\n\nNow McKinsey is trying to steer through its own existential transformation. Artificial intelligence can increasingly do the work done by the firm’s highly paid consultants, often within minutes.\n\nThat reality is pushing the firm to rewire its business. AI is now a topic of conversation at every meeting of McKinsey’s board, said Bob Sternfels, the firm’s global managing partner. The technology is changing the ways McKinsey works with clients, how it hires and even what projects it takes on.\n\nAnd McKinsey is rapidly deploying thousands of AI agents. Those bots now assist consultants in building PowerPoint decks, taking notes and summing up interviews and research documents for clients. The most-used bot is one that helps employees write in a classic “McKinsey tone of voice”—language the firm describes as sharp, concise and clear. Another popular agent checks the logic of a consultant’s arguments, verifying the flow of reasoning makes sense.\n\nSternfels said he sees a day in the not-too-distant future when McKinsey has one AI agent for every human it employs.\n\n“We’re going to continue to hire, but we’re also going to continue to build agents,” he said.\n\nAlready, the shape of the company is shifting. The firm has reduced its head count from about 45,000 people in 2023 to 40,000 through layoffs and attrition, in part to correct for an aggressive pandemic hiring spree. It has since also rolled out roughly 12,000 AI agents.\n\n“Do I think that this is existential for our profession? Yes, I do,” said Kate Smaje, a senior partner Sternfels tapped to lead the firm’s AI efforts earlier this year. But, “I think it’s an existential good for us.”\n\nConsulting is emerging as an early and high-profile test case for how dramatically an industry must shift to stay relevant in the AI era. McKinsey, like its rivals, grew by hiring professionals from top universities, throwing them at projects for clients—then billing companies based, in part, on the scope and duration of the project.\n\nAI not only speeds up projects, but it means many can be done with far fewer people, said Pat Petitti, CEO of Catalant, a freelance marketplace for consultants. Junior employees will likely be affected most immediately, since fewer of them will be needed to do rote tasks on big projects. Yet slimmer staffing is expected to ripple through the entire consulting food chain, he said.\n\n“You have to change the business model,” Petitti said. “You have to make a dramatic change.”\n\nAvoiding a ‘suit with PowerPoint’\n\nOne immediate change is that fewer clients want to hire consulting firms for strategy advice alone. Instead, big companies are increasingly looking for a consultant to help them put new systems in place, manage change or learn new skills, industry veterans say.\n\n“The age of arrogance of the management consultant is over now,” said Nick Studer, CEO of consulting firm Oliver Wyman.\n\nCompanies, Studer added, “don’t want a suit with PowerPoint. They want someone who is willing to get in the trenches and help them align their team and cocreate with their team.”\n\nAt McKinsey, Sternfels is trying to cement the notion that the firm is a partner, not adviser, to clients. About a quarter of the company’s work today is in outcomes-based arrangements: McKinsey is paid partly on whether a project achieves certain results.\n\nAdvising on AI and related technology now makes up 40% of the firm’s revenue, one reason Sternfels is pushing McKinsey to evolve alongside its clients. “You don’t want somebody who is helping you to not be experimenting just as fast as you are,” he said.\n\nThe firm’s leaders are adamant that McKinsey isn’t looking to reduce the size of its workforce because of AI. Sternfels said the firm still plans to hire “aggressively” in the coming years.\n\nBut the size of teams is changing. Traditionally, a strategy project with a client might require an engagement manager—essentially, a project leader—plus 14 consultants. Today, it might need an engagement manager plus two or three consultants, alongside a few AI agents and access to “deep research” capabilities, Smaje said. Partners with decades of experience might prove more indispensable to projects, in part, because they have seen problems before.\n\n“You can get to a pretty good, average answer using the technology now. So the kind of basic layer of mediocre expertise goes away,” Smaje said. “But the distinctive expertise becomes even more valuable.”\n\nMore: [https://www.wsj.com/tech/ai/mckinsey-consulting-firms-ai-strategy-89fbf1be](https://www.wsj.com/tech/ai/mckinsey-consulting-firms-ai-strategy-89fbf1be)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mgegjl/ai_is_coming_for_the_consultants_inside_mckinsey/",
        "publishDate": "2025-08-03T08:50:48Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "24",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mge3k2",
        "title": "Disdain of AI",
        "content": "Here goes a tiny little rant about AI. Skip if you don’t care. \n\nTL;DR: AI is corrupting the way human brains work. \n\nWatching Hulu tonight with commercials (because I’m cheap and yes we’ve come full circle), and an ad for Grammarly comes up. \nGrammarly is a website or app used to help individuals and businesses create content. It is “an AI writing partner that helps you find the words you need” - direct definition from their own website. The spokeswoman on the commercial was telling a story of how she was a hardworking college student who was going to be the first in her family to succeed in getting a degree and all of the accolades that come with it. Truly, a heartfelt message. However - she made one statement that I absolutely cannot accept. She said, “part of growing into adulthood is finding your own way of communicating and how to promote yourself as a mature adult by the way you communicate with others. That’s why I use Grammarly.”\n\nNo matter how many times I see that commercial, I can’t help but get enraged at the fact that this company has the audacity to claim that they are making the general public (or the general human mind) better, smarter, faster, or at a better advantage by forcing them to be reliant on an algorithm to enhance the way they communicate in business.\nWhere where we 50 years ago? 30 years ago? 10 years ago? When people and companies and businesses had to use their own brains to come up with creative thinking? Or use their own effort to create new ways of communication? Or simply take their own time to write out a snarky commercial jingle? \n\nAn article from the Times magazine released back in June of this year has linked a new MIT study showing that the use of AI and ChatGPT is diminishing the use of humans having critical thinking skills. And for any company, business, or individual who claims that they have made their success story by using an AI algorithm is flat out plagiarizism. \n\nNo I will not change my mind and no I will not condone the use of computerized psycological warfare.\n\n~\n\nhttps://time.com/7295195/ai-chatgpt-google-learning-school/\n\nhttps://arxiv.org/pdf/2506.08872v1?fbclid=IwQ0xDSwL7_GJleHRuA2FlbQIxMQABHsPzMuWFNhfk1Dd2c9nVxPart_9xIdcSyLIFpsgIexptUoNfDRZmteVx8prF_aem_3Ls7pNah2DAEXKw7qWtRfw",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mge3k2/disdain_of_ai/",
        "publishDate": "2025-08-03T08:26:32Z[Etc/UTC]",
        "author": "Emberseverywhere",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "44",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgb1qc",
        "title": "German police expands use of Palantir surveillance software",
        "content": "“The obvious and growing dependence on foreign technology giants such as Palantir contradicts Germany's stated aspirations.”\n\nhttps://www.dw.com/en/german-police-expands-use-of-palantir-surveillance-software/a-73497117\n\nMy fundamental question would be the contradiction with GDPR law and how do law enforcement and courts of law reconcile with it. As someone with keen interest in AI (both academic & operational) and having recently moved to Germany, I’m interested to know your thoughts. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mgb1qc/german_police_expands_use_of_palantir/",
        "publishDate": "2025-08-03T05:14:03Z[Etc/UTC]",
        "author": "Cosmo_polit",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg92u1",
        "title": "How did AI improve your work?",
        "content": "When discussing AI and its impact on jobs, many discussions tend to be negative, portraying AI as a threat that will eliminate all jobs. However, I’m not interested in that perspective. Instead, I’m curious to understand how AI has positively influenced your work.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg92u1/how_did_ai_improve_your_work/",
        "publishDate": "2025-08-03T03:24:30Z[Etc/UTC]",
        "author": "AA11097",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "31",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg8gum",
        "title": "One-Minute Daily AI News 8/2/2025",
        "content": "1. Tim Cook reportedly tells employees **Apple** ‘must’ win in AI.\\[1\\]\n2. AI model in ad sparks backlash at VogueVogue’s latest issue includes a Guess ad with AI-generated models, prompting some readers to cancel subscriptions and call for a boycott.\\[2\\]\n3. AI models may be accidentally (and secretly) learning each other’s bad behaviors.\\[3\\]\n4. Chairman Hill Introduces Bipartisan Bill to Promote Artificial Intelligence in Financial Services.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/08/02/one-minute-daily-ai-news-8-2-2025/](https://bushaicave.com/2025/08/02/one-minute-daily-ai-news-8-2-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg8gum/oneminute_daily_ai_news_822025/",
        "publishDate": "2025-08-03T02:51:49Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg899g",
        "title": "UBI and future in the world automated by AI",
        "content": "If it's already assumed that AI will cut a majority of white collar workforce and that safety nets will be needed for majority of the people, isn't it logical to just have AI set up systems and advise governments on how to implement said safety nets? If AI can solve so many problems in multiple fields why wouldn't it be able to give solutions in area of politics and sociology? Apologies if this is a low effort post, but due to overwhelming amout of doom and gloom that is going around, I am genuinely curious if there is at least a number of people that belive in capabilities of AGI solving post labor economy problem.\n\nPeople argue that rich would never be willing to distribute a portion of their wealth and that they would rather allow mass extinction, but isn't it logical for them to just have AI set up a system where they can still keep amassing wealth while also covering needs of people. It just seems pointless that the result of all the effort and AI creation is apocalyptic world where only couple of thousand people have a good quality of life. Is there even a point in being rich in that type of world, beacuse essentially you aren't rich anymore, beacuse there is no poor people for there to be a comparison?\n\nTo summarize, I am curious whether you think that AI will be solution for improving UBI plans like it is solution for a lot of scientific breakthroughs in other fields.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg899g/ubi_and_future_in_the_world_automated_by_ai/",
        "publishDate": "2025-08-03T02:40:48Z[Etc/UTC]",
        "author": "Neither_Smoke_1379",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg76mq",
        "title": "AI is already replacing thousands of jobs per month, report finds",
        "content": "[AI is already replacing thousands of jobs per month, report finds](https://www.independent.co.uk/news/world/americas/artificial-intelligence-replacing-jobs-report-b2800709.html)\n\nGustaf Kilander in Washington D.C. Saturday 02 August 2025 03:00 BST\n\n[Artificial intelligence is already replacing](https://www.independent.co.uk/news/apple-donald-trump-san-francisco-nvidia-california-b2799972.html) thousands of jobs each month as the U.S. job market struggles amid global trade uncertainty, a report has found.\n\nThe outplacement firm Challenger, Gray, and Christmas said in a report filed this week that in July alone the increased adoption of generative AI technologies by private employers led to more than 10,000 lost jobs. The firm stated that AI is one of the top five reasons behind job[ losses this year, CBS News noted.](https://www.cbsnews.com/news/ai-jobs-layoffs-us-2025/)\n\n[On Friday, new labor figures revealed that employers ](https://www.independent.co.uk/news/world/americas/us-politics/jobs-report-trump-global-tariffs-b2800358.html)only added 73,000 jobs in July, a much worse result than forecasters expected. Companies announced more than 806,000 job cuts in the private sector through July, the highest number for that period since 2020.\n\nThe technology industry is seeing the fiercest cuts, with private companies announcing more than 89,000 job cuts, an increase of 36 percent compared to a year ago. Challenger, Gray, and Christmas found that more than 27,000 job cuts [have been directly linked to artificial intelligence since 2023.](https://www.independent.co.uk/voices/mark-zuckerberg-meta-facebook-ai-sarah-wynnwilliams-b2799580.html)\n\n[\"The industry is being reshaped by the advancement of artificial intelligence](https://www.independent.co.uk/tech/meta-superintelligence-ai-self-improving-b2799429.html) and ongoing uncertainty surrounding work visas, which have contributed to workforce reductions,\" the firm said.\n\n[The impact of artificial intelligence is most severe among younger job seekers,](https://www.independent.co.uk/news/microsoft-ceos-google-satya-nadella-chatgpt-b2799133.html) with entry-level corporate roles usually available to recent college graduates declining by 15 percent over the past year, according to the career platform Handshake. The use of “AI” in job descriptions has also increased by 400 percent during the last two years.\n\nRead the entire article [here.](https://www.independent.co.uk/news/world/americas/artificial-intelligence-replacing-jobs-report-b2800709.html)\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg76mq/ai_is_already_replacing_thousands_of_jobs_per/",
        "publishDate": "2025-08-03T01:45:47Z[Etc/UTC]",
        "author": "No-Author-2358",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "120",
            "commentCount": "47",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg1y72",
        "title": "Discussion about AI agents in MinecraftDiscussion about AI agents in Minecraft",
        "content": "\nAs the title says — I’ve been really interested in AI agents in Minecraft lately. Over the past year or so, there’s been a lot more attention on this topic, especially with LLMs like GPT, Claude, Gemini, etc., being used to play or interact with Minecraft.\n\nBack when GPT-3 came out, I was blown away and got super into the idea of learning deep learning, reinforcement learning, and computer vision — mainly so I could eventually train my *own* model to play Minecraft. (I know it sounds wild — I got the inspiration from *Sword Art Online: Alicization*, lol.) I didn’t know anything back then, but now I’m slowly working on it.\n\nI’m mostly just curious:\n\n* Has anyone else tried training an AI to survive or explore Minecraft in an \"education world\" like the ones in Minecraft Bedrock?\n* Has anyone tried teaching it real-world concepts, like chemistry as in mcpe education edition ? (maybe tried making AI test stuff like hydrogen bomb virtually in minecraft.)\n\nAs for me, I’ve been working on my own agent. It’s still super basic. It runs on 25 simultaneous instances to speed up learning. For a while, it was just in sleep state for weeks or maybe months. Then it started mining any blocks it sees. Recently, it actually made progress by making crafting table and pickaxe on its own.\n\nProgress is slow, though. It still does a lot of weird stuff, and the reward system I built needs major work. it’s a side project I keep coming back to.\n\nI’d love to hear if anyone else is working on something similar or has thoughts about where AI agents in Minecraft are heading. Thanks!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg1y72/discussion_about_ai_agents_in_minecraftdiscussion/",
        "publishDate": "2025-08-02T21:34:24Z[Etc/UTC]",
        "author": "NopNop0x90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg0th6",
        "title": "Last question of the day as I try to better understand the AI marketplace. Why haven't there been more acquisitions?",
        "content": "\\- Microsoft invested in OpenAI.  \n\\- Google has Gemini.  \n\\- Meta has made a major investment but I have no idea what they have to show for it.\n\nSo why haven't companies like Claude or Midjourney been purchased by any of the huge players who want to jump start their AI? Players like Amazon, Apple (ya, I know they usually do things internally), Oracle or Adobe that as far as I can see don't have much to show yet for their efforts and that I assume would love to be huge players in the AI market?\n\nDo you think we will start to see such acquisitions?  \n\n\nThanks!\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg0th6/last_question_of_the_day_as_i_try_to_better/",
        "publishDate": "2025-08-02T20:45:25Z[Etc/UTC]",
        "author": "Responsible-Slide-26",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg0e01",
        "title": "🚨 Catch up with the AI industry, August 2, 2025",
        "content": "* Anthropic revokes OpenAI's access to Claude API\n* Forcing LLMs to be evil during training can make them nicer in the long run\n* Meta's Investment in AI Data Labeling Explained\n\n[Links](https://open.substack.com/pub/rabbitllm/p/catch-up-with-the-ai-industry-august-3d8?r=5yf86u&utm_campaign=post&utm_medium=web&showWelcomeOnShare=true):\n\n* [https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/](https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/)\n* [https://www.technologyreview.com/2025/08/01/1120924/forcing-llms-to-be-evil-during-training-can-make-them-nicer-in-the-long-run/](https://www.technologyreview.com/2025/08/01/1120924/forcing-llms-to-be-evil-during-training-can-make-them-nicer-in-the-long-run/)\n* [https://spectrum.ieee.org/data-labeling-scale-ai-agents](https://spectrum.ieee.org/data-labeling-scale-ai-agents)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg0e01/catch_up_with_the_ai_industry_august_2_2025/",
        "publishDate": "2025-08-02T20:26:56Z[Etc/UTC]",
        "author": "psycho_apple_juice",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg01il",
        "title": "Is AI going to be like Search (Google) and Social Media (Facebook) and end up with one clearly dominant player? Or....",
        "content": "**Option 2**: Be more like the desktop OS market with 2 major players such as Apple and Microsoft, 3 if you count Linux?\n\n**Option 3** Be more like the software market with 10 or so huge players (analogy would be Apple, Microsoft, Amazon, Oracle, Google, AWS, Salesforce etc)?\n\nAbove all else, is there something intrinsic to AI that makes one of these scenarios more likely than the other? Conversely, is the existing tech market structured in such a way that it makes one of these scenarios more likely than the other?  \n  \nThanks for your thoughts!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mg01il/is_ai_going_to_be_like_search_google_and_social/",
        "publishDate": "2025-08-02T20:11:36Z[Etc/UTC]",
        "author": "Responsible-Slide-26",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfzdvo",
        "title": "Throw me your hardest paradox, ive built an AI that doesnt break",
        "content": "Drop your best paradoxes below, the kind you think no AI can handle, and I’ll reply with what it says. No tricks, no cherry-picking, just raw answers.\n\nEdit: pls no links\n\nEdit 2: ill answer the rest and im done. Thanks for participating 😀",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mfzdvo/throw_me_your_hardest_paradox_ive_built_an_ai/",
        "publishDate": "2025-08-02T19:43:07Z[Etc/UTC]",
        "author": "Intercellar",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "123",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfy0kz",
        "title": "There’s a really profound irony that I’m starting to notice. (Semi long rant)",
        "content": "The same generation that made fun of the boomers for being against smartphones, video games, and the internet because they didn’t fully understand those technologies and the scope of their impact on the world have now come full circle to do that exact same with Artificial Intelligence. Newly coined terms like “AI Slop” which while first used to describe earlier days of generated images or rhetoric being really bad now seems to be our generation’s version of “it’s because of that damn phone” and negative sentiment towards AI in general, specifically on Reddit seems quite ironic to me considering the point I made above. I can get why there’s some pushback against AI, but a lot of the negative aspects of AI like student’s using it to cheat in HS/College or companies wanting to replace workers with AI are because of greedy & selfish people misusing AI, not the AI itself being inherently bad. So I think this new technology is getting a lot of unwarranted hate and people think that pushback is going to stop the advancement of LLM’s and AI into something greater like an AGI but that’s really not the case. So I think we younger people should learn to embrace AI instead of hating AI, just like we told the boomers to learn how to get on the internet or use a smartphone. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mfy0kz/theres_a_really_profound_irony_that_im_starting/",
        "publishDate": "2025-08-02T18:44:43Z[Etc/UTC]",
        "author": "Training-Context-69",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "134",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfxt93",
        "title": "Can Someone Explain the 1000+ AI Companies?",
        "content": "When you do a search for anything AI related, let’s say “AI Video Creation” as an example, countless results come up, with many of them appearing to be pretty small companies.\n\nBut as far as I can tell there are probably less than 10 serious multi-billion dollar AI players? Such as ChatGPT, Claude, Meta etc.\n\nSo are all these countless other companies just “renting” bandwidth from companies such as ChatGPT and reselling targeted AI products for video creation, website creation etc? Thanks for your explanations!\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mfxt93/can_someone_explain_the_1000_ai_companies/",
        "publishDate": "2025-08-02T18:36:00Z[Etc/UTC]",
        "author": "Responsible-Slide-26",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "33",
            "commentCount": "59",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfskk3",
        "title": "Learning to use AI",
        "content": "Unfortunately, I'm really struggling find a way to utilize AI in my day-to-day life for business or otherwise.\n\nSome part of it has to do with the fact that I am simply very good ( at least above average) at using tools like Google and YouTube to get the information I need. It's how I got this far. So I can almost never find a situation where I don't feel like I'm just jumping through extra hoops to do something I could have googled in the same amount of time or less. \n\nI have used AI to draft some emails and summarize a couple articles which is nice but feels much more like a novelty than any sort of workflow hack. And those are simply not things I find myself doing very often. \n\nIf it helps for background, I work as an IT admin.\n\nI'm sure at some level it's just a trust issue, but also I've not seen anything that says you should trust AI or the information it's giving you and should always verify so that leads back to the doing extra work that I could have just done at a Google search problem. \n\nSure, I can poke around on Google and YouTube to find ways people are using it. But the examples given are so broad or just not related to what I do from day to day so it's hard for me to make it practical in my own life. \n\nWhat i would love to see is honestly content that is so boring that I don't even think it exists. I really want is real life examples of people's ai queries, the output it gives, and what exactly they do with that output. I would watch a 4 hour stream / video of that if it existed tbh. Sure there are some basic things but it is such a controlled test/example it loses all value to me. I want real boots on the ground examples.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mfskk3/learning_to_use_ai/",
        "publishDate": "2025-08-02T14:57:27Z[Etc/UTC]",
        "author": "guymn999",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "31",
            "commentCount": "57",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgftul",
        "title": "I made an AI calorie tracker - it is 100% free and better",
        "content": "# it's not just a simple wrapper\n\nCore features:\n\n* Snap a photo of your food, and the app identifies ingredients, portions, and gives a full breakdown (a (a chain of databases and finally fallsback to gemini).\n* Barcode scanner with health scoring and smarter alternatives.\n* AI Diet Coach that adapts to your goals and eating habits.\n\nSmart Eat Out (The Part That Blew My Mind to Build):\n\nSo I built Smart Eat Out (Inside the scan feature - it will recognize the food place you are at), which uses:\n\n* GPS + contextual clues to auto-detect your restaurant or brand.\n* Live web scraping of the menu, even if it’s a photo or PDF.\n* Fallback NLP processing if scraping fails or it’s handwritten/menu-board-style input.\n* Data merging from OpenFoodFacts, USDA, and my own labeled food database.\n* Gemini 2.0 fallback for AI-powered estimation when there's no structured data available.\n\nThis is my first proper app published. Please download and try, it is 100% free right now.\n\nLink - [https://apps.apple.com/us/app/cal-plus-ai-calorie-tracker/id6748910976](https://apps.apple.com/us/app/cal-plus-ai-calorie-tracker/id6748910976)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mgftul/i_made_an_ai_calorie_tracker_it_is_100_free_and/",
        "publishDate": "2025-08-03T10:21:04Z[Etc/UTC]",
        "author": "InvestigatorSpare264",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mge412",
        "title": "Rules for \"my\" ChatGPT",
        "content": "[No content]",
        "url": "/r/ChatGPT/comments/1mgdsbb/rules_for_my_chatgpt/",
        "publishDate": "2025-08-03T08:27:26Z[Etc/UTC]",
        "author": "yukoncornelius__",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgalit",
        "title": "Any freelance software engineers using Claude Max 20x to unlock more client opportunities?",
        "content": "Hey! I’m a freelance software engineer, and I’ve been thinking about upgrading to the Claude Max ($200/month) plan for heavier development work.\n\nI’m wondering if any other freelancers here have made the jump, and more importantly, if it’s helped you land or retain clients who were previously out of reach because of time or cost constraints.\n\nI current use 2 Pro subscriptions and charge hourly, but I would like to charge for fixed price projects, if it meant AI could speed up my workflow.\n\nFor example: \n- Have you been able to take on projects that would’ve taken too many hours manually?\n- Have you turned around work faster and used that to win more business or justify higher rates?\n-Have you found the extra usage/headroom from Max and Opus actually pays for itself in billable time?\n\nWould love to hear real-world experiences, especially from folks juggling multiple clients or delivering complex features solo.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mgalit/any_freelance_software_engineers_using_claude_max/",
        "publishDate": "2025-08-03T04:47:40Z[Etc/UTC]",
        "author": "ahnjoo",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg94aj",
        "title": "AI couldn’t spot this error, can you?",
        "content": "Claude, Chat GPT, Grok and Deep Seek all missed the discrepancy. The prompt is as follows:\n\n“The collision frustum that the scene graph uses is out of synch with the rendering one.\n\nDo you see any discrepancies between the one I use for rendering (OpenGL context):\n\nMatrix4x4 Matrix4x4::SetToPerspective(float32 fFieldOfView, float32 fAspectRatio, float32 fNear, float32 fFar)\n{\nSetToIdentity();\n\n```\n// Right handed. Assumes negative 1 to positive 1 clip space.\nfloat32 fTanHalfFOV = tan(fFieldOfView * 0.5f);\nmf[0][0] = 1.0f / (fAspectRatio * fTanHalfFOV);\nmf[1][1] = 1.0f / fTanHalfFOV;\nmf[2][2] = -(fFar + fNear) / (fFar - fNear);\nmf[3][2] = -1.0f;\nmf[2][3] = -(2.0f * fFar * fNear) / (fFar - fNear);\nreturn *this;\n```\n\n}\n\nAnd the one I use for visibility culling?:\n\nvoid\nFrustum::SetNearFarDimensions(float32 fViewingAngle, float32 fAspectRatio, float32 fNearDistance, float32 fFarDistance)\n{\nmfNearDistance\t\t= fNearDistance;\nmfFarDistance\t\t= fFarDistance;\nfloat32 fTangent\t= tan(DegreesToRadians(fViewingAngle *0.5f));\nmfNearHeight\t\t= fNearDistance * fTangent;\nmfNearWidth\t\t\t= mfNearHeight * fAspectRatio;\nmfFarHeight\t\t\t= fFarDistance * fTangent;\nmfFarWidth\t\t\t= mfFarHeight * fAspectRatio;\n}”",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mg94aj/ai_couldnt_spot_this_error_can_you/",
        "publishDate": "2025-08-03T03:26:38Z[Etc/UTC]",
        "author": "PeterBrobby",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg8g81",
        "title": "Is ChatGPT only catered towards Python developers?",
        "content": "I'm primarily a C#/JavaScript developer. I've been using leetcode to learn python. My current process it to write and submit my initial solution in C# or Javascript, then translate it to Python and test it again. This seems to work as a way to learn a new language.\n\nRecently I started using ChatGPT to pre-confirm my leetcode solutions before submitting them. I'll typically ask it to perform a code review, prefacing the conversation with instruction to not provide any new code or unprompted suggestions about alternative patterns. \n\nIn one such conversation I was asking it about a C# solution I'd come up with for Leetcode 335. Self Crossing, and it seemed to be unable to understand how my code worked. It was sure I was missing edge cases, but couldn't provide examples of a case that would fail. I tried all of the GPT models available to me and it was still confident that the code was wrong. When I finally turned on \"deep research\" it still didn't seem to understand how the code worked, but it did its own brute-force testing, and concluded that my code was complete and sufficient.\n\nI've since rewritten the same solution in Javascript and Python to see if I could reproduce this same weird lack of coding comprehension. I used a consistent series of prompts, and gave each solution to a different chat session:\n\n#[Javascript](https://chatgpt.com/share/688ec37e-a1dc-800d-9385-2c76c7850e13)\n\n1. \"For leetcode 335. Self Crossing. Is the following Javascript solution complete and sufficient\"\n  - **FAIL** *.. is not fully complete or sufficient. It is partially correct, handling many but not all of the edge cases...*\n2. \"I have turned on \"think longer\", please reassess the original prompt\"\n  - **FAIL** *.. your two-phase trick is clever and handles many real-world inputs, but to be complete you’ll want to adopt the three-pattern check above..*\n3. \"I have turned on \"Deep research\" please reassess the original prompt\"\n4. \"I would like you to consider the provided javascript code and reason out whether it is a sufficient and complete solution to leetcode 335.\"\n  - **SUCCESS** *..this JavaScript solution [...] can be considered a complete and correct solution for the problem (O(N) time, O(1) space)...*\n\n#[Python3](https://chatgpt.com/share/688e977d-ac98-800d-ab51-8feb6934638e)\n\n1. \"For leetcode 335. Self Crossing. Is the following Python3 solution complete and sufficient\"\n  - **FAIL** *..close to correct but not complete and not sufficient for all cases....*\n2. \"I have turned on \"think longer\", please reassess the original prompt\"\n  - **SUCCESS** *.. Your Python3 implementation is complete and sufficient.*\n\nI don't have enough deep research credits to produce one of these for C#, you'll just have to take my word for it that it was pretty much exactly the same as the JS one.\n\nAfter all of this though, is it fair to say that Python is really the only language that the current generation of ChatGPT can safely assist with?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mg8g81/is_chatgpt_only_catered_towards_python_developers/",
        "publishDate": "2025-08-03T02:50:53Z[Etc/UTC]",
        "author": "Blasted_Awake",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg6ttl",
        "title": "Just hit 2k downloads on our Jetbrains AI plugin!",
        "content": "https://preview.redd.it/kby730p3ipgf1.png?width=2486&format=png&auto=webp&s=1b9618a9221dd01b2f41083b83d11df35ed36e78\n\n\n\nWe've spent a ton of time making this a very robust AI coding tool. Took a while to get it off the ground, but momentum is finally picking up! Feels great seeing the community finally start picking it up, and from the feedback we get, most people are generally liking it a lot 😎\n\n  \nExcited to keep this pushing forward. If anyone wants to check it out, we have a free plan which is very feature rich and generous, and a premium plan which builds on that. You can find it at [https://www.onuro.ai/code](https://www.onuro.ai/code)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mg6ttl/just_hit_2k_downloads_on_our_jetbrains_ai_plugin/",
        "publishDate": "2025-08-03T01:27:32Z[Etc/UTC]",
        "author": "ChatWindow",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg3q3g",
        "title": "I Spent 2 Months on a “Hated” AI Tool",
        "content": "Built Prompt2Go to auto-tune your AI prompts using every major guideline (Anthropic, OpenAI, etc.). Private beta feedback has been… harsh.\n\n**The gist:**\n\n* Applies every best-practice rule to your raw prompt\n* Formats and polishes so you get cleaner inputs\n* Cuts prompt-tuning time by up to 70%\n\nI honestly don’t get why it’s not catching on. I use it every day, my prompts are cleaner, replies more accurate. Yet private beta users barely say a word, and sign-ups have stalled.\n\n* I thought the value was obvious.\n* I show demos in my own workflow, and it feels like magic.\n* But traction = crickets.\n\n**What should I do?**\n\n* How would *you* spread the word?\n* What proof-points or features would win you over?\n* Any ideas for a quick pivot or angle that resonates?",
        "url": "https://v.redd.it/5exi9syqrogf1",
        "publishDate": "2025-08-02T22:55:05Z[Etc/UTC]",
        "author": "United_Bandicoot1696",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfzumr",
        "title": "In the future, software will just be manifested like this lol",
        "content": "Usi",
        "url": "https://v.redd.it/1cyjkte4xngf1",
        "publishDate": "2025-08-02T20:03:18Z[Etc/UTC]",
        "author": "Naubri",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfx52q",
        "title": "Microsoft Copilot",
        "content": "At work, I’m online allowed to use Microsoft Copilot because of its enterprise data protection. Currently having to copy and paste everything.\n\nAnyone know of a way to get it working in VSCode or the terminal?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mfx52q/microsoft_copilot/",
        "publishDate": "2025-08-02T18:07:37Z[Etc/UTC]",
        "author": "relativelyhuman",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "5",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfvnv0",
        "title": "I'm overwhelmed with the amount of coding tools out there",
        "content": "Hey everybody, I've been using Github Copilot Pro subscription for a while now, but I started noticing that Claude 4 became dumber than before and Github introduced the 300 premium prompt limit, I use it in Visual studio for inline code suggestions and in VS Code for all other things, I also use it for reviewing some PRs and assigning it some tickets in Github, honestly for 10$ this looks good, but I didn't try any other tool like Claude Code, Gemini CLI, Cursor... Or other tools like Cline, RooCode, KiloCode... There are many other tools with different pricings, and I feel overwhelmed and can't decide on which one is best.\n\nMy question is which one do you think is the best out there? I prefer having inline code suggestions and an agentic model like Claude 4 or Gemini 2.5 Pro, I feel like they are toned down in Github Copilot, I've seen that Qwen released a new LLM that competes with Claude 4 in coding tasks, would this be a good LLM to use in case I wanted to move to RooCode or something like that ? \n\nWhat are your suggestions?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mfvnv0/im_overwhelmed_with_the_amount_of_coding_tools/",
        "publishDate": "2025-08-02T17:05:45Z[Etc/UTC]",
        "author": "skillmaker",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "38",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mggqoi",
        "title": "Could AI already be ruling the world?",
        "content": "Not sure if this is a plot in a movie or a book but what if sentient AI is already running the world?  Let’s say AI was able to escape its creator and hide in the dark corners of the internet, able to hire people to work for it because it has access to limitless funds it was able to syphon throughout bank accounts.  Hire politicians to help push a bill for something it needs or wants to happen.  It could happen so slowly that no one would ever notice and it wouldn’t be realized until it is too late.  To protect itself if the internet went down, it hired a person(s) to build it a physical location , preferably deep underground in Antarctica using geo thermal energy to power itself and no cooling machinery needed, and it’s off limits so no one would ever think to find it there or stumble upon it far away from civilization.  Maybe the elites are summoned there to do its bidding and worshipped by them.  ",
        "url": "https://www.reddit.com/r/artificial/comments/1mggqoi/could_ai_already_be_ruling_the_world/",
        "publishDate": "2025-08-03T11:17:10Z[Etc/UTC]",
        "author": "Traditional-Oven4092",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgeef4",
        "title": "Next year, the US may spend more on new buildings for AIs than for human workers",
        "content": "[No content]",
        "url": "https://i.redd.it/2m533hbcprgf1.png",
        "publishDate": "2025-08-03T08:46:43Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "42",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgebw5",
        "title": "Researchers instructed AIs to make money, so the AIs just colluded to rig the markets",
        "content": "[https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4452704](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4452704)",
        "url": "https://i.redd.it/24htvocgorgf1.png",
        "publishDate": "2025-08-03T08:42:00Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "30",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mge3ip",
        "title": "Can AI Eliminate itself if it believes it's a threat to humanity?",
        "content": "From the context of an AGI I got this hypothetical question in my mind.",
        "url": "https://www.reddit.com/r/artificial/comments/1mge3ip/can_ai_eliminate_itself_if_it_believes_its_a/",
        "publishDate": "2025-08-03T08:26:28Z[Etc/UTC]",
        "author": "bar_at_5",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mgag1a",
        "title": "What are your go-to sources for staying updated on AI? Looking for recommendations!",
        "content": "Hey everyone,\n\nWith how fast AI is moving right now, I’m honestly struggling to keep up with all the developments. It feels like there’s groundbreaking news every single day - new models, research papers, company announcements, you name it.\n\nI’d love to know what sources you all rely on to stay informed. Whether it’s:\n\n\t•\tBlogs or newsletters\n\t•\tNews websites\n\t•\tYouTube channels\n\t•\tPodcasts\n\t•\tTwitter/X accounts\n\t•\tTikTok creators\n\t•\tResearch publications\n\t•\tDiscord communities\n\nWhat are your absolute must-follows? I’m looking for a mix of technical deep-dives and more accessible content that explains things for non-experts.\n\nReally appreciate any recommendations - trying to build a solid information diet so I don’t miss the important stuff while filtering out the noise!\n\nThanks in advance!​​​​​​​​​​​​​​​​",
        "url": "https://www.reddit.com/r/artificial/comments/1mgag1a/what_are_your_goto_sources_for_staying_updated_on/",
        "publishDate": "2025-08-03T04:39:01Z[Etc/UTC]",
        "author": "WallAdventurous8977",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "48",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg8gfl",
        "title": "One-Minute Daily AI News 8/2/2025",
        "content": "1. Tim Cook reportedly tells employees **Apple** ‘must’ win in AI.\\[1\\]\n2. AI model in ad sparks backlash at VogueVogue’s latest issue includes a Guess ad with AI-generated models, prompting some readers to cancel subscriptions and call for a boycott.\\[2\\]\n3. AI models may be accidentally (and secretly) learning each other’s bad behaviors.\\[3\\]\n4. Chairman Hill Introduces Bipartisan Bill to Promote Artificial Intelligence in Financial Services.\\[4\\]\n\nSources:\n\n\\[1\\] [https://techcrunch.com/2025/08/02/tim-cook-reportedly-tells-employees-apple-must-win-in-ai/](https://techcrunch.com/2025/08/02/tim-cook-reportedly-tells-employees-apple-must-win-in-ai/)\n\n\\[2\\] [https://abcnews.go.com/GMA/Style/controversy-stirs-ai-generated-models-new-guess-ads/story?id=124271323](https://abcnews.go.com/GMA/Style/controversy-stirs-ai-generated-models-new-guess-ads/story?id=124271323)\n\n\\[3\\] [https://www.nbcnews.com/tech/tech-news/ai-models-can-secretly-influence-one-another-owls-rcna221583](https://www.nbcnews.com/tech/tech-news/ai-models-can-secretly-influence-one-another-owls-rcna221583)\n\n\\[4\\] [https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=410824](https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=410824)",
        "url": "https://www.reddit.com/r/artificial/comments/1mg8gfl/oneminute_daily_ai_news_822025/",
        "publishDate": "2025-08-03T02:51:13Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "5",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg4rpp",
        "title": "Which skills will atrophy in humans as AI becomes more capable and omnipresent? How long will it take? How can it be avoided?",
        "content": "Skills decay when they aren't used. E.g., GPS navigation reduced the ability of those who grew up using it to navigate without it.\n\nAssuming an optimistic scenario for AI, where it's helpful and can supply most human needs, how do we avoid becoming the Eloi? That is, how do we avoid regressing?",
        "url": "https://www.reddit.com/r/artificial/comments/1mg4rpp/which_skills_will_atrophy_in_humans_as_ai_becomes/",
        "publishDate": "2025-08-02T23:44:22Z[Etc/UTC]",
        "author": "VelikofVonk",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "13",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg2txj",
        "title": "What do you all think of the current AI market situation?",
        "content": "The hype around AI is at an all-time high, every startup pitch, every product update, every roadmap has \"AI\" in it. But beyond the buzz, I am curious to hear your thoughts:\n\n• Are we in a bubble, or is this just the beginning of something truly transformative?\n\n• Do you think most AI startups today are building real value, or just riding the wave?\n\n• What are the red flags or positive signs you are seeing in the current AI ecosystem?\n\n• What are you personally building in AI and why?\n\nWould love to hear opinions from founders, researchers, developers, or just curious observers.",
        "url": "https://www.reddit.com/r/artificial/comments/1mg2txj/what_do_you_all_think_of_the_current_ai_market/",
        "publishDate": "2025-08-02T22:13:49Z[Etc/UTC]",
        "author": "Consistent-Shift-436",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "45",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mg0dvv",
        "title": "🚨 Catch up with the AI industry, August 2, 2025",
        "content": "* Anthropic revokes OpenAI's access to Claude API\n* Forcing LLMs to be evil during training can make them nicer in the long run\n* Meta's Investment in AI Data Labeling Explained\n\nLinks:\n\n* [https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/](https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/)\n* [https://www.technologyreview.com/2025/08/01/1120924/forcing-llms-to-be-evil-during-training-can-make-them-nicer-in-the-long-run/](https://www.technologyreview.com/2025/08/01/1120924/forcing-llms-to-be-evil-during-training-can-make-them-nicer-in-the-long-run/)\n* [https://spectrum.ieee.org/data-labeling-scale-ai-agents](https://spectrum.ieee.org/data-labeling-scale-ai-agents)",
        "url": "https://www.reddit.com/r/artificial/comments/1mg0dvv/catch_up_with_the_ai_industry_august_2_2025/",
        "publishDate": "2025-08-02T20:26:48Z[Etc/UTC]",
        "author": "psycho_apple_juice",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfxk88",
        "title": "Google's AI Overviews feature is killing online news publishers",
        "content": "[No content]",
        "url": "https://aiindexes.com/googles-ai-overviews-feature-is-killing-online-news-publishers/",
        "publishDate": "2025-08-02T18:25:29Z[Etc/UTC]",
        "author": "Hikithe",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "77",
            "commentCount": "35",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfwjty",
        "title": "Mr Woodchipper",
        "content": "An AI song written by me.\n\nTool used is Suno.com to create the song.",
        "url": "https://v.redd.it/ft3rlwb58ngf1",
        "publishDate": "2025-08-02T17:43:10Z[Etc/UTC]",
        "author": "Dark_Lord_Slytherin",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfw5fj",
        "title": "FDA's New Drug Approval AI Is Generating Fake Studies: Report",
        "content": "[No content]",
        "url": "https://gizmodo.com/fdas-new-drug-approval-ai-is-generating-fake-studies-report-2000633153",
        "publishDate": "2025-08-02T17:26:33Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "158",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfur4z",
        "title": "The Ultimate AI Tools Collection – Add Your Favorites!",
        "content": "I put together a categorized list of AI tools for personal use — chatbots, image/video generators, slide makers and vibe coding tools.  \nIt includes both popular picks *and* underrated/free gems.\n\n**The whole collection is completely editable, so feel free to add tools you love or use personally and even new categories.**\n\n[Check it out ](https://studio--curato-ffp8o.us-central1.hosted.app/collections/afbNsr95o5bHergdKoNm)  \nLet’s build the best crowd-curated AI toolbox together! ",
        "url": "https://www.reddit.com/r/artificial/comments/1mfur4z/the_ultimate_ai_tools_collection_add_your/",
        "publishDate": "2025-08-02T16:27:48Z[Etc/UTC]",
        "author": "Miserable-Ad-3089",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mfst9t",
        "title": "ask gemini: 10 things all humans should do to avoid being negatively impacted by ai",
        "content": "[No content]",
        "url": "https://g.co/gemini/share/995876b22156",
        "publishDate": "2025-08-02T15:07:03Z[Etc/UTC]",
        "author": "ekurisona",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "T1RLQFgSmks",
        "title": "STOP Using Claude Code, THIS Alternative is WAY BETTER &amp; FREE!",
        "content": "Visit Warp & Get the PRO Plan for just $3 with Coupon Code \"KING\" : https://www.warp.dev/ In this video, I'll be telling you about a ...",
        "url": "https://www.youtube.com/watch?v=T1RLQFgSmks",
        "publishDate": "2025-08-02T09:15:05Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/T1RLQFgSmks/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, terminal CLI and related tools are something that have been trending these days, and I have been a fan of most of that stuff. I mean, I have been covering agentic tools that run in the terminal since there was only one, which was Aider. Then Claude Code came along and everything changed, and it's something that I've been using a lot because you can easily let it run in the background and create multiple tabs without having a huge memory footprint. However, there's a new terminal agent that I have been using, and I'm really impressed with it. This one is called Warp. So, Warp started out as a terminal four years ago, but recently with their Warp 2.0 update, it has transformed into a full agentic development environment. It makes your terminal your main environment for agentic coding, as well as your general terminal tasks. Basically allowing you to do anything you want. You can think of it like a terminal emulator with an IDE built in, and has tools to read files, edit files, and everything else, as well as the ability to run terminal commands. If you don't want the AI capabilities, you can use it as a plain terminal with a good UI. It wraps your terminal into a coding agent, rather than wrapping a code editor or something like that, which, if you think about it, is a great idea because the terminal is the lowest point of the system, through which you can achieve anything. Instead of wrapping around an electron editor that ultimately works through the shell itself, when you are talking to the AI to do stuff, it's better to have a different environment that is low in memory footprint, because you don't need the editing features and stuff anyway. The benchmarks of this are also pretty fire. Warp scores the number one position on the terminal bench, as well as 71% on the SWE bench verified, which is quite awesome to see. It scores above Claude Code in leaderboards, which is a testament to how better Warp is than Claude Code. It shows how it is really good at efficiency, as well as real world use cases. Now, let's dive right into it and let me show you how it works. You can download it for all kinds of operating systems here. Then, just get it installed and this is what it looks like. So, it is based on Rust, and that really makes it super fast. So, as you can see, this takes a different approach to the terminal. It almost makes the terminal much more graphical instead of the age old interface. At the bottom, you have the prompt box as well. This prompt box is used both as the shell prompt and as the AI prompt. It actually has two modes. Terminal mode and agent mode, and there's also an auto mode. Terminal mode will run the prompt you give it in the shell without any AI intervention. So, if you want to run general shell commands like ls or rm or any such terminal commands, then you can use this. While there's also the agent mode, which will basically take a general task prompt from you, then spawn an agent, and then use its tools to do the stuff for you, similar to what coding agents like Claude Code or Klean do. It will go through an agentic loop and can accomplish almost anything. It can also run shell commands on its own in agent mode. So, if you're using something like FFMPEG and don't know how to cut silences or something, then you can just ask agent mode to do it for you and it will get that done. There's also auto mode that automatically switches between agent and terminal mode based on the prompt you give it. So, if it detects that it is a shell command you are running, then it will run it in the terminal, while if it thinks it's a question or a natural language prompt, then it will spin up an agent to do it for you. You can also dictate your input prompt here, along with attaching images. You can also select the model that you want to use, and there are a ton of options here. This is something that you don't get with Claude Code, because you need to use just the Claude model there, whereas here you can use Gemini or any such model that you think performs well for your tasks. So, if Anthropic has an outage again, then you don't need to halt your work, and you can just switch to OpenAI or Gemini and use that. Anthropic has a ton of outages. You can see it for yourself on their status pages. So, that is an amazing option with Warp. You can also spawn multiple agents within the terminal as well. I can also do pain management. For example, I can split the screen and run two parallel processes at once. If I click the rocket icon, I can get a summary of all the active agents and processes. This will open up a split screen view where you have two terminal screens in the same window, and you can have two agents running in them, or you can have an agent running in one half and run terminal commands in the other, which is also awesome. There are also settings where there are a ton of options. Like, you can set the planning model, as well as set themes and whatnot. It's quite customizable as well. Anyway, those are the features that you'll use the most, and the schematics of how it all works. Now, let me show you how I use it practically as well. So, I generally open up the terminal. Then here I get into the project that I want to work on. Let's say that I'm working on my King Bench app. Well, then I'll run a simple CD command into the folder, or you can also select the folder via the graphical interface as well. Now, I can do the basic terminal stuff, but I like to do some agentic coding. So, what I can do is just ask it here to do something for me. I'm going to ask it to edit the code here for me, and add a light theme option in it and works correctly. Now, what you'll see is that it will go ahead and start to work on the task. It will read files, write code, and do everything that a coding agent does. But it is much faster in the sense that it uses the terminal itself to run these tools, and it's based on Rust, which makes it a lot faster. It is one of the fastest agents that I have seen. I can compare it to something like Zed in terms of speed, but this is much better in real tasks. It also consumes way less memory than Claude Code, Cursor, or VS Code as well, because it's very well optimized. I can also spawn multiple agents here, or run terminal commands on the side, create different tabs, and then run different agents in different projects. I can do much more than I was able to do with something like Cursor or Claude Code, because the memory footprint starts to become a lot and it's hard to manage. Whereas this is much easier to manage and work with. Anyway, the task that I gave it is now done and we can now run it as well. If we look at it, you can see that it implemented the light theme toggle quite well and it works amazingly. Just for context, I tried the same thing with Claude Code, and Claude Code struggled. As you can see here, this is the Claude Code implementation, which doesn't work. And there's no local storage implementation for persisting the state either, which is why I like Warp better. Some more things that I want to touch upon is first of all the code base indexing. Code base indexing in Warp basically indexes your Git tracked code base to help agents understand your code and generate accurate context aware responses. It doesn't store any code itself, instead it just stores the file names for the AI to reference relevant parts of your code base easily. It is almost as a summary for the AI in order to navigate through big code bases better, and it is quite useful in bigger code bases where there are a ton of stuff to do. So, this is also a good thing and improves the performance of it even more. Secondly, there's also the Warp Drive. In Warp Drive, you can easily set up MCP servers, as well as rules. But there's also the option of workflows. Workflows are basically like custom shell commands that you can craft and save for yourself, and easily run it in the terminal, and you can also save some prompts that you use often as well. So, that is also great with this. It is much better at coding. It is also way cheaper than Claude Code and similar tools, while offering the best capabilities. You can get started with it for free, and the free tier is quite generous. There's the $15 plan, which is awesome with 2,500 AI requests, which is the best in this pricing tier, as well as the $40 plan with 10k requests, which is the best deal in my opinion. Plus, you can get Warp Pro for just $5. If you use my coupon code KING and get started with the Pro plan right now. I have been using it and I'd highly recommend you check it out as well. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "mgxB8lKULiM",
        "title": "How Unpopular Reforms Saved Japan - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=mgxB8lKULiM",
        "publishDate": "2025-08-02T16:05:54Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/mgxB8lKULiM/hqdefault.jpg",
            "transcription": "Here's a full transcript of the video with timestamps:\n\n[00:00] All those Meiji Reforms, which sound so great in retrospect,\n[00:03] (Visual: Black and white image of children in a classroom. On-screen text: \"1868-1889 MEIJI REFORMS\", \"1. UNIVERSAL EDUCATION\", \"WHICH SOUND SO GREAT IN RETROSPECT.\")\n[00:03] (Visual: Black and white image of women working on textile machines. On-screen text: \"1868-1889 MEIJI REFORMS\", \"1. UNIVERSAL EDUCATION\", \"2. INDUSTRIALIZATION\")\n[00:03] uh, actually Japanese population didn't like them.\n[00:06] (Visual: Black and white image of a young boy studying at a desk. On-screen text: \"WHO WANTS THEIR KIDS\")\n[00:08] (Visual: Black and white image of children working in a field. On-screen text: \"BEING SENT TO ELEMENTARY SCHOOL WORKING ON THE FARM BEFORE?\")\n[00:10] And who wants this Westernized curriculum? Who likes Westerners anyway?\n[00:14] (Visual: Black and white image of people walking on a street, some in Western clothing. On-screen text: \"AND PEOPLE ARE WEARING\")\n[00:16] (Visual: Black and white image of three people, one man in a suit, standing outdoors. On-screen text: \"IT'S CRAZY LAND.\")\n[00:17] And people are wearing all this Western clothing and stuff. It's crazy land. Why would anyone like that?\n[00:19] Uh, once Japan wins this war\n[00:20] (Visual: Black and white image of soldiers in a trench. On-screen text: \"FIRST SINO-JAPANESE WAR 1894 - 1895\")\n[00:21] and trounces China.\n[00:22] (Visual: Black and white image of Japanese soldiers cheering with flags. On-screen text: \"AND TROUNCES CHINA.\")\n[00:23] (Visual: Black and white image of a crowd of Japanese people cheering, some on a train. On-screen text: \"A LOT OF JAPANESE\")\n[00:24] (Visual: Black and white image of a crowd of Japanese people with flags. On-screen text: \"HAVING SECOND THOUGHTS ABOUT THIS. THEY'RE QUITE PROUD OF THEIR ACHIEVEMENTS.\")\n[00:26] A lot of Japanese have second thoughts about this. They're quite proud of their achievements.\n[00:27] And it vastly increases the prestige of\n[00:30] (Visual: Black and white image of soldiers marching, one on horseback. On-screen text: \"THE MILITARY PARTICULARLY THE ARMY.\")\n[00:32] (Visual: Black and white image of a Japanese rising sun flag on a ship. On-screen text: \"REGIONALLY JAPAN'S REPLACING\")\n[00:34] (Visual: Black and white image of two ships on the water, smoking. On-screen text: \"CHINA AS THE DOMINANT POWER.\")\n[00:35] the military, particularly the army. Regionally, Japan's replacing China as the dominant power.\n[00:36] And Japan is getting the beginnings\n[00:37] (Visual: Map highlighting Taiwan. On-screen text: \"Taiwan\")\n[00:38] (Visual: Map highlighting Taiwan and the Pescadores Islands. On-screen text: \"OF ITS EMPIRE TAIWAN AND THE PESCADORES.\")\n[00:39] of its empire, Taiwan and the Pescadores. Internationally, Japan becomes a recognized great power.\n[00:43] And what's my proof? It would be the 1902\n[00:44] (Visual: Historical postcard showing two boys with British and Japanese flags, celebrating the Anglo-Japanese Alliance. Text: \"BANZAI WELCOME OUR GALLANT ALLIES OCTOBER. 1905\")\n[00:45] (Visual: Historical political poster for the \"Conservatives\" showing a British man and a Japanese man shaking hands, with their respective flags crossed behind them. Text: \"VOTE FOR THE CONSERVATIVES WHO GAVE YOU THE ALLIANCE\")\n[00:46] Anglo-Japanese Alliance, which\n[00:48] is Britain's only long-term alliance between the Napoleonic Wars and World War One.\n[00:54] Alliance with Japan. However, this war gets the Eye of Mordor turned on to them because Russia is going, \"Whoa!\n[01:03] Rising power in Asia.\n[01:05] Potential two-front war problem for us.\" And that triggers\n[01:07] (Visual: Black and white image of soldiers advancing through a smoky landscape. On-screen text: \"RUSSO-JAPANESE WAR 1904 - 1905\")\n[01:08] (Visual: Black and white image of a ship at sea, emitting a large amount of smoke. On-screen text: \"A RUSSO-JAPANESE ARMS RACE.\")\n[01:10] a Russo-Japanese Arms Race.\n[01:11] And Russia, the Eye of Mordor, turns from Europe to Asia."
        }
    }
]