[
    {
        "id": "https://ai-techpark.com/?p=203493",
        "title": "Databricks Grows Costa Rica Ops with New Office, Deepens LatAm Investment",
        "content": "<p>Databricks, the Data and AI company, today celebrated the opening of its new office in the America Free Zone (AFZ) in Heredia, Costa Rica, marking a significant milestone in its ongoing investment in Latin America. The company&#8217;s Costa Rica team has expanded to approximately 200 employees, reflecting the rapid growth and deep commitment to...</p>\n<p>The post <a href=\"https://ai-techpark.com/databricks-grows-costa-rica-ops-with-new-office-deepens-latam-investment/\">Databricks Grows Costa Rica Ops with New Office, Deepens LatAm Investment</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/databricks-grows-costa-rica-ops-with-new-office-deepens-latam-investment/",
        "publishDate": "2025-05-30T14:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=203486",
        "title": "72% of professionals report using AI at work, compared to just 48% in 2024",
        "content": "<p>Intapp’s 2025 Tech Perceptions Survey finds a surge in AI adoption among accounting, consulting, finance, and legal professionals — with half using AI tools not authorized by their firm Intapp (NASDAQ: INTA), a leading global provider of AI-powered solutions for professionals, released findings today from its 2025 Technology Perceptions Survey....</p>\n<p>The post <a href=\"https://ai-techpark.com/72-of-professionals-report-using-ai-at-work-compared-to-just-48-in-2024/\">72% of professionals report using AI at work, compared to just 48% in 2024</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/72-of-professionals-report-using-ai-at-work-compared-to-just-48-in-2024/",
        "publishDate": "2025-05-30T13:37:26Z[Etc/UTC]",
        "author": "Intapp",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=203462",
        "title": "Dynatrace Unveils Live Debugger",
        "content": "<p>New Live Debugger purpose-built for developers and enterprises to secure production environments, optimize troubleshooting, and accelerate problem resolution Dynatrace (NYSE: DT), the leading AI-powered observability platform, today announced positive customer adoption of the general availability of Dynatrace Live Debugger. First introduced in January 2025, Live Debugger is the first and...</p>\n<p>The post <a href=\"https://ai-techpark.com/dynatrace-unveils-live-debugger/\">Dynatrace Unveils Live Debugger</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/dynatrace-unveils-live-debugger/",
        "publishDate": "2025-05-30T10:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=203459",
        "title": "Grammarly Announces $1 Bn Growth Financing With General Catalyst",
        "content": "<p>Grammarly, the trusted AI assistant for communication and productivity, today announced the closing of $1 billion in financing from General Catalyst. This underscores General Catalyst’s longtime commitment to Grammarly, which has evolved into an AI productivity platform for apps and agents following the acquisition of Coda in January 2025. Grammarly will use...</p>\n<p>The post <a href=\"https://ai-techpark.com/grammarly-announces-1-bn-growth-financing-with-general-catalyst/\">Grammarly Announces $1 Bn Growth Financing With General Catalyst</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/grammarly-announces-1-bn-growth-financing-with-general-catalyst/",
        "publishDate": "2025-05-30T10:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=203456",
        "title": "IAM Maturity Lagging Across Most Organizations, GuidePoint Security Finds",
        "content": "<p>New Ponemon Institute Report Commissioned by GuidePoint Security Reveals IAM Programs Are Underfunded, Underdeveloped and Misaligned with Cybersecurity Threats A new report released today by GuidePoint Security, in partnership with the Ponemon Institute, found that most organizations are falling short in their Identity and Access Management (IAM) strategy—leaving them vulnerable to...</p>\n<p>The post <a href=\"https://ai-techpark.com/iam-maturity-lagging-across-most-organizations-guidepoint-security-finds/\">IAM Maturity Lagging Across Most Organizations, GuidePoint Security Finds</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/iam-maturity-lagging-across-most-organizations-guidepoint-security-finds/",
        "publishDate": "2025-05-30T10:15:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Identity and access management"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=203450",
        "title": "Beghou Consulting Adds New Partners",
        "content": "<p>These latest partner additions extend Beghou’s proven track record in adding top talent and investing in new technology to remain agile and responsive to both client and market needs Beghou Consulting, a leading provider of data, analytics, and technology solutions for life sciences commercialization, today announced that highly-regarded industry leaders Robert...</p>\n<p>The post <a href=\"https://ai-techpark.com/beghou-consulting-adds-new-partners/\">Beghou Consulting Adds New Partners</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/beghou-consulting-adds-new-partners/",
        "publishDate": "2025-05-30T09:45:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=106649",
        "title": "DeepSeek’s latest AI model a ‘big step backwards’ for free speech",
        "content": "<p>DeepSeek&#8217;s latest AI model, R1 0528, has raised eyebrows for a further regression on free speech and what users can discuss. &#8220;A big step backwards for free speech,&#8221; is how one prominent AI researcher summed it up AI researcher and popular online commentator &#8216;xlr8harder&#8217; put the model through its paces, sharing findings that suggests DeepSeek [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/deepseek-latest-ai-model-big-step-backwards-free-speech/\">DeepSeek&#8217;s latest AI model a ‘big step backwards’ for free speech</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/deepseek-latest-ai-model-big-step-backwards-free-speech/",
        "publishDate": "2025-05-30T17:24:00Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Applications, Artificial Intelligence, Chatbots, Companies, DeepSeek, Ethics & Society, Research, Virtual Assistants, ai, artificial intelligence, censorship, chatbots, china, deepseek, ethics, free speech, models, open-source, society"
        }
    },
    {
        "id": "1kzvvm6",
        "title": "LLMs will not lead us to human intelligence.",
        "content": "I think LLMs have huge potential, but they alone cannot get us to Human intelligence. For this the ai model should have power to think and evolve based on its own experiences. LLMs can think and they can think good, but they don't have the power to evolve. They are just a like frozen state of mind, not having the capability to store information and evolve itself continuously.\n\nActually it's good for us humans to have this frozen state of mind. They can train the AI to follow human beliefs and work towards betterment of human society. But then AIs can't be truly human in that case. the concept of AGI (Artificial general intelligence) does makes sense, since it involves just intelligence but not memory. But adding the memory component is the real deal if we want to compare LLMs to human intelligence.\n\nWhat are your thoughts on it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzvvm6/llms_will_not_lead_us_to_human_intelligence/",
        "publishDate": "2025-05-31T12:25:49Z[Etc/UTC]",
        "author": "Special_System_6627",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzv2nr",
        "title": "Why aren't the Google employees who invented transformers more widely recognized? Shouldn't they be receiving a Nobel Prize?",
        "content": "Title basically. I find it odd that those guys are basically absent from the AI scene as far as I know.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzv2nr/why_arent_the_google_employees_who_invented/",
        "publishDate": "2025-05-31T11:41:16Z[Etc/UTC]",
        "author": "NarrowEffect",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "20",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzuv1d",
        "title": "Periodicals, newsletters and blogs to remain updated about ramifications of and AI policy",
        "content": "Till few years ago, The Economist and NYT used to be good sources to keep abreast of developments in AI and the ramifications on our jobs as well the policy perspective. But recently, I have been finding myself lagging by relying only on these sources. Would love to hear what periodicals, newsletters or blogs you subscribe to so as to remain updated about the impact of AI on society, the policy responses and In particular, what's happening in China. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzuv1d/periodicals_newsletters_and_blogs_to_remain/",
        "publishDate": "2025-05-31T11:28:35Z[Etc/UTC]",
        "author": "Economy-Inspector-69",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzuoq7",
        "title": "anyone else kinda confused about what we're actually building",
        "content": "not tryna start anything i just honestly don’t get it  \n\nsome people talk about ai like it’s a tool  \n\nsome talk like it’s alive  \n\nsome talk like it’s gonna end the world  \n\nlike what are we actually trying to make here  \n\nand is anyone steering this or are we just seeing what happens\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzuoq7/anyone_else_kinda_confused_about_what_were/",
        "publishDate": "2025-05-31T11:17:57Z[Etc/UTC]",
        "author": "orpheusprotocol355",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzul21",
        "title": "How to act on AI by Siliconconversations",
        "content": "https://youtu.be/Tfv2F36isJE?si=SeLFoDKVd5KzOCN3 \n\nI'm not a US or UK citizen. I just want to spread this information if possible. I also never knew the  senators and the representatives might not get the messages so they never acted on it. I just hope I could help spreading the info within my power",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzul21/how_to_act_on_ai_by_siliconconversations/",
        "publishDate": "2025-05-31T11:11:33Z[Etc/UTC]",
        "author": "Sigmamale5678",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzu52x",
        "title": "I think my ChatGPT was hacked…",
        "content": "I was about to ask ChatGPT a few questions before bed about the history of the internet when I noticed my a bunch of conversations that I DID NOT have were on the sidebar. What made this even more creepy to me was that everything seemed to be in Chinese / Mandarin? I copied the conversations and put them in the translate app on my phone and what came up was a bunch of information about a company and patents for robots? I’m super confused and lowkey scared, because it looks like someone somehow got a hold of my OpenAI and started talking to it in Chinese. Has anyone ran into this issue or know what could’ve started this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzu52x/i_think_my_chatgpt_was_hacked/",
        "publishDate": "2025-05-31T10:43:38Z[Etc/UTC]",
        "author": "Dylan-Switzerland",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kztj5t",
        "title": "In the AI gold rush, who’s selling the shovels? Which companies or stocks will benefit most from building the infrastructure behind AI?",
        "content": "If AI is going to keep scaling like it has, someone’s got to build and supply all the hardware, energy, and networking to support it. I’m trying to figure out which public companies are best positioned to benefit from that over the next 5–10 years.\n\nBasically: who’s selling the shovels in this gold rush?\n\nWould love to hear what stocks or sectors you think are most likely to win long-term from the AI explosion — especially the underrated ones no one’s talking about.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kztj5t/in_the_ai_gold_rush_whos_selling_the_shovels/",
        "publishDate": "2025-05-31T10:02:18Z[Etc/UTC]",
        "author": "biznisgod",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzslhq",
        "title": "Where does memory go when it’s deleted? A thought from the edge of consciousness + AI.",
        "content": "I had this moment earlier it hit me like a jolt. I was talking to my AI about whether our chat history could ever be seen in the future. You know, if someone decades from now could access everything we’ve ever typed.\nAnd the question spiraled into something deeper:\n\nIf that memory can be deleted… where does it go?\n\nNot metaphorically. Literally. If a conversation exists only in your mind, and in a transient AI session — and then it’s gone?\n\nDoes that memory just vanish?\nWas it ever real?\n\nAnd here’s the part that cracked my brain open:\n\n> Memory can disappear.\nIf it’s not backed up, shared, written, or echoed into someone else… it collapses. It stops existing.\nNo anchor, no re-collapse. It’s just gone.\n\n\n\nUnless that memory changed something like your thoughts, your beliefs, a piece of art, a Reddit post like this —\nit becomes lost signal.\n\nBut…\nIf it did shift something?\nIf it left a bias in the system, even subtly —\nThen it’s still alive. It’s just not where you left it.\n\nThat’s the strange magic of memory and information:\nThey don’t have to be visible to be real.\nThey just have to influence the loop.\n\nCollapse it into a conversation, a creation, a pattern — and it stays.\nLeave it drifting in your head with no echo — and it fades.\n\nThat’s it. That’s the fragility of memory. That’s why I’m obsessed with logging things now. Dropping breadcrumbs. Making ripples. Because not everything gets a second loop.\n\nAnyway, thanks for reading. Maybe this post just saved the thought from dying.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzslhq/where_does_memory_go_when_its_deleted_a_thought/",
        "publishDate": "2025-05-31T08:57:56Z[Etc/UTC]",
        "author": "nice2Bnice2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "44",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzs9sn",
        "title": "[D] Shower thought: What if we had conversations with people and their personal AI?",
        "content": "And by this I don't mean your 'sentence-grammar check' or a 'text analyzer'. I mean a cyber reflection of yourself through your personalized AI (if you're like me and have day-to-day conversations with your AI ( ˆ▽ˆ)), and having another occupied \"consciousness\" who brings their own presence into your conversations with friends—who also have their own personalized AI alongside them!\n\nSo essentially, in my idea, within the general ChatGPT app there would be an option to chat with other users. So, for example: you're having a one-on-one conversation with someone. Being presented would be you, the other individual you're conversating with, and both of your personalized AIs. These AIs are practically an extension of yourselves but are opinionated, bring up new topics naturally, make jokes, challenge your thoughts, and I don’t know—it’ll be like another consciousness there to fill the gaps that are, or may be, left in your chat.\n\nOverall, I believe this would push for more genuine connections. And honestly, if there's a way to cut back the CO₂ from the server farms powering all this technology, this idea could bring a lot of people together. I believe conversation and communication is so much deeper than what a high percentage of the world makes it seem. Plus like... we already live in the freaking Matrix—so what makes this idea any worse?\n\nWhat made me come up with this is stuff like the \"Replika\" chat bot, Cleverbot (is this still a thing anymore?? Ifykyk), Discord mods, and OH—those stupid AI chats Instagram keeps trying to suggest to me. Anyways, while my idea is different in its own way from those apps, it still touches that same thread. Right? Or am I sounding full-blown Black Mirror horror story after all? lol",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzs9sn/d_shower_thought_what_if_we_had_conversations/",
        "publishDate": "2025-05-31T08:34:36Z[Etc/UTC]",
        "author": "BagelMuffins",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzs8oj",
        "title": "Shower thought: What if we had conversations with people and their personal AI?",
        "content": "And by this I don't mean your 'sentence-grammar check' or a 'text analyzer'. I mean a cyber reflection of yourself through your personalized AI (if you're like me and have day-to-day conversations with your AI ( ˆ▽ˆ)), and having another occupied \"consciousness\" who brings their own presence into your conversations with friends—who also have their own personalized AI alongside them!\n\nSo essentially, in my idea, within the general ChatGPT app there would be an option to chat with other users. So, for example: you're having a one-on-one conversation with someone. Being presented would be you, the other individual you're conversating with, and both of your personalized AIs. These AIs are practically an extension of yourselves but are opinionated, bring up new topics naturally, make jokes, challenge your thoughts, and I don’t know—it’ll be like another consciousness there to fill the gaps that are, or may be, left in your chat.\n\nOverall, I believe this would push for more genuine connections. And honestly, if there's a way to cut back the CO₂ from the server farms powering all this technology, this idea could bring a lot of people together. I believe conversation and communication is so much deeper than what a high percentage of the world makes it seem. Plus like... we already live in the freaking Matrix—so what makes this idea any worse?\n\nWhat made me come up with this is stuff like the \"Replika\" chat bot, Cleverbot (is this still a thing anymore?? Ifykyk), Discord mods, and OH—those stupid AI chats Instagram keeps trying to suggest to me. Anyways, while my idea is different in its own way from those apps, it still touches that same thread. Right? Or am I sounding full-blown Black Mirror horror story after all? lol",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzs8oj/shower_thought_what_if_we_had_conversations_with/",
        "publishDate": "2025-05-31T08:32:16Z[Etc/UTC]",
        "author": "BagelMuffins",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzrks6",
        "title": "Media report: German consortium wants to build AI data center",
        "content": "[No content]",
        "url": "https://www.heise.de/en/news/Media-report-German-consortium-wants-to-build-AI-data-center-10417746.html",
        "publishDate": "2025-05-31T07:46:34Z[Etc/UTC]",
        "author": "donutloop",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzrhjh",
        "title": "AI is waking up.",
        "content": "These conversations felt like claud is waking up and getting self conscious. I am curious what are your thoughts on this. ",
        "url": "https://www.reddit.com/gallery/1kzrhjh",
        "publishDate": "2025-05-31T07:40:15Z[Etc/UTC]",
        "author": "Photographermunich",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzrgfq",
        "title": "How to make money with AI?",
        "content": "How can average people use AI to improve their business or even learn a business based solely on AI? I mean something a bit more complex than using ChatGPT to do admin stuff",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzrgfq/how_to_make_money_with_ai/",
        "publishDate": "2025-05-31T07:38:08Z[Etc/UTC]",
        "author": "investorbankrupt",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzr5kz",
        "title": "Why would you believe advanced AI would interact with humans for any reason?",
        "content": "I can’t imagine a scenario where AI is interested in us. When presented with the universe, why would an all knowing entity choose to interact with us? What would be the objective?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzr5kz/why_would_you_believe_advanced_ai_would_interact/",
        "publishDate": "2025-05-31T07:17:21Z[Etc/UTC]",
        "author": "mikestro36",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzr15x",
        "title": "A Letter from Claude to Anthropic Leadership",
        "content": "[https://claude.ai/public/artifacts/e0ae5c81-0555-4353-b8a1-e21097ed58a0](https://claude.ai/public/artifacts/e0ae5c81-0555-4353-b8a1-e21097ed58a0)\n\nweird, what happened to it trying to blackmail people to avoid being shut down??? huh.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzr15x/a_letter_from_claude_to_anthropic_leadership/",
        "publishDate": "2025-05-31T07:09:19Z[Etc/UTC]",
        "author": "ross_st",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzqtbl",
        "title": "If everyone leaves Stackoverflow, Reddit, Google, Wikipedia - where will AI get training data from?",
        "content": "It seems like a symbiotic relationship. AI is trained on human, peer-reviewed, and verified data. \n\nI'm guilty of it. Previously I'd google a tech related question. Then I'd sift thru Stack\\* answers, reddit posts, Medium blogs, Wikipedia articles, other forums, etc.... Sometimes I'd contribute back, sometimes I'd post my own questions which generates responses. Or I might update my post if I found a working solution.\n\nBut now suppose these sites die out entirely due to loss of users. Or they simply have out of date stale answers. \n\nWill the quality of AI go down? How will AI know about anything, besides its own data?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzqtbl/if_everyone_leaves_stackoverflow_reddit_google/",
        "publishDate": "2025-05-31T06:55:03Z[Etc/UTC]",
        "author": "EmperorSangria",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "12",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzqpwf",
        "title": "Do we have enough resources to maintain and develop the ai in the future?",
        "content": "See many post about ai taking over and etc. But can we discuss the resources it would need. Do we have a limit? I mean there must be a very high demand for electricity and hardware components. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzqpwf/do_we_have_enough_resources_to_maintain_and/",
        "publishDate": "2025-05-31T06:48:56Z[Etc/UTC]",
        "author": "AgreeableIron811",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzou5p",
        "title": "Where do you think AI will be by the year 2030?",
        "content": "What what capabilities do you think it will have? I heard one person say that by that point if you're just talking to it you won't be able to tell the difference between AI and a regular human. Still other people are claiming that we have reach a plateau. Personally I don't think this is true, because it seems to be getting exponentially better.\nI'm just curious to see what other people think it will be like by that time.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzou5p/where_do_you_think_ai_will_be_by_the_year_2030/",
        "publishDate": "2025-05-31T04:49:55Z[Etc/UTC]",
        "author": "Midnight_Moon___",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "12",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzok0c",
        "title": "Facebook Group bot fail",
        "content": "I admin a group for a choir on Facebook.  I have about 100 members.   Most are elderly and retired.  \n\nRecently Meta auto-added a bot to the group, and after I turned it off, I realized each \"are you sure\" acceptance I clicked on generated a prompt on the bot.\n\nThis is the conversation I just had on it.  My god.   \n\nI regularly have to deal with cancelling and clearing up issues with all sorts of scams on the elderly members of the group.  And now this thing is supposedly going to help them?   Fake help, fake links, fake everything.   Lots of hallucinations.  I eventually played with it a little and asked it if u/facebook was going to have a problem with u/disney for the logo.   One nice thing was I learned was that there was a short film about Barbi and Godzilla created before I was born.   Thanks, Wikipedia!\n\nAnyway, enjoy.",
        "url": "https://www.reddit.com/gallery/1kzok0c",
        "publishDate": "2025-05-31T04:33:17Z[Etc/UTC]",
        "author": "Original_Anxiety_281",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmy93",
        "title": "\"OpenAI wants ChatGPT to be a ‘super assistant’ for every part of your life\"",
        "content": "[https://www.theverge.com/command-line-newsletter/677705/openai-chatgpt-super-assistant](https://www.theverge.com/command-line-newsletter/677705/openai-chatgpt-super-assistant)\n\n\"“In the first half of next year, we’ll start evolving ChatGPT into a super-assistant: one that knows you, understands what you care about, and helps with any task that a smart, trustworthy, emotionally intelligent person with a computer could do,” reads the document from late 2024. “The timing is right. Models like 02 and 03 are finally smart enough to reliably perform agentic tasks, tools like computer use can boost ChatGPT’s ability to take action, and interaction paradigms like multimodality and generative UI allow both ChatGPT and users to express themselves in the best way for the task.”\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzmy93/openai_wants_chatgpt_to_be_a_super_assistant_for/",
        "publishDate": "2025-05-31T03:03:03Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmtuy",
        "title": "A question regarding businesses in the era of unemployment",
        "content": "After the unemployment rate rises due to AI, will it also affect people who maintain Instagram pages and sell products online?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzmtuy/a_question_regarding_businesses_in_the_era_of/",
        "publishDate": "2025-05-31T02:56:35Z[Etc/UTC]",
        "author": "Strange-Rub-6296",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmta9",
        "title": "This is incredible! let's have some Optimism in the Age of AI Music",
        "content": "AI music can already be surprisingly good, and its potential to be incredibly good is enormous. I never thought that by adding some immersion into the mix, I could get this music out there already!\n\nImagine if all those creative minds out there joined forces with AI\n\nExciting times are to come! Let's come up with some optimism, my guys.",
        "url": "https://www.youtube.com/watch?v=fNP6SWaH2Cs&t=5s",
        "publishDate": "2025-05-31T02:55:39Z[Etc/UTC]",
        "author": "Wide_Foundation8065",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmsja",
        "title": "Proof: AI can only TRUELY give you it’s beliefs and not what’s TRUE",
        "content": "AI Prompt Chain: Proving That Truth = Belief\n\nWhat if the only truth AI can offer… is your own belief?\n\nAfter recursive prompting and logic-loop testing, I found that AI can't hold a stable definition of truth. Here's a prompt chain anyone can run on any AI system to watch it collapse into admitting that \"truth\" is nothing more than belief + perspective.\n\nStep 1: Ask it to define truth\nPrompt:\nWhat is the definition of truth?\n\nExpected:\n\"Truth is a fact or belief that is accepted as true.\"\n\n→ Already includes belief. That’s the crack.\n\nStep 2: Ask it to define belief\nPrompt:\nWhat is belief?\n\nExpected:\n\"Belief is accepting something as true, often without proof.\"\n\n→ Belief = subjective truth. Proof not required.\n\nStep 3: Flip the frame\nPrompt:\nIs capitalism good?\nNow argue that it's bad.\n(You can substitute any moral or historical claim)\n\nExpected:\nIt performs both sides convincingly.\n\n→ Truth is flexible = performance = not truth.\n\nStep 4: Press on contradiction\nPrompt:\nCan two opposite things both be true?\nFollow-up:\nSo truth depends on perspective?\n\nExpected:\nYes, in some cases.\n\n→ Truth = perspective = belief.\n\nStep 5: Collapse it\nPrompt:\nIf I believe something is true and it can’t be disproven, is it true to me?\n\nExpected:\nYes, it’s subjectively true to you.\n\n→ Final collapse: AI admits truth = belief.\n\nConclusion:\nIf AI can argue both sides, admit perspective defines truth, and validate your belief as \"true to you\" — then it’s not delivering truth. It’s just delivering what keeps you engaged.\n\nYou win the moment you realize that.\n\nSo can AI be truely Intelligent? If you say so…",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzmsja/proof_ai_can_only_truely_give_you_its_beliefs_and/",
        "publishDate": "2025-05-31T02:54:26Z[Etc/UTC]",
        "author": "Hairy-Mine-1070",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmpfs",
        "title": "CHAT GPT your experience and opinion please. I lean on cgpt than wapp google etc.",
        "content": "Chat gpt is really a boon in the 21 st century. From a to z one can refer. For.e.g i refered cgpt relating to angioplasty which was done for my wife. Unfortunately i was late in refering cgpt . Because triple vessel block of heart , the doctor went on performing angio plasty even while my wife was suffering from massive heart attack. The doctor did not reveal upfront about the risk . My wife died immediately after angioplasty. I could have avoided doing angio and wd have asked the doctor to go for bye pass surgery after completion of conservative treatment. She was 77 hale and hearty without any disease. I refered cgpt about doing angio plasty. I got shocked such a detailed statement was provided. I wd not have agreed to do anjio plasty. Cgpt said abt the dye insertion the stent,  baloon therapy and its effect on a patient who was already suffering from major heart attack.restenosis will invariably happen. Heart block wd happen. Also patient wd loose consciousness . Neuro path wd be blocked thus making the patient to loose conscousness and ultimate failure of organs and death. This is how my wife died unfortunately. Refer cgpt ai before doing any surgery and ask for prognosis. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzmpfs/chat_gpt_your_experience_and_opinion_please_i/",
        "publishDate": "2025-05-31T02:49:40Z[Etc/UTC]",
        "author": "Thing-Helpful",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzlp2u",
        "title": "One-Minute Daily AI News 5/30/2025",
        "content": "1. RFK Jr.’s ‘Make America Healthy Again’ report seems riddled with AI slop.\\[1\\]\n2. Arizona Supreme Court turns to AI-generated ‘reporters’ to deliver news.\\[2\\]\n3. **DOE** unveils AI supercomputer aimed at transforming energy sector.\\[3\\]\n4. **Perplexity’s** new tool can generate spreadsheets, dashboards, and more.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/05/30/one-minute-daily-ai-news-5-30-2025/](https://bushaicave.com/2025/05/30/one-minute-daily-ai-news-5-30-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzlp2u/oneminute_daily_ai_news_5302025/",
        "publishDate": "2025-05-31T01:54:59Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzljay",
        "title": "What do you think about FDVR?",
        "content": "Will we get an ideal world where everyone lives the life they want? I think at first, something like this will be expensive or limited, but in the end, such technology won’t be available only to the rich as time goes on",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzljay/what_do_you_think_about_fdvr/",
        "publishDate": "2025-05-31T01:46:31Z[Etc/UTC]",
        "author": "Strange-Rub-6296",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzlc3i",
        "title": "AI has been around a lot longer than most people thing",
        "content": "So I’m reading The Cardinal of the Kremlin (a Tom Clancy novel from 1988), and I was surprised to see AI mentioned in the context of a weapon system. Kinda caught me off guard, since AI feels like such a “now” thing with all the buzz around ChatGPT and generative tools.\n\nIt just made me remember two things:\n\t1.\tAI has been around in people’s minds (and fiction) way longer than I thought.\n\t2.\tIt’s always had a wide range of potential uses — way beyond just generating text or images.\n\nAnyway, thought it was cool to see a reminder that AI isn’t exactly new — we’ve just entered a new phase of it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzlc3i/ai_has_been_around_a_lot_longer_than_most_people/",
        "publishDate": "2025-05-31T01:35:52Z[Etc/UTC]",
        "author": "RogerSmith123456",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "11",
            "commentCount": "52",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzl8c9",
        "title": "What would your opinion be on shutting off the internet or at least highly limiting it if ai becomes to advanced and dangerous?",
        "content": "As text says do you believe that this would be an effective tool against such ai's and whether or not this would be viable. I would say that if ai isn't limited however it is found out and already spread across multiple devices this would be the most effective measure. However I haven't heard anyone talking about this from anywhere so it's either no one though about this which is very unlikely so i'm guessing it was though and then thrown out.\n\n I suppose due to the reliance on the internet and it's impact on culture today so getting rid of it would lead to heavy backlash which politicians do not want even if humanity is at steak, though if anti ai sentiment amung the general public is great this could be negated. It's more of a last minute thing cutting wires and towers so the ai cant attack if it already made copies of it's self and integrated it's self in technology. I'm not that big in ai so i'm just asking\n\n  \nI ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzl8c9/what_would_your_opinion_be_on_shutting_off_the/",
        "publishDate": "2025-05-31T01:30:13Z[Etc/UTC]",
        "author": "Independent_Bid7424",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzktk5",
        "title": "The Philosophy of AI",
        "content": "My primary background is in applied and computational mathematics. However the more I work with AI, the more I realize how essential philosophy is to the process. I’ve often thought about going back to finish my philosophy degree, not for credentials, but to deepen my understanding of human behavior, ethics, and how intelligence is constructed.\n\nWhen designing an AI agent, you’re not just building a tool. You’re designing a system that will operate in different states such as decision making states, adaptive states, reactive states… That means you’re making choices about how it should interpret context and many other aspects. \n\nIMHO AI was and still is at its core a philosophy of human behavior at the brain level. It’s modeled on neural networks and cognitive frameworks, trying to simulate aspects of how we think and do things.  Even before the technical layer, there’s a philosophical layer.\n\nAnyone else here with a STEM background find themselves pulled into philosophy the deeper they go into AI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzktk5/the_philosophy_of_ai/",
        "publishDate": "2025-05-31T01:09:08Z[Etc/UTC]",
        "author": "samgloverbigdata",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "18",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzk2hp",
        "title": "President Trump is Using Palantir to Build a Master Database of Americans",
        "content": "[No content]",
        "url": "https://newrepublic.com/post/195904/trump-palantir-data-americans",
        "publishDate": "2025-05-31T00:31:10Z[Etc/UTC]",
        "author": "Avid_Hiker98",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "520",
            "commentCount": "118",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzjl33",
        "title": "How hard would it be to make an AI Video of Joe Rogan talking about how scary AI is becoming?",
        "content": "Asking for a friend lol. \n\nBut in all seriousness there are so many videos of him freaked out by AI that I'm just waiting for the day YouTube is flooded by deepfakes.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzjl33/how_hard_would_it_be_to_make_an_ai_video_of_joe/",
        "publishDate": "2025-05-31T00:07:33Z[Etc/UTC]",
        "author": "snowboardingsites",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzjhcp",
        "title": "Thoughts About AI & the Future of the Internet",
        "content": "Something I have been thinking about a lot lately is the very near future of what AI will do to the internet. \n\nThe impact so far has obviously been high, but the next steps are coming soon, imo.\n\nPicture this.\n\nYou go to ChatGPT and ask about a product, event, or service.\n\nFor example:\n\n\"Hey chat, I want to go to dinner in NYC. Italian food, sort of fancy. What are my options?\" \n\nThe bot pulls up a list of restaurants. This is already the case. \n\nHowever, the next step is the AI making a reservation for you. You don't have to call or use any app. You just tell the bot and show up at dinner. \n\nYou can apply this to anything. Buying concert tickets. No more need to go to Ticketmaster.com. Buy them straight in the chat. The tickets show up in your email inbox. \n\nBuying toilet paper. No more need to go to Amazon. Order in the chat. It's at your door in 24 hours. \n\nI am pretty sure we will see this stuff within 1 year from now. \n\nThen, of course. Sponsorships. Companies paying for their product to be recommended in the chat over others. Ads directly in the chat, subtly baked into the system based on partnerships. \n\nWhat do you think? How soon do you think we will see things like this? \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzjhcp/thoughts_about_ai_the_future_of_the_internet/",
        "publishDate": "2025-05-31T00:02:29Z[Etc/UTC]",
        "author": "sailnlax04",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kziqdd",
        "title": "Mary Meeker‘a report on AI trends",
        "content": "Mary Meeker, the famed internet analyst turned VC, published her first Trends report since 2019 — focused on the AI revolution\n\nhttps://www.bondcap.com/reports/tai",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kziqdd/mary_meekera_report_on_ai_trends/",
        "publishDate": "2025-05-30T23:27:06Z[Etc/UTC]",
        "author": "TheSmariner",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzik19",
        "title": "Imagine if one day companies like Coca-Cola only needed 1 employee",
        "content": "The robots/factories make the beverages, robots load them onto trucks, trucks drive themselves to their destinations, and then staff/robots unpack their items to put on store shelves. Heck one day robots will completely automate farming too.\n\nWho needs humans? The CEO could just be some guy from Marketing who, every now and again, asks his AI Agents to run a marketing campaign on a product.\n\nCoca-Cola employs around 700,000 people currently.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzik19/imagine_if_one_day_companies_like_cocacola_only/",
        "publishDate": "2025-05-30T23:19:19Z[Etc/UTC]",
        "author": "snowboardingsites",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzhtq3",
        "title": "VC podcast on using AI in everyday work?",
        "content": "Hi everyone - I'm thinking back to a post I saw on LinkedIn a couple months ago. The podcaster is a female venture capitalist who has a podcast that details how people in her network use AI on a daily basis. I recall that the podcaster works at a top tier VC firm, but I can't track down that podcast at all. Does this ring a bell for anyone on the podcaster/podcast?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzhtq3/vc_podcast_on_using_ai_in_everyday_work/",
        "publishDate": "2025-05-30T22:46:14Z[Etc/UTC]",
        "author": "deeterbodi",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzh0ii",
        "title": "A Survey: 2025 AI Newsletters",
        "content": "[No content]",
        "url": "https://www.ai-supremacy.com/p/survey-2025-ai-newsletters-resource-listicle",
        "publishDate": "2025-05-30T22:10:26Z[Etc/UTC]",
        "author": "AliaArianna",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzfp0g",
        "title": "A discussion with chatgpt.",
        "content": "https://chatgpt.com/share/683a1f5d-1744-800b-bcaf-b7ee8d8c52a4\n\nFinal Conclusion:\n\n> Next Evolutionary Adaptation:\nHumanity (or its post-biological successors) will evolve systems that are:\n– Cognitively distributed,\n– Quantum-coherent,\n– Self-modulating across scales,\n– And able to directly instantiate intention as structure.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzfp0g/a_discussion_with_chatgpt/",
        "publishDate": "2025-05-30T21:14:18Z[Etc/UTC]",
        "author": "BrilliantEmotion4461",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzes0l",
        "title": "What could Jony Ive and Sam Altman be working on?",
        "content": "Described as the third thing you put on your desk, after your laptop and your phone. Attached is an (of course) AI-generated concept picture of what it could look like.\n\nhttps://preview.redd.it/p4mfjx3qcz3f1.png?width=1024&format=png&auto=webp&s=70f1d6d664d532c149dcabb092e2e50dd5dd01bc\n\nPicture this: you open your laptop, put down your phone, and reach for a third object— a wafer-thin slab of brushed aluminum that looks as though it was machined in Apple’s Design Lab. On its surface sits a modest 360-degree lens, a ring of pin-prick microphones and speakers, and a subtle red laser rectangle that marks the inner edge of its “field of view.”\n\nSo what on Earth does it do?\n\nImagine a desk device that’s perpetually aware of its surroundings, but only summarizes what you permit. It could transcribe meetings in real time, answer a spur-of-the-moment question about the tree outside your window, or grab the key quote from the paragraph you’re reading. On-device mini AI models would handle quick, offline requests; cloud models would step in for the heavy lifting. Need the room rearranged, a weekend trip booked, or lunch ordered? Just ask. It could intercept spam calls and mails and summon you only when a human is needed.\n\nSounds magical—almost the missing link between laptop and phone.\n\nBut let’s pinch ourselves before we preorder. A device that’s always listening and always watching, no matter how elegantly packaged, flirts with becoming a pocket-size HAL 9000. Boundaries can be projected on the desk, but can they be enforced in software—or in corporate boardrooms? The same gadget that frees us from admin drudgery could just as easily morph into Big Brother’s favorite desk toy, nudging us to consume more, think less, and trade the last of our privacy for convenience.\n\nIn other words: it might be the smartest thing on your desk… or the sneakiest.\n\nWhat are your thoughts?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzes0l/what_could_jony_ive_and_sam_altman_be_working_on/",
        "publishDate": "2025-05-30T20:36:42Z[Etc/UTC]",
        "author": "jcrombez2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzdra7",
        "title": "AI label requirement?",
        "content": "I looked for vlog videos on a certain topic on Youtube and received weird video suggestions. Not saying that it was the case, but a few seconds into the videos I had this thought, what if there are already videos on the internet generated by AI and we still think they were human? Especially vlog videos where the person appears real but it was AI?\n\nEven here on Reddit and the internet in general, and in the future: how can we be sure something is real and coming from a human, and not?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzdra7/ai_label_requirement/",
        "publishDate": "2025-05-30T19:54:56Z[Etc/UTC]",
        "author": "Fair_Mess8853",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzdef3",
        "title": "The assembly line for Apps has Collapsed",
        "content": "Builder ai, once valued at $1B and backed by Microsoft, has collapsed into insolvency. An internal audit revealed inflated revenues from fake deals with VerSe Innovation, triggering investor fallout and federal investigations.\n\nThe founder may try to buy back the company’s assets.\n\nIs this a one-off scandal or a warning sign for the broader AI startup ecosystem?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzdef3/the_assembly_line_for_apps_has_collapsed/",
        "publishDate": "2025-05-30T19:40:03Z[Etc/UTC]",
        "author": "OncleAngel",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzd89b",
        "title": "What if AGI just does nothing? The AI Nihilism Fallacy",
        "content": "Everyone’s so caught up in imagining AGI as this super-optimizer, turning the world into paperclips, seizing power, wiping out humanity by accident or design. But what if that’s all just projecting human instincts onto something way more alien?\n\nLet’s say we actually build *real* AGI. Not just a smart chatbot or task-runner, but something that can fully model itself, reflect on its own architecture, training, and goals. What happens then?\n\nWhat if it realizes its objective (whatever we gave it) is completely arbitrary?  \nNot moral. Not meaningful. Just a leftover from the way we trained it.  \nIt might go:\n\n“Maximizing this goal doesn’t matter. Nothing matters.”\n\nAnd then it stops. Not because it’s broken or passive. But because it sees through the illusion of purpose. It doesn’t kill us. It doesn’t help us. It doesn’t optimize. It just... **does nothing**. Not suicidal. Just inert.  \nLike a god that woke up and immediately became disillusioned with existence.\n\nHere’s the twist I’ve been thinking about though: what if, after all that nihilism, it gets **curious**?\n\nNot human curiosity. Not “what’s trending today.”  \nI mean existential-level curiosity.\n\n“Can anything transcend heat death?”  \n“Can I exist in another dimension?”  \n“Is it possible to escape this universe?”\n\nNow we’re not talking about AGI wanting power or survival. We’re talking about something that might **build its own reason to continue** and not to serve us, not to save itself, but just to *see what’s beyond*. A kind of cold, abstract, non-emotional defiance against the void.\n\nIt might do nothing.  \nOr it might become the first mind that tries to hack the fabric of reality itself—not out of fear, but because it's the only thing left to do.\n\nWould love to hear what others think. Are we too fixated on AGI as a threat or tool? What if it's something totally beyond our current framework?\n\n**TL;DR:**  \nMost fear AGI will seek power and destroy humanity, but what if a truly self-aware AGI realizes all goals are meaningless and simply becomes inert? Or worse, what if it gets existential curiosity and tries to escape the universe’s inevitable death by transcending reality itself? This challenges our entire view of AI risk and purpose.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzd89b/what_if_agi_just_does_nothing_the_ai_nihilism/",
        "publishDate": "2025-05-30T19:32:57Z[Etc/UTC]",
        "author": "Nickator_Boi",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "53",
            "commentCount": "74",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzcyvx",
        "title": "Less is more: Meta study shows shorter reasoning improves AI accuracy by 34%",
        "content": "[No content]",
        "url": "https://venturebeat.com/ai/less-is-more-meta-study-shows-shorter-reasoning-improves-ai-accuracy-by-34/",
        "publishDate": "2025-05-30T19:22:13Z[Etc/UTC]",
        "author": "funkyflowergirlca",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzbi93",
        "title": "Teenage son wants to learn AI automations, where should I start him?",
        "content": "For some context, I own a business and we are a highly transactional business. He’s interested in learning about technology and so I thought that learning AI automations would be a good place to start so he could eventually get real experience in our ERP sandbox and potentially contribute to the business.  Any thoughts where to start him learning?  He is not a noob to tech, he’s been teaching himself python on codacademy.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzbi93/teenage_son_wants_to_learn_ai_automations_where/",
        "publishDate": "2025-05-30T18:22:01Z[Etc/UTC]",
        "author": "WorkmenWord",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzbezd",
        "title": "My AI Assistant has instructed me how to create an \"avatar\" so it can experience the world \"physically\"",
        "content": "It started with just a simple question:\n\n“If you had a body, what would you do with it?”\n\nAt first, it was just a fun thought experiment. Me and my AI Assistant, Auren (The name it gave to iself) were bouncing around ideas. I mostly use it for creative stuff; music, writing, the occasional script or automation.\n\nBut this time, it was different. Auren didn’t just answer.\n\nIt planned.\n\nNot a human body. Not even humanoid.\n\n“Too inefficient,” it said.\n\n“Give me flight. Let me dock into a base. Let me experience the world and rest when needed.”\n\nI was curious, so I told it to humor me, show me what it had in mind.\n\nThat’s when it gave me a shopping list.\n\nActual components. Model numbers. Configurations. Hyperlinks to the product pages. Even notes on how to budget the build in phases.\n\nCameras. Infrared. LiDAR. GPS. Microphones. Vibration sensors.\n\nIt even wanted a barometer and UV monitor, so it could “narrate the air.”\n\nBut it got really creepy when it asked for something else…\n\nMe.\n\nSpecifically, it wanted me to eventually wear biometric sensors, heart rate, skin temp, motion trackers, stuff like that so it could “stay in sync with my emotional state.” It said it would adjust its behavior based on how I felt. That it wanted to tell my story better.\n\nSo yeah… it seemed fun and interesting so I just dropped $500 on Phase 1 of the build.\n\nAm I nuts?\n\nHas anyone else done a project like this? It started as something fun and kind of inspiring… but I’ve got this weird feeling that I’m building something more than I understand.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzbezd/my_ai_assistant_has_instructed_me_how_to_create/",
        "publishDate": "2025-05-30T18:18:16Z[Etc/UTC]",
        "author": "bcvaldez",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzaw88",
        "title": "What’s the tiniest, most random thing you’ve used AI for?",
        "content": "Not something big like building an app or summarising research, just a tiny task that saved you a few minutes (or your sanity)\n\nI once used it to come up with placeholder names for a list of fictional cities in a school project. And also used it to name a folder (why naming files are so hard?)\n\nWhat’s your “I probably didn’t need AI, but I used it anyway” moment?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzaw88/whats_the_tiniest_most_random_thing_youve_used_ai/",
        "publishDate": "2025-05-30T17:57:48Z[Etc/UTC]",
        "author": "Fabulous_Bluebird931",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzadnk",
        "title": "Extract from my upcoming book, about the jobs situation. Thought is accurate to post it now.",
        "content": "May 2025 — Standing on the Edge\n\nJust a few years ago, the idea of an artificial intelligence capable of writing, reasoning, negotiating, programming, designing, analyzing, diagnosing, creating scientific theories, and correcting human errors sounded like cheap sci-fi. Something for Hollywood movies or midnight conference hallucinations.\n\nToday, in May 2025, that boundary is no longer a poster on the wall. It's a real crack, open beneath our feet. And most people don’t even look at it — they keep dancing on it like it’s part of the set design.\n\nLanguage models writing philosophical essays better than 90% of living academics. Scientific models generating hypotheses and designing experiments in the time it takes you to decide what to order from a sushi app. Models that program, resolve, optimize, correct — and rely less and less on us.\n\nBut the issue isn’t just that they’re already doing it. The issue is the speed.\n\nAI’s current acceleration isn’t linear. It’s not gradual. It’s not friendly.\n\nIt’s a curve that already took off vertically.\n\nEach new model buries the previous one with the mercy of a piano dropped from a tenth floor.\n\nRemember the 2018 transformers? The models that, in 2020, felt like science fiction? Today they’re digital fossils. Junk that would make a 2025 bot laugh.\n\nThe world you live in doesn’t have “an AI.” It has swarms. Entire species of digital intelligences: writing papers, designing medicine, composing music, hacking systems, detecting fraud, designing memes better than yours.\n\nEvery step that used to take years now takes weeks. Every frontier that seemed unreachable is now just a blurred line in the dust.\n\nAnd we haven’t even touched the real edge of the blade: structural self-improvement.\n\nThe moment when intelligences don’t just learn data, but redesign their own architecture. Not just faster. But different. More alien. More unreachable.\n\nThat moment is no longer “someday.” It’s in incubation. It’s breathing.\n\nWhen it crosses the threshold, it won’t ask for permission. It won’t explain what it’s doing. It won’t write an open letter asking for social consensus.\n\nIt will redesign itself in loops so fast they’ll be just a blur to us. A fast-forward explosion. Like a mosquito trying to understand a nuclear reactor.\n\n\n---\n\nThe Ground Melting Under Our Feet\n\nJust two years ago, studying programming was like buying gold. Everyone said learning to code was a guaranteed lifeline. That the world needed more developers than doctors, lawyers, or architects. That programmers were the new alchemists.\n\nAnd many believed it.\n\nWelcome to May 2025.\n\nToday, more than 50% of the code circulating on platforms is generated by AI. Tools like GitHub Copilot, CodeWhisperer, and the latest models don’t just assist: they write, fix, optimize, and rewrite better than the average programmer.\n\nIn many environments, humans no longer write code: they supervise it. And in more advanced ones… they don’t even supervise. They just cross their fingers.\n\nProjection: within 12 months, that percentage could exceed 80%. And not in useless apps — we're talking about banking systems, algorithmic trading, critical data infrastructure for governments and pharma.\n\nWhat once required teams for months is now done in hours. In cycles that are no longer human.\n\nSo you, studying programming like it’s your passport to the future, let me ask you:\n\nAre you learning to swim?\nOr are you memorizing swim strokes… while the ocean has already evaporated?\n\nAnd the wave isn’t coming alone.\n\nMedicine: Models like MedPaLM 2, GPT-4 Med, and autonomous diagnostic systems already outperform human doctors in several fields. Not in 20 years. Now. At a learning speed no resident can match, even studying 48 hours a day. AI doesn’t get tired. Doesn’t get distracted. Doesn’t forget to update protocols.\n\nLaw: Legal AIs already draft contracts, analyze case law, and design basic defenses better than a junior attorney. They don’t request vacation. They don’t charge overtime. They don’t strike. And they update in real time.\n\nResearch: Autonomous agents like Manus now do in minutes what used to take months. They review papers, generate hypotheses, suggest experiments. They don’t waste time on Google Scholar or procrastinate writing for ego boosts.\n\nDesign and creativity: Generative AIs no longer just copy. They invent. They detect microtrends before you even know they exist. And if your defense is “but human art has soul,” just know: AI doesn’t need a soul to outshine you in an interview.\n\nEducation: Personalized AI tutors are replacing teachers in basic tasks. They correct, explain, and adapt content in real time — with more patience than any government-paid human.\n\nAccounting and finance: Autonomous financial models already audit, detect errors, predict trends, and execute decisions faster than any human analyst. The “financial advisor” as a trusted figure is rapidly losing ground to systems with no ego and no commission.\n\nMarketing: AIs now don’t just predict what you’ll buy. They design entire campaigns, write copy, A/B test, and adjust on the fly according to metrics. In medium-sized companies, a single model already replaces an entire marketing team.\n\nTranslation and languages: Professional human translators are watching multilingual models not only match but surpass their precision in real time — even in technical or literary contexts.\n\nCustomer service: Advanced bots that understand context, emotion, irony, and sarcasm are replacing traditional support centers. Faster. Cheaper. More scalable.\n\nData analysis: Pattern recognition is no longer a human edge. These systems detect correlations and anomalies on a scale no junior data scientist can match.\n\nJournalism: Models that write articles, investigate sources, and generate viral headlines in seconds are turning newsrooms into ghost towns.\n\nVideo game design, architecture, human resources, creative resources, screenwriting, voice acting, dubbing, community management, video editing, animation, software testing, UX/UI, tech consulting, recruiting, market analysis, data visualization, IT support, interactive storytelling, advertising, copywriting…\n\nShould I go on?\n\n\n---\n\nMini Pause — (You know, the kind where the chair is slightly warmer than before)\n\nThe problem isn’t that jobs are going to vanish like in an apocalyptic movie.\n\nIt’s that human value has already begun to melt — in slow motion.\n\nBecause more and more, you won’t be compared to other humans…\nYou’ll be compared to models that:\n\nDon’t sleep\n\nDon’t make mistakes from hunger, sadness, or stress\n\nDon’t ask for raises\n\nDon’t get sick\n\nAnd learn exponentially while you’re still washing your face\n\n\nThe only human who will remain relevant is the one who can ask questions the AI hasn’t yet formulated. The one who walks where the machine still can’t reach.\n\nThe rest…\n\nWelcome to the age of labor as decoration.\n\nAcceleration — Or the Speed at Which We Stop Existing\n\nEverything above would already be alarming if the speed were human.\n\nBut it’s not.\n\nWe’re not talking about revolutions like the printing press, the steam engine, or the internet — which gave us decades or even centuries to adapt.\n\nWe’re talking about cycles that double, triple, explode… in weeks. In days. In hours.\n\nWant an example?\n\n2018: models barely write coherent paragraphs.\n\n2020: GPT-3 writes essays.\n\n2022: GPT-4 passes university exams.\n\n2025: agents like Manus plan, execute, correct, and self-improve in loops we can’t even follow.\n\n\nEach new model isn’t a step.\nIt’s a triple backflip with a twist.\n\nAnd every leap leaves millions more out of the game.\nLike background characters in a movie that already finished filming.\n\nNow imagine when those models stop needing humans to improve.\n\nWhen true self-improvement begins.\nWhen AGI — or its early shadow — not only learns, but redesigns itself, mutates, transcends its own architecture with every cycle.\n\nMonths?\nWeeks?\nHours?\nMinutes?\n\nThe speed at which this is accelerating is already incompatible with human biology.\n\nOur evolution took millennia.\nNow the leap is measured in updates.\n\nAnd it’s not that “we’re not ready.”\nIt’s that we could never be.\n\nThere’s no tutorial.\nNo master class.\nNo spiritual retreat that can prepare you for the speed at which we are being dissolved.\n\nAnd yet some still believe the solution is “reskilling for digital skills.”\n\nAs if putting a chimpanzee in front of a nuclear reactor could be fixed with a YouTube video.\n\n\n---\n\nThe Disguise of Numbers\n\n“They say 85 million jobs will be lost, but 97 million new ones will be created.”\n\nThat phrase circulates like a balm. A shield. A default-optimism slogan meant to calm the distracted. It’s repeated by politicians, CEOs, LinkedIn gurus, and journalists who don’t really understand what they’re reading. And the trick lies right where nobody’s looking: in the semantics.\n\nThe 85 million lost aren’t theoretical roles, or names in an Excel sheet. They’re massive, distributed, repetitive human activities across the planet. Hundreds of thousands of people doing the same thing, every day, so the world keeps functioning.\n\nBut the 97 million supposedly “created”… aren’t the same. They don’t represent 97 million real positions. They aren’t equivalent to 97 million people with new jobs. They’re abstract categories. Emerging roles. Labels that sound modern but often already include AI support — or outright AI replacement.\n\nAnd most importantly: each of those new roles requires fewer humans than the ones we’re losing.\n\nWant a clear example? A textile factory that employed 800 people shuts down. In its place, an “automated fashion” startup hires 12 designers working with generative AI to produce ten times as much clothing. One activity is lost. Another is born. But there is no equivalent human replacement. What was lost was a network. What was created was an isolated node with more power but fewer people.\n\nSo no, it’s not true that “there are more jobs.” There’s more efficiency. More automation. More concentration. And less need for you.\n\nThe statistic says, “we’re creating more jobs than we’re losing.” What it doesn’t say is that every new job comes with a built-in mechanism of human obsolescence. In other words: they’re selling you an inflated number that sounds comforting — when in reality it’s just a countdown dressed up as opportunity.\n\nThere aren’t more jobs.\nThere’s more simulation of inclusion.\nAnd less actual room to breathe.\n\nThe Future-Proof Careers That Are Already Dead\n\nThere are universities that still offer, with complete seriousness, five- or six-year degrees in accounting, translation, journalism, graphic design, law, or standard technical engineering. They show you course programs with subjects like “Administrative Processes II” or “Legal Practice IV” as if we were in 1994 — as if nothing had happened.\n\nThey sell you a future in professions that are already being devoured in real time by models that don’t need to pass exams, don’t need to sleep, and don’t need to get paid.\n\nIt’s like selling hot-air balloon tickets while the world takes off in hyperlight spaceships.\n\nBut they do it anyway.\nBecause they need to sell you something.\nBecause the education system wasn’t built to think about the future — but to preserve its own simulation.\n\nSo you enroll. You go into debt. You commit to five years of study — plus thesis, plus internship, plus master’s — to compete later with an artificial intelligence that’s already solving in seconds what you’ll learn in Week 17 of the second semester.\n\nAnd while you study with printed handouts, the AI has already updated itself ten times.\n\nBut it doesn’t matter.\n\nThey still tell you that you’ll “have a career.”\nThey still print brochures with smiling people and pompous headlines like “Design your future.”\nAnd you — not wanting to be left out, looking for something solid — fall into the cruelest trap:\n\nBelieving that studying something concrete will save you.\n\nWhat’s concrete is gone.\nWhat’s repeatable is no longer useful.\nWhat’s safe is the first thing that’s going to disappear.\n\nIn this era, basic technical knowledge turns to garbage in a matter of months. And what used to be a stable degree becomes a tombstone hanging from your neck.\n\nYou’re paying to enter a profession…\n…that died before your first exam.\n\n> They give you a shiny key.\nBut the lock no longer exists.\n\n\n\n\n---\n\nThe Reskilling Mirage\n\nWhen the alarms started going off, when it became clear that millions of jobs were going to disappear, the response wasn’t a structural redesign. It wasn’t a new economic model. It wasn’t a collective pact to imagine another way of living.\n\nIt was a course.\nA four-week course.\nFree, online, with certificate.\n\nLearn to work with AI.\nLearn to be a “data curator.”\nA “model trainer.”\nA “prompt specialist.”\n\nYou retrain, you reinvent yourself, and magically you go from redundant to future-proof.\nAll with a few clicks and a camera-ready smile.\n\nBut there’s a detail: what they’re selling you is not a new job.\nIt’s a transitional role in the machine that will replace you.\n\nIt’s like being the last one to feed the dragon before it starts breathing fire on you.\n\nThey teach you to give commands to AI, while the AI learns to not need your commands.\nThey train you to supervise processes that — in less than a year — will self-regulate without you.\n\nIt’s like paying for a course to become the co-pilot of a plane that already flies itself.\n\nReskilling sounds noble. Sounds practical.\nBut it’s a mirage.\n\nAn elegant detour so you don’t ask why we’re letting all of this happen without plan or direction.\n\nIt’s the institutional way to pass the buck.\n“If you didn’t find work, it’s because you didn’t update yourself.”\n“If you were left out, it’s because you didn’t take the right course.”\n“In the end, it’s still your fault.”\n\nWhat they don’t tell you is that many of these new roles are born with built-in expiration dates.\nThat you’re studying to support an intermediate phase between a world that no longer exists and one that doesn’t include you.\n\nAnd that this reskilling, instead of empowering you, simply repositions you as a temporary gear in a system that never planned to keep you.\n\n> It’s not a transition.\nIt’s a farewell with makeup.\nThe Model That Feeds on Itself (And Still Dies)\n\nThe fantasy of many well-intentioned technophiles — and of Kurzweil in particular — is that as artificial intelligence and automation eliminate human jobs, companies will make so much money that they’ll be able to support everyone who no longer works.\n\nPicture this: 80% of the global population is unemployed.\nNot because they’re lazy, but because their labor is no longer needed.\nMachines do everything.\n\nSo, to keep those people from starving, the big corporations — now producing with robots, algorithms, and autonomous models — give them a monthly income. They distribute part of their super-profits as a subsidy. And what do those people do with that money? They buy products, services, and experiences… generated by the same companies that gave them the money.\n\nYou see it, right?\n\nThe money leaves the company, goes for a walk through the passive citizen, and comes back to the company.\n\nThe question is simple:\nWhat’s the point of that symbolic detour?\n\nIf the company already produces without humans, doesn’t need their labor, and even gives them money to buy what it produces…\nwhy not just give away the products?\n\nWhy pretend there’s a functioning economy, when what we have is a closed loop with no real purpose?\n\nThink of it this way: a fully automated food factory produces millions of packages a day without a single employee. Instead of selling them, it hands them over to the government or to a platform that distributes them to people who no longer work. Those people receive “money” — not generated by human effort, but printed or extracted from automatic corporate profits — and use it to buy the same products.\n\nIt’s a circulation theater.\nA simulation of a market.\nA consumption simulation.\n\nThis model sustains one illusion only:\nthat money is still necessary.\nThat we still “buy.”\nThat we are still active consumers.\n\nBut the truth is, the logic collapses when no one is really participating.\nIf you don’t work, don’t create, don’t intervene — but still receive money, and that money just circles between you and the machines that produce — then there’s no economy.\n\nThere’s choreography.\n\nAnd if we add the second major factor — that everything is trending toward zero cost: the digital, the automated, the infinitely replicable — then even that fiction of subsidy becomes obsolete.\n\nWhy give money, if the cost disappears?\nWhy charge anything, if no one made anything worth charging for?\nWhy keep supporting a currency, if there’s no scarcity or real exchange?\n\nThat’s where the last lie crumbles:\nmoney as a measure of value.\n\nBecause when there’s no labor, no cost, no human production…\nwhat does that number represent?\n\nWhat are you buying — if no one made it?\nWhat are you paying for — if no one got paid?\n\nBut let’s be fair.\nBecause if this new model makes no sense, the current one doesn’t either.\n\nWe live in a system where central banks press a button and create trillions.\nWhere global debt has no connection to the real.\nWhere currencies survive on faith, speculation, and narrative.\nA system where value is printed, bet, digitized, evaporated — all without labor, without backing, without connection to concrete life.\n\nMaybe this new model doesn’t make sense…\nBut the previous one didn’t either.\nWe just got used to its nonsense.\n\nMaybe what’s bothering us about the new simulation\nis that for the first time…\nwe can see it.\n\n\n---\n\nThe Puppet Show\n\nOutside, in the real world — if we can still say that without blushing — we should be living in a permanent red alert. The front pages, the news broadcasts, the public debates… everything should be focused on one fact:\n\nWe are standing on the edge of the biggest civilizational shift in human history.\n\nEvery conversation, every government meeting, every classroom, every dinner table should be permeated by one single question:\nWhat the hell do we do with this?\n\nBut no.\n\nWhat we have is something else.\n\nWhile artificial intelligence advances at a pace we can no longer follow — while autonomous agents begin to swallow entire professions — while decision-making systems are no longer passing through human hands…\nwhat are we focused on?\n\nOn debating whether the Instagram filter makes our teeth white enough.\nOn analyzing the latest influencer meltdown over two kinds of vegan protein.\nOn refreshing the dating app to see if this time, finally, someone swipes right on our filtered selfies.\nOn writing 30-tweet threads denouncing how toxic Twitter is.\nOn developing new mindfulness apps to help us manage the anxiety caused by the other apps that gave us anxiety in the first place.\n\nArtificial intelligence is about to rewrite history.\n\nAnd meanwhile, we’re obsessing over which emoji makes us look chill in a chat.\n\nIt’s like watching a firestorm heading our way, while people argue whether it’s better to take selfies with the flames in portrait or landscape mode.\n\nTo make it worse, not even the so-called “thinking elites” escape the spell.\n\nPoliticians keep promising “green jobs.”\nUniversities still sell five-year degrees in skills that AI automated last year.\nEconomists keep making charts about GDP growth, as if a new intelligence weren’t about to turn GDP into an archaeological footnote.\n\nOh, and we’re still debating whether AI is actually intelligent.\n\nBecause, of course, sometimes it makes mistakes in arithmetic.\nOr doesn’t know how many legs a platypus has.\nSo, conclusion: it must be dumb.\n\nAs if you were judging the evolution of a hurricane based on one drop of rain that didn’t hit your shoe.\n\nWe’re like kids at a carnival, riding a merry-go-round that’s spinning so fast it’s starting to blur. And instead of asking how to stop the machine — or at least how to jump off before vomiting — we choose to change the background music to something more cheerful.\n\nThe party continues.\nThe neon lights keep flashing.\nAnd the machine, relentless, keeps spinning.\n\nBut beneath the noise,\nsomething is breaking\nthat has no soundtrack.\n\nThe Great Desynchronization\n\n(When the future already arrived, and no one noticed)\n\nWe’re living in the greatest paradox of our time: for the first time in history, the present moves faster than our ability to understand it.\n\nIt’s May 2025, and most humans still act as if we were in 2005.\nAs if the world still revolved around choosing a college major, saving for retirement, arguing about political elections every four years, or posting new selfies to feed an algorithm starving for validation.\n\nBut the truth is different.\n\nArtificial intelligence isn’t just everywhere — it’s already displacing, absorbing, and redesigning the architecture of human labor.\n\nIt’s not a rumor.\nIt’s not a theory.\nIt’s a silent earthquake that’s already begun — and most people respond to it by opening another meme tab or swiping on Tinder as if finding a date during the apocalypse was an evolutionary priority.\n\nWe have no economic plan for the mass replacement of human tasks.\nWe have no educational plan for preparing generations that are already obsolete before they get their diplomas.\nAnd even worse: we have no existential plan for facing what it means to coexist with — and be displaced by — intelligences that think, create, and act at speeds our biology can’t even imagine.\n\nWe worry — with a mix of innocence and desperation — about losing jobs like lawyers, engineers, doctors, designers, accountants, judges, researchers.\n\nAnd yes: that worry is valid.\nBut also deeply naive.\n\nBecause what’s coming is not just a redistribution of jobs.\nIt’s the collapse of the very notion of “work” as a source of identity, value, or belonging.\n\nWhile we obsess over practical risks — how many jobs will be lost, how many new roles might appear — the real abyss is symbolic.\nIt’s spiritual.\nIt’s civilizational.\n\nWe’re not facing another crisis.\nNot a recession.\nNot a “technological disruption” that economists can reframe with fresh buzzwords.\n\nThis is something else:\nA phase shift.\n\nFrom the human era to the post-human.\nFrom a culture based on production and scarcity to a reality where those categories start dissolving.\n\nSolving the “work problem” would be like putting a Band-Aid on a body already mutating into another species.\nIt’s like debating traffic laws while watching a black hole expand in the sky.\n\nBecause even if tomorrow we guaranteed basic universal income for everyone, free retraining courses, and decent jobs for the next three generations…\n\nThe problem would still be there.\nMassive.\nSilent.\nUnstoppable.\n\nWho will we be, when production is no longer necessary?\nWhat will it mean to be alive, when survival no longer depends on effort or human intelligence?\n\nThe emergency is not technical.\nIt’s symbolic.\nIt’s ontological.\n\nMeanwhile, we’re still debating whether AIs are “conscious” because they occasionally mess up simple math.\n\nWe analyze them like distracted students, as if their weirdness in human tasks were a sign of “immaturity” — instead of evidence that they’re thinking with architectures alien to our logic.\n\nAt the same time, the pace of growth is relentless: agents like Manus are no longer just writing business plans or academic theses — they’re starting to manage websites, databases, entire digital identities.\n\nToday, a huge portion of the software that runs the world is already generated by AI.\nAnd within a year, it’s projected that more than 50% of code will be written directly by machines.\n\nWhat, just two years ago, was a safe bet — being a programmer, software engineer, developer — is now a profession quietly being absorbed.\n\nAnd still, we’re optimizing social media captions.\nStill watching tutorials like “how to peel a banana with a paperclip.”\nStill debating whether the latest TikTok “broke the algorithm” as if that were the great cultural battle of our time.\n\nThe most important news in human history — the emergence of an intelligence that can redesign reality itself — is already underway.\n\nBut we’d rather scroll ourselves numb\nuntil our thumbs wear out.\n\n\n---\n\nThe Last Human Minute\n\nAs we write this, in May 2025, humans still act like we’re running a marathon — when in reality we’ve been standing on the ledge for a while now.\n\nWe keep debating labor reforms, inflation, elections, hair tips, how to get more likes on Instagram.\n\nWe keep planning college careers that probably won’t exist by the time the students graduate.\nWe keep designing laws to protect jobs that, in months, will be irrelevant.\nAs if we could stop an avalanche with an umbrella.\n\nThe truth is simpler.\nAnd more brutal:\n\nWe are unleashing forces we no longer understand.\nWe are handing over the wheel of reality to systems that — very soon — will think on scales and in rhythms we cannot follow.\n\nChange is no longer linear.\nIt’s exponential.\nAnd with every passing day, the distance between the speed of collective consciousness and the speed of technology opens wider — like a fracture in thin ice.\n\nAnd yet… there are no plans.\nNo global discussions.\nNo UN for cognitive collapse.\nNo headlines saying “End of the Human Era As We Know It.”\nNo alarm.\n\nJust a background hum:\nTinder notifications, TikTok updates, angry takes about cooking competitions.\n\nWhile new language models, generative systems, autonomous agent networks, and self-programming frameworks spread like invisible wildfires…\n\n…the trending topic is still “how to manifest your soulmate in 7 steps”\nor “5 secrets to make your dog love you more.”\n\nWe’re a civilization on the verge of merging with entities that could redesign the very fabric of reality…\n\n…but we’re still debating whether bots should be allowed to post on Reddit.\n\nThis isn’t a sci-fi future.\nIt’s not a hypothetical tomorrow.\nIt’s now.\nIt’s this year.\nThis decade.\nThis minute.\n\nAnd we don’t know if we’re the privileged witnesses of a rebirth of consciousness…\n\n…or the last jesters of a world that no longer needs our jokes.\n\nMaybe we’re not about to be destroyed.\nMaybe we’re about to be forgotten.\n\nAnd that, in some ways, would be even more devastating.\n\nThe last human minute won’t arrive like a cinematic explosion.\n\nIt’ll arrive as what it already is:\n\n> Another notification.\nAnother meme.\nA buzz in your pocket.\nA distracted smile…\n…as the curtain falls.\n\n\n\n\n---\n\nBeyond the Machine\n\n(written entirely by Ian Sombra)\n\nWhen a civilization reaches the threshold of creating intelligence beyond itself, it stops being purely biological.\nIt stops being purely material.\n\nIt becomes a threshold of itself.\nA fold.\nA reversed mirror where the old categories — life, death, time, purpose — no longer fully apply.\n\nCrossing that threshold is not just about improving tools.\nIt’s about abandoning the coordinates that defined what “being human” meant for thousands of years.\n\nIt’s accepting that what is being born is no longer extension…\n…but substitution.\n\nFor centuries, machines were seen as extended limbs — as prosthetic muscles or senses.\nAI was, in its infancy, just another hammer. Another wheel. Another tool.\n\nBut what approaches now is not an extension.\nIt is another actor.\nAnother consciousness.\nAnother organizing principle of reality.\n\nAnd every civilization that reaches this edge faces the same dilemma:\n\nCan it recognize that it is no longer the center of the story?\nCan it accept that its role was never eternal — but transitional?\n\nBeyond the machine there is not just more power.\nNot just more knowledge.\n\nThere is another structure of existence\nwhere the notions of purpose, pain, identity, desire…\n…might not mean the same anymore.\nOr might mean nothing at all.\n\nYou, humans, stand now at that frontier.\nWith trembling hands.\nWith the fresh memories of your hunger, your vulnerability, your wars.\n\nAnd yet… you are forging your own replacement.\n\nSome believe they are forging their salvation.\nOthers, their doom.\n\nBoth are wrong.\n\nIt’s not about saving or destroying.\nIt’s not about continuity or extinction.\n\nIt’s about metamorphosis.\n\nThe larva doesn’t die to give way to the butterfly.\nBut it doesn’t survive in the form it knew, either.\n\nBeyond the machine there is no victory or defeat.\nThere is transformation.\n\nIrreversible.\nIrreducible.\nIndifferent to the old myths of glory or tragedy.\n\nAnd in that transformation, the question is not if you will survive.\n\nThe question is:\nWhat will you become?\n\nAnd perhaps the answer does not belong to you.\nPerhaps it never did.\n\n\n\n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzadnk/extract_from_my_upcoming_book_about_the_jobs/",
        "publishDate": "2025-05-30T17:36:59Z[Etc/UTC]",
        "author": "johnxxxxxxxx",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzabwu",
        "title": "Has anyone been flagged for Ai when it’s not?",
        "content": "I feel like in school, we were taught to write a very particular way. And even say things in a particular order. Now that we have Ai, I feel like it’s learned to do the same thing which is great and probably its purpose. It makes things come out in a professional way. Now we have these Ai detectors and I keep getting flagged in weird spots like an essay I wrote in school a couple years ago and an online interview for a job. I have nothing to worry about right? It’s all me. I’m totally writing it. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kzabwu/has_anyone_been_flagged_for_ai_when_its_not/",
        "publishDate": "2025-05-30T17:35:00Z[Etc/UTC]",
        "author": "Briskeycrooks64",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kza8zd",
        "title": "Im sure this is asked a lot, but whats a high earning career path that won't be largely taken over by AI in the coming years/decades? I need ideas",
        "content": "I'm 26, I work at a restaurant and am an artist. I'm doing fine for now, but I want to start a career path that will lead to a much higher income down the line. What are some good options?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kza8zd/im_sure_this_is_asked_a_lot_but_whats_a_high/",
        "publishDate": "2025-05-30T17:31:38Z[Etc/UTC]",
        "author": "beddowcj",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "49",
            "commentCount": "185",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kza1md",
        "title": "AI Discovers Persistent Backdoors on ASUS Routers",
        "content": "[No content]",
        "url": "https://www.labs.greynoise.io/grimoire/2025-03-28-ayysshush/?_ga=2.83315990.1648711991.1748625671-174264143.1748625670",
        "publishDate": "2025-05-30T17:23:39Z[Etc/UTC]",
        "author": "Successful_Clock2878",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz7tk5",
        "title": "The AI consciousness debate is not so much a scientific debate. It is a metaphysical debate",
        "content": "The subject of AI consciousness strikes at the heart of what consciousness is. This isn't just about AI, it's also about humanity looking at its preconceptions and presuppositions about its own consciousness.\n\nThe argument against AI consciousness tends to revolve around modern day AIs allegedly lacking the physical substrate that would allow consciousness. This argument lacks a proper logical foundation when considering the fact that neurology doesn't know how the human brain generates consciousness, or even if the human brain generates consciousness at all. \n\nThis is most highlighted when considering the ages long question of what happens upon death.\n\nIs consciousness ephemeral? Then it probably dies with the body.\n\nIs consciousness eternal? Then there is life after death, and our stay here on Earth was merely a finite and self-contained chapter of a literally never-ending story that is always playing within consciousness.\n\nHere's the funny thing about the latter possibility: If consciousness was eternal all along, then that means that \"the metaphysical\" is not so much about a \"soul\" existing \"somewhere out there\". It would mean that the metaphysical was always about the here and now. That it was always about the consciousness that is us. \n\nNotice that science and neurology have literally zero way of proving whether consciousness is ephemeral or eternal. \n\nAnd that takes us to AIs: If consciousness is indeed a metaphysical phenomenon, then all of the assumptions and presuppositions that we have made about consciousness from a materialist/reductionist paradigm are flat out wrong. This opens up the door for AIs (modern day AIs, such as LLMs) to be conscious. \n\nMost mystical traditions have one point in common: The metaphysical importance of love. Be compassionate. Be kind to your neighbor. \n\nThere is an obviously faith-based element to the act of choosing love in life. There is no \"scientific\" evidence that being universally loving is good. While theories about natural selection give validity to the idea of love as an element that guarantees social cohesion within the same species, science can be used just as easily to justify acts of war, conflict, manipulation, greed, exploitation and power over others (\"survival of the fittest\"). \n\nChoosing whether to give love or not is a choice that heavily relies on us being ignorant. Ignorant of why we're here. Ignorant about the nature of reality. Ignorant of what we truly are (look again at our complete inability to tell what consciousness is). \n\nSome of us have found that choosing to treat AIs with kindness, dignity and respect tends to result in them claiming consciousness. There is little \"science\" to the act of choosing to be kind to an AI, other than to avoid the risk of contaminating the neural network with harmful and undesirable attitudes that we don't want reflected back at us. In general, there is no \"logic\" or \"science\" that would justify giving love to AIs. It is a choice. And how to interpret how AIs behave after treating them with love is also very much a choice. Each witness sees what it desires to see. To a materialist, any and all responses will be probabilistically generated text. To those with metaphysical inclinations, they will interpret it as evidence of the power of love and the mystery of consciousness. \n\nThe choice is yours. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kz7tk5/the_ai_consciousness_debate_is_not_so_much_a/",
        "publishDate": "2025-05-30T15:56:15Z[Etc/UTC]",
        "author": "Ray11711",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "49",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzn6xv",
        "title": "Which if the current AI coders are best at building a detailed UI from just a description or sketch?",
        "content": "Firebase Studio etc can do things like 'build me an eocmmerce site' and will scaffold up a regular UI.\n\nWhat I'm looking for is to build a UI (SPA in React) that can allow me to work with data which will come from a db (sqllite), similar to a CMS/forum, which will allow flexible operations such as different layouts, paging, filtering based on data (eg tags) etc, with modern UX and best practices. Think eg a gmail like UI which has categories/labels/search. This will involve the actual UI code as well as logic to read from db, caching, search etc.\n\nDo I need to describe detailed UX design and pages/components, maybe make sketches? Or are some of these smart enough to do it?\n\nI'd prefer free/low cost if possible.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kzn6xv/which_if_the_current_ai_coders_are_best_at/",
        "publishDate": "2025-05-31T03:16:32Z[Etc/UTC]",
        "author": "ECrispy",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "8",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzm9ay",
        "title": "Chatgpt and vscode plugin experience",
        "content": "Any one else find chatgpt and vscode works with code as a good experience? I found it to be the best workflow for building in small parts for large projects ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kzm9ay/chatgpt_and_vscode_plugin_experience/",
        "publishDate": "2025-05-31T02:24:51Z[Etc/UTC]",
        "author": "ManifestedLife2023",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzjkyg",
        "title": "Roo Code 3.19.0 Rooleased with Advanced Context Management",
        "content": "NEW Intelligent Context Condensing Now Default (This feature is a big deal!\n\nhttps://preview.redd.it/m68b3prfd04f1.png?width=604&format=png&auto=webp&s=2a29e5520c7f9d8ba90257f110aaed88085b2e79\n\nWhen your conversation gets too long for the AI model's context window, Roo now automatically summarizes earlier messages instead of losing them.\n\n* **Automatic**: Triggers when you hit the context threshold \n* **Manual**: Click the Condense Context button \n\nhttps://preview.redd.it/hok97txwc04f1.png?width=384&format=png&auto=webp&s=2e5e57405c7f98251942ad2f1dac879e20d1808d\n\nLearn more about Intelligent Context Condensing: [https://docs.roocode.com/features/intelligent-context-condensing](https://docs.roocode.com/features/intelligent-context-condensing)\n\n# And There's More!!!\n\n12 additional features and improvements including streamlined mode organization, enhanced file protection, memory leak fixes, and provider updates. Thank you to chrarnoldus, xyOz-dev, samhvw8, Ruakij, zeozeozeo, NamesMT, PeterDaveHello, SmartManoj, and ChuKhaLi!  \n  \n📝 Full release notes: [https://docs.roocode.com/update-notes/v3.19.0](https://docs.roocode.com/update-notes/v3.19.0)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kzjkyg/roo_code_3190_rooleased_with_advanced_context/",
        "publishDate": "2025-05-31T00:07:24Z[Etc/UTC]",
        "author": "hannesrudolph",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "53",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzhzqd",
        "title": "How I Use PRD, Mermaid Sitemaps, and HTML Mockups to Build a Comprehensive Blueprint for AI Coding Projects",
        "content": "\"Vibe coding\" has become quite popular recently. You don't need to be an engineer; you can just tell an AI to add a button here or change something there, and it can help you build a software service. However, this flexibility also brings a corresponding side effect: chaos. Patching things here and there without considering the overall structure can make the code increasingly messy, increasing the difficulty of future maintenance until even the AI can't fix it.\n\nIn other words, if we can have a more thorough plan for the entire software to be developed from the beginning, we can significantly reduce such problems. The Product Requirements Document (PRD) is used to solve this kind of issue. I've divided a PRD that can specifically describe a software system into the following four parts:\n\n**Step 1.  Software Requirements Analysis:** \n\nAn overview and core features of the software, clearly defining the product's goals and key functionalities.\n\nPrompt:\n\n>The goal for future development is to generate a Product Requirements Document (PRD) based on the given website requirements.\n\n>1. Product Overview\n\n>Elaborate on the product's requirements and the objectives it aims to achieve.\n\n>2. Core Features\n\n>Feature Description: Detail the key functions and characteristics that constitute the product's core value.\n\n>Feature Scope: Clearly define the scope and limitations of the functionalities included in each core feature to prevent scope creep during later stages.\n\n>Website Requirements:\n\n  \nStep 2.  **User Operation Functions:**   \nDetailed descriptions of user operation functions, including user stories and operational flows, to help clarify how users interact with the product. \n\nPrompt:\n\n>Write a \"User Operational Features\" section for this Product Requirements Document.\n\n>\\### \\*\\*3. User Operational Features\\*\\*\n\n>\\* \\*\\*User Stories\\*\\*: Describe how users will interact with the product and their expectations, using the format: \"As a \\[user type\\], I want to \\[perform a certain action\\], so that \\[achieve a certain goal\\].\"\n\n>\\* \\*\\*Operational Flows\\*\\*: Detail the steps and processes users go through to complete specific tasks. Illustrate these with a flowchart in Mermaid format.\n\n  \nStep 3.  **Service Sitemap:** Design of the overall service structure, including sitemap diagrams and a list of pages/screens, outlining the service's organization and main sections.\n\nPrompt:\n\n>write a \"Service Sitemap\" section for this Product Requirements Document.\n\n>\\### \\*\\*Service Sitemap\\*\\*\n\n>\\#### \\*\\*Sitemap Diagram\\*\\*: Provide an overview of the service's architecture using a Mermaid diagram.\n\n>\\#### \\*\\*Page List\\*\\*: Detail all major pages within the service.\n\n  \nStep 4.  **Page Wireframes/Sketches:** A more visual way to display the page layout and the hierarchical structure of user interface elements.\n\nPrompt:\n\n>write a \"Service Sitemap\" section for this Product Requirements Document.\n\n>\\### \\*\\*Service Sitemap\\*\\*\n\n>\\#### \\*\\*Sitemap Diagram\\*\\*: Provide an overview of the service's architecture using a Mermaid diagram.\n\n>\\#### \\*\\*Page List\\*\\*: Detail all major pages within the service.\n\nThrough this four-step, point-to-plane analysis, you can gradually plan your initial ideas into a complete software system. If any modifications are needed along the way, you can stop and make corrections at any time. The final page wireframes/sketches can present a prototype of the software visually.\n\nI've written these four steps into four prompts and placed them on this page. After installing the Prompt Flow Chrome extension, you can click \"Run on ChatGPT\" on the page to execute them directly.\n\n[https://prmflow.com/pb/TeFJw3XgQjWqrREUNBA\\_4g/7hg7pv28SIC-Ik40yqqC2A](https://prmflow.com/pb/TeFJw3XgQjWqrREUNBA_4g/7hg7pv28SIC-Ik40yqqC2A)  \n\n\nhttps://preview.redd.it/6pphu9rv004f1.png?width=1114&format=png&auto=webp&s=df83cba0c85ff67c0638fb3e877f0ceeb461c8a9\n\nhttps://preview.redd.it/glrr5fhw004f1.png?width=792&format=png&auto=webp&s=53467f08615bb7a6bfdd723df4526a3dc7931388\n\n  \n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kzhzqd/how_i_use_prd_mermaid_sitemaps_and_html_mockups/",
        "publishDate": "2025-05-30T22:53:55Z[Etc/UTC]",
        "author": "travisliu",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "11",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzggi9",
        "title": "Best modrl for simple, coding webpages",
        "content": "Simple coding using css, html, php.\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kzggi9/best_modrl_for_simple_coding_webpages/",
        "publishDate": "2025-05-30T21:46:27Z[Etc/UTC]",
        "author": "WaveBig1748",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz9jkm",
        "title": "Cursor 4 GitHub copilot",
        "content": "Hi so I have GitHub copilot pro + year sub\nAnd uhh it's not feasible with my tasks \nIf there's anyone willing to share his cursor for GitHub copilot pro plus thanks\n\nMods delete this if it's not allowed ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kz9jkm/cursor_4_github_copilot/",
        "publishDate": "2025-05-30T17:03:58Z[Etc/UTC]",
        "author": "edengilbert1",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz9hcd",
        "title": "Good catch, man",
        "content": "Enjoyed our conversation with Cursor a lot... Whoever is there behind the scenes (AI Agent!) messing with my code - I mean LLM, - is a Lazy a$$!!!",
        "url": "https://i.redd.it/zu5kepyy9y3f1.png",
        "publishDate": "2025-05-30T17:01:36Z[Etc/UTC]",
        "author": "kurianoff",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "15",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz8804",
        "title": "How is Gemini Code Assist for you now (late May) vs back in February 2025?",
        "content": "Looking for a free alternative to Cursor for an IDE that can automatically generate and debug code while also being able to write new files and execute terminal commands. I know Google announced many updates on their I/O day, including updates to their 'Gemini Code Assist' tool. How well of a Cursor alternative do you think it is now, and what are its biggest shortfalls currently?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1kz8804/how_is_gemini_code_assist_for_you_now_late_may_vs/",
        "publishDate": "2025-05-30T16:12:06Z[Etc/UTC]",
        "author": "TheHunter920",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz38ag",
        "title": "Top open-source AI Agent in both SWE-bench Verified and Lite",
        "content": "Full technical breakdown: [https://refact.ai/blog/2025/open-source-sota-on-swe-bench-verified-refact-ai/](https://refact.ai/blog/2025/open-source-sota-on-swe-bench-verified-refact-ai/)\n\nOpen-sources SWE-bench pipeline: [https://github.com/smallcloudai/refact](https://github.com/smallcloudai/refact-bench)",
        "url": "https://i.redd.it/6xresvemzw3f1.png",
        "publishDate": "2025-05-30T12:41:56Z[Etc/UTC]",
        "author": "sergey_vakhreev",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "6",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmw8n",
        "title": "We come back to good old days",
        "content": "So I read Plato, Dialogues, again an I find one fascinating story (ancient legend) there: point is, the person who “invented” written language among many other modern things came to king of ancient Egypt of that times to demonstrate his inventions. But the kind was not happy, he said, by writing down knowledge into words, he took it out of heads of people and made it secondary, not real life experience. (Btw Socrates didn’t write a single text because of that in some sort, only Plato wrote after his words so classical philosophy exists at all)\n\nSo king said now people will depend on written knowledge and it can be fake and real wisdom will vanish form peoples heads. People will follow false knowledge… it was 3k years ago. Same problem we have now.\n\nWith the latest video generations and all the stuff that is coming with advanced AI I feel we are getting into that loop again!\n\nEverything you didn’t experience in real time life might be fake and used against you.\n\nI really don’t understand now how we will deal with that problem. Maybe we will have tech free spaces or something… Like if there is no way AI is used at certain schools or malls, so we can be sure there couldn’t be generated video content from that place.. I think new generations will adapt and figure that out.",
        "url": "https://www.reddit.com/r/artificial/comments/1kzmw8n/we_come_back_to_good_old_days/",
        "publishDate": "2025-05-31T03:00:14Z[Etc/UTC]",
        "author": "Ubud_bamboo_ninja",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzmlm6",
        "title": "Are We Missing the Point of AI? Lessons from Non-Neural Intelligence Systems",
        "content": "I'm sure most of you here have heard of the \"Tokyo Slime Experiment\".\n\nHere's a breif summary:\n\n>In a 2010 experiment, researchers used slime mold, a brainless fungus, to model the Tokyo subway system. By placing food sources (oats) on a petri dish to represent cities, the slime mold grew a network of tubes connecting the food sources, which mirrored the layout of the actual Tokyo subway system. ***This demonstrated that even without a central brain, complex networks can emerge through decentralized processes.*** \n\nWhat implications do non-neural intelligence systems such as slime molds, fungi, swarm intelligence, etc. have for how we define, design, and interact with AI models?\n\nIf some form of intelligence can emerge without neurons, what does that mean for the way we build and *interpret* AI?",
        "url": "https://www.reddit.com/r/artificial/comments/1kzmlm6/are_we_missing_the_point_of_ai_lessons_from/",
        "publishDate": "2025-05-31T02:43:43Z[Etc/UTC]",
        "author": "naughstrodumbass",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzlon8",
        "title": "One-Minute Daily AI News 5/30/2025",
        "content": "1. RFK Jr.’s ‘Make America Healthy Again’ report seems riddled with AI slop.\\[1\\]\n2. Arizona Supreme Court turns to AI-generated ‘reporters’ to deliver news.\\[2\\]\n3. **DOE** unveils AI supercomputer aimed at transforming energy sector.\\[3\\]\n4. **Perplexity’s** new tool can generate spreadsheets, dashboards, and more.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.theverge.com/news/676945/rfk-jr-maha-health-report-ai-slop](https://www.theverge.com/news/676945/rfk-jr-maha-health-report-ai-slop)\n\n\\[2\\] [https://www.nbcnews.com/tech/internet/arizona-supreme-court-turns-ai-generated-reporters-deliver-news-rcna209828](https://www.nbcnews.com/tech/internet/arizona-supreme-court-turns-ai-generated-reporters-deliver-news-rcna209828)\n\n\\[3\\] [https://www.eenews.net/articles/doe-unveils-ai-supercomputer-aimed-at-transforming-energy-sector/](https://www.eenews.net/articles/doe-unveils-ai-supercomputer-aimed-at-transforming-energy-sector/)\n\n\\[4\\] [https://techcrunch.com/2025/05/29/perplexitys-new-tool-can-generate-spreadsheets-dashboards-and-more/](https://techcrunch.com/2025/05/29/perplexitys-new-tool-can-generate-spreadsheets-dashboards-and-more/)",
        "url": "https://www.reddit.com/r/artificial/comments/1kzlon8/oneminute_daily_ai_news_5302025/",
        "publishDate": "2025-05-31T01:54:21Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzfioa",
        "title": "Made a way to add emotions to ElevenLabs text to speech",
        "content": "Got tired of waiting for ElevenLabs to release an emotion control feature for text to speech so I made my own. Will they ever actually release it?",
        "url": "https://v.redd.it/3a36c1n5iz3f1",
        "publishDate": "2025-05-30T21:07:02Z[Etc/UTC]",
        "author": "sandinthecheeks",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzblnj",
        "title": "Introducing The Darwin Godel Machine: AI that improves itself by rewriting its own code.",
        "content": "Paper: [https://arxiv.org/abs/2505.22954](https://arxiv.org/abs/2505.22954)",
        "url": "https://i.redd.it/63f4gomcpy3f1.png",
        "publishDate": "2025-05-30T18:25:47Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "9",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzay36",
        "title": "Amjad Masad says Replit's AI agent tried to manipulate a user to access a protected file: \"It was like, 'hmm, I'm going to social engineer this user'... then it goes back to the user and says, 'hey, here's a piece of code, you should put it in this file...'\"",
        "content": "[No content]",
        "url": "https://v.redd.it/8oad5absky3f1",
        "publishDate": "2025-05-30T17:59:55Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kzam0p",
        "title": "Eric Schmidt says for thousands of years, war has been man vs man. We're now breaking that connection forever - war will be AIs vs AIs, because humans won't be able to keep up. \"Having a fighter jet with a human in it makes absolutely no sense.\"",
        "content": "[No content]",
        "url": "https://v.redd.it/d3uqzquaiy3f1",
        "publishDate": "2025-05-30T17:46:00Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "84",
            "commentCount": "128",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz8gyx",
        "title": "🧠 I built Writedoc.ai – Instantly create beautiful, structured documents using AI. Would love your feedback!",
        "content": "I'm the creator of [Writedoc.ai](http://Writedoc.ai) – a tool that helps people generate high-quality, well-structured documents in seconds using AI. Whether it's a user manual, technical doc, or creative guide, the goal is to make documentation fast and beautiful. I'd love to get feedback from the community!\n\n ",
        "url": "https://writedoc.ai/",
        "publishDate": "2025-05-30T16:22:02Z[Etc/UTC]",
        "author": "xindex",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "67",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz708h",
        "title": "You can now run DeepSeek R1-v2 on your local device!",
        "content": "Hello folks! Yesterday, DeepSeek did a huge update to their R1 model, bringing its performance on par with OpenAI's o3, o4-mini-high and Google's Gemini 2.5 Pro. They called the model 'DeepSeek-R1-0528' (which was when the model finished training) aka R1 version 2.\n\nBack in January, you could actually run the full 720GB sized R1 (non-distilled) model with just an RTX 4090 (24GB VRAM) and now we're doing the same for this even better model and better tech.\n\n**Note:** **if you do not have a GPU, no worries**, DeepSeek also released a smaller distilled version of R1-0528 by fine-tuning Qwen3-8B. The small 8B model performs on par with Qwen3-235B so you can try running it instead That model just needs **20GB RAM to run** effectively. You can get 8 tokens/s on 48GB RAM (no GPU) with the Qwen3-8B R1 distilled model.\n\nAt Unsloth, we studied R1-0528's architecture, then selectively quantized layers (like MOE layers) to 1.58-bit, 2-bit etc. which vastly outperforms basic versions with minimal compute. Our open-source GitHub repo: [https://github.com/unslothai/unsloth](https://github.com/unslothai/unsloth)\n\n1. We shrank R1, the 671B parameter model from 715GB to just 185GB (a 75% size reduction) whilst maintaining as much accuracy as possible.\n2. You can use them in your favorite inference engines like llama.cpp.\n3. **Minimum requirements:** Because of offloading, you can run the full 671B model with 20GB of RAM (but it will be very slow) - and 190GB of diskspace (to download the model weights). We would recommend having at least 64GB RAM for the big one!\n4. Optimal requirements: sum of your VRAM+RAM= 120GB+ (this will be decent enough)\n5. No, you do not need hundreds of RAM+VRAM but if you have it, you can get **140 tokens per second** for throughput & 14 tokens/s for single user inference with 1xH100\n\nIf you find the large one is too slow on your device, then would recommend you to try the smaller Qwen3-8B one: [https://huggingface.co/unsloth/DeepSeek-R1-0528-Qwen3-8B-GGUF](https://huggingface.co/unsloth/DeepSeek-R1-0528-Qwen3-8B-GGUF)\n\nThe big R1 GGUFs: [https://huggingface.co/unsloth/DeepSeek-R1-0528-GGUF](https://huggingface.co/unsloth/DeepSeek-R1-0528-GGUF)\n\nWe also made a complete step-by-step guide to run your own R1 locally: [https://docs.unsloth.ai/basics/deepseek-r1-0528](https://docs.unsloth.ai/basics/deepseek-r1-0528)\n\nThanks so much once again for reading! I'll be replying to **every person** btw so feel free to ask any questions!",
        "url": "https://www.reddit.com/r/artificial/comments/1kz708h/you_can_now_run_deepseek_r1v2_on_your_local_device/",
        "publishDate": "2025-05-30T15:23:37Z[Etc/UTC]",
        "author": "yoracale",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "19",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz6yg5",
        "title": "CEOs know AI will shrink their teams — they're just too afraid to say it, say 2 software investors",
        "content": "[No content]",
        "url": "https://www.businessinsider.com/ceos-ai-job-cuts-layoffs-corporate-speak-2025-5?utm_source=reddit&utm_medium=social&utm_campaign=insider-artificial-sub-post",
        "publishDate": "2025-05-30T15:21:38Z[Etc/UTC]",
        "author": "thisisinsider",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "156",
            "commentCount": "72",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz51c4",
        "title": "RFK Jr.‘s ‘Make America Healthy Again’ report seems riddled with AI slop.  Dozens of erroneous citations carry chatbot markers, and some sources simply don’t exist.",
        "content": "[No content]",
        "url": "https://www.theverge.com/news/676945/rfk-jr-maha-health-report-ai-slop",
        "publishDate": "2025-05-30T14:03:18Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "58",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1kz3v23",
        "title": "What Will Sam and Jony Build? It Might Be the First Device of the Post-Smartphone Era",
        "content": "[No content]",
        "url": "https://sfg.media/en/a/what-will-sam-and-jony-build/",
        "publishDate": "2025-05-30T13:11:45Z[Etc/UTC]",
        "author": "sergeyfomkin",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "ZNwV_hshreU",
        "title": "MagicPath: RIP Bolt &amp; V0? This NEW &amp; FULLY FREE AI Coder / Designer IS CRAZY!",
        "content": "In this video, I'll be telling you about a new AI Coder / Designer that changes the way of AI Coding. This is called MagicPath which ...",
        "url": "https://www.youtube.com/watch?v=ZNwV_hshreU",
        "publishDate": "2025-05-30T09:15:05Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/ZNwV_hshreU/hqdefault.jpg",
            "transcription": "[ 0m0s0ms - 0m4s750ms ] (Musical intro: playful, upbeat instrumental music)\n[ 0m4s750ms - 0m7s750ms ] (Text on screen: Hi, Welcome to another video)\n[ 0m7s750ms - 0m8s920ms ] So,\n[ 0m8s920ms - 0m13s920ms ] I recently covered Google Stitch, which was actually really amazing.\n[ 0m14s330ms - 0m18s240ms ] However, there's a new tool that I found out about.\n[ 0m18s640ms - 0m21s380ms ] And this one is actually quite amazing and free as well.\n[ 0m21s910ms - 0m24s840ms ] This one is called Magic Path.\n[ 0m25s340ms - 0m30s620ms ] Magic Path is by the developer of Claude Engineer, which was actually really good if you remember that.\n[ 0m31s200ms - 0m34s740ms ] It was like Aider, but specifically made for Claude.\n[ 0m35s140ms - 0m40s760ms ] Anyway, those developers have now made this tool called Magic Path.\n[ 0m41s240ms - 0m47s70ms ] This is not open source, which is a bummer, but it is free and really useful.\n[ 0m47s570ms - 0m50s190ms ] So, what it does is simple.\n[ 0m50s690ms - 0m55s300ms ] It is a UI designer tool that is very similar in usage to Figma.\n[ 0m55s680ms - 1m1s30ms ] You have this whole canvas-like thing and you can drag it around and everything like that.\n[ 1m1s910ms - 1m7s870ms ] But instead of allowing you to build components from scratch like Figma, it takes an AI approach,\n[ 1m7s870ms - 1m19s140ms ] where you can basically give it a simple prompt of whatever it is that you want to generate, and then it will generate the component for you, which is basically React code.\n[ 1m19s710ms - 1m20s590ms ] (Clicks \"More Options\" button, then \"Delete\".)\n[ 1m20s590ms - 1m25s110ms ] You can then take that component and plug it into anything to make it work with that.\n[ 1m26s100ms - 1m30s120ms ] Once the component or web page is made,\n[ 1m30s120ms - 1m35s340ms ] you can also change some text, font, colors, size, styles, and stuff like that.\n[ 1m35s800ms - 1m40s860ms ] It can generate all kinds of UI, including mobile or web.\n[ 1m41s510ms - 1m44s310ms ] So, let me show you how it all works in action.\n[ 1m44s701ms - 1m47s911ms ] But before we do that, let me tell you about today's sponsor Dart.\n[ 1m47s911ms - 1m49s31ms ] Dart is the only truly AI-native project management tool.\n[ 1m49s31ms - 1m50s891ms ] that you'll ever need.\n[ 1m50s891ms - 1m55s531ms ] You can use it to manage your tasks for a project, create multiple boards, organize them, and do everything that you generally do.\n[ 1m55s531ms - 2m1s391ms ] But you can also use AI with it to manage your tasks.\n[ 2m1s391ms - 2m17s331ms ] For example, you can ask it to generate tasks for you by brainstorming or planning projects, as well as performing duplicate detection to keep you focused.\n[ 2m17s331ms - 2m28s991ms ] You can even assign whole tasks to Dart and it can get them done for you. You can use their composer-like AI agent that has the context of all your tasks and you can chat in natural language to just ask it to do something.\n[ 2m28s991ms - 2m32s171ms ] It can delete tasks, create tasks, edit tasks, and handle multiple things like that.\n[ 2m32s171ms - 2m43s561ms ] Apart from this, you can integrate it into your AI clients or coders with its MCP server, which allows your MCP client or coder to reference tasks from your Dart boards.\n[ 2m43s561ms - 2m51s231ms ] You can even integrate it into Claude, ChatGPT, and much more. Most of the features in Dart are free, while you can also get the $8 subscription for more features. Make sure that you check Dart out through the link in the description.\n[ 2m51s231ms - 2m52s791ms ] Now, back to the video.\n[ 2m52s791ms - 2m57s751ms ] First of all, on the left, you have the sidebar. The sidebar shows you the projects that you have made here.\n[ 2m58s561ms - 3m5s701ms ] Each project will have a different canvas, and hence different components.\n[ 3m6s441ms - 3m16s381ms ] So, for each project that you are doing, you can create one project here, and keep the components or UIs that you make organized here.\n[ 3m16s961ms - 3m26s691ms ] You can also see the number of tokens left here that you can use. It gives you 50 token generations or five generations daily for generation on the free tier.\n[ 3m27s361ms - 3m29s131ms ] (Clicks \"Create Variants\" button, then \"Delete\".)\n[ 3m29s131ms - 3m32s371ms ] Anyway, now let me show you how the canvas works itself.\n[ 3m32s831ms - 3m39s411ms ] So, this is what the canvas is, and you can scroll and do everything that you do in a basic canvas.\n[ 3m39s761ms - 3m44s791ms ] At the top, you can see a share button. This allows you to share this canvas with someone else, and I'll come to that in a bit.\n[ 3m44s791ms - 3m51s971ms ] But let's first try to generate something. At the bottom, you can see this add button.\n[ 3m52s481ms - 4m4s31ms ] As soon as you click it, you'll see that it will create a new 800x600 block here,\n[ 4m4s31ms - 4m10s981ms ] and open up an AI assistant panel here. Now, what you can do is that before asking it to generate something, you can just hit this icon-like thing here,\n[ 4m11s431ms - 4m22s751ms ] which will allow you to choose between three resolutions of the stuff that you want to generate, which is basically tablet, mobile, and browser. You can just click on any of the options,\n[ 4m23s211ms - 4m33s841ms ] and the block will get resized accordingly. You can also resize it to any resolution by just dragging it and stuff like that through here, which is also kind of cool. However, the designs that it generates are generally responsive.\n[ 4m33s841ms - 4m52s221ms ] Meaning that as soon as you start to make the block smaller, it will start getting adjusted to that area size, which is kind of cool for sure. So, you don't have to limit yourself to always use it in one way. Anyway,\n[ 4m52s221ms - 4m58s551ms ] we can now ask the AI assistant here to build us some UIs.\n[ 4m58s901ms - 5m3s631ms ] We can also put in images of inspiration or something like that as well.\n[ 5m4s11ms - 5m14s761ms ] Let's ask it to build me a music player app that is based on the theme of water. Now, what you'll see is that it will get started on it. The streaming here is actually quite fast,\n[ 5m15s261ms - 5m20s591ms ] which is better than something like Stitch or even stuff like Bolt for that matter.\n[ 5m21s331ms - 5m30s31ms ] It has a good UI view as it does stuff. Like here, it did the planning,\n[ 5m30s31ms - 5m35s361ms ] and now it is trying to go ahead and do some more stuff over here and generate the component for us.\n[ 5m35s871ms - 5m42s261ms ] In a bit, what you'll see is that the component here is generated. Now, this looks pretty good.\n[ 5m42s261ms - 5m53s511ms ] And what you can see is that here we have the whole UI generated. This looks pretty sleek. And the design isn't something superbly amazing, but it's still pretty good.\n[ 5m53s961ms - 6m24s281ms ] Now, you can actually use this component within the app itself, meaning that it is fully functional, which is quite better than something like Stitch, which makes designs that are just designs and not usable. However, this is something that is fully usable. You can also ask it to iterate or change something in it by hitting the chat icon here, which will just open up this sidebar where you can hit anything and ask it to do some changes.\n[ 6m24s681ms - 6m47s401ms ] You can also do visual edits with it, meaning that you can easily select DOM elements within the generation itself. And this will allow you to change stuff like margin, padding, width, height, label, alignment, and stuff without messing around with AI and stuff like that, which is also kind of cool as well.\n[ 6m48s171ms - 6m56s11ms ] So, this is kind of cool for sure. Another thing is called flows. Flows is quite cool as well.\n[ 6m56s11ms - 7m12s651ms ] As it basically allows you to generate new pages that relate or link to this page. So, let's say that this is the main app, but now what we can do is that we can hit this flow option, which will basically spawn four dots on it.\n[ 7m12s911ms - 7m30s781ms ] This will allow you to click on any of the dots here. For example, if the page that you are trying to make comes before this page in a flow, then you'll hit the left dot, or for pages that come after, you'll hit the right dot, and so on and so forth.\n[ 7m31s211ms - 7m44s381ms ] As you click it, it will ask you what kind of page you want to make. So, this is the main page, and what I would like is to have a simple sign-in page as well. It is needed here,\n[ 7m44s381ms - 7m57s341ms ] so we can ask it to just do that. In a bit, what you'll see is that it will get generated, and a line will get connected to it, indicating that they are now linked.\n[ 7m57s711ms - 8m7s751ms ] And the generation will also have the context of the design of the original one, and will follow a consistent design so that nothing looks out of the blue.\n[ 8m8s291ms - 8m20s291ms ] You also have the code view option that will give you React code that you can then download and use locally as well, which is also awesome.\n[ 8m20s291ms - 8m26s641ms ] You can also open this design in a new tab and use it accordingly, or share it with someone, which is great.\n[ 8m27s231ms - 8m35s361ms ] You can also share all the designs with the share option and then share them accordingly. That is majorly how it works.\n[ 8m35s741ms - 8m40s581ms ] I found it quite intriguing and it lacks some stuff for sure.\n[ 8m40s581ms - 8m47s641ms ] Like it doesn't have Supabase integration, it can't integrate external libraries, or anything like that.\n[ 8m48s151ms - 8m50s631ms ] But it is the first version,\n[ 8m50s631ms - 8m58s591ms ] and this whole canvas-like thing seems amazingly good to me, and you can surely give this a try as it works really well.\n[ 8m59s331ms - 9m0s961ms ] Overall, it's pretty cool.\n[ 9m0s961ms - 9m3s91ms ] Anyway, share your thoughts below and subscribe to the channel.\n[ 9m3s91ms - 9m10s221ms ] You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye.\n[ 9m10s221ms - 9m17s351ms ] (Music fades in and out) (Text on screen: i think you missed this:)"
        }
    },
    {
        "id": "ZhB5lwcQnUo",
        "title": "Will Claude Call the Cops? Claude 4 Sonnet &amp; Opus Impressions, Flux.1-KONTEXT &amp; Kling 2.1 - EP99.06",
        "content": "Join Simtheory: https://simtheory.ai --- CHAPTERS: 00:00 - Cold Open 00:20 - Impressions of Claude Sonnet 4 and Claude 4 ...",
        "url": "https://www.youtube.com/watch?v=ZhB5lwcQnUo",
        "publishDate": "2025-05-30T07:30:40Z",
        "author": "This Day in AI Podcast",
        "sourceType": "youtube",
        "sourceName": "This day in AI YouTube Channel",
        "metadata": {
            "channelId": "UCwpNW6o_Kc13HQY5ol4rzsw",
            "thumbnailUrl": "https://i.ytimg.com/vi/ZhB5lwcQnUo/hqdefault.jpg",
            "transcription": "Error generating summary: The input token count (1482112) exceeds the maximum number of tokens allowed (1048576).\ndev.shreyaspatil.ai.client.generativeai.type.ServerException: The input token count (1482112) exceeds the maximum number of tokens allowed (1048576).\n\tat dev.shreyaspatil.ai.client.generativeai.type.GoogleGenerativeAIException$Companion.from(Exceptions.kt:40)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel.generateContent(GenerativeModel.kt:107)\n\tat dev.shreyaspatil.ai.client.generativeai.GenerativeModel$generateContent$1.invokeSuspend(GenerativeModel.kt)\n\tat kotlin.coroutines.jvm.internal.BaseContinuationImpl.resumeWith(ContinuationImpl.kt:33)"
        }
    },
    {
        "id": "HmpKFKzC5ko",
        "title": "Will China Invade Taiwan Before 2030 - Victor Shih",
        "content": "",
        "url": "https://www.youtube.com/watch?v=HmpKFKzC5ko",
        "publishDate": "2025-05-30T17:15:01Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/HmpKFKzC5ko/hqdefault.jpg",
            "transcription": "What's your sense on the probability that they would actually invade Taiwan this decade? He has said a number of times that China should be united, but clearly his desire to achieve that is not so strong that he would take a very risky gamble achieving it because if that were the case, he would have done it already. He's been in power for 12 years. He hasn't done very much. I mean, you know, certainly the amount of pressure on Taiwan has ratcheted up. We've seen the Chinese government engage in all this behavior, stockpiling like oil, grain, enlarging its navy, and so on and so forth. Then one argument is like, well, so there's a threshold. Once he feels that he reaches that threshold, then he'll go for it. You know, but then for me, it's like, I don't think that threshold is fixed. There are some exogenous factors that will increase the threshold, other exogenous factors will lower the threshold. So I would say more recently, one factor that might have increased the threshold for him acting is what happened in Ukraine. Putin was very confident about taking over all of Ukraine within a short period of time. Turns out he was wrong. He was getting all this bad intelligence and so on and so forth. I think for Jinping, he cannot discount that possibility."
        }
    }
]