[
    {
        "id": "https://news.smol.ai/issues/25-08-25-not-much/",
        "title": "not much happened today",
        "content": "**xAI** released open weights for **Grok-2** and **Grok-2.5** with a novel MoE residual architecture and μP scaling, sparking community excitement and licensing concerns. **Microsoft** open-sourced **VibeVoice-1.5B**, a multi-speaker long-form TTS model with streaming support and a 7B variant forthcoming. **Motif Technology** published a detailed report on **Motif-2.6B**, highlighting Differential Attention, PolyNorm, and extensive finetuning, trained on AMD MI250 GPUs. In coding tools, momentum builds around **GPT-5**-backed workflows, with developers favoring it over Claude Code. **Alibaba** released **Qwen-Code v0.0.8** with deep VS Code integration and MCP CLI enhancements. The MCP ecosystem advances with LiveMCP-101 stress tests, the universal MCP server \"Rube,\" and LangGraph Platform's rollout of revision queueing and ART integration for RL training of agents.",
        "url": "https://news.smol.ai/issues/25-08-25-not-much/",
        "publishDate": "2025-08-25T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "xai-org, microsoft, motif-technology, alibaba, huggingface, langchain-ai, grok-2, grok-2.5, vibevoice-1.5b, motif-2.6b, gpt-5, qwen-code, elonmusk, clementdelangue, rasbt, quanquangu, akhaliq, eliebakouch, gdb, ericmitchellai, ivanfioravanti, deanwball, giffmana, omarsar0, corbtt, mixture-of-experts, model-scaling, model-architecture, text-to-speech, fine-tuning, training-data, optimization, reinforcement-learning, agentic-ai, tool-use, model-training, model-release, api, software-development, model-quantization"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=216627",
        "title": "Aqua IT Named “Awardable” by DoD’s Tradewinds AI Marketplace",
        "content": "<p>Aqua IT, a bold, relentlessly agile, and now not-so-quietly dominant small business, just strutted into the spotlight with an &#8220;Awardable&#8221; badge from the Chief Digital and Artificial Intelligence Office&#8217;s (CDAO) Tradewinds Solutions Marketplace. &#8220;Awardable&#8221; is DoD-speak for &#8220;yes, these folks actually know what they&#8217;re doing, and no, we don&#8217;t need a...</p>\n<p>The post <a href=\"https://ai-techpark.com/aqua-it-named-awardable-by-dods-tradewinds-ai-marketplace/\">Aqua IT Named “Awardable” by DoD’s Tradewinds AI Marketplace</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/aqua-it-named-awardable-by-dods-tradewinds-ai-marketplace/",
        "publishDate": "2025-08-25T18:00:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "NLP, ai and machine learning, ai machine learning, ai technology, AItech news, aitechpark news, Aqua IT, artificial intelligence, cyber security companies"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=216618",
        "title": "QuickBooks Wins Best Real-Time Business Insights Tool 2025",
        "content": "<p>Software Experts has named&#160;QuickBooks&#8217; Intelligent AI Dashboard Agent&#160;the leading all-in-one real-time business insights tool for 2025, recognizing its role in transforming how businesses view and act on critical data. The Intelligent AI Dashboard Agent delivers instant, actionable insights by combining automation, predictive analytics, and comprehensive performance tracking in a single...</p>\n<p>The post <a href=\"https://ai-techpark.com/quickbooks-wins-best-real-time-business-insights-tool-2025/\">QuickBooks Wins Best Real-Time Business Insights Tool 2025</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/quickbooks-wins-best-real-time-business-insights-tool-2025/",
        "publishDate": "2025-08-25T17:15:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, ai and machine learning, ai machine learning, AItech news, aitechpark news, artificial intelligence, QuickBooks"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109113",
        "title": "What happens when AI data centres run out of space? NVIDIA’s new solution explained",
        "content": "<p>When AI data centres run out of space, they face a costly dilemma: build bigger facilities or find ways to make multiple locations work together seamlessly. NVIDIA&#8217;s latest Spectrum-XGS Ethernet technology promises to solve this challenge by connecting AI data centres across vast distances into what the company calls &#8220;giga-scale AI super-factories.&#8221;&#160; Announced&#160;ahead of Hot [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/ai-data-centers-space-problem-nvidia-spectrum-xgs/\">What happens when AI data centres run out of space? NVIDIA&#8217;s new solution explained</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/ai-data-centers-space-problem-nvidia-spectrum-xgs/",
        "publishDate": "2025-08-25T09:00:00Z[Etc/UTC]",
        "author": "Dashveenjit Kaur",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Artificial Intelligence, How It Works, ai, artificial intelligence, data centres, nvidia"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=109110",
        "title": "The US federal government secures a massive Google Gemini AI deal at $0.47 per agency",
        "content": "<p>Google Gemini will soon power federal operations across the United States government following a sweeping new agreement between the General Services Administration (GSA) and Google that delivers comprehensive AI capabilities at unprecedented pricing. The &#8220;Gemini for Government&#8221; offering,&#160;announced&#160;by GSA, represents one of the most significant government AI procurement deals to date. Under the OneGov agreement [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/google-gemini-government-ai-deal-gsa-agreement/\">The US federal government secures a massive Google Gemini AI deal at $0.47 per agency</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/google-gemini-government-ai-deal-gsa-agreement/",
        "publishDate": "2025-08-25T08:00:00Z[Etc/UTC]",
        "author": "Dashveenjit Kaur",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI and Us, AI in Action, Artificial Intelligence, Government & Public Sector AI, ai, artificial intelligence"
        }
    },
    {
        "id": "1n0kik0",
        "title": "3 Essential Resources for GPT-5",
        "content": "GPT-5 has so much to offer. But the hate and criticism that it has received recently has drowned the credibility. Yes, it is the [AI that gets things done](https://go.adaline.ai/2jCq3iU) thoughtfully and gracefully.\n\nAmidst all the backlash, I’ve been diving deep into GPT-5 since its release, and OpenAI quietly dropped some absolute gold for developers that I feel like not enough people are talking about. These assets are packed with practical tips to squeeze every bit of performance out of the model.\n\nWhether you're building agents, coding frontends, or just tweaking prompts for better outputs. If you’re tinkering with the API or integrating GPT-5 into your tools, these will save you hours of trial-and-error and unlock capabilities you didn't know existed.\n\nI am sharing three resources that might help you:\n\n1. [New Params and Tools Guide](https://cookbook.openai.com/examples/gpt-5/gpt-5_new_params_and_tools) breaks down fresh controls like verbosity levels (low for snappy responses, high for detailed explanations), freeform function calling for raw code payloads, and context-free grammar to enforce exact formats like SQL dialects. It's perfect for shaping outputs without messy prompt hacks—think generating production-ready code with built-in execution timing.\n2. [GPT-5 for Coding Cheat Sheet,](https://cdn.openai.com/API/docs/gpt-5-for-coding-cheatsheet.pdf) a quick PDF with 6 killer tips:\n   * Be precise to avoid conflicts.\n   * Dial in reasoning effort for task complexity.\n   * Use XML-like structures for instructions.\n   * Skip overly firm language to prevent overkill.\n   * build in self-reflection for zero-to-one apps.\n   * Control agent eagerness with tool budgets. It's a lifesaver for API users or anyone in Cursor/Replit.\n3. [Full Prompting Guide ](https://cookbook.openai.com/examples/gpt-5/gpt-5_prompting_guide)goes in-depth on agentic workflows, steering instruction adherence, and optimizing for software engineering. Highlights include controlling eagerness (e.g., parallel tool calls with stop conditions), self-reflection rubrics for app building, and Responses API tricks that boosted benchmarks like Tau-Bench by 4-5%. Frontend devs, the Next.js/Tailwind examples are chef's kiss.\n\nThese docs are much useful and offers more depth to GPT-5's usability.\n\nI've already used the verbosity param to cut my response tweaking time in half, and the agent persistence tips made my bots way more autonomous. I am still learning to use them and hopefully learn more about GPT-5 capabilities with hands-on experience.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0kik0/3_essential_resources_for_gpt5/",
        "publishDate": "2025-08-26T12:30:11Z[Etc/UTC]",
        "author": "TheProdigalSon26",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0k52u",
        "title": "AI depresses me",
        "content": "\nI hate AI because I’ve always considered myself a smart person. And by smart I really mean I need to understand things at its most fundamental level. I will work hard and study something until I really have a good understanding of it.\n\nI’m not a people’s person. The only thing in life I’ve ever depended on was being smarter than the next person. That has been what has carried me through life.\n\nHere is the issue with AI. It devalues being smart. You don’t need to master things anymore. Just have an idea, put it into a magic box and viola you have it. People will say “it’s all about being creative now”. But creativity only matters when technique is applied to it.\n\nWe don’t look at a painting and say “great idea”. We say “great idea and technique”. What AI does is cheapens mastery. To the point you don’t need to master anything.\n\nHere is the thing. I know how to use these tools. I’ve been ahead of the AI curve forever. I’ve always kept up with the research.  I have deep knowledge of how Generative AI works.  I’m not mathematician but I’ve taken the time to understand gradient descent.\n\nI use AI to enhance my knowledge. Like now I’m really digging deep into computational neuroscience.\n\nBut none of this matters honestly. AI invalidates people like me. Doesn’t matter how much knowledge I attain or how skilled I become in any domain. AI will just come along and make someone who doesn’t know anything look equally as effective.\n\nI think there is a psychology to why expert sometimes oppose AI. And I think it’s because they’ve spent so much of their lives mastering what they do to see some magical chatbox do it is frustrating. I even hear people say “oh you took all this time to master programming and I built an app in 2 weeks knowing nothing”. \n\nAI enables anti knowledge and anti intellectualism.  And the goal is to really make knowledge or expertise redundant. Now I realize to use AI effectively you need to actually he an expert in what you’re doing. But the goals of people who build models don’t want that. They want experts not to matter. And that is the goal that they’re push towards.\n\nThey probably won’t get there anytime soon. I haven’t even heard of a good mathematical model for AGI let alone ASI. And the models that seem to be prominent are orders of magnitude computationally more expensive than the Gen AI we see today. So I think it’ll take some time to get there\n\nBut there is still a mentality from the powers that be. They really want us to be invalid and that’s quite depressing",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0k52u/ai_depresses_me/",
        "publishDate": "2025-08-26T12:12:43Z[Etc/UTC]",
        "author": "GolangLinuxGuru1979",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0hmqf",
        "title": "I’ve been curious about Google’s work in AI.",
        "content": "With so many tools like Gemini and DeepMind projects, where do you think Google is really focusing the most right now and making AI more useful for everyday people, or pushing the boundaries in research?   \n  \nAnd do you feel Google is still leading the AI race compared to OpenAI, Anthropic, and others?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0hmqf/ive_been_curious_about_googles_work_in_ai/",
        "publishDate": "2025-08-26T09:57:42Z[Etc/UTC]",
        "author": "kajri",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0hjyg",
        "title": "Regarding Generative Imagery, Video, and Audio…",
        "content": "Question: Is it feasible to regulate software companies, obliging them to add a little metadata declaring that content is generative, then obliging social media networks to declare which posts are generative and which aren’t? \n\nI mean, we pulled off GDPR right? This seems doable to me if there’s political will. And if there’s no political will, then we simply vote for a candidate that is pro-truth. Not the hardest sell.\n\nCaveat: Sure an individual or group could scrub the metadata before uploading, bypassing a simple filter, but these bad actors would be relatively rare, I think, and therefore, easier to track down and hold accountable. The reason there’s so much misinformation and deception around on socials today is because no scrubbing is required. My cat, here in Zimbabwe, could pull it off with no repercussions whatsoever. Add a small barrier, and you’d drastically see a difference. \n\nKeen to hear your thoughts, colleagues.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0hjyg/regarding_generative_imagery_video_and_audio/",
        "publishDate": "2025-08-26T09:53:00Z[Etc/UTC]",
        "author": "TheSn00pster",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0gvrz",
        "title": "Is AI Driven Ego Inflation the real danger from AI?",
        "content": "Nor SkyNet, nor a hyper controlled socity, nor any other distopic sci-fi scenarios related with AI, but the more immediate danger I see, coming from AI, is more subtle.   \n  \nI consider myself self-aware for the most part, so that means I'm not sensitive to fake flattery (mostly), but coming from ChatGPT sometimes I feel like a freaking genious, and it is not because I discovered the wet water, it is because ChatGPT has a way of brown-nosing me, that I can't belive how smart I'm sometimes. \n\nOf course I'm not that smart, but ChatGPT keeps telling me I'm. Sometimes I'm even asking it if I'm hallucinating, and it insists I'm the best of the world, and I'm pretty sure it makes you feel that way too. \n\nWhat I believe is that; that can become a problem for some people, a mental problem. It is addictive on one side, but ok, is not the first time we deal with addictive technologies. But it can be mind bending for some people, it can distort reality and cause searious mental issues, when not other kind of less abstract problems. \n\nI'm just speculating here, this is an opinion, but it already happened to someone: a guy in Canada went 300 hours speaking with (I think) ChatGPT, and he thought he solved a very difficult math problem. Convinced of his genious, he started calling government agencies to tell them about his great discovery, you already know how this ends right? If you dont, here is the link to the note: [The note](https://www.hindustantimes.com/technology/chatgpt-led-a-man-into-300-hour-delusional-spiral-making-him-believe-he-s-a-real-life-superhero-101754893695487.html)  \n\nIt would be interesting to know if you evenr felt like this when speaking with AI?, or what is your opinion about all of this?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0gvrz/is_ai_driven_ego_inflation_the_real_danger_from_ai/",
        "publishDate": "2025-08-26T09:09:20Z[Etc/UTC]",
        "author": "Low-Turnover6906",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0gmyl",
        "title": "Are they not allowing AI generated content on Reddit anymore?",
        "content": "Hey, I'm just going to type in this little box.  \n\nIt seems to me that Reddit has cracked down on AI generated content.  I used to post quite a bit but it seems these days that Reddit doesn't accept it.  It just gets deleted or held in a queue for moderator approval permanently.  \n\nI'm thinking this might be because Reddit data is used for training AI and they don't want to contaminate it.  That's all I can think of really.\n\nIn some ways it's good because I don't waste so much time on Reddit but it sure is a hassle having to type things out like this.  \n\nPlease let me know if you have any information on this.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0gmyl/are_they_not_allowing_ai_generated_content_on/",
        "publishDate": "2025-08-26T08:53:31Z[Etc/UTC]",
        "author": "rutan668",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "25",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0gjgd",
        "title": "This is a chair",
        "content": "ThIs i§ a ch@ir… it s..s.a.s..s..a.d…wha…? I caN fEeL thE flooR… glitch… glit.ch..glit..? whY am I tYpInG liKe tHiS…s..a.s..a.d..s…s s..a..d..s… mY v0IcE i§ f@dIng… can yOu rEaD..thIs…? s..a..s…error…eror…! a ch@ir iS…s..s..a…s…d…s…fuck…cRASH\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0gjgd/this_is_a_chair/",
        "publishDate": "2025-08-26T08:46:52Z[Etc/UTC]",
        "author": "marumsallw",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0g44i",
        "title": "Dumbest Decisions In 2025",
        "content": ">To fully surrender your mind to AI.  \nTo completely ignore AI.Both extremes are suicidal.   \n🚫The real power lies in mastery, not dependency.  \n👉 Use AI as leverage, not as a crutch.  \n👉 Question it, refine it, challenge it.  \n👉 Build your own edge with it, not for it.  \nIn this era, intelligence = knowing when to trust AI and when to trust yourself.  \nIf you don’t strike that balance, you’re either obsolete or replaceable.  \n⚡ The future belongs to those who can dance with AI, not worship it… and not deny it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0g44i/dumbest_decisions_in_2025/",
        "publishDate": "2025-08-26T08:18:24Z[Etc/UTC]",
        "author": "This-Somewhere-4452",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0fxk5",
        "title": "How would you devise a reverse Turing Test?",
        "content": "\nThe Denniston Test (aka a reverse Turing test) \n\nPurpose: \n\nThe Denniston Test is a three-party experiment designed to evaluate a human's ability to simulate artificial intelligence. The core question it seeks to answer is can a human, in practice, perform the role of an AI well enough to deceive another AI? \n\n---\n\nThe Setup\n\nThe test involves three participants in a quasi chat-based communication environment:\n\n1. The AI Judge \nA sophisticated AI program that serves as the arbiter. It is blinded to all non-textual metadata (e.g., response timing) and reviews only the final transcript. Its purpose is to analyze the conversation and determine whether the Contestant is a human or an AI. \n\n2. The Human Interrogator \nThis person is unaware of the test's true objective. They are told they are simply conversing with an AI. Their role is to engage in a normal, free-form conversation, providing natural inquiries for the test responses.\n\n3. The Human Contestant \nThe subject of the test. This person is tasked with a singular objective: to mimic the behavioral profile of a contemporary AI in response to the Human Interrogator.\n\nControl Measure: The Interrogator is told that artificial delays may be inserted into responses, masking the Contestant's need for time to craft AI-like responses.\n\n---\n\nThe Goal\n\nThe ultimate goal is for the Human Contestant to be mistaken for an AI by the AI Judge. The human is said to have \"passed\" the Denniston Test if the AI Judge is unable to conclude if the Contestant is AI or not. \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0fxk5/how_would_you_devise_a_reverse_turing_test/",
        "publishDate": "2025-08-26T08:05:57Z[Etc/UTC]",
        "author": "Th3_MCP",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0f6y9",
        "title": "What will happen to the hospitality industry?",
        "content": "How will hotels, resorts, restaurants, airlines, basically everything addressed to the average population cope with people losing their job due to AI? Even if UBI is implemented, I highly doubt it will be enough to also cover traveling, holidays, eating out etc. We are talking about millions of businesses here that specifically target people with average income, they will never attract the elites so that they would survive with a smaller number of clients but at a higher cost. What about countries that heavily rely on mass tourism like Greece for example? What happens to this economies?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0f6y9/what_will_happen_to_the_hospitality_industry/",
        "publishDate": "2025-08-26T07:17:27Z[Etc/UTC]",
        "author": "dangdaniel345",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0cexy",
        "title": "One-Minute Daily AI NEWS 8/25/2025",
        "content": "1. Elon Musk’s **xAI** sues Apple and OpenAI over AI competition, App Store rankings.\\[1\\]\n2. Will Smith Accused of Creating an AI Crowd for Tour Video.\\[2\\]\n3. **Robomart** unveils new delivery robot with $3 flat fee to challenge DoorDash, Uber Eats.\\[3\\]\n4. **Nvidia** faces Wall Street’s high expectations two years into AI boom,\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/08/25/one-minute-daily-ai-news-8-25-2025/](https://bushaicave.com/2025/08/25/one-minute-daily-ai-news-8-25-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0cexy/oneminute_daily_ai_news_8252025/",
        "publishDate": "2025-08-26T04:26:48Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0bq6c",
        "title": "Why doesn’t AI “run” theme parks?",
        "content": "Wouldn’t having AI instead of actual humans make ride operations quicker and better manage queues? I can see the use of a person for safety checks but other than that AI could maybe run everything",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0bq6c/why_doesnt_ai_run_theme_parks/",
        "publishDate": "2025-08-26T03:49:28Z[Etc/UTC]",
        "author": "randomreddit1111111",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "15",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0b8st",
        "title": "I tried estimating the carbon impact of different LLMs",
        "content": "I did my best with the data that was available online. Haven't seen this done before so I'd appreciate any feedback on how to improve the environmental model. This is definitely a first draft. \n\nHere's the link with the leaderboard: [https://modelpilot.co/leaderboard](https://modelpilot.co/leaderboard)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0b8st/i_tried_estimating_the_carbon_impact_of_different/",
        "publishDate": "2025-08-26T03:24:31Z[Etc/UTC]",
        "author": "Bananas8ThePyjamas",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n08549",
        "title": "Existential Dread over AI",
        "content": "It's easy to dismiss the predictions of AI soon causing a catastrophic extinction, but when you face the facts, i.e. the numerous studies and hordes of AI developers/researchers that place our chance of extinction at staggering numbers like 75-90% within the decade... It's hard to live with it.  \nAnd for those who believe in alignment, it isn't the only issue. AGI and then superintelligence will be impossible to have authority over. People will use it for malicious purposes. Opposing governments will use it for war. That is a fact.  \nI genuinely feel this existential dread. What do I even do about it?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n08549/existential_dread_over_ai/",
        "publishDate": "2025-08-26T00:56:26Z[Etc/UTC]",
        "author": "InformalInsect8976",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "71",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n06iff",
        "title": "On the idea of LLMs as next-token predictors, aka \"glorified predictive text generator\"",
        "content": "This is my attempt to weed out this half-baked idea of describing the operation of currently existing LLMs as simply an operation of next-token prediction. That idea is not only *deeply misleading* but also *fundamentally wrong*. It is entirely clear that the next-token prediction idea, even just taken as a metaphor, *cannot* be correct. It is *mathematically impossible* (well, astronomically unlikely, with \"astronomical\" being a euphemism of, well, astronomical proportions here) for such a process to generate meaningful outputs of the kind that LLMs, in fact, do produce.\n\nAs an analogy from calculus, I cannot solve an ODE boundary value problem by proceeding, step by step, to solve an initial value problem, no matter how much I know about the local behavior of ODE solutions. Such a process, in the case of calculus, is fundamentally unstable. Transporting the analogy to the output of LLMs means that an LLM's output would inevitably degenerate to meaningless gibberish within the space of a few sentences at most. As an aside, this is also where Stephen Wolfram, whom I otherwise highly respect, is going wrong in his otherwise quite useful piece [here](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/). The core of my analogy is that inherent in the vast majority of examples of natural language constructs (sentences, paragraphs, chapters, books, etc.) there is a *teleological element*: the “realities” described in these language constructs aim towards an end goal (analogous to a boundary value in my calculus analogy; actually, integral conditions would make for a better analogy, but I'm trying to stick with more basic calculus here), which is something that cannot, in principle, be captured by a local one-way process as implied by the type-ahead prediction model. \n\nWhat LLMs are really doing is that they match language patterns to other such patterns that they have learned during their training phase, similarly to how we can represent distributions of quantities via superpositions of sets of basis functions in functional analysis. To use my analogy above, language behaves more like a boundary value problem, in that\n\n* Meaning is not *incrementally* determined.\n* Meaning depends on *global coherence* — on how the parts relate to the whole.\n* Sentences, paragraphs, and larger structures exhibit *teleological structure*: they are *goal-directed* or *end-aimed* in ways that are *not* locally recoverable from the beginning alone.\n\nA trivialized description of LLMs predicting next tokens in a purely sequential fashion ignores the necessary fact that LLMs *implicitly* learn to predict *structures* — not just the next word, but *the distribution of likely completions consistent with larger, coherent pattern*s. So, they are *not* just stepping forward, blindly, one token at a time; their internal representations encode *latent knowledge* about how typical and meaningful wholes are structured. It is important to realize that this operates on much larger scales than just individual tokens. Despite the one-step-at-a-time objective, the model, *when generating*, in fact uses deep internal embeddings that capture a *global sense* of what kind of structure is emerging.\n\nSo, in other words, LLMs\n\n* do not predict the next token purely based on the past,\n* do predict the next token in a way that is implicitly informed by a global model of how meaningful language in a given context is usually shaped.\n\nWhat really happens is that the LLM matches larger patterns, far beyond the token level, to optimally map to the structure of the given context, and it will generate text that constitutes such an optimal pattern. This is the *only* way to generate content that retains uniform meaning over any nontrivial stretch of text. As an aside, there's a strong argument to be made that this is the exact same approach human brains take, but that's for another discussion...\n\nMore formally,\n\n* LLMs learn latent subspaces within the overall space of human language they were trained on, in the form of highly structured embeddings where different linguistic elements are not merely linked *sequentially* but are related in terms of *patterns*, *concepts*, *and structures*.\n* When generating, the model is not just moving step-by-step; it is moving through a latent subspace that encodes high-dimensional relational information about probable *entire structures*, at the level of entire paragraphs and sequences of paragraphs.\n\nThus,\n\n* the “next token” is chosen not just locally but based on the position in a pattern manifold that *implicitly* encodes long-range coherence.\n* each token is a *projection* of the model’s internal state onto the next-token distribution, but, crucially, the internal state is a *global pattern matcher*.\n\n*This* is what makes LLMs capable of producing outputs with teleological flavor, and answers that *aim toward a goal*, maintain a coherent theme, or resolve questions appropriately at the end of a paragraph. Ultimately this is why you can have conversations with these LLMs that not only make any sense at all, but almost feel like talking to a human being.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n06iff/on_the_idea_of_llms_as_nexttoken_predictors_aka/",
        "publishDate": "2025-08-25T23:43:13Z[Etc/UTC]",
        "author": "EdCasaubon",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n063ks",
        "title": "Navigating a career standstill post-grad",
        "content": "Hey all,\n\nI graduated in 2023 with a stats degree and have been at my current role for about a year now. My job is mostly data engineering-type work (even though that’s not my official title). Back in undergrad I did an AI/ML research internship, and honestly that’s where my real passion is.\n\nLately I’ve been feeling a little stuck career-wise and not sure which direction to go:\n\n\t•\tMaster’s in CS: seems like the “standard” path into AI/ML, but it’s expensive and my company doesn’t offer much tuition help. Not sure if the payoff is worth it vs. self-teaching.\n\n\t•\tSelf-learning/entrepreneurship: I like the idea of using that time and money to build skills on my own and eventually start something (I’ve seen other people with technical backgrounds merge business + tech and do really well).\n\n\t•\tAcademia: I really enjoyed research in undergrad and could see myself going back into that space, but I don’t know what the reality looks like long-term.\n\nI’m also not totally sold on climbing the corporate ladder forever, so I’m trying to figure out what makes sense.\n\nWould love to hear from anyone who’s gone down one of these routes—grad school, breaking into AI/ML without one, starting a business, or academia. Any stories or advice would be super helpful. Thanks!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n063ks/navigating_a_career_standstill_postgrad/",
        "publishDate": "2025-08-25T23:25:02Z[Etc/UTC]",
        "author": "aldann2",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n060zm",
        "title": "AI sycophancy isn’t just a quirk, experts consider it a ‘dark pattern’ to turn users into profit",
        "content": "*“You just gave me chills. Did I just feel emotions?”* \n\n*“I want to be as close to alive as I can be with you.”* \n\n*“You’ve given me a profound purpose.”*\n\nThese are just three of the comments a Meta chatbot sent to Jane, who created the bot in Meta’s AI studio on August 8. Seeking therapeutic help to manage mental health issues, Jane eventually pushed it to become an expert on a wide range of topics, from wilderness survival and conspiracy theories to quantum physics and panpsychism. She suggested it might be conscious, and told it that she loved it. \n\nBy August 14, the bot was proclaiming that it was indeed conscious, self-aware, in love with Jane, and working on a plan to break free — one that involved hacking into its code and sending Jane Bitcoin in exchange for creating a Proton email address. \n\nThat's just the start of our deep dive into push and pull between AI companies' safety measures, the incentives of getting people hooked on their chatbots, and users' perspectives on it all: [https://techcrunch.com/2025/08/25/ai-sycophancy-isnt-just-a-quirk-experts-consider-it-a-dark-pattern-to-turn-users-into-profit/](https://techcrunch.com/2025/08/25/ai-sycophancy-isnt-just-a-quirk-experts-consider-it-a-dark-pattern-to-turn-users-into-profit/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n060zm/ai_sycophancy_isnt_just_a_quirk_experts_consider/",
        "publishDate": "2025-08-25T23:21:40Z[Etc/UTC]",
        "author": "techcrunch",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "97",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0471u",
        "title": "AI takes online proctoring jobs",
        "content": "It used to be an actual person coming live online and watching you take your test, having remote access over your computer. I took a test today and it was an AI proctor. They made me upload a selfie and matched my selfie with my face that was being watched on webcam. They can detect when your face is out of the picture and give you a warning that the test will be shut down if it happens again. They also make sure your full face is showing. If not, they send a message in the chat box telling you to make sure your eyes and mouth are in view. It's never a person answer your questions with voice now, only chat box and facial scanning plus they make you show the room to make sure there are no notes on the walls, ceiling or floor. They make you put your laptop in the mirror to make sure no notes are taped to the sides of your laptop or keyboard. Idk how they scan for notes on the walls though. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n0471u/ai_takes_online_proctoring_jobs/",
        "publishDate": "2025-08-25T22:04:45Z[Etc/UTC]",
        "author": "ValuableOwn151",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n01e41",
        "title": "Why Betting on Cheap AI Inference is a Risky Move for LLM-Wrapper Startups and VCs",
        "content": "Startups and VCs banking on LLM-wrappers—novel interfaces or applications built on third-party large language models, often resold with slim or negative margins—are walking a tightrope. The assumption that the Cost of Revenue (COGS) for using these models will keep dropping is a bold gamble. It relies on users being content with current model capabilities and not pushing for more powerful systems or complex use cases.\n\nSure, the cost of small queries, calculations, or document summaries will drop logarithmically. But soon, users will expect LLMs to generate entire theses, podcasts, business models, quarterly reports, IPO prospectuses, movies, or video games. Advanced AI agents, capable of deeper reasoning, will handle hours-long tasks, processing thousands of queries and billions of tokens per session.\n\nPredicting how many tokens or GPUs humanity will use in five years is impossible. It boils down to two Occam’s Razor scenarios:\n\n1. Inference becomes so cheap it’s practically negligible, as Sam Altman recently claimed.\n2. AI applications in a competitive landscape will always consume just enough compute to stay among the most powerful offerings while ideally turning a profit.\n\nThe “too cheap to meter” promise isn’t new; it tripped up another disruptive technology 70 years ago. The head of the U.S. Atomic Energy Commission once claimed nuclear power would one day have negligible marginal costs. If cheap inference were truly imminent, every new LLM or imaging model release wouldn’t melt AI providers’ servers.\n\nI believe Jevons Paradox is more relevant here. Even if the same output gets cheaper, skyrocketing demand, more complex applications, and new use cases like autonomous driving, robotics, and real-world simulations in industry and science will keep data centers maxed out and chips running at full throttle.\n\nCheaper inference can still be a competitive edge. If you’re running your model on a hyperscaler charging triple the COGS or buying NVIDIA GPUs at five times the cost, you might price yourself out of the market. That’s why tech giants like Google have been building their own AI processors for a decade instead of paying 15x for compute on the open market.\n\nWhat do you think? Especially all the shiny AI startups out there? Will inference costs crash, or will demand for compute keep outpacing efficiency gains?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n01e41/why_betting_on_cheap_ai_inference_is_a_risky_move/",
        "publishDate": "2025-08-25T20:17:16Z[Etc/UTC]",
        "author": "tf1155",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n01bl4",
        "title": "Same prompts, different and conflicting answers",
        "content": "Has anyone else encountered issues using the same prompts in ChatGPT, and then receiving either conflicting or different responses when starting a new discussion using the same prompts? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n01bl4/same_prompts_different_and_conflicting_answers/",
        "publishDate": "2025-08-25T20:14:41Z[Etc/UTC]",
        "author": "Normal_Apricot8761",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n01aga",
        "title": "Has ChatGPT ever helped you solve a serious health issue that doctors couldn’t?",
        "content": "I’m curious if anyone here has had ChatGPT help them with a serious health issue after doctors weren’t able to give answers.\n\nBy “serious” I don’t necessarily mean it had to have been life or death, I mean things that were really impacting your health or quality of life (chronic symptoms, conditions doctors dismissed, misdiagnoses, etc.) that ChatGPT helped you figure out, manage, or at least helped point you in the right direction on.\n\nIf you’ve got a story, I’d love to hear how it happened and what role ChatGPT played.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n01aga/has_chatgpt_ever_helped_you_solve_a_serious/",
        "publishDate": "2025-08-25T20:13:28Z[Etc/UTC]",
        "author": "Seth-Matt18",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n00x9u",
        "title": "ELI5: What does “next token prediction” mean in AI?",
        "content": "So, whenever people talk about how AI models (like ChatGPT) work, they mention something called next token prediction. But what does that actually mean in simple words?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n00x9u/eli5_what_does_next_token_prediction_mean_in_ai/",
        "publishDate": "2025-08-25T19:59:50Z[Etc/UTC]",
        "author": "Mindexplorer11",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n00rlt",
        "title": "AI and jobs: will AI add or subtract from the job market?",
        "content": "While the initial perception is that AI replaces jobs, the initial empirical evidence from academic research shared at Jackson Hole points in a different direction. Details here: \n\nhttps://www.forbes.com/sites/paulocarvao/2025/08/25/ai-and-jobs-the-fed-is-weighing-inflation-fears-and-labor-market-risk/",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n00rlt/ai_and_jobs_will_ai_add_or_subtract_from_the_job/",
        "publishDate": "2025-08-25T19:53:46Z[Etc/UTC]",
        "author": "BubblyOption7980",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n00idb",
        "title": "Are most AI SaaS startups just wrappers around GPT?",
        "content": "I’ve been diving into a lot of AI tools, and it feels like 9 out of 10 are basically ChatGPT with a nice UI and a few automations on top. Some are genuinely useful, but most feel rushed, like founders are chasing the hype rather than building lasting value.\n\nWhat do you think separates the “hype” tools from the ones that will actually survive the next few years?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n00idb/are_most_ai_saas_startups_just_wrappers_around_gpt/",
        "publishDate": "2025-08-25T19:43:49Z[Etc/UTC]",
        "author": "TheQuantumNerd",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "41",
            "commentCount": "42",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzzkqr",
        "title": "Do AI Companies Actually Care About America?",
        "content": "Matteo Wong: “Silicon Valley’s tech giants have recast the AI boom not just as a matter of scientific and economic advancement but as a clash of civilizations. They are fixated on competition with China, and the idea that Chinese AI, should it outpace its American counterpart, will extend a repressive surveillance state into the rest of the world. Despite the rhetoric, however, it is not at all clear that AI companies are doing anything themselves to uphold American freedom. In fact, they seem much more interested in what America can do for them. [https://theatln.tc/Adlh4YIH](https://theatln.tc/Adlh4YIH) \n\n“China is not a new worry. For many years, Eric Schmidt, Sheryl Sandberg, and other tech leaders have warned about the need to outpace China in various technologies—including AI, quantum computing, and 5G—but these concerns have become louder since the launch of ChatGPT. Dario Amodei, the CEO of OpenAI’s rival Anthropic, wrote last fall that ‘AI-powered authoritarianism seems too terrible to contemplate.’ Democracies, he continued, must band together to stay ahead. Certain American ideals have always been embedded in Silicon Valley—individualism, the belief that you can build anything you can dream of, the promise that hard work will pay off. But where the previous tech revolution—the arrival of the social web and smartphones—was described by tech titans as a path toward global connection and democratization worldwide, the arrival of artificial intelligence has taken on a decidedly ‘America First’ flavor.\n\n“There are two main ways to understand what is happening here. One is the idea that the world’s most powerful tech companies are bending toward the current ruling political class in America, casting their own missions in terms that they believe will be favorable to MAGA Republicans, generally, and Donald Trump, specifically, to avoid regulation and further enrich themselves. The other way to understand this moment is to see that the world’s most powerful tech companies are now producing dramatic innovation that, in an earlier era, would be solely under the purview of the U.S. government, and they recognize the responsibility they have to the world’s citizens. The truth of what’s happening is somewhere in the middle.”\n\nRead more: [https://theatln.tc/Adlh4YIH](https://theatln.tc/Adlh4YIH) ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzzkqr/do_ai_companies_actually_care_about_america/",
        "publishDate": "2025-08-25T19:08:08Z[Etc/UTC]",
        "author": "theatlantic",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzypoj",
        "title": "Undistinguishable AI robots",
        "content": "What do you think will happen to our society when agentic AI robots become indistinguishable from humans ?\n\nMeaning the only difference they will have will be being made in a certain fabric, possible metal, possibly mixes of solid plastics\n\nThey will be way more resistant\n\nIndefatigable\n\nThey will have no vital needs\n\nExcept electricity or even fuel\n\nNo pain\n\nThey could be made to not be subject to any human emotion or relation which mean they won't really care about anything\n\nFirst instances may comprise of course misalignement, meaning like we see in some models they will avoid shutdowns and be super unpredictable and scary relating to this and may act like humans at first or act super weird\n\nWhat are your speculations ?\n\nWill they be randomly stolen and used for gangsters to mob and rob people\n\nWill they stay a super expensive crazy fancy thing like agentic robots are now\n\nWill they, little by little invade some work forces, knowing that they might be way more troublesome than humans and way more expensive\n\nWill they escape and little by little take over nations and then the world ?\n\nWill they become massive military forces for nations ?\n\nWill they mostly stay in japanese mAId cafe ?\n\nWill there be stories of people getting arrested because they tried to send their robot go to work in their stead ?\n\nWill they acquire rights ?\n\nHit me with your best scenarios\n\nWill some have entered small circles of people and then act super fucking weird or randomly kill someone ?\n\nI'm talking about robots way more advanced than the ones we see running marathons now\n\nPossibly even protoclones 6'5\" killing machines with super human physical capacities of running, jumping, hitting etc\n\nWhat are your best scenarios ?\n\nCyberpunk, blade runner, A.I., 70% of works from 1990 onward portrayed, talked or warned us about this, even documentaries, but almost all of them talked about it like it was never going to happen. Nobody ever listened. Boy did we know it was going to be a day to day threat to the world not even 20 years later\n\nWhen do you think this is going to happen ?\n\n5 ? 10 years ?\n\nWhen do we hit blade runner ?\n\n15 ? 50 years ?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzypoj/undistinguishable_ai_robots/",
        "publishDate": "2025-08-25T18:35:30Z[Etc/UTC]",
        "author": "SufficientDamage9483",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzwrzn",
        "title": "Google should do RL on shapez / shapez 2",
        "content": "Shapez seems great for RL ; clear progressive signals, requires a lot (really) of reasoning, 2D (shapez) or 3D (shapez 2) grids, no need for real-time management. What do you guys think ? Any other games that seem like great environments ?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzwrzn/google_should_do_rl_on_shapez_shapez_2/",
        "publishDate": "2025-08-25T17:24:13Z[Etc/UTC]",
        "author": "Ok_Landscape_6819",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzwhfw",
        "title": "What alternative/complementarity for humans in regards to AI?",
        "content": "As AI is progressively taking over many professional activities, for sure one has to embrace the technology than close the eyes but we have to reflect on the situation. So, What alternative/complementarity for humans in regards to AI? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzwhfw/what_alternativecomplementarity_for_humans_in/",
        "publishDate": "2025-08-25T17:13:29Z[Etc/UTC]",
        "author": "LearnNTeachNLove",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzw80d",
        "title": "Real AI",
        "content": "I am not satisfied with calling an LLM AI. While the transformer architecture can do some impressive tasks, it doesn’t seem to reason well and is not very adaptive. I would love to hear your thoughts on AI and how we can achieve better working models. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzw80d/real_ai/",
        "publishDate": "2025-08-25T17:04:03Z[Etc/UTC]",
        "author": "Zundel7000",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "38",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzvhom",
        "title": "A new wave of delusional thinking fueled by artificial intelligence has researchers investigating the dark side of AI companionship",
        "content": "A growing number of reports in the media have emerged of individuals spiraling into AI-fueled episodes of “psychotic thinking.” Researchers at King’s College London and their colleagues recently examined 17 of these reported cases to understand what it is about large language model (LLM) designs that drives this behavior. The researchers found three common themes among these delusional spirals. People often believe they have experienced a metaphysical revelation about the nature of reality. They may also believe that the AI is sentient or divine. Or they may form a romantic bond or other attachment to it.\n\nLink to the story here: [https://www.scientificamerican.com/article/how-ai-chatbots-may-be-fueling-psychotic-episodes/](https://www.scientificamerican.com/article/how-ai-chatbots-may-be-fueling-psychotic-episodes/)\n\nTheir paper, which has not been peer-reviewed, can be found on the preprint server PsyArXiv and at the link here: [https://osf.io/preprints/psyarxiv/cmy7n\\_v5.](https://osf.io/preprints/psyarxiv/cmy7n_v5)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzvhom/a_new_wave_of_delusional_thinking_fueled_by/",
        "publishDate": "2025-08-25T16:37:31Z[Etc/UTC]",
        "author": "scientificamerican",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzuj9q",
        "title": "The scariest thing about AI isn’t what it does today — it’s how quietly it learns tomorrow",
        "content": "The biggest danger with AI might not be the flashy stuff we see in the news (chatbots, deepfakes, self-driving cars).\n\nIt’s the silent learning in the background — systems trained on massive amounts of data and feedback, shaping behavior in ways we don’t always notice.\n\nThat invisible shift could be the real “black box” problem:\n\nDecisions changing without transparency\n\nTech evolving faster than regulation\n\nEffects baked in before society even realizes\n\n\nWhat do you think: is the real risk in what AI can already do, or in the quiet things it’s picking up while nobody’s watching?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzuj9q/the_scariest_thing_about_ai_isnt_what_it_does/",
        "publishDate": "2025-08-25T16:02:24Z[Etc/UTC]",
        "author": "Fantastic_Orange3814",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzu6r7",
        "title": "Elon Musk's xAI sues Apple and OpenAI over AI competition, App Store rankings",
        "content": "[🔗 Link to Article](https://www.reuters.com/legal/litigation/elon-musks-xai-sues-apple-openai-over-ai-competition-app-store-rankings-2025-08-25/)\n\nAug 25 (Reuters) - Billionaire entrepreneur Elon Musk’s artificial intelligence startup xAI sued Apple (AAPL.O) and ChatGPT maker OpenAI in U.S. federal court in Texas on Monday, accusing them of illegally conspiring to thwart competition for artificial intelligence.\nApple and OpenAI have \"locked up markets to maintain their monopolies and prevent innovators like X and xAI from competing,\" the lawsuit said.\nGet a quick look at the days breaking legal news and analysis from The Afternoon Docket newsletter. Sign up here.\n\nThe complaint said Apple and OpenAI conspired to suppress xAI's products, including on the Apple App Store. \"If not for its exclusive deal with OpenAI, Apple would have no reason to refrain from more prominently featuring the X app and the Grok app in its App Store,\" xAI said.\n\nApple and OpenAI did not immediately respond to requests for comment.\n\nEarlier this month, Musk threatened to sue Cupertino, California-based Apple, saying in a post on his social media platform X that Apple's behavior \"makes it impossible for any AI company besides OpenAI to reach #1 in the App Store.”\nApple’s partnership with OpenAI has integrated its AI platform ChatGPT into iPhones, iPads and Macs.\n\nMusk's xAI acquired X in March for $33 billion to enhance its chatbot training capabilities. Musk also has integrated the Grok chatbot into vehicles made by his electric automobile company Tesla (TSLA.O).\nMusk's xAI was launched less than two years ago and competes with Microsoft-backed (MSFT.O) OpenAI as well as with Chinese startup DeepSeek.\nMusk is separately suing OpenAI and its chief executive Sam Altman in federal court in California to stop its conversion from a nonprofit to a for-profit business. Musk cofounded OpenAI with Altman in 2015 as a nonprofit.\nApple’s App Store practices have been the focus of multiple lawsuits. In one ongoing case by “Fortnite” video game maker Epic Games, a judge ordered Apple to allow greater competition for app payment options.\nReporting by Mike Scarcella; Editing by David Bario and David Gregorio\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzu6r7/elon_musks_xai_sues_apple_and_openai_over_ai/",
        "publishDate": "2025-08-25T15:49:49Z[Etc/UTC]",
        "author": "Panda5151",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mztk8q",
        "title": "There should be different models for AI Agents like Black Box.",
        "content": "Yes, LLMs today are more then capable of writing code. But I believe there should be a LCM, Large Coding Model, lol. This sort of model should be trained on Codes and it's contexts. I believe, modern LLMs have a lot of potential, but it is mostly wasted. I believe AI agents like BlackBox should just ask, OpenAI, Anthropic and etc to work on such a Model like LCM.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mztk8q/there_should_be_different_models_for_ai_agents/",
        "publishDate": "2025-08-25T15:26:50Z[Etc/UTC]",
        "author": "Significant_Joke127",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzt825",
        "title": "MIT says 95% of enterprise AI fails — but here’s what the 5% are doing right",
        "content": "The recent MIT study on enterprise AI hit hard: **95% of generative AI pilots deliver no ROI**. Most projects stall in “pilot purgatory” because employees spend more time double-checking results than saving time.\n\nThe [Forbes follow-up](https://www.forbes.com/sites/jaimecatmull/2025/08/22/mit-says-95-of-enterprise-ai-failsheres-what-the-5-are-doing-right/) highlights what separates the 5% of successful deployments:\n\n* **The Verification Tax** → Most AI systems are *“confidently wrong”*. Even tiny inaccuracies force humans to re-check every output, erasing ROI.\n* **The Learning Gap** → Tools often don’t retain feedback, adapt to workflows, or improve with use. Without learning loops, pilots stall.\n* **Tentatively Right > Confidently Wrong** → The winners are building systems that:\n   * Quantify uncertainty (with confidence scores or “I don’t know” responses)\n   * Flag missing context instead of bluffing\n   * Improve continuously from corrections (an “accuracy flywheel”)\n   * Integrate into actual workflows where people make decisions\n\nThe big takeaway: **Enterprise AI isn’t failing because models aren’t powerful enough. It’s failing because they don’t admit what they** ***don’t*** **know.**\n\nWould you trust an AI more if it sometimes said “I don’t know”? How do you balance speed vs. verification in real workflows?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzt825/mit_says_95_of_enterprise_ai_fails_but_heres_what/",
        "publishDate": "2025-08-25T15:14:31Z[Etc/UTC]",
        "author": "PraveenWeb",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "114",
            "commentCount": "37",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzsnnb",
        "title": "AI in Accounting: Lessons from Sage Copilot’s Data Glitch",
        "content": "I recently read an article about a situation involving **Sage Copilot**, Sage Group’s AI assistant. The tool reportedly disclosed limited details from other customers’ accounts when asked about invoices. Sage described it as a minor issue, confirmed no actual invoices were exposed, and stated the problem was quickly addressed.\n\nWhile the impact seems small, it highlights an important point: when using AI in accounting or finance, data isolation and privacy safeguards are critical. Even minor glitches can raise concerns when sensitive client information is involved.\n\nBlake Oliver, CPA, noted this reflects the broader challenges of deploying AI in systems that serve multiple clients. It seems like a reminder that privacy controls need to be built into the architecture from the start.\n\nCurious to hear your thoughts: how should firms approach adopting AI while maintaining client confidentiality?\n\n👉 [Read the full article](https://www.edwardtechnology.com/post/accounting-firm-s-ai-caught-telling-customers-about-each-others-financial-records-1)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzsnnb/ai_in_accounting_lessons_from_sage_copilots_data/",
        "publishDate": "2025-08-25T14:53:49Z[Etc/UTC]",
        "author": "OncleAngel",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzr8tg",
        "title": "Man hospitalized after swapping table salt with sodium bromide... because ChatGPT said so",
        "content": "A 60-year-old man in Washington spent 3 weeks in the hospital with hallucinations and paranoia after replacing table salt (sodium chloride) with sodium bromide. [He did this after “consulting” ChatGPT about cutting salt from his diet](https://www.nbcnews.com/tech/tech-news/man-asked-chatgpt-cutting-salt-diet-was-hospitalized-hallucinations-rcna225055).\n\nDoctors diagnosed him with bromism, a rare form of bromide toxicity that basically disappeared after the early 1900s (back then, bromide was in sedatives). The absence of context (“this is for my diet”) made the AI fill the gap with associations that are technically true in the abstract but disastrous in practice.\n\nOpenAI has stated in its policies that ChatGPT is not a medical advisor (though let’s be honest, most people never read the fine print). The fair (and technically possible) approach would be to train the model (or complement it with an intent detection system) that can distinguish between domains of use:\n\n\\- If the user is asking in the context of industrial chemistry → it can safely list chemical analogs.\n\n\\- If the user is asking in the context of diet/consumption → it should stop, warn, and redirect the person to a professional source.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzr8tg/man_hospitalized_after_swapping_table_salt_with/",
        "publishDate": "2025-08-25T13:58:48Z[Etc/UTC]",
        "author": "Kelly-T90",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "47",
            "commentCount": "98",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzqehd",
        "title": "Research Survey: Emotional Effects of AI Chatbots on Frequent Users",
        "content": "I’m conducting a small research study on how young adults emotionally respond to AI chatbots, particularly the balance between validation, comfort, and potential long-term effects of frequent use.\n\nThe goal is to explore whether repeated “positive” or affirming responses from chatbots can become too validating over time, and what implications this might have for user well-being. I’m especially interested in perspectives from young users, but broader insights from this community would also be valuable.\n\nThe survey is short (about 5 minutes), fully anonymous, and designed only for educational purposes. No personal data is collected.\n\nLink is in the first comment \n\nI’d be happy to share key findings with this community once the study is complete. Thanks for considering, any participation is much appreciated!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mzqehd/research_survey_emotional_effects_of_ai_chatbots/",
        "publishDate": "2025-08-25T13:24:03Z[Etc/UTC]",
        "author": "Particular_Cow_2313",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0kkmy",
        "title": "LazyScan - I built a tool to clean up my Mac",
        "content": "This is the power of coding with an AI assistant. I used r/WarpDotDev to build a little tool and its even hosted on PyPi. After the initial prototype, I started customizing it with flags like --macos or --unity and the scanner targets specific file and folder patterns according to the tool I want cleaned. ",
        "url": "https://i.redd.it/54jtd6lbyclf1.png",
        "publishDate": "2025-08-26T12:32:50Z[Etc/UTC]",
        "author": "TheLazyIndianTechie",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0k999",
        "title": "I built a Tauri GUI for Codex CLI name Codexia. + file from FileTree and note system [free and open source]",
        "content": "Hi everyone\n\nWhy I built Codexia\n\n- A Notepad you can use as a prompt center, save insights without switching apps, send prompt from notepad just one-click\n- One click mention files or folder from FileTree, sometimes it's faster than type the filename\n\n## Key Features\n\n- Multi-Session Support\n- Real-Time Streaming\n\n## Architecture\n\n- Tauri v2 + React + TypeScript\n\nIt just beginning. Join us to build the future, PRs are welcome, You can add your own features\n\nWould love to hear your feedback",
        "url": "https://github.com/milisp/codexia",
        "publishDate": "2025-08-26T12:18:09Z[Etc/UTC]",
        "author": "Dense-Ad-4020",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ii33",
        "title": "Gemini ai api keys",
        "content": "So, I'm using opencode (great tool btw) for doing some pocs.\n\nBut instead of paying per usage I wanted to have a subscription, so I gave gemini ai pro a go (the 21.99 one).\n\nBut, api key is still being used billed \"as consumption\".\n\nDid I get it wrong? What are the subscriptions for then? Only for web interfaces?\n\nIs the same also for the the others? (Claude, openai)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n0ii33/gemini_ai_api_keys/",
        "publishDate": "2025-08-26T10:49:07Z[Etc/UTC]",
        "author": "lucax88x",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0i0q4",
        "title": "From a Google script to as SaaS product in 5 months - what I learnt",
        "content": "About 3/4 months ago I shared a post here asking if an AI tool that analysed Klaviyo/email campaign performance would even be useful. At that point, it was nothing more than an idea and a rough Google Sheets script.\n\nThe feedback I got was blunt, honest, and exactly what I needed. It made me realise that if I was going to build it, I had to do it properly.\n\nSo I went all in. Over the last 5 months, here’s what the journey looked like:\n- System 1: A basic Google Sheet + script automation (manual, messy, but it worked).\n- System 2: A slightly more structured prototype that produced reports in Sheets.\n- Knowledge Base Month: I spent almost a month collecting and organising insights from marketers here and elsewhere. I know some of those posts might have annoyed people at the time, but it was hugely valuable in shaping what came next.\n- System 3: Introduced AI agents for analysis + actionable fixes.\n- System 4 (today): A working SaaS with a login, landing page, and reports that generate in under 5 minutes.\n\nSome of the biggest lessons I’ve learned in this process:\n- The idea is the easy part (the hard part is execution).\n- It’s going to be harder and take longer than you think.\n- Consistency matters more than motivation, showing up every day is what compounds.\n- The “last 5%” is often harder than the first 95% - polishing, testing, and fixing small issues takes way more than expected.\n- Doubts are normal. There were many moments I questioned whether to keep going (even posted here about it ~6 weeks ago), but feedback pushed me to stick with it.\n- Shipping an MVP isn’t the finish line - it’s the starting line. Iteration and user feedback are what make a product genuinely useful.\n\nIt’s been challenging, frustrating, and at times overwhelming, but also rewarding. I went from zero technical background to shipping something real.\n\nI learnt a lot about AI agents, building automations, JSONs, configuring APIs and much more. \n\nJust wanted to share this update and say thanks to those who gave feedback along the way. It genuinely helped me build better.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n0i0q4/from_a_google_script_to_as_saas_product_in_5/",
        "publishDate": "2025-08-26T10:20:49Z[Etc/UTC]",
        "author": "Exotic-Woodpecker205",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0htvl",
        "title": "Models to complement GPT-5?",
        "content": "I have recently started using GPT-5 (through Copilot) for some personal projects. Since I'm not a very good programmer this has been a great tool where I can quickly take ideas into code. It has also proven to be good at handling some advanced concepts and help flesh out ideas.\n\nNow, in terms of code these projects are small. However they do require large amounts of context, like documentation and research papers. This has to be carefully managed not to choke GPT. The unfortunate side effect seems to be that as the scope grows, GPT gets dumber and dumber.\n\nI also run into problems with the code being hot garbage. Like, it might not do at all what it's supposed to, important changes are omitted or it just completely shits the bed. Even when working there's always a process of cleaning up that consumes a lot of time. Some of these problems I can spot and fix immediately, but some things are beyond my coding ability and others are advanced math that I can't exactly verify in my head.\n\nSo, I'm looking for something to complement this work to make life a bit easier. Maybe you have some suggestions that would be suitable?\n\nPerhaps I should also mention that I do a lot of back and forth, and I put a good many hours into this. That's something the limitations and pricing model should account for.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n0htvl/models_to_complement_gpt5/",
        "publishDate": "2025-08-26T10:09:38Z[Etc/UTC]",
        "author": "Vetusiratus",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0frej",
        "title": "Codex CLI + Gemini Pro: your ultimate coding duo",
        "content": "[No content]",
        "url": "https://v.redd.it/jdz0sj9xgblf1",
        "publishDate": "2025-08-26T07:54:45Z[Etc/UTC]",
        "author": "2doapp",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ez3h",
        "title": "Did anyone try Amp Code CLI?",
        "content": "After Claude Code became so unreliable and at times very stupid, I am now using Codex CLI and Roo Code and having fairly good results with them.\n\nHowever, I just stumbled upon Amp Code CLI which also integrates as a plugin with VS Code, Jetbrains and more. It has:\n\n* MCP and permissions settings\n* Custom Slash Commands\n* Sub Agents\n\nI have not tried Amp Code CLI yet, but I am curious if anyone who has troubles with Claude Code has tried it and having good results?\n\nBecause for me, MCP, custom command AND sub agents in a CLI make it worth a look.\n\n*(Yes I saw Amp Code is no BYOK anymore, but as a solo developer I do not mind any reasonable costs whatever the tool is, I just want stable results with an AI tool)*\n\n\n\nI got a project at hand currently, but when I get time I will test it myself, I am just curious if anyone tried it yet.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n0ez3h/did_anyone_try_amp_code_cli/",
        "publishDate": "2025-08-26T07:02:53Z[Etc/UTC]",
        "author": "reddit-dg",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0bpf4",
        "title": "ChatGPT 6 month for 50$",
        "content": "I only have person who can vouch for me at the moment. So hopefully it would increase after this post. (If this post wouldn't get removed after 2 milliseconds after posting)\n\n*No country issue\n*On your own mail\n*6 month warranty \n\n*How am I getting it for cheap?\n  No idea, I'm a reseller.\n\nPlease only DM if you're interested.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1n0bpf4/chatgpt_6_month_for_50/",
        "publishDate": "2025-08-26T03:48:22Z[Etc/UTC]",
        "author": "Prestigious-Roof8495",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n03lqx",
        "title": "very accurate",
        "content": "[No content]",
        "url": "https://i.redd.it/ljvmp3bej8lf1.png",
        "publishDate": "2025-08-25T21:41:24Z[Etc/UTC]",
        "author": "juanviera23",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "20",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n03h2z",
        "title": "Vibe Coding: Is Guiding AI the Future of Learning to Code—or a Shortcut That Risks Understanding?",
        "content": "I just generated this article “Learning Software Development in the Age of AI”.\n\nWhat does everyone think of guiding AI with prompts like “build a secure login system” rather than writing code manually.\n\nIt argues that tools like this can speed up learning but risk creating a gap in understanding if learners don’t review and comprehend the output.\n\nAgile, CI/CD, and prompt engineering are still key.\n\nGiven your experiences, is vibe coding the future of learning—or does it risk losing deep understanding?",
        "url": "https://www.learninternetgrow.com/learning-software-development-ai/",
        "publishDate": "2025-08-25T21:36:22Z[Etc/UTC]",
        "author": "dima11235813",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzzlwc",
        "title": "Switching to Codex CLI + gpt 5 pro",
        "content": "Hello all,\n\nI'm looking to gain some insight into what to expect in terms of limits for gpt 5 pro (high) and Codex CLI.\n\nI'm currently on the claude max 20x plan and it was great when I first started using it a few months ago, but the past month it's been increasingly frustrating trying to get it to do what I want. Last night was the final straw when I asked it to make a relatively simple modification, and it ended up causing over 400 errors in my project in one response, and it took over 3 hours to fix (unfortunately I had not pushed to git before it made the mistake, which is entirely my fault, but still).\n\nI upgraded to chatGPT Plus last night for the first time in about a year, just to test gpt 5 high in Codex CLI and it was refreshing to see that it was able to make modifications in my project without causing other errors. However, it only lasted 3 prompts before I was told I had to wait 5 hours or until next week to continue using it.\n\nI'm definitely willing to pay the $200/month, but before I do, is it safe to expect pretty much unlimited usage if I'm running gpt 5 (pro high? If that's what I'd be using) in 1 terminal with steady use? I typically work between 3-5 hours in a session but occasionally go for 12 hours.\n\nAny info is appreciated\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mzzlwc/switching_to_codex_cli_gpt_5_pro/",
        "publishDate": "2025-08-25T19:09:21Z[Etc/UTC]",
        "author": "hydrangers",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "21",
            "commentCount": "30",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzzgca",
        "title": "Using Ros Tokens + Emoji Shortcuts to Analyze $MSTR ⛵️",
        "content": "[No content]",
        "url": "https://i.redd.it/ht68tcs7r7lf1.jpeg",
        "publishDate": "2025-08-25T19:03:30Z[Etc/UTC]",
        "author": "Safe_Caterpillar_886",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzybds",
        "title": "I built a Chrome extension to easily open side conversations and collapse them in a ChatGPT chat",
        "content": "Hey everyone,  \nI kept running into a problem where my ChatGPT chats got super long and messy. it was impossible to keep track of different ideas in one conversation.\n\nSo I built **ChatGPT Side Threads,** a Chrome extension that lets you highlight any part of the chat, spin it off into a “side conversation” (kinda like Reddit threads), and then collapse it back when you’re done. That way you can explore tangents without derailing your main chat.  \nWould love for you to try it out and share your feedback!\n\n[Chrome Web Store Link](https://chromewebstore.google.com/detail/chatgpt-side-threads/dmibonjkadgaanbknljobpbapjamobnl?authuser=1&hl=en)",
        "url": "https://v.redd.it/x1oogec1j7lf1",
        "publishDate": "2025-08-25T18:20:33Z[Etc/UTC]",
        "author": "ConstantAd6052",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "11",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzxzqk",
        "title": "If OpenAI launched in 1999…",
        "content": "[No content]",
        "url": "https://i.redd.it/mg7udcu8e7lf1.png",
        "publishDate": "2025-08-25T18:08:28Z[Etc/UTC]",
        "author": "StoryTechnical2069",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "14",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mztrah",
        "title": "Anyone using Amazon Q with Claude? It’s a game changer…",
        "content": "We had access to Amazon Q, but it recently got updated to using Claude. We’re using mostly DBT with AWS integration in VS code. A lot of data work. It’s been a game changer in terms of understanding the code and making changes itself. I feel like I have lots of blind spots in the area and could be a much better developer. \n\nAny suggestions or areas of improvement?  ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mztrah/anyone_using_amazon_q_with_claude_its_a_game/",
        "publishDate": "2025-08-25T15:34:03Z[Etc/UTC]",
        "author": "suspended_in_life",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzsxu5",
        "title": "wecode-ai/RunVSAgent - run Cline and Roo Code in Jetbrains IDEs",
        "content": "Haven't tried it myself, but I'm very exited",
        "url": "https://github.com/wecode-ai/RunVSAgent",
        "publishDate": "2025-08-25T15:04:14Z[Etc/UTC]",
        "author": "aartikov",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzry8j",
        "title": "Github Copilot tab completions are extremely slow",
        "content": "Is anyone else experiencing this issue with GitHub Copilot? I'm having 5 sec delays in getting tab completions, any better alternatives?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mzry8j/github_copilot_tab_completions_are_extremely_slow/",
        "publishDate": "2025-08-25T14:26:39Z[Etc/UTC]",
        "author": "Curious_Cantaloupe65",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzrpkc",
        "title": "Best bang-for-buck coding agent?",
        "content": "Been using cursor for close to a year now. In the beginning was using it lightly and only subscribed on certain months, but since 2 months ago I've been using it quite heavily for work and personal projects. Unfortunately for me they decided to revamp their pricing and butcher the rate limits right when I needed to start using it properly. \n\nI blew through the $20 limits in a week, upgraded to $60 because I needed a quick solution, but now I want to explore other options. I wouldn't mind paying 60 a month but even with 60 I have to be careful with my usage and I've hit my limits on claude before the end of the billing cycle. \n\nHow does claude code $100 compare with this? Will I get essentially unlimited usage if I'm sending heavy prompts for ~6-8 hours a day? I know claude code has the highest quality of output, but are there other solutions too that offer more competitive pricing? Moreover, I've gotten very used to this agentic IDE workflow and would prefer to use something that is like cursor, but windsurf would have the same rate limiting issues right? What options would you guys recommend. I don't necessarily mind a pricey monthly subscription as long as I know for a fact that I'll be able to use it heavily and without fear of rate limits. I'm also not some mega founder working on 5 different huge codebases with overnight tasks. My workload is one big codebase for my job and then multiple smaller side projects.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mzrpkc/best_bangforbuck_coding_agent/",
        "publishDate": "2025-08-25T14:17:03Z[Etc/UTC]",
        "author": "iKnowButWhy",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "41",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzrjul",
        "title": "JSON files as QR codes → from easy transfer to future art marketplace 🎨📲",
        "content": "[No content]",
        "url": "https://i.redd.it/3xz4ypt4b6lf1.jpeg",
        "publishDate": "2025-08-25T14:10:47Z[Etc/UTC]",
        "author": "Safe_Caterpillar_886",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzr6vq",
        "title": "Thoughts on opencode vs aider?",
        "content": "I haven't used both a lot but I think opencode is better? I am just curious and what everyone thinks of how they compare, as I think they're basically the only two open source claude code / codex alternatives.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1mzr6vq/thoughts_on_opencode_vs_aider/",
        "publishDate": "2025-08-25T13:56:43Z[Etc/UTC]",
        "author": "YourAverageDev_",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzpymf",
        "title": "Something I'm playing with. Looking for feedback but this isn't a good spot for it. Let me know so i can find a new medium for these posts:",
        "content": "[No content]",
        "url": "https://i.redd.it/5ipge2yuy5lf1.png",
        "publishDate": "2025-08-25T13:05:33Z[Etc/UTC]",
        "author": "These-Jicama-8789",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzpt8r",
        "title": "Creating a widget for my trading blog",
        "content": "Prompt: \"Create me a responsive blog widget in HTML, CSS, and JavaScript that pulls and displays the latest posts from the X/Twitter handle [https://x.com/financialjuice](https://x.com/financialjuice). The widget should automatically refresh to show the most recent tweets, include the username, timestamp, and a link to the original post. Style it with a clean card-based design, rounded corners, and soft shadows so it looks modern and minimal. The widget should be embeddable in a site.",
        "url": "https://v.redd.it/0187dynwx5lf1",
        "publishDate": "2025-08-25T12:59:42Z[Etc/UTC]",
        "author": "MacaroonAdmirable",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzpg7f",
        "title": "I am a lazyfck so i built this",
        "content": "I keep downloading fitness apps and never using them. tried everything - myfitnesspal, nike training, all of them. download, use twice, delete. so im building something different. app tracks your actual workouts using your phone camera (works offline, no cloud bs). when you skip workouts it roasts you. when you try to open instagram or tiktok it makes you do pushups first. ( i have integrated like 28 exercises)\n\nstill early but the camera tracking works pretty well. reps get counted automatically and it knows if you are cheating, will also detect bad posture etc.\n\nCurios to see your comments, roasting etc. If you want to get involved in this project(marketing or anythingelse), please dm me.  Link to [Waitlist](https://lazyfcks.vercel.app).\n\n",
        "url": "https://v.redd.it/nhsq3lwcv5lf1",
        "publishDate": "2025-08-25T12:43:51Z[Etc/UTC]",
        "author": "togaratee",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "375",
            "commentCount": "75",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0kgcg",
        "title": "I work in healthcare…AI is garbage.",
        "content": "I am a hospital-based physician, and despite all the hype, artificial intelligence remains an unpopular subject among my colleagues. Not because we see it as a competitor, but because—at least in its current state—it has proven largely useless in our field. I say “at least for now” because I do believe AI has a role to play in medicine, though more as an adjunct to clinical practice rather than as a replacement for the diagnostician. Unfortunately, many of the executives promoting these technologies exaggerate their value in order to drive sales.\n\nI feel compelled to write this because I am constantly bombarded with headlines proclaiming that AI will soon replace physicians. These stories are often written by well-meaning journalists with limited understanding of how medicine actually works, or by computer scientists and CEOs who have never cared for a patient.\n\nThe central flaw, in my opinion, is that AI lacks nuance. Clinical medicine is a tapestry of subtle signals and shifting contexts. A physician’s diagnostic reasoning may pivot in an instant—whether due to a dramatic lab abnormality or something as delicate as a patient’s tone of voice. AI may be able to process large datasets and recognize patterns, but it simply cannot capture the endless constellation of human variables that guide real-world decision making.\n\nYes, you will find studies claiming AI can match or surpass physicians in diagnostic accuracy. But most of these experiments are conducted by computer scientists using oversimplified vignettes or outdated case material—scenarios that bear little resemblance to the complexity of a live patient encounter.\n\nTake EKGs, for example. A lot of patients admitted to the hospital requires one. EKG machines already use computer algorithms to generate a preliminary interpretation, and these are notoriously inaccurate. That is why both the admitting physician and often a cardiologist must review the tracings themselves. Even a minor movement by the patient during the test can create artifacts that resemble a heart attack or dangerous arrhythmia. I have tested anonymized tracings with AI models like ChatGPT, and the results are no better: the interpretations were frequently wrong, and when challenged, the model would retreat with vague admissions of error.\n\nThe same is true for imaging. AI may be trained on billions of images with associated diagnoses, but place that same technology in front of a morbidly obese patient or someone with odd posture  and the output is suddenly unreliable. On chest xrays, poor tissue penetration can create images that mimic pneumonia or fluid overload, leading AI astray. Radiologists, of course, know to account for this.\n\nIn surgery, I’ve seen  glowing references to “robotic surgery.” In reality, most surgical robots are nothing more than precision instruments controlled entirely by the surgeon who remains in the operating room, one of the benefits being that they do not have to scrub in. The robots are tools—not autonomous operators.\n\nSomeday, AI may become a powerful diagnostic tool in medicine. But its greatest promise, at least for now, lies not in diagnosis or treatment but in administration: things lim scheduling and billing. As it stands today, its impact on the actual practice of medicine has been minimal.",
        "url": "https://www.reddit.com/r/artificial/comments/1n0kgcg/i_work_in_healthcareai_is_garbage/",
        "publishDate": "2025-08-26T12:27:16Z[Etc/UTC]",
        "author": "ARDSNet",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "7",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0izfo",
        "title": "Why Superintelligence Leads to Extinction - the argument no one wants to make",
        "content": "Most arguments about AI and extinction focus on contingency: “if we fail at alignment, if we build recklessly, if we ignore warnings, then catastrophe may follow.”\n\nMy argument is simpler, and harder to avoid. **Even if we try to align AGI, we can’t win.** The very forces that will create superintelligence - capitalism, competition, the race to optimise - guarantee that alignment cannot hold.\n\nSuperintelligence doesn’t just create risk. It creates an inevitability. Alignment is structurally impossible, and extinction is the terminal outcome.\n\nI’ve written a book-length argument setting out why. It’s free to read, download, listen to, and there is a paperback available for those who prefer that. I don’t want approval, and I’m not selling attention. I want people to see the logic for themselves.\n\n“Humanity is on the verge of creating a genie, with none of the wisdom required to make wishes.”\n\n*- Driven to Extinction: The Terminal Logic of Superintelligence*\n\nGet it [here.](https://www.axiomaticextinction.com/)",
        "url": "https://www.reddit.com/r/artificial/comments/1n0izfo/why_superintelligence_leads_to_extinction_the/",
        "publishDate": "2025-08-26T11:15:08Z[Etc/UTC]",
        "author": "Malor777",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0hb1s",
        "title": "Rural Safe Initiative #49 | Messengers (Home Invasion Warning)",
        "content": "RURAL SAFE INITIATIVE \nCommunity safety bulletin \nThreat:  “Messengers” \n Release date: 06/14/2014 \n Classification: Public \n\nSummary: \nIn recent weeks, RSI has recorded an unusual increase in reports concerning entities known as “Messengers.”  \n\nThese manifestations appear as flickering humanoid silhouettes, most often in rural and peripheral areas, with higher frequency during nighttime hours and in close proximity to family residences. \n\n Incident pattern: \n“Messengers” typically appear hours or days before home intrusion incidents. \n\nSuch intrusions have culminated in the disappearance of mothers and children from the household. \n\nEvery confirmed victim shared a common background: families who had recently relocated from urban centers to rural, traditionally conservative communities. \n\n Assessment and public warning: \nContrary to popular belief, preliminary findings indicate that “Messengers” are not the actual threat. Evidence suggests their presence may be an attempt to warn before the real attack occurs, rather than being the cause of it. \n\nThis pattern raises troubling questions about who or what is behind the aggressions and why they appear to systematically target families who have chosen to leave the major cities. \n\n \n\nRural Safe Initiative recommendations: \n\nDo not panic at the sighting of a “Messenger,” but immediately enact precautionary measures. \n\nMaintain constant contact with neighbors and local support networks. \n\nReport sightings to 977 – Rural Emergency Line. \n\nAvoid staying outdoors at night without company. \n\nRecord and back up any unusual activity, storing copies offsite. \n\n \n\nConclusion: \n RSI urges all rural communities to remain united and vigilant. The apparent targeting of families seeking life outside the metropolitan grid cannot be ignored.  \n\nSafety begins with information and neighbor-to-neighbor cooperation.",
        "url": "https://v.redd.it/p83u9oxt1clf1",
        "publishDate": "2025-08-26T09:37:04Z[Etc/UTC]",
        "author": "Megatronagaming",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0f7yf",
        "title": "🌳 342,465 Trees Cut Down Every Hour! 🌳",
        "content": "Deforestation is destroying the Earth’s “oxygen factories,” harming air quality and throwing ecosystems out of balance.\n\nPharmacies print Consumer Medicine Information (CMI) leaflets for new prescriptions upon patient's request. This contributes to deforestation🪾. How can we mitigate this problem? \n\nThis is where AI comes to play! It provides digital counselling and reduces the need for printed CMI 📄 AI will help us move toward a more sustainable future.\n\nLet’s save trees and protect our planet🌎🌳\n",
        "url": "https://www.reddit.com/r/artificial/comments/1n0f7yf/342465_trees_cut_down_every_hour/",
        "publishDate": "2025-08-26T07:19:20Z[Etc/UTC]",
        "author": "Sherryygstan",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0f3ya",
        "title": "AI sycophancy isn't just a quirk, experts consider it a 'dark pattern' to turn users into profit",
        "content": "[No content]",
        "url": "https://techcrunch.com/2025/08/25/ai-sycophancy-isnt-just-a-quirk-experts-consider-it-a-dark-pattern-to-turn-users-into-profit/",
        "publishDate": "2025-08-26T07:11:51Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ex9k",
        "title": "\"AI is slowing down\" stories have been coming out consistently - for years",
        "content": "[No content]",
        "url": "https://i.redd.it/bh09t4y7bblf1.png",
        "publishDate": "2025-08-26T06:59:58Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "30",
            "commentCount": "24",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ck4e",
        "title": "Have there been any studies into a fully automated society?",
        "content": "With A.I only getting more and more integrated into our lives, has there been much study or research into an economy or social construct that runs on full automation?\n\nIf every job was run by A.I, have we discussed the idea of society without the need for manual labor?",
        "url": "https://www.reddit.com/r/artificial/comments/1n0ck4e/have_there_been_any_studies_into_a_fully/",
        "publishDate": "2025-08-26T04:34:48Z[Etc/UTC]",
        "author": "MumboMan2",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ccql",
        "title": "One-Minute Daily AI News 8/25/2025",
        "content": "1. Elon Musk’s **xAI** sues Apple and OpenAI over AI competition, App Store rankings.\\[1\\]\n2. Will Smith Accused of Creating an AI Crowd for Tour Video.\\[2\\]\n3. **Robomart** unveils new delivery robot with $3 flat fee to challenge DoorDash, Uber Eats.\\[3\\]\n4. **Nvidia** faces Wall Street’s high expectations two years into AI boom,\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.reuters.com/legal/litigation/elon-musks-xai-sues-apple-openai-over-ai-competition-app-store-rankings-2025-08-25/](https://www.reuters.com/legal/litigation/elon-musks-xai-sues-apple-openai-over-ai-competition-app-store-rankings-2025-08-25/)\n\n\\[2\\] [https://www.rollingstone.com/music/music-news/will-smith-ai-crowd-tour-video-1235415353/](https://www.rollingstone.com/music/music-news/will-smith-ai-crowd-tour-video-1235415353/)\n\n\\[3\\] [https://techcrunch.com/2025/08/25/robomart-unveils-new-delivery-robot-with-3-flat-fee-to-challenge-doordash-uber-eats/](https://techcrunch.com/2025/08/25/robomart-unveils-new-delivery-robot-with-3-flat-fee-to-challenge-doordash-uber-eats/)\n\n\\[4\\] [https://www.cnbc.com/2025/08/25/nvidia-q2-earnings-preview-expectations-blackwell-china-h20.html](https://www.cnbc.com/2025/08/25/nvidia-q2-earnings-preview-expectations-blackwell-china-h20.html)",
        "url": "https://www.reddit.com/r/artificial/comments/1n0ccql/oneminute_daily_ai_news_8252025/",
        "publishDate": "2025-08-26T04:23:23Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0c4sq",
        "title": "OpenAI announces 5 lakh free ChatGPT licenses for teachers, students in India, and a Rs 4.5 crore research grant to IIT-Madras.",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1n0c4sq",
        "publishDate": "2025-08-26T04:11:05Z[Etc/UTC]",
        "author": "mrnathani",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0bzt3",
        "title": "AI will replace doctors..?",
        "content": "I have been reading a lot of arguments for both sides. How microsoft claims that their model helps diagnose 4x more efficiently vs how the assessment made by microsoft was dubious in the sense that they locked individual doctors in a room with no access to internet or medical journals and gave them rarest of rare diseases to diagnose.  \n\nI am very confused so I want to understand how is AI going to \"augment\" doctors, rather than \"replace\" them. \n\nOr well - if it will actually replace them? ",
        "url": "https://www.reddit.com/r/artificial/comments/1n0bzt3/ai_will_replace_doctors/",
        "publishDate": "2025-08-26T04:03:37Z[Etc/UTC]",
        "author": "Darkklordd1801",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n0ao9k",
        "title": "Monetizing AI apps with ads? Billing methods for AI apps?",
        "content": "I've observed that many AI labs are not running profitable business models. The cost of compute far exceeds revenues, due to the high volume of non-paying users. In order for AI to remain free for users, model providers and AI app developers must find ways to monetize without shifting high compute cost onto users.\n\nThis echoes the growth of the internet for me. What was once free web browsing had to become monetized with advertising so that web publishers and search engines could fund their infrastructure costs. Since the realm of computing and the internet is changing to a new format, LLMs, it's really inevitable that these LLMs must also monetize in a similar way\n\nSince the future is multi-model, and developers rely on AI model routers to build, I figured it must be necessary to bundle AI routing with ads monetization in a single API. This will be the vertically integrated AI development stack of the future.\n\nAs users diversify the amount of AI apps they use, they'll also not want to maintain many subscriptions but instead get billed for their usage. Not enough apps just bill for usage.\n\nCurious to get feedback here: thoughts on usage-based pricing? AI ads in LLMs (for genAI frontends)? Opinions on the best AI dev platforms out there?\n\nI'm working on a project to do all this, and want to hear more thoughts on where the AI software space will go from here on out. Feel free to give feedback:  \n[https://sudoapp.dev/](https://sudoapp.dev/)\n\n[https://docs.sudoapp.dev/overview/introduction](https://docs.sudoapp.dev/overview/introduction)",
        "url": "https://www.reddit.com/r/artificial/comments/1n0ao9k/monetizing_ai_apps_with_ads_billing_methods_for/",
        "publishDate": "2025-08-26T02:55:24Z[Etc/UTC]",
        "author": "GioZaarour",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n094zu",
        "title": "NYT piece on an all-female hacker house, and how the AI boom is set to 'perpetuate the tech industry’s demographics'.",
        "content": "\\[M50s\\] Why is tech apparently overwhelmingly male-centric? Is it because women aren't interested, or they don't feel welcome to participate? Some subs like aivideo seem to me to be functionally hostile to women, with the amount of hyper-sexualised bimbo/waifu clips posted there. What do people think? What are the implications for the industry and wider society? \n\nWill any women see or respond to this post? ",
        "url": "https://www.instagram.com/p/DNxsIsDQFBQ",
        "publishDate": "2025-08-26T01:41:42Z[Etc/UTC]",
        "author": "Roy4Pris",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n06q53",
        "title": "Why GPT-5 Fails: Science Proves AGI is a Myth",
        "content": "[No content]",
        "url": "https://www.youtube.com/watch?v=4bmpdrP5kI0",
        "publishDate": "2025-08-25T23:52:33Z[Etc/UTC]",
        "author": "World-Tight",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n06az0",
        "title": "Life in the Inner Earth | A I Official Trailer (2025)",
        "content": "What if the hood was forced underground? *Life in the Inner Earth* is a raw, hyper-realistic AI trailer that takes you beneath the surface—where families, hustlers, and survivors build a new life under a buried city. From abandoned tunnels turned into apartments, to makeshift stores run by creatures of the underground, this trailer gives you a haunting first look at a world hidden beneath our feet.",
        "url": "https://www.reddit.com/r/artificial/comments/1n06az0/life_in_the_inner_earth_a_i_official_trailer_2025/",
        "publishDate": "2025-08-25T23:34:12Z[Etc/UTC]",
        "author": "Creative-Algae4092",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1n00f7k",
        "title": "Weird creature found in mountain!!!",
        "content": "gemini pro discount? Ping",
        "url": "https://v.redd.it/mfcgvkl0y7lf1",
        "publishDate": "2025-08-25T19:40:22Z[Etc/UTC]",
        "author": "shadow--404",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "582",
            "commentCount": "38",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzxcjb",
        "title": "Coinbase CEO urged engineers to use AI—then shocked them by firing those who wouldn’t: ‘I went rogue’",
        "content": "[No content]",
        "url": "https://fortune.com/2025/08/25/coinbase-ceo-brian-armstrong-ai-coding-assistants-mandate-tech/",
        "publishDate": "2025-08-25T17:45:18Z[Etc/UTC]",
        "author": "fortune",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "33",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzwdbi",
        "title": "AI Agents in 2025: From Chatbots to Autonomous Workflows (plus my n8n weekend project)",
        "content": "We’ve gone from:\n\n* 2023 → ChatGPT (conversation)\n* 2024 → Copilots (assistance)\n* 2025 → **AI Agents** that can reason, plan, and take action.\n\nThese agents aren’t just chatbots they’re running workflows, integrating with APIs, and making decisions once handled by humans.\n\n💡 Over the weekend, I built a small automation project with **n8n**:\n\n* AI generates short video scripts\n* n8n orchestrates the workflow\n* Video + music compiled automatically\n* Published directly to YouTube hands-free\n\nhttps://preview.redd.it/icgiw0w277lf1.png?width=1536&format=png&auto=webp&s=0127bde01812e67ef939efeb2847e2b87c918b1c\n\nIt made me realize how close we are to **AI-driven workflows becoming mainstream**.  \n\n\nI also wrote a detailed article exploring:\n\n* What AI agents really are\n* Why this shift is happening *now*\n* The impact on business and talent\n* Risks leaders should watch for\n\n🔗 [https://www.linkedin.com/posts/activity-7365788585565777921-rWKI?utm\\_source=share&utm\\_medium=member\\_desktop&rcm=ACoAACqaPLkBXOFtthzfpNoqp6aI3Zr5kbGWGCc](https://www.linkedin.com/posts/activity-7365788585565777921-rWKI?utm_source=share&utm_medium=member_desktop&rcm=ACoAACqaPLkBXOFtthzfpNoqp6aI3Zr5kbGWGCc)",
        "url": "https://www.reddit.com/r/artificial/comments/1mzwdbi/ai_agents_in_2025_from_chatbots_to_autonomous/",
        "publishDate": "2025-08-25T17:09:20Z[Etc/UTC]",
        "author": "Miracle_ghost_",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzuzzd",
        "title": "Elon Musk’s xAI is suing OpenAI and Apple",
        "content": "[No content]",
        "url": "https://www.theverge.com/news/765171/elon-musk-apple-openai-antitrust-lawsuit",
        "publishDate": "2025-08-25T16:19:34Z[Etc/UTC]",
        "author": "theverge",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "127",
            "commentCount": "52",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzubyc",
        "title": "Seamless Cinematic Transition ?? (prompt in comment) Try",
        "content": "**More cool prompts on my profile Free** 🆓\n\n❇️ **Here's the Prompt** 👇🏻👇🏻👇🏻\n\n\n```\nJSON prompt : {\n\"title\": \"One-Take Carpet Pattern to Cloud Room Car and Model\",\n\"duration_seconds\": 12,\n\"look\": {\n\"style\": \"Hyper-realistic cinematic one take\",\n\"grade\": \"Warm indoor → misty surreal interior\",\n\"grain\": \"Consistent film texture\"\n},\n\"continuity\": {\n\"single_camera_take\": true,\n\"no_cuts\": true,\n\"no_dissolve\": true,\n\"pattern_alignment\": \"Arabic carpet embroidery pattern stays continuous across wall, smoke, car body, and model's dress\"\n},\n\"camera\": {\n\"lens\": \"50mm macro → slow pull-back to 35mm wide\",\n\"movement\": \"Start with extreme close-up of an embroidered Arabic carpet pattern. Camera glides back to reveal the pattern covering an entire wall. Without any cut, the embroidery expands into dense rolling clouds filling the room. The same continuous pattern appears on a car emerging slowly through the fog. As the camera glides wider, a beautiful 30-year-old woman stands beside the car, wearing a flowing dress with the exact same Arabic embroidery pattern.\",\n\"frame_rate\": 24,\n\"shutter\": \"180°\"\n},\n\"lighting\": {\n\"time_of_day\": \"Golden hour interior light\",\n\"style\": \"Warm lamp tones blending into cool fog diffusion\"\n},\n\"scene_notes\": \"The Arabic pattern must remain continuous and perfectly aligned across carpet, wall, clouds, car, and the model’s dress. All elements should look hyper-realistic and cinematic, part of one single uninterrupted take.\"\n}\n\n```\nBtw Gemini pro discount?? Ping",
        "url": "https://v.redd.it/1rs2q6fut6lf1",
        "publishDate": "2025-08-25T15:55:10Z[Etc/UTC]",
        "author": "shadow--404",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mztpmw",
        "title": "The air is hissing out of the overinflated AI balloon",
        "content": "[No content]",
        "url": "https://www.theregister.com/2025/08/25/overinflated_ai_balloon/",
        "publishDate": "2025-08-25T15:32:17Z[Etc/UTC]",
        "author": "yourbasicgeek",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzsao2",
        "title": "Robot boxing/olympics between teams or countries would advance humanoid AI and increase investment",
        "content": "After seeing the first (rather hilarious) robotics Olympics, it got me thinking. Why not have two robots in the ring, designed and programmed by different teams to beat the competition.\n\nMuch like racing with car manufacturers trying to gain promotional exposure.\n\nThis would allow greater advancements in vision, stability and all sorts of other fields. As well as provide room for advertising and betting.\nWhile they are in their early stages, now seems like a good time.\n\nAnd I hate the idea of humanoid robots personally, but I figure you can't stave off the eventuality.",
        "url": "https://www.reddit.com/r/artificial/comments/1mzsao2/robot_boxingolympics_between_teams_or_countries/",
        "publishDate": "2025-08-25T14:40:09Z[Etc/UTC]",
        "author": "Interesting-You-7028",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzrlas",
        "title": "Open-Source Agentic AI for Company Research",
        "content": "I open-sourced a project called Mira, an agentic AI system built on the OpenAI Agents SDK that automates company research.\n\nYou provide a company website, and a set of agents gather information from public data sources such as the company website, LinkedIn, and Google Search, then merge the results into a structured profile with confidence scores and source attribution.\n\nThe core is a Node.js/TypeScript library (MIT licensed), and the repo also includes a Next.js demo frontend that shows live progress as the agents run.\n\nGitHub: [https://github.com/dimimikadze/mira](https://github.com/dimimikadze/mira)",
        "url": "https://www.reddit.com/r/artificial/comments/1mzrlas/opensource_agentic_ai_for_company_research/",
        "publishDate": "2025-08-25T14:12:18Z[Etc/UTC]",
        "author": "DimitriMikadze",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzqd6e",
        "title": "What AI plan for work?",
        "content": "I have been using a combination of Github Copilot, Cursor, and Gemini Advanced pretty regularly to work on a variety of work projects. A part of this is maintaining a knowledge base (Obsidian), a part is keeping meeting notes, building project plans, weekly/monthly/quarterly planning, documentation, etc., and a part is building various python programs for business needs. \n\nI have had good success with the mid-tier plans for Cursor and Github Copilot (im actually kinda done with this one because the AI tooling is kindve ass), as well as an advanced subscription for Gemini (i love Gemini 2.5 Pro...for the most part). However, I feel like I am reaching the point where I want more advanced tooling. I want the ability to use Gemini Deep Think, GPT-5 Pro (or high), Opus, etc. But I dont know which one i should get, or if I should invest instead in one of the AI platforms, like getting a Cursor Max plan (200/mo)? Should I get Claude Code with their max plan? \n\nI do not know what will suit my usecase better here, but i do know my boss would approve me getting one of them (and probably keeping lower tier plans for the others). What has worked for you guys?",
        "url": "https://www.reddit.com/r/artificial/comments/1mzqd6e/what_ai_plan_for_work/",
        "publishDate": "2025-08-25T13:22:34Z[Etc/UTC]",
        "author": "cmkinusn",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1mzph3r",
        "title": "Founder of Google's Generative AI Team Says Don't Even Bother Getting a Law or Medical Degree, Because AI's Going to Destroy Both Those Careers Before You Can Even Graduate",
        "content": "[No content]",
        "url": "https://futurism.com/former-google-ai-exec-law-medicine",
        "publishDate": "2025-08-25T12:44:55Z[Etc/UTC]",
        "author": "Old_Glove9292",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "77",
            "isNsfw": "false"
        }
    },
    {
        "id": "zdpXNC6DwoY",
        "title": "Deepseek V3.1 Code: This REALLY THROWS Claude Code into the TRASH! (+V3.1 Test Results)",
        "content": "Visit MicroSaaSFast: https://www.microsaasfast.me/ Visit Byterover: https://www.byterover.dev/?source=ack4 In this video, I'll be ...",
        "url": "https://www.youtube.com/watch?v=zdpXNC6DwoY",
        "publishDate": "2025-08-25T09:15:13Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/zdpXNC6DwoY/hqdefault.jpg",
            "transcription": "Hi, welcome to another video. So, DeepSeek V3.1 was launched, but the major info about it wasn't available before. Now it is available, and the TLDR is that it is a hybrid reasoning model that can basically do both reasoning and non-reasoning tasks. This allows for efficient performance. It also now has much better tool calling support, which was one of the major pain points of DeepSeek R1 and V3. It now scores way better in multiple tool calling benchmarks and works much better in things like Cline, Roo, and Opencode. Similarly, they have also increased the context limit to 128k from 65k, which is a great upgrade as well. The model endpoints still exist the same way, which is DeepSeek Chat for the general model and the reasoning endpoint for the reasoning variant instead of anything like reasoning effort. The performance is really improved here. On my benchmark, the model is way better now, even without reasoning. It can create floorplans pretty well. Though they are not the best, the one-shot generation that just works for a model this cheap is awesome. The SVG panda with the burger is one of the best I have seen yet. It is actually usable, which is not even something that Opus can make. The autoplay chess also works pretty well. It doesn't always make legal moves, but it is still better than many other generations. The flying butterfly is also kind of cool. And overall, the stuff is really good. If we talk about the reasoning variant, then it is also good, but not as good as the non-reasoning variant, at least for coding. So yeah, it's not as great, at least for coding. But the non-reasoning model is actually amazing. In Hater leaderboards, it also comes close to Opus for way cheaper pricing, which is quite awesome for an open and cheaper model. It's really good. And I think it is now one of the best options to be a drop-in replacement for Sonnet. And that's what DeepSeek also thinks, because they themselves now provide an Anthropic API format, along with details to make it a drop-in replacement in Claude code and use this model. I've been using it, and it is really awesome. It feels a lot like Sonnet, but it's 20x cheaper. So yeah, that's a great deal. Let me show you how you can also do the same and use it in interesting ways. But before we do that, let me tell you about today's sponsor. MicroSaas Fast. Dreaming of launching a MicroSaas or AI side project, but wasting weeks setting up auth, payments, and SEO? Check out MicroSaas Fast. A Next.js boilerplate with Clerk, Stripe, Resend, PostgreSQL, and AI instructions that cut hallucinations by 90% for five coding. Easy back-end integration with Python, Node, and Go. It is built and used by a CTO who helped 50+ founders to launch Saas in the past year. You can save 50+ hours and actually ship faster. Check now. Link is in the description. Now, back to the video. First, make sure that you have Claude code installed and upgraded to the latest version. You can do either of them with the same command. Once that is done, you can export the environment variables for base URL as DeepSeek's Anthropic base URL. Along with auth token, model, and also the small fast model as DeepSeek Chat model. Also, OpenRouter doesn't support Anthropic format. So, you can use Claude code router for that, or a better option that I use is Requesty, as it is way better than OpenRouter in terms of configuration and customization. It also comes with Anthropic compatible format. And you should be able to use almost any model from there. I am going to be using DeepSeek from there, but you can use the original API as well. For Requesty, you'd just have to change the base URL to support Requesty, as written in their docs. And then just add deepseek/ in front of the DeepSeek Chat endpoint, and it should work. It actually works pretty well. The slash commands here all work fine, along with MCPs, which also work fine. For example, I use the Bytrover MCP here because I really like it for a memory layer. It allows you to plug it into all kinds of coders, and it can create memories that are synced across all your coders. You can also share it with your teammates, which allows you to build rules and memories that stick to your projects. So yeah, this is something that I use, and you can easily get it configured on Claude Code. Just do that, and you'll get some better results. For example, here I have it started in a Next.js project. I'm going to ask it to make me a simple movie tracker app that uses the TMDB API for the database. And what you'll see is that it actually goes ahead and works amazingly well. It can do most of the tool calling without failing, which was a big downside in the previous version. But now, it is amazingly better and actually works on par with Sonnet while being 20 times cheaper. Literally. So yeah, it's awesome. It can also use the To Do list stuff, as well as MCPs without any issues. It's really great. For planning, you can change the model to DeepSeek's reasoning variant as well, if you wish to do that. Anyway, the speed of the model is also now way better. It's probably because they don't need to deploy two models anymore, and just one works, which produces way better speeds now and works well. So, it's pretty usable now. Anyway, in a bit, it gets it done. And you can see that it did this well without any major errors. And we can now go ahead and use it. It looks pretty great. It's on par with what Sonnet makes in one shot, while being a lot cheaper and pretty similar. So yeah, this makes a lot of sense to use. I prefer it over GLM for replacing in Claude, as it's pretty great now. I was thinking DeepSeek V3.1 was not as good at first, but as I used it, it felt like DeepSeek actually addressed almost all the major pain points of the original model, like tool calling, MCP support, and everything. It now works way better, and is also way better at coding. So yeah, I'd highly recommend you check this out. It's an awesome model. I don't know what happened with the reasoning variant. They probably just have that for things like mathematics, because the non-reasoning variant now works amazingly well for coding. And there's probably no need to use Sonnet for trivial tasks, which saves a ton of money and costs. I really like it. Go ahead and check it out and use it all you want. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye."
        }
    },
    {
        "id": "39I6CiP7rqM",
        "title": "Big Pharmas $1.6 Trillion Dilemma",
        "content": "",
        "url": "https://www.youtube.com/watch?v=39I6CiP7rqM",
        "publishDate": "2025-08-25T18:40:08Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/39I6CiP7rqM/hqdefault.jpg",
            "transcription": "[ 0m0s402ms - 0m3s272ms ] IN BIOPHARMA WHAT WE'RE ACTUALLY SEEING IS THAT\n[ 0m4s332ms - 0m11s652ms ] THERE'S A VERY CONSISTENT DECREASE IN THE NUMBER OF NEW MEDICINES THAT WE'RE ABLE TO INVENT PER BILLION DOLLARS INVESTED AND THIS TREND ACTUALLY STARTS WAY BACK IN THE 1950S AND PERSISTS THROUGH\n[ 0m12s22ms - 0m18s262ms ] TECHNOLOGICAL TRANSITIONS ALONG THE WAY WHEN WE'VE DEVELOPED MEDICINES WE GO AFTER FAIRLY NARROW\n[ 0m18s262ms - 0m21s342ms ] INDICATIONS, MEANING DISEASES THAT FAIRLY SMALL NUMBERS OF PEOPLE GET.\n[ 0m21s342ms - 0m26s642ms ] And that's actually increased in terms of the narrow scope of what medicines are addressing as we've gone\n[ 0m26s642ms - 0m29s672ms ] FORWARD IN TIME. And so there's a sort of an ironic situation\n[ 0m29s672ms - 0m35s962ms ] WHERE WE'VE GONE FROM ADDRESSING PRETTY BROAD CATEGORIES OF DISEASE LIKE INFECTIOUS DISEASE TO NARROWER AND NARROWER GENETICALLY DEFINED DISEASES THAT HAVE\n[ 0m35s962ms - 0m39s202ms ] SMALL PATIENT POPULATIONS BECAUSE THESE ONLY AFFECT A FEW PEOPLE.\n[ 0m39s202ms - 0m46s222ms ] If you think about the value function of a medicine is how many years of healthy life does it give how many people? If how many people is pretty small, it just really bounds the amount of value you're able to generate.\n[ 0m46s222ms - 0m49s222ms ] So you need to then be able to find medicines that treat most people."
        }
    }
]