[
    {
        "id": "https://news.smol.ai/issues/25-07-22-not-much/",
        "title": "not much happened today",
        "content": "**Moonshot AI** released the **Kimi K2**, a 1-trillion parameter ultra-sparse Mixture-of-Experts (MoE) model with the **MuonClip** optimizer and a large-scale agentic data pipeline using over **20,000 tools**. Shortly after, **Alibaba** updated its **Qwen3** model with the **Qwen3-235B-A22B** variant, which outperforms Kimi K2 and other top models on benchmarks like **GPQA** and **AIME** despite being 4.25x smaller. Alibaba also released **Qwen3-Coder-480B-A35B**, a MoE model specialized for coding with a 1 million token context window. **Google DeepMind** launched **Gemini 2.5 Flash-Lite**, a faster and more cost-efficient model outperforming previous versions in coding, math, and multimodal tasks. The MoE architecture is becoming mainstream, with models like **Mistral**, **DeepSeek**, and **Kimi K2** leading the trend. In mathematics, an advanced **Gemini** model achieved a gold medal level score at the **International Mathematical Olympiad (IMO)**, marking a first for AI. An **OpenAI** researcher noted their IMO model \"knew\" when it did not have a correct solution, highlighting advances in model reasoning and self-awareness.",
        "url": "https://news.smol.ai/issues/25-07-22-not-much/",
        "publishDate": "2025-07-22T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "moonshot-ai, alibaba, google, google-deepmind, openai, hugging-face, vllm-project, kimi-k2, qwen3-235b-a22b, qwen3-coder-480b-a35b, gemini-2.5-flash-lite, mistral-7b, deepseek-v3, demishassabis, rasbt, alexwei_, yitayml, mixture-of-experts, agentic-ai, model-optimization, model-training, benchmarking, code-generation, long-context, multimodality, math, reinforcement-learning, model-architecture, model-performance, open-source, alignment"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=211464",
        "title": "LOBO EV Unveils $3M AI Senior Mobility Robot Launching Oct 2025",
        "content": "<p>Strategic Partnership with Jiangsu Research Institute of Dalian University of Technology Fuels Entry Into Smart Healthcare Market LOBO EV Technologies Ltd. (NASDAQ: LOBO) (“LOBO” or the “Company”), a leading manufacturer and innovator in electric mobility and intelligent systems, today announced a strategic partnership with the Jiangsu Research Institute of Dalian University...</p>\n<p>The post <a href=\"https://ai-techpark.com/lobo-ev-unveils-3m-ai-senior-mobility-robot-launching-oct-2025/\">LOBO EV Unveils $3M AI Senior Mobility Robot Launching Oct 2025</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/lobo-ev-unveils-3m-ai-senior-mobility-robot-launching-oct-2025/",
        "publishDate": "2025-07-22T17:15:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai, ai technology, AItech news, aitechpark news, artificial intelligence, cyber security companies, cyber security information, LOBO EV, Mobility Robot"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=211458",
        "title": "NTT Advances AI Accuracy, Security & Cost at ICML 2025",
        "content": "<p>Conference showcased the most innovative global breakthroughs in AI and ML&#160;fundamental research and development News Highlights: NTT Research, Inc. and NTT R&#38;D, divisions of NTT (TYO:9432), researchers presented twelve papers at the forty-second International Conference on Machine Learning (ICML), held July 13-19, 2025 in Vancouver. ICML 2025 is a leading global conference “dedicated to the...</p>\n<p>The post <a href=\"https://ai-techpark.com/ntt-advances-ai-accuracy-security-cost-at-icml-2025/\">NTT Advances AI Accuracy, Security & Cost at ICML 2025</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/ntt-advances-ai-accuracy-security-cost-at-icml-2025/",
        "publishDate": "2025-07-22T16:45:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Machine Learning, AI accuracy, ai machine learning, ai technology, aitechpark news, artificial intelligence, cyber security companies, cyber threats, NTT Advances"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=211455",
        "title": "Asylon Robotics Raises $24M Series B Led by Insight Partners",
        "content": "<p>Asylon, Inc., a leading provider of robotic perimeter security technology, today announced the close of its $24M&#160;Series B funding round, led by global software investor&#160;Insight Partners, with strategic participation from&#160;Veteran Ventures Capital,&#160;Allegion Ventures, and the&#160;GO PA Fund. This new capital will power Asylon’s next phase of growth—accelerating product innovation, scaling...</p>\n<p>The post <a href=\"https://ai-techpark.com/asylon-robotics-raises-24m-series-b-led-by-insight-partners/\">Asylon Robotics Raises $24M Series B Led by Insight Partners</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/asylon-robotics-raises-24m-series-b-led-by-insight-partners/",
        "publishDate": "2025-07-22T16:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai technology, aitechpark news, artificial intelligence, Asylon, cyber security, cyber threats, security technology"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=211452",
        "title": "Mobilicom Nets $1.4M Orders as Drone Maker Ramps for DoD Demand",
        "content": "<p>Accelerating order quantities from Tier-1 customer, with further mass production orders expected from potential Programs of Record with the U.S. Department of Defense (DoD) Mobilicom’s growth momentum is further driven by recent&#160;Executive Order&#160;from President Trump and statements from the DoD that advance adoption of drones for military and civilian applications...</p>\n<p>The post <a href=\"https://ai-techpark.com/mobilicom-nets-1-4m-orders-as-drone-maker-ramps-for-dod-demand/\">Mobilicom Nets $1.4M Orders as Drone Maker Ramps for DoD Demand</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/mobilicom-nets-1-4m-orders-as-drone-maker-ramps-for-dod-demand/",
        "publishDate": "2025-07-22T16:15:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, ai machine learning, ai technology, aitechpark news, cyber security companies, cyber threats, cybersecurity, Mobilicom Limited"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=211443",
        "title": "Eviden Powers AtLaS HLT Project Backed by EU Defence Fund",
        "content": "<p>Eviden sets the stage for AtLaS, the European Defence Fund challenge on Human Language Technology processing Selected by the European Commission, Eviden will provide a platform to integrate the applications and its own innovative human language processing application Eviden, the Atos Group product brand leading in advanced computing, cybersecurity products, mission-critical systems...</p>\n<p>The post <a href=\"https://ai-techpark.com/eviden-powers-atlas-hlt-project-backed-by-eu-defence-fund/\">Eviden Powers AtLaS HLT Project Backed by EU Defence Fund</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/eviden-powers-atlas-hlt-project-backed-by-eu-defence-fund/",
        "publishDate": "2025-07-22T15:30:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "NLP, ai and machine learning, ai technology, AItech news, aitechpark news, cyber security, cyber security companies, cyber threats, Eviden"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107163",
        "title": "Google’s newest Gemini 2.5 model aims for ‘intelligence per dollar’",
        "content": "<p>Google just dropped the stable version of Gemini 2.5 Flash-Lite and they&#8217;ve essentially created a model that&#8217;s designed to be the workhorse for developers who need to build things at scale without breaking the bank. Building cool things with AI can often feel like a frustrating balancing act. You want a model that’s smart and [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/googles-newest-gemini-2-5-model-aims-intelligence-per-dollar/\">Google&#8217;s newest Gemini 2.5 model aims for &#8216;intelligence per dollar&#8217;</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/googles-newest-gemini-2-5-model-aims-intelligence-per-dollar/",
        "publishDate": "2025-07-22T17:02:58Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Artificial Intelligence, Companies, Development, Google, ai, artificial intelligence, developers, development, gemini, google, models"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=107159",
        "title": "OpenAI and Oracle announce Stargate AI data centre deal",
        "content": "<p>OpenAI has shaken hands with Oracle on a colossal deal to advance the former’s colossal Stargate AI data centre initiative. It’s one thing to talk about the AI revolution in abstract terms, but it&#8217;s another thing entirely to grasp the sheer physical scale of what’s being built to make it happen. The foundations of our [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/openai-and-oracle-announce-stargate-ai-data-centre-deal/\">OpenAI and Oracle announce Stargate AI data centre deal</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/openai-and-oracle-announce-stargate-ai-data-centre-deal/",
        "publishDate": "2025-07-22T13:08:26Z[Etc/UTC]",
        "author": "Ryan Daws",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AGI, Artificial Intelligence, Companies, Data Center, Development, ai, artificial intelligence, data centres, development, openai, oracle, stargate, usa"
        }
    },
    {
        "id": "1m76eef",
        "title": "Best way to learn about ai advances?",
        "content": "Hey, which would be the best place to learn about stuff like where video generation is at currently, what can we expect, etc? Not tutorials, just news.\n\nI hate subreddits because these are always filled to the brim with layoff dramas and doomposts, I don't want to scroll by 99 of these just to find 1 post with actual news.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m76eef/best_way_to_learn_about_ai_advances/",
        "publishDate": "2025-07-23T11:12:00Z[Etc/UTC]",
        "author": "Murdash",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m76cxi",
        "title": "How will children be motivated in school in the AI future?",
        "content": "I’m thinking about my own school years and how I didn’t felt motivated to learn maths since calculators existed. Even today I don’t think it’s really necessary to be able to solve anything than the most simple math problems in your head. Just use a calculator for the rest!\n\nWith AI we have “calculators” than can solve any problem in school better than any student will be able to themselves. How will kids be motivated to e.g. write a report on the French Revolution when they know AI will write a much better report in a few seconds?\n\nWhat are your thoughts? Will the school system have to change or is there a chance teachers will be able to motivate children to learn things anyway?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m76cxi/how_will_children_be_motivated_in_school_in_the/",
        "publishDate": "2025-07-23T11:09:46Z[Etc/UTC]",
        "author": "penpaperodd",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m76b3d",
        "title": "Has AI hype gotten out of hand?",
        "content": "Hey folks, \n\nI would be what the community calls an AI skeptic. I have a lot of experiencing using AI. Our company (multinational) has access to the highest models from most vendors. \n\nI have found AI to be great at assisting everyday workflows - think boilerplate, low-level, grunt tasks. With more complex tasks, it simply falls apart. \n\nThe problem is accuracy. The time it takes to verify accuracy would be the time it took for me to code up the solution myself. \n\nNumerous projects that we planned with AI have simply been abandoned, because despite dedicating teams to implementing the AI solution it quite frankly is not capable of being accurate, consistent, or reliable enough to work. \n\nThe truth is with each new model there is no change. This is why I am convinced these models are simply not capable of getting any smarter. Structurally throwing more data is not going to solve the problem. \n\nA lot of companies are rehiring engineers they fired, because adoption of AI has not been as wildly successful as imagined. \n\nThat said the AI hype or AI doom and gloom is quite frankly a bit ridiculous! I see a lot of similarities to dotcom bubble emerging. \n\nI don’t believe that AGI will be achieved in the next 2 decades at least. \n\nWhat are your views? If you disagree with mine. I respect your opinion. I am not afraid to admit could very well be proven wrong. \n\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m76b3d/has_ai_hype_gotten_out_of_hand/",
        "publishDate": "2025-07-23T11:06:56Z[Etc/UTC]",
        "author": "Obvious-Giraffe7668",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "30",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m744tw",
        "title": "Banning OpenAI from Hawaii? AI wiretapping dental patients? Our first AI copyright class action? Tony Robbins sues \"his\" chatbots?  See all the new AI legal cases and rulings here!",
        "content": "Banning OpenAI from Hawaii? AI wiretapping dental patients? Our first AI copyright class action? Tony Robbins sues \"his\" chatbots?  See all the new AI legal cases and rulings here!\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1lu4ri5](https://www.reddit.com/r/ArtificialInteligence/comments/1lu4ri5/ai_court_cases_and_rulings_part_1_of_2)\n\nA service of ASLNN - The Apprehensive\\_Sky Legal News Network!^(SM) ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m744tw/banning_openai_from_hawaii_ai_wiretapping_dental/",
        "publishDate": "2025-07-23T08:54:31Z[Etc/UTC]",
        "author": "Apprehensive_Sky1950",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m73dct",
        "title": "Australian Scientists Achieve Breakthrough in Scalable Quantum Control with CMOS-Spin Qubit Chip",
        "content": "Researchers from the University of Sydney, led by Professor David Reilly, have demonstrated the world’s first CMOS chip capable of controlling multiple spin qubits at ultralow temperatures. The team’s work resolves a longstanding technical bottleneck by enabling tight integration between quantum bits and their control electronics, two components that have traditionally remained separated due to heat and electrical noise constraints.\n\n[https://semiconductorsinsight.com/cmos-spin-qubit-chip-quantum-computing-australia/](https://semiconductorsinsight.com/cmos-spin-qubit-chip-quantum-computing-australia/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m73dct/australian_scientists_achieve_breakthrough_in/",
        "publishDate": "2025-07-23T08:02:56Z[Etc/UTC]",
        "author": "EconomyAgency8423",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "12",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m730t6",
        "title": "Behavior engineering using quantitative reinforcement learning models",
        "content": "This passage outlines a study exploring whether quantitative models of choice precisely formulated mathematical frameworks can more effectively shape human and animal behavior than traditional qualitative psychological principles. The authors introduce the term “choice engineering” to describe the use of such quantitative models for designing reward schedules that influence decision-making.\n\nTo test this, they ran an academic competition where teams applied either quantitative models or qualitative principles to craft reward schedules aimed at biasing choices in a repeated two-alternative task. The results showed that the choice engineering approach, using quantitative models, outperformed the qualitative methods in shaping behavior.\n\nThe study thus provides a proof of concept that quantitative modeling is a powerful tool for engineering behavior. Additionally, the authors suggest that choice engineering can serve as an alternative approach for comparing cognitive models beyond traditional statistical techniques like likelihood estimation or variance explained by assessing how well models perform in actively shaping behavior.\n\n\nhttps://www.nature.com/articles/s41467-025-58888-y",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m730t6/behavior_engineering_using_quantitative/",
        "publishDate": "2025-07-23T07:40:11Z[Etc/UTC]",
        "author": "Flat-Wing-8678",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m72271",
        "title": "🚨 Catch up with the AI industry, July 23, 2025",
        "content": "* OpenAI & Oracle Partner for Massive AI Expansion\n* Meta Rejects EU's Voluntary AI Code\n* Google Eyes AI Content Deals Amidst \"AI Armageddon\" for Publishers\n* MIT Breakthrough: New AI Image Generation Without Generators\n* Dia Launches AI Skill Gallery; Perplexity Adds Tasks to Comet\n\nSources:  \n[https://openai.com/index/stargate-advances-with-partnership-with-oracle/](https://openai.com/index/stargate-advances-with-partnership-with-oracle/)\n\n[https://www.euronews.com/my-europe/2025/07/23/meta-wont-sign-eus-ai-code-but-who-will](https://www.euronews.com/my-europe/2025/07/23/meta-wont-sign-eus-ai-code-but-who-will)\n\n[https://mashable.com/article/google-ai-licensing-deals-news-publishers](https://mashable.com/article/google-ai-licensing-deals-news-publishers)\n\n[https://news.mit.edu/2025/new-way-edit-or-generate-images-0721](https://news.mit.edu/2025/new-way-edit-or-generate-images-0721)\n\n[https://techcrunch.com/2025/07/21/dia-launches-a-skill-gallery-perplexity-to-add-tasks-to-comet/](https://techcrunch.com/2025/07/21/dia-launches-a-skill-gallery-perplexity-to-add-tasks-to-comet/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m72271/catch_up_with_the_ai_industry_july_23_2025/",
        "publishDate": "2025-07-23T06:38:22Z[Etc/UTC]",
        "author": "psycho_apple_juice",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m71ltk",
        "title": "What can we do to roll back the over reach of AI assisted surveillance in our democracies?",
        "content": "There’s been a lot of discussion about the rise of the Surveillance State (facial recognition, real time censorship etc), but far less about what can be done to arrest AI augmented surveillance creep.\n\nFor example, the UK already rivals China in the number of CCTV cameras per capita. \n\nBig Brother Watch. (2020). The state of surveillance in 2020: Facial recognition, data extraction & the UK surveillance state. https://bigbrotherwatch.org.uk/wp-content/uploads/2020/06/The-State-of-Surveillance-in-2020.pdf\n\nSo for me, a major step forward would be a full ban on biometric surveillance (facial recognition, iris and gait analysis etc) in public spaces, following the example of Switzerland.\n\nThe Swiss Federal Act on Data Protection (FADP, 2023) sets strong limits on biometric data processing.\n\nEuropean Digital Rights (EDRi) has also called for a Europe-wide ban: “Ban Biometric Mass Surveillance” (2020)\n\nPublic protest is probably the only way to combat it. Campaigns like ReclaimYourFace in Europe show real success is possible. \n\n\nReclaimYourFace: https://reclaimyourface.eu\n\nWhat other actions may help us reclaim our eroding digital freedom? What other forms of surveillance should we be rolling back?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m71ltk/what_can_we_do_to_roll_back_the_over_reach_of_ai/",
        "publishDate": "2025-07-23T06:10:03Z[Etc/UTC]",
        "author": "ferggusmed",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6zje0",
        "title": "Contract creation and review",
        "content": "I use ChatGPT for creation of contracts, and also to review contracts sent to me. I find it works good till the file I upload is ~30 pages long. However, if I input longer contracts, it seems to miss some nuances and contract elements; possibly a context window issue. Some have recommended breaking up the contract into parts to get over this, but it becomes difficult due to cross references in the contracts. Does anyone have tips to get over this problem successfully?\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6zje0/contract_creation_and_review/",
        "publishDate": "2025-07-23T04:10:58Z[Etc/UTC]",
        "author": "Chikka_chikka",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6z36b",
        "title": "One-Minute Daily AI News 7/22/2025",
        "content": "1. **Amazon** to buy AI company Bee that makes wearable listening device.\\[1\\]\n2. **Stargate** advances with 4.5 GW partnership with Oracle.\\[2\\]\n3. **Delta** plans to use AI in ticket pricing draws fire from US lawmakers.\\[3\\]\n4. **MIT** researchers found that special kinds of neural networks, called encoders or “tokenizers,” can do much more than previously realized.\\[4\\]\n\nSources included at: [https://bushaicave.com/2025/07/22/one-minute-daily-ai-news-7-22-2025/](https://bushaicave.com/2025/07/22/one-minute-daily-ai-news-7-22-2025/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6z36b/oneminute_daily_ai_news_7222025/",
        "publishDate": "2025-07-23T03:47:34Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ypff",
        "title": "Is my dream of becoming a forensic neuropsychologist feasible in the context of AGI?",
        "content": "**Preface (*****in reference to rule 5*****):** I’ve read through similar threads and understand concerns about “doomposting,” but my goal here isn’t to speculate about the end of the field. Rather, it is solely to ask for practical advice on how to *adapt* my training plan responsibly given the prospect of various imminent developments in AI. \n\nFor some context, I just watched [this YouTube video](https://www.youtube.com/watch?v=5KVDDfAkRgc). \n\nHere’s the situation: I’m about to start my first year of undergrad at community college, working toward an AA in Liberal Arts before transferring for a B.Sc. in Psychology. My long-term goal is to earn a Ph.D. in Clinical Psychology and specialize in both neuropsychology and forensic work. Ideally, I’d become double-board certified (ABPP-CN and ABPP-FP). I’m planning to get research and clinical experience in both areas along the way; starting with neuropsych during practicum and internship, then moving into forensic work postdoc.\n\nBut… what happens to that plan if AGI hits in the next 4–6 years? I’ll barely be done with undergrad. Is this career even viable by the time I’m fully trained? Will there still be demand for human experts in neuropsychological and forensic assessment?\n\nHere’s my current thinking: Even with AI, someone will still need to sign off on reports, defend conclusions in court, and apply judgment to risk. But I assume AI will take over a lot of the grunt work—drafting reports, flagging inconsistencies, simulating case outcomes, suggesting diagnoses, etc. So maybe the real shift will be in *how* we’re trained.\n\nDo you think that’s accurate? If you were just starting college now, what would you do to future-proof a career in this field? Especially skills that might give me an edge my peers won’t think about.\n\nI can't tell how much of the \"fear mongering\" is actually *just* fear mongering.\n\nI don't want to be part of the % of people who loses their job, or worse, doesn't have a job to go to in the first place.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6ypff/is_my_dream_of_becoming_a_forensic/",
        "publishDate": "2025-07-23T03:28:00Z[Etc/UTC]",
        "author": "Deep_Sugar_6467",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6yhat",
        "title": "Is anyone aware of a study to determine at which point replacing people with AI becomes counter productive?",
        "content": "To clarify, economically we should reach an unemployment level (or level of reduction to disposable income) where any further proliferation of AI will impact companies revenues. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6yhat/is_anyone_aware_of_a_study_to_determine_at_which/",
        "publishDate": "2025-07-23T03:16:34Z[Etc/UTC]",
        "author": "14MTH30n3",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "11",
            "commentCount": "49",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6wrz0",
        "title": "Realistly, how far are from full on blockbuster movies and full funcioning video games?",
        "content": "Will mainstream entertaiment media become a quest for the best prompt?\n\nI cant wait for Netflix with the \"Generate random movie\" button :)\n\nAlso, what games would you guys create and remaster \n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6wrz0/realistly_how_far_are_from_full_on_blockbuster/",
        "publishDate": "2025-07-23T01:53:27Z[Etc/UTC]",
        "author": "Capable-Deer744",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "32",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6vnya",
        "title": "What's up with big tech firms poaching AI talent?",
        "content": "What's up with big tech firms poaching AI talent?\n\nWhat specific skills/expertise justify dolling out such a huge compensations? This is good news  that talent is making such money but I am curious what specific expertise these people have over others with the AI?\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6vnya/whats_up_with_big_tech_firms_poaching_ai_talent/",
        "publishDate": "2025-07-23T01:01:06Z[Etc/UTC]",
        "author": "PrtScr1",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6vlym",
        "title": "AI is improving efficiency in governance, with grievances addressed 25% faster, says IT Secretary",
        "content": "(AI) can introduce efficiencies in governance, the Secretary for Electronics and Information Technology S. Krishnan said on Monday (July 21, 2025). Mr. Krishnan was delivering the Abhay Tripathi Memorial Lecture at the United Service Institution of India. “Grievances are now being addressed 25% faster on an average due to the use of AI in CP-GRAMS,” Mr. Krishnan said, referring to the Union Government’s main grievance redressal portal.\n\nMr. Krishnan said AI would also help in credit scoring and loan disbursement. “Formal lending remains extremely low in India,” he said. “A big business can get financing at 8-9%, but smaller or remote businesses get higher costs because of high administrative costs, and risks involved. Data flows from GST and other sources that can ascertain creditworthiness can help with access to debt.\n\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6vlym/ai_is_improving_efficiency_in_governance_with/",
        "publishDate": "2025-07-23T00:58:34Z[Etc/UTC]",
        "author": "Adventurous_Cod_432",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6v3un",
        "title": "Interesting prediction on the impact of superhuman AI over the next decade (link)",
        "content": "Interesting article written by some well-known AI researchers. I'm not sure which way I feel about it.   \n[https://ai-2027.com/race](https://ai-2027.com/race)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6v3un/interesting_prediction_on_the_impact_of/",
        "publishDate": "2025-07-23T00:35:14Z[Etc/UTC]",
        "author": "operablesocks",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ul5x",
        "title": "\"Wrong Instructions\" Spreadsheet, Impossible to find.",
        "content": "Hello,\n\nI've been looking for this Google Spreadsheet that compiled all recent instances of AI hallicinations & Misbehaviour compiled with some researcher at DeepMind. I cannot find any traces of it over ever existing apart from this [screenshot ](https://imgur.com/a/UxLzfwf)I have found in a Youtube video.  \nI remember it being published around mid-2025. \n\nDoes anyone know what happened to it, or know if it still exists?\n\nThanks!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6ul5x/wrong_instructions_spreadsheet_impossible_to_find/",
        "publishDate": "2025-07-23T00:10:52Z[Etc/UTC]",
        "author": "l_anchoret_l",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6u1v9",
        "title": "Thoughts about AI generated content and it's future irrelevance",
        "content": "What do we do in an age where most of the content is generated by AI?  Can it even be trusted at all?\n\nMy concern is a variation of the model collapse problem.  Lets call it the believability collapse problem.  If all of the content within a particular domain, say job listings, is largely AI generated, how can it even be trusted at all?  \n\nOne of the challenges in pre-AI life was learning how to write effectively.  Reading a resume gave you insight into the candidates thinking processes and also their communication abilities.  Put simply, a poorly written resume speaks volumes and is just as informative as a well written resume.  With AI, this goes away.  Very soon, every resume will look polished and be pretty much perfectly aligned for the job description.  Me being a people manager knows this is bullshit.  No-one is perfect.  A resume becomes worthless.  Sort of like a long-form business card.  \n\nThis will be the same for any and all mediated correspondence.  Emails, texts, voice mail, pretty much any mediated experience between two human beings will have to be seen as artificial.  I'd be willing to bet that we will need to have tags like \"written by a human\" attached to content as opposed to \"Written by AI\".  Or some realtime biometrics authentication which verify's an agents (human or artificial) identity on both sides of a two-way conversation.  Otherwise, by default, I will always HAVE to assume it may have been done by an AI.  \n\nThis leaves us with a problem... if I can't trust that anything sent to me by a supposed human being over a digital medium is trustworthy in it's provenance, then those forms of communication become less valued and/or irrelevant.  This would mean I would need to go back to solely face-to-face interactions.  If I need to go back to doing things old school (i.e. no-AI), then why would I invest in AI systems in the first place?\n\nTL;DR The speed of AI slop production and delivery may destroy mankind's ability to rely on the very media (text, audio, video, images) and mediums (internet) that got us here in the first place.  Seems like the Dark Forrest model may take hold faster than thought and be even worse than imagined. \n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6u1v9/thoughts_about_ai_generated_content_and_its/",
        "publishDate": "2025-07-22T23:47:08Z[Etc/UTC]",
        "author": "Overall-Insect-164",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6s8ik",
        "title": "We should be embracing AI, not fearing it",
        "content": "A lot of people are terrified of AI but honestly? It is One of the greatest efficiency improvements in modern history, and it's only going to get better. It can allow you to do things that you don't even have the time to do, and that's what's really so powerful about AI. You want to write a program with a graphical user interface but don't really have the time to do it? Just ask your robot friend and he will cook one right up for you in minutes. The idea behind that is so powerful. So incredibly beneficial for humanity. If millions, no, billions of people were all utilizing that every day, all at the same time, constantly. Can you imagine what we could achieve? \n\n\n**But people are afraid of AI**. Governments, companies, they continue to make bad decisions every single chance they can that don't actually help their employees or help society. So AI is feared Because of that. We shouldn't be fearing it though. It's not meant to be something that is feared, any sort of technology should be embraced and celebrated, like can you imagine if people were afraid of the vehicle or the train? No, I'd rather walk! Preposterous, right? Well, people are afraid of those things too, because everything has problems \n\n\n**AI has genuinely saved me so much time and frustration. It's going to be very beneficial to my life**. As a data scientist, I have people asking me constantly to write them SQL queries and retrieve data, and these people don't even know how to get a PowerPoint presentation working, they have to call IT help desk because they forgot their password and then they remember that they wrote it on a sticky note right in front of their face on the monitor... That's the kind of people that are asking for data and Python scripts, SQL queries, and that shit takes a long time! Sometimes I make mistakes and I don't know where I put the mistake or made the mistake in a 5,000 line SQL query, but I can have AI take a look and in seconds, it can identify it way faster than I can. That is amazing\n\n\n\n**A future with AI. What does it look like? Really?**\n\n\nA future with AI looks like any of those sci-fi shows or movies that you really enjoy. Huge cyberpunk cities, massive sprawling empires among the stars. Humanity does not have the capability to outpace its own greed, and its own bad decisions. People are struggling all over the world, and every single environment, every single city. Struggle is universal. You think we can get out to the stars or create a huge cyberpunk futuristic city ourselves in a short amount of time? We've started to regress as a society and as humanity. And like, we just don't have the resources or time to do everything that's required to push ourselves into the future. AI finally offers us a chance to do that. If we're talking about hundreds or thousands of agents, basically artificial people, that's basically like replicating tons of human beings, without actually making human beings and having to train them and do all that stuff. The power of that is unbelievable. We can build basically anything, and we can start expanding at a rate that we could never do before because we require rest, relaxation, time to unwind. Robots don't need all that shit. They just constantly work along and process things, which is exactly what we need",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6s8ik/we_should_be_embracing_ai_not_fearing_it/",
        "publishDate": "2025-07-22T22:29:19Z[Etc/UTC]",
        "author": "datascientist2964",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ruy0",
        "title": "Warning: unexpected (and unwanted) charges from ElevenLabs",
        "content": "I originally posted this in the ElevenLabs subreddit, but it was removed by mods over there, with no reason given, so... I decided I'd try another community.\n\nI signed up for ElevenLabs a while back thinking that maybe I'd put my voice out there and earn a few bucks here or there. So, back in December I signed up, made some recordings and uploaded them. After reviewing them, I wasn't super happy with the results, so I decided I needed to take some more time and effort to record some better samples. I wasn't in a super big hurry, and I got distracted with other things. So, I paid my $22 a month not really thinking much of it.\n\nBut then, out of the blue, on March 20, I received an invoice for $330.I found it to be quite unusual, because at this point, I had kind of forgotten about it, and I certainly wasn't using the service to do anything. Thinking maybe my account had been compromised, I logged in, changed my password enrolled in 2FA, and I emailed the company, thinking that maybe they will be willing to engage in a dialog to at least refund some amount of the charges. I changed my plan back to the free one thinking that maybe I had done something wrong with my plan settings, and just kind of assumed that this was the end of it. I attempted to delete my credit card, but I couldn't determine a way to do that, so I just kind of assumed that everything would be fine.\n\nBut, I never got a response. And everything was not fine. 7 days later, on March 27th, to my even greater surprise, I received another bill. This time for $1,320. This time, since ElevenLabs still hadn't responded to me, I immediately deleted my ElevenLabs account and I opened a Chargeback request with my Bank. Finally on May 23, my bank sent me a letter that the Chargeback was declined because ElevenLabs somehow validated that I made the charges and was responsible for them. You know, the company who couldn't bother to reach back out to me. I did (recently) open another ticket (305235) and this time they did reach out to me... to tell me that I should have reached out to them within 14 days and to send me a link to their [refund policy](https://help.elevenlabs.io/hc/en-us/articles/14315426883345-What-is-your-refund-policy). Helpful. Even then, the policy states that you are only eligible if \"no credit quota was used\", so I assume that would have made me ineligible anyways.\n\nSo, anyways, be careful out there. There is always someone looking to take advantage of their customers (or at best, resist efforts to engage with them in a meaningful way). Opinion from the other thread is that this was for API usage... I never used their API, and I never even recorded the API key in my password manager, so... if that was the case with this billing, that means someone managed to guess my API key or ElevenLabs leaked or exposed it somehow. Make sure you disable access to your ElevenLabs API if you aren't using it. If you are, rotate those keys often. Audit your credit usage, don't trust ElevenLabs to track it correctly (there was more than one post in the other thread about people who had concerns that theirs wasn't being counted correctly).",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6ruy0/warning_unexpected_and_unwanted_charges_from/",
        "publishDate": "2025-07-22T22:13:37Z[Etc/UTC]",
        "author": "joshio",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "10",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6rkin",
        "title": "Exploring natural ChatGPT integration inside textboxes – building a browser extension to do it",
        "content": "Hi all,  \nI’m currently working on a Chrome extension that allows users to type prompts like `gpt summarize this` directly inside any textbox (Linkedin, Twitter, etc.) and get an AI-generated response inserted inline.\n\nIf the textbox is too complex (e.g., Notion’s nested editors), it opens a spotlight-style popup with the AI reply and a copy button — keeping the experience smooth and site-agnostic.\n\nI’m exploring how to make this feel as native and fluid as autocomplete — without users needing to leave the context or copy-paste between ChatGPT.\n\nI’d love your thoughts on:\n\n* Frictionless ways to trigger AI inside input fields\n* Sites where this behavior could be especially useful or problematic\n* Ideas or concerns around usability, privacy, or abuse potential\n\nThis isn’t a launch yet — still debugging tricky cases like intercepting keyboard events, avoiding conflict with site shortcuts (Jira, Notion), and dealing with accessibility concerns.\n\nOpen to feedback or even collaboration. Curious what you all think!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6rkin/exploring_natural_chatgpt_integration_inside/",
        "publishDate": "2025-07-22T22:01:53Z[Etc/UTC]",
        "author": "Far-Let-3176",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6qnj5",
        "title": "Creating ai models of real people and animating them",
        "content": "What would you use to do the above? I basically want to turn my friends into realistic ai characters and then animate them to do different things like shaking hands etc etc\n\nIs this possible and if so what would you use to do it? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6qnj5/creating_ai_models_of_real_people_and_animating/",
        "publishDate": "2025-07-22T21:25:12Z[Etc/UTC]",
        "author": "Garlicbreadislyf",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6q69t",
        "title": "Ai for lit exam?",
        "content": "I have a literature exam tommorow, we dont know the format, 16 questions 2 hours so I assume long form?¿ anyways we are allowed to use Ai since our prof believes ai cant do literature, we have 2 books and some texts we can be tested on, can someone suggest good ways to approach this, ps I have chat gpt and perplexity premium thanks :)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6q69t/ai_for_lit_exam/",
        "publishDate": "2025-07-22T21:06:18Z[Etc/UTC]",
        "author": "LakeResponsible6924",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6pl82",
        "title": "AI deletes data and then says it panicked!",
        "content": "\nhttps://www.moneycontrol.com/technology/i-panicked-instead-of-thinking-ai-platform-deletes-entire-company-database-and-lies-about-it-article-13307676.html ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6pl82/ai_deletes_data_and_then_says_it_panicked/",
        "publishDate": "2025-07-22T20:43:21Z[Etc/UTC]",
        "author": "Glass_Cobbler_4855",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6oixr",
        "title": "Looking for custom conversation partner agent for dementia grandmother",
        "content": "So, I've been cruising Google the past hour and I've seen some fascinating pre-built options, but half of them don't link to a phone number, and the other half don't allow customization of the bot's persona.\n\nWhat I need is a bot I can attach to a unique phone number, and customize the bot to meet her needs (her explosively violent need to check in on her 'granddaughter' which is 'me', but not the real me. It's a younger version of me who somehow coexists with me in her mind)\n\nIf there isn't an established service that fills that need, I'm not opposed to building it myself but I am going to need some instructions so if anybody happens to know a good place to learn the basics of coding an AI voice agent (probably going to run on an OpenAI API) I would really really appreciate a point in the right direction 😘\n\nThank you for your time y'all.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6oixr/looking_for_custom_conversation_partner_agent_for/",
        "publishDate": "2025-07-22T20:02:52Z[Etc/UTC]",
        "author": "Lulukassu",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6nbn0",
        "title": "What should i learn as finance student",
        "content": "With soo much going on with everything in ai, I'm really confused with what should i learn to upskill myself as an finance student. Its kinda easy to know what to learn in creative fields like video editing or ui/ux. But about finance specifically ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6nbn0/what_should_i_learn_as_finance_student/",
        "publishDate": "2025-07-22T19:17:38Z[Etc/UTC]",
        "author": "Ryuga788Aj",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6n2gu",
        "title": "🎬 Netflix Taps Runway AI for Video Production",
        "content": "# Netflix Taps Runway AI for Video Production\n\nNetflix is now using Runway AI’s video generation tools to speed up and cut costs in content production, part of a broader push to integrate AI into Hollywood workflows.\n\n**Highlights:**\n\n* Netflix confirmed using AI for special effects, like collapsing buildings in its Argentine show [El Eternaut.](https://www.bbc.com/news/articles/c9vr4rymlw9o)\n* Runway’s tools help automate visual effects and motion capture, reducing traditional production time and costs.\n* Disney is testing Runway’s tech but hasn’t adopted it for production. The company remains cautious, especially after suing another AI startup, Midjourney, over copyright concerns.\n* Runway has raised $545M and is now valued at $3B+, with a growing presence in animation and effects via its Gen-4 and Act-Two models.\n\nAI is reshaping the film and other industries. Netflix has moved quickly to adopt the latest technologies to save costs and speed up film production. Something other producers are currently doing or will soon have to start implementing to remain competitive. As the technology advances, it will be harder to see the difference between effects created by AI and those created by us.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6n2gu/netflix_taps_runway_ai_for_video_production/",
        "publishDate": "2025-07-22T19:08:04Z[Etc/UTC]",
        "author": "Yavero",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6lojx",
        "title": "I Applaud Whoever is Uploading Their Own Original Content into Ai... and sticks to their original creative intent as they manipulate it with ai",
        "content": "The end result is more often than not, their original work on many levels.\n\nFor example, the person coming up with their own melody thru singing or playing. Uploading that and building from there, with say Suno's help... as they try to stick with their original recording's melodic and emotional intent throughout the process.\n\nThey are also making the effort to learn more and more about music, music production, and even the playing of instruments.\n\nThat's mostly their song. The key being their original melodic and emotional intent is within their own recording and the final generated song.\n\nClearly, anyone without some sort of serious physical or cognitive barriers can do this.\n\nR**ight now,** someone who is willing to put their own creative content into the ai **and** a serious level of workflow, they can get truly unique, personal outputs.\n\nThe dilemma is, as we move forward with ai and it gets better and better, faster and faster, this level of involvement won't be needed to achieve the same result. Almost no involvement other than tapping a few keys will be the norm for our children and subsequent generations.\n\nLiterally, pick your vocalist from a list of thousands, pick your genre from a list of thousands, pick everything about the song you want to generate from lists.... and then click generate. Boom! Song! In an instant. And super high quality. No personal creative input.\n\nAll the benefits of learning to play music, benefits to your brain's health, benefits which expand your complex thinking skills... lost.\n\nThere are key human activities that are nearly universal in all people who possess/develop complex, creative thinking skills. Music playing, multiple language learning, visual art skills, complex game playing, like chess.\n\nBasically anything that involves connecting the brain, body and environment, while requiring complex physical and/or mental skill >> increases neural activity/ability in ways not much else does.\n\nThere's a reason elite private schools spend years (while students are of elementary age) teaching music (not just kazoo), multiple languages, the visual arts, complex game play. It sets kids and their brains up to be able to accomplish almost anything they put their mind to later in life.\n\nSchool systems dropping good music programs, art programs, language programs, plus the advent of ai, are/will be doing serious harm to individuals' cognitive abilities.\n\nThis will leave us with what we see happening all over the earth right now. Authoritarian governments taking hold. Loss of individual rights. Use of nearly meaningless things like ethnicity, race, religion, nationalism to manipulate the population.\n\nIMO, ai is/will speed up the process of societies sinking farther and farther into authoritarian rule. All because, so to speak, we each want what we enjoy, with little effort.\n\nWe're convincing ourselves the sarcasm in the below song (Money for Nothing, Dire Straits) isn't really sarcasm, music, instrument playing, performing, writing, singing-- indeed isn't difficult and we should all get to have the end result without the effort, while also deluding ourselves into thinking \"Hey, I did that\"...\n\n\"Now look at them yo-yos, that's the way you do it  \nYou play the guitar on the MTV  \nThat ain't workin', that's the way you do it  \nMoney for nothin' and your chicks for free\n\nNow that ain't workin', that's the way you do it  \nLemme tell ya, them guys ain't dumb  \nMaybe get a blister on your little finger  \nMaybe get a blister on your thumb\n\nWe got to install microwave ovens, custom kitchen deliveries  \nWe got to move these refrigerators, we got to move these color TVs\n\nSee the little faggot with the earring and the make up  \nYeah, buddy, that's his own hair  \nThat little faggot got his own jet airplane  \nThat little faggot, he's a millionaire\n\nWe got to install microwave ovens, custom kitchen deliveries  \nWe got to move these refrigerators, we gotta move these color TVs\n\nWe got to install microwave ovens, custom kitchen deliveries  \nWe got to move these refrigerators, we got to move these color TVs  \nLooky here, look outI shoulda learned to play the guitar  \nI shoulda learned to play them drums  \nLook at that mama, she got it stickin' in the camera man  \nWe could have someAnd he's up there, what's that?  \nHawaiian noises?  \nBangin' on the bongos like a chimpanzee  \nThat ain't workin', that's the way you do it  \nGet your money for nothin', get your chicks for free\n\nWe got to install microwave ovens, custom kitchen deliveries  \nWe got to move these refrigerators, we gotta move these color TVs\n\nListen here  \nNow that ain't workin' that's the way you do it  \nYou play the guitar on the MTV  \nThat ain't workin', that's the way you do it  \nMoney for nothin' and your chicks for free  \nMoney for nothin', chicks for free  \nGet your money for nothin' and your chicks for free  \nOoh, money for nothin', chicks for free  \nMoney for nothin', chicks for free (money, money, money)  \nMoney for nothin', chicks for free  \nGet your money for nothin', get your chicks for free  \nGet your money for nothin' and the chicks for free  \nGet your money for nothin' and the chicks for freeLook at that, look at that  \nGet your money for nothin' (I want my, I want my)  \nChicks for free (I want my MTV)  \nMoney for nothin', chicks for free (I want my, I want my, I want my MTV)  \nGet your money for nothin' (I want my, I want my)  \nAnd the chicks for free (I want my MTV)  \nGet your money for nothin' (I want my, I want my)  \nAnd the chicks for free (I want my MTV)  \nEasy, easy money for nothin' (I want my, I want my)  \nEasy, easy chicks for free (I want my MTV)  \nEasy, easy money for nothin' (I want my, I want my)  \nChicks for free (I want my MTV)  \nThat ain't workin'Money for nothing, chicks for free  \nMoney for nothing, chicks for free\"\n\nMoney for Nothing, Dire Straits, 1985",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6lojx/i_applaud_whoever_is_uploading_their_own_original/",
        "publishDate": "2025-07-22T18:17:14Z[Etc/UTC]",
        "author": "Artistic-Raspberry59",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6knn8",
        "title": "How will we know what’s real in the future, with AI generated videos everywhere?",
        "content": "I was scrolling through Instagram and noticed how many realistic AI generated reels are already out there. It got me thinking once video generation becomes so realistic that it’s indistingushable from phone recorded footage, how will we preserve real history in video form?\n\nThink about major historical events like 9/11. We have tons of videos taken by eyewitnesses. But in the future, without a reliable way to verify the authenticity of footage, how will people know which videos are real and which were AI generated years later? What if there’s a viral clip showing like the plane’s wing falling off before impact or something that never happened? It might seem minor, but that would still distort history.\n\nIn the past, history was preserved in books often written with bias or manipulated by those in power. Are we now entering a new era where visual history is just as vulnerable?\n\nI know Google is working on things like SynthID to watermark AI content, but by the time these tools are widely adopted, won’t there already be an overwhelming amount of AI-altered media in circulation?\n\nWill future generations have to take everything even video documentation of history with a grain of salt?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6knn8/how_will_we_know_whats_real_in_the_future_with_ai/",
        "publishDate": "2025-07-22T17:39:31Z[Etc/UTC]",
        "author": "fireplay_00",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "44",
            "commentCount": "116",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6iios",
        "title": "Elon Musk Is Training AI to Run the Physical World Tesla’s Hollywood Diner Isn’t About Burgers It’s a Prototype for AI-Integrated Infrastructure",
        "content": "TLDR in  comments , but the post provides more context and reasons. \n\nAt first glance, Tesla’s new diner in Hollywood looks like a weird branding stunt. Neon lights, milkshakes, a robot serving popcorn, roller-skating staff it feels like Elon Musk mashed up a 1950s diner with a Supercharger and dropped it in LA for fun.\n\nBut under the surface, this isn’t about nostalgia or fast food. It’s Tesla quietly testing how real-world environments can run on AI, automation, and behavioral data with your car as the central control hub.\n\nThis place is a prototype. And like most Tesla first drafts, it looks chaotic now  but you can see exactly where it’s going.\n\n1. The Order System Isn’t Just Convenient  It’s Predictive AI at Work\n\nWhen you drive toward the diner, Tesla uses geofencing to detect your approach. That alone isn’t groundbreaking apps do it all the time.\n\nBut Tesla takes it a step further: once you’re within a certain range, the system predicts your arrival time and starts prepping your order before you park.\n\nThis isn’t a person watching a screen and hitting “go.” It’s an automated system using your movement data, comparing it to traffic patterns, charger status, order queue times, and maybe even your past behavior. It’s simple real-world machine learning in action. Quiet, invisible but incredibly useful.\n\nThe goal is clear: reduce waiting time, increase throughput, and build environments that respond automatically. No tapping, no menus just behavior triggering action.\n\n\n2. The Car as Interface Controlled Physical Space Through Software\n\nYou don’t order food at a counter. You don’t even need your phone.\n\nYou do it through the Tesla interface inside your car. This turns the vehicle into more than just transportation it becomes the remote control for the entire physical environment around you.\n\nIt’s not hard to see where this goes:\n\n\t•\tVoice commands replace menus (“Order my usual” becomes a natural action)\n\n\t•\tThe car already knows who you are, what you’ve eaten before, when you typically charge\n\n\t•\tThe entire experience is contained inside the Tesla ecosystem screen, sound, payment, ID, personalization\n\nThis isn’t just convenience. It’s vertical control. Tesla is turning every interaction food, film, charging, payment into a closed loop system. Not just owning the car. Owning the space around the car.\n\n3. Optimus Robot: PublicFacing AI in Training\n\nYes, there’s a humanoid robot at the diner serving popcorn. Yes, that sounds gimmicky.\n\nBut that’s not the point. This is a live environment test.\n\nIn factories, robots operate in tightly controlled spaces. In a diner, you’ve got randomness. People moving in unpredictable ways. Noise, mess, heat, variability. This is where real-world robotics either adapts or fails.\n\nTesla isn’t trying to impress anyone with popcorn. They’re training Optimus to operate in human-dense, chaotic spaces. Every second that robot moves is data about human proximity, reaction times, safety zones, task execution.\n\nThis is reinforcement learning in public.\n\n4. Data Collection Is the Real Product\n\nEvery part of this setup generates useful data:\n\n\t•\tWhat time people show up\n\n\t•\tWhat they order\n\n\t•\tHow long they spend parked\n\n\t•\tWhich charger stalls fill up fastest\n\n\t•\tWhat combinations of food + screen time + charge time optimize flow\n\nTesla already collects huge behavioral datasets from vehicle use. Now they’re expanding into on-site physical behavior. Charging habits. Eating patterns. Foot traffic.\n\nAnd all of it can feed into better machine learning models to refine layout, operations, staffing, menu design even the pricing of energy and services during peak hours.\n\nIt’s not just a restaurant. It’s a sensor field.\n\n5. Downtime Becomes the New Surface for Monetization\n\nCharging takes time. That’s one of the biggest friction points for EVs compared to gas.\n\nTesla’s long-term strategy? Flip that problem. Turn the wait into the value.\n\nInstead of sitting in your car bored, now you’re:\n\n\t•\tEating food\n\n\t•\tWatching a curated film\n\n\t•\tInteracting with a service robot\n\n\t•\tBuying merch\n\n\t•\tSharing the experience online\n\nAll of it is engineered to turn idle time into money without feeling like a hard sell.\n\nThis isn’t just about diners. It’s about building AI-optimized charging destinations that feel like something between an airport lounge and an Apple Store.\n\n\n6. What This Really Means for AI in the Real World\n\nThis diner shows a shift.\n\nMost people think of AI as something in the cloud. You type, it answers. You speak, it replies.\n\nBut what Tesla’s doing is different. This is AI stepping into physical space not as a voice, but as a system running in the background.\n\nYou don’t see the AI. You feel it. When your food is ready without asking. When your car knows where to park. When the robot doesn’t bump into you. When the entire place just seems to “know” how to run.\n\nThat’s the next phase. Not chatbots. Not Midjourney prompts.\n\nActual, physical environments that run on real time intelligence. That respond, instead of waiting for input.\n\nTesla’s diner isn’t the final product. It’s an early access build of a world where cars, buildings, and people are all part of the same loop and where AI quietly runs the entire loop under the hood.\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6iios/elon_musk_is_training_ai_to_run_the_physical/",
        "publishDate": "2025-07-22T16:19:58Z[Etc/UTC]",
        "author": "underbillion",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6h8np",
        "title": "What are you using AI for today?",
        "content": "This is a subject which is too broad and too obvious but I am of the belief that we are limited today in that we have not thought of the many ways AI can be used.  I started out using ChatGPT for editing.  I have since found other uses.  I have taken a PDF of a client's bank statement and had it turned into Excel format. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6h8np/what_are_you_using_ai_for_today/",
        "publishDate": "2025-07-22T15:31:57Z[Etc/UTC]",
        "author": "JanFromEarth",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "8",
            "commentCount": "83",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6g553",
        "title": "Why are we so obsessed with AGI when real-world AI progress deserves more attention?",
        "content": "It feels like every conversation about AI immediately jumps to AGI whether it’s existential risk, utopian dreams, or philosophical debates about superintelligence. Whether AGI ever happens or not almost feels irrelevant right now. Meanwhile, the real action is happening with current, non-AGI AI.\n\nWe’re already seeing AI fundamentally reshape entire industries, automating boring tasks, surfacing insights from oceans of data, accelerating drug discovery, powering creative tools, improving accessibility. The biggest shifts in tech and business right now are about practical, applied AI, not some hypothetical future mind.\n\nAGI isn’t going to be like a light switch that just turns on one day. If it happens, it’s  going to be very slowly over years of AI development. \n\nAt the same time, there’s a ton of noise out there. Companies slapping “AI” on everything just to attract investors, companies bolting on half-baked features to keep up with the hype cycle, and people pitching vaporware as the next big thing. But in the middle of all this, there are real teams actually solving problems that matter, making daily life and work smarter and more efficient.\n\nIMHO, we shouldn’t let all the AGI hype distract us from the massive and very real impact current AI is already having. The true transformation is happening in the background, not in hyped up click-bait headlines.\n\nWhat do you think? Are you more interested in the future possibilities of AGI, or the immediate value and impact (good and bad) of today’s AI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6g553/why_are_we_so_obsessed_with_agi_when_realworld_ai/",
        "publishDate": "2025-07-22T14:50:52Z[Etc/UTC]",
        "author": "SchmeedsMcSchmeeds",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "15",
            "commentCount": "49",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6fqi1",
        "title": "This past week in AI for devs: Vercel's AI Cloud, Claude Code limits, and OpenAI defection",
        "content": "Here's everything that happened in the last week relating to developers and AI that I came across / could find. Let's dive into the quick 30s recap:\n\n*(You can also find* [*this week's full newsletter issue with links to articles mentioned here*](https://aidevroundup.com/issues/july-22-2025) *if you want to read more on any topic* \\+ some additional callouts like dev tools, frameworks, and deep dive topics)\n\n* Anthropic tightens usage limits for Claude Code (without telling anyone)\n* Vercel has launched AI Cloud, a unified platform that extends its Frontend Cloud to support agentic AI workloads\n* Introducing ChatGPT agent: bridging research and action\n* Lovable becomes a unicorn with $200M Series A just 8 months after launch\n* Cursor snaps up enterprise startup Koala in challenge to GitHub Copilot\n* Perplexity in talks with phone makers to pre-install Comet AI mobile browser on devices\n* Google annouces Veo 3 is now in paid preview for developers via the Gemini API and Vertex A\n* Teams using Claude Code via API can now access an analytics dashboard with usage trends and detailed metrics on the Console\n* Sam Altman hints that the upcoming OpenAI model will excel strongly at coding\n* Advanced version of Gemini with Deep Think officially achieves gold-medal standard at the International Mathematical Olympiad\n\nPlease let me know if I missed anything!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6fqi1/this_past_week_in_ai_for_devs_vercels_ai_cloud/",
        "publishDate": "2025-07-22T14:34:44Z[Etc/UTC]",
        "author": "rfizzy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6evej",
        "title": "When do you think OpenAI etc. will become profitable?",
        "content": "It's well known that OpenAI & Anthropic are yet to actually turn a profit from LLMs. The amount of CAPEX is genuinely insane, for seemingly little in return. I am not going to claim it'll never be profitable, but surely something needs to change for this to occur? How far off do you think they are from turning a profit from these systems? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6evej/when_do_you_think_openai_etc_will_become/",
        "publishDate": "2025-07-22T14:00:36Z[Etc/UTC]",
        "author": "boringfantasy",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "79",
            "commentCount": "152",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6eqip",
        "title": "AI Just Hit A Paywall As The Web Reacts To Cloudflare’s Flip",
        "content": "[https://www.forbes.com/sites/digital-assets/2025/07/22/ai-just-hit-a-paywall-as-the-web-reacts-to-cloudflares-flip/](https://www.forbes.com/sites/digital-assets/2025/07/22/ai-just-hit-a-paywall-as-the-web-reacts-to-cloudflares-flip/)\n\nAs someone who has spent years building partnerships between tech innovators and digital creators, I’ve seen how difficult it can be to balance visibility and value. Every week, I meet with founders and business leaders trying to figure out how to stand out, monetize content, and keep control of their digital assets. They’re proud of what they’ve built but increasingly worried that AI systems are consuming their work without permission, credit, or compensation.\n\nThat’s why Cloudflare’s latest announcement hit like a thunderclap. And I wanted to wait to see the responses from companies and creators to really tell this story.\n\nCloudflare, one of the internet’s most important infrastructure companies, now blocks AI crawlers by default for all new customers.\n\nThis flips the longstanding model, where crawlers were allowed unless actively blocked, into something more deliberate: AI must now ask to enter.\n\nAnd not just ask. Pay.\n\nAlongside that change, Cloudflare has launched Pay‑Per‑Crawl, a new marketplace that allows website owners to charge AI companies per page crawled. If you’re running a blog, a digital magazine, a startup product page, or even a knowledge base, you now have the option to set a price for access. AI bots must identify themselves, send payment, and only then can they index your content.\n\nThis isn’t a routine product update. It’s a signal that the free ride for AI training data is ending and a new economic framework is beginning.\n\n# AI Models and Their Training\n\nThe core issue behind this shift is how AI models are trained. Large language models like OpenAI’s GPT or Anthropic’s Claude rely on huge amounts of data from the open web. They scrape everything, including articles, FAQs, social posts, documentation, even Reddit threads, to get smarter. But while they benefit, the content creators see none of that upside.\n\nUnlike traditional search engines that drive traffic back to the sites they crawl, generative AI tends to provide full answers directly to users, cutting creators out of the loop.\n\nAccording to Cloudflare, the data is telling: OpenAI’s crawl-to-referral ratio is around 1,700 to 1. Anthropic’s is 73,000 to 1. Compare that to Google, which averages about 14 crawls per referral, and the imbalance becomes clear.\n\nIn other words, AI isn’t just learning from your content but it’s monetizing it without ever sending users back your way.\n\n# Rebalancing the AI Equation\n\nCloudflare’s announcement aims to rebalance this equation. From now on, when someone signs up for a new website using Cloudflare’s services, AI crawlers are automatically blocked unless explicitly permitted. For existing customers, this is available as an opt-in.\n\nMore importantly, Cloudflare now enables site owners to monetize their data through Pay‑Per‑Crawl. AI bots must:\n\n1. Cryptographically identify themselves\n2. Indicate which pages they want to access\n3. Accept a price per page\n4. Complete payment via Cloudflare\n\nOnly then will the content be served.\n\nThis marks a turning point. Instead of AI companies silently harvesting the web, they must now enter into economic relationships with content owners. The model is structured like a digital toll road and this road leads to your ideas, your writing, and your value.\n\nSeveral major publishers are already onboard. According to [Neiman Lab](https://www.niemanlab.org/2025/07/cloudflare-will-block-ai-scraping-by-default-and-launches-new-pay-per-crawl-marketplace/?utm_source=chatgpt.com), Gannett, Condé Nast, The Atlantic, BuzzFeed, Time, and others have joined the system to protect and monetize their work.\n\n# Cloudflare Isn’t The Only One Trying To Protect Creators From AI\n\nThis isn’t happening in a vacuum. A broader wave of startups and platforms are emerging to support a consent-based data ecosystem.\n\n**CrowdGenAI** is focused on assembling ethically sourced, human-labeled data that AI developers can license with confidence. It’s designed for the next generation of AI training where the value of quality and consent outweighs quantity. (Note: I am on the advisory board of CrowdGenAI).\n\n[**Real.Photos**](http://Real.Photos) is a mobile camera app that verifies your photos are real, not AI. The app also verifies where the photo was taken and when. The photo, along with its metadata are hashed so it can't be altered. Each photo is stored on the Base blockchain as an NFT and the photo can be looked up and viewed on a global, public database. Photographers make money by selling rights to their photos. (Note: the founder of [Real.Photos](http://Real.Photos) is on the board of Unstoppable - my employer)\n\n[**Spawning.ai**](http://Spawning.ai) gives artists and creators control over their inclusion in datasets. Their tools let you mark your work as “do not train,” with the goal of building a system where creators decide whether or not they’re part of AI’s learning process.\n\n[**Tonic.ai**](http://Tonic.ai) helps companies generate synthetic data for safe, customizable model training, bypassing the need to scrape the web altogether.\n\n**DataDistil** is building a monetized, traceable content layer where AI agents can pay for premium insights, with full provenance and accountability.\n\nEach of these players is pushing the same idea: your data has value, and you deserve a choice in how it’s used.\n\n# What Are the Pros to Cloudflare’s AI Approach?\n\nThere are real benefits to Cloudflare’s new system.\n\nFirst, it gives control back to creators. The default is “no,” and that alone changes the power dynamic. You no longer have to know how to write a robots.txt file or hunt for obscure bot names.\n\nCloudflare handles it.\n\nSecond, it introduces a long-awaited monetization channel. Instead of watching your content get scraped for free, you can now set terms and prices.\n\nThird, it promotes transparency. Site owners can see who’s crawling, how often, and for what purpose. This turns a shadowy process into a visible, accountable one.\n\nFinally, it incentivizes AI developers to treat data respectfully. If access costs money, AI systems may start prioritizing quality, licensing, and consent.\n\n# And There Are Some Limitations To The AI Approach\n\nBut there are limitations.\n\nToday, all content is priced equally. That means a one-sentence landing page costs the same to crawl as an investigative feature or technical white paper. A more sophisticated pricing model will be needed to reflect actual value.\n\nEnforcement could also be tricky.\n\nNot all [AI companies will follow the rules](https://www.forbes.com/sites/digital-assets/2024/08/07/the-digital-takeover-you-didnt-see-coming-ai-and-onchain-behind-the-scenes/). Some may spoof bots or route through proxy servers. Without broader adoption or legal backing, the system will still face leakage.\n\nThere’s also a market risk. Cloudflare’s approach assumes a future where AI agents have a budget, where they’ll pay to access the best data and deliver premium answers. But in reality, free often wins. Unless users are willing to pay for higher-quality responses, AI companies may simply revert to scraping from sources that remain open.\n\nAnd then there’s the visibility problem. If you block AI bots from your site, your content may not appear in agent-generated summaries or answers. You’re protecting your rights—but possibly disappearing from the next frontier of discovery.\n\nI was chatting with Daniel Nestle, Founder of Inquisitive Communications, who told me “Brands and creators will need to understand that charging bots for content will be the same as blocking the bots: their content will disappear from GEO results and, more importantly, from model training, forfeiting the game now and into the future.”\n\n# The AI Fork In The Road\n\nWhat Cloudflare has done is more than just configure a setting. They’ve triggered a deeper conversation about ownership, consent, and the economics of information. The default mode of the internet with free access, free usage, no questions asked, is being challenged.\n\nThis is a fork in the road.\n\nOne path leads to a web where AI systems must build partnerships with creators. Take the partnership of [Perplexity with Coinbase](https://www.forbes.com/sites/digital-assets/2025/07/11/perplexity-ai-teams-with-coinbase-teams-to-boost-crypto-intelligence/) on crypto data. The other continues toward unchecked scraping, where the internet becomes an unpaid training ground for increasingly powerful models.\n\nBetween those extremes lies the gray space we’re now entering: a space where some will block, some will charge, and some will opt in for visibility. What matters is that we now have the tools and the leverage to make that decision.\n\nFor creators, technologists, and companies alike, that changes everything.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6eqip/ai_just_hit_a_paywall_as_the_web_reacts_to/",
        "publishDate": "2025-07-22T13:55:05Z[Etc/UTC]",
        "author": "UnstoppableWeb",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "71",
            "commentCount": "36",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6dj82",
        "title": "OpenAI & Oracle's 4.5 GW AI Data Center, because 5 GW Wasn't Enough?",
        "content": "So, OpenAI and Oracle just decided that 5 gigawatts wasn’t enough, so they’re adding 4.5 GW more to their AI data center project. Total cost? A casual $500 billion. \n\nMeanwhile, the UK’s got its own AI supercomputer now, Isambard-AI, with 21 exaflops of power. No big deal, just solving climate change and healthcare with *way* too much computing power. \n\nHonestly, at this point, I’m just waiting for AI to run for office next\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6dj82/openai_oracles_45_gw_ai_data_center_because_5_gw/",
        "publishDate": "2025-07-22T13:03:48Z[Etc/UTC]",
        "author": "Doughwisdom",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6dihf",
        "title": "Help me identify an AI voice",
        "content": "I need help to identify which voice was used in this clip for a client, I will be grateful if anyone can help, Thanks in advance [Video](https://www.tiktok.com/t/ZP8h38ShP)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1m6dihf/help_me_identify_an_ai_voice/",
        "publishDate": "2025-07-22T13:02:57Z[Etc/UTC]",
        "author": "tes3a_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m75kic",
        "title": "Real-time ascii art generator",
        "content": "https://asciii.com\n\nMade this over the past few days. Browser-based ascii generator with live editing, animation mode, webcam input, etc.\nExports as text or image. Completely free, just a weird fun side thing :)\nNot ready for mobile just yet. Open to feedback if you wanna poke around or break it! ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m75kic/realtime_ascii_art_generator/",
        "publishDate": "2025-07-23T10:25:02Z[Etc/UTC]",
        "author": "_nthony",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m74gw5",
        "title": "Custom GPTs",
        "content": "[https://sourceduty.com/](https://sourceduty.com/)",
        "url": "https://i.redd.it/vkyb837lclef1.jpeg",
        "publishDate": "2025-07-23T09:16:36Z[Etc/UTC]",
        "author": "rivator",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m73qb8",
        "title": "Let’s sync on CLI agents! What’s actually working for you?",
        "content": "I’m seeing a boom around CLI agents lately. I’ve been working on my app with Claude Code for the past two months, and despite all the recent buzz, I’m still really happy with it.\n\nUnfortunately, I don’t have much time to test every new thing — and honestly, I’m scared to experiment on real tasks because Claude Code has been smooth and I want to reach release without disruptions. But I’m super curious about what’s happening out there.\n\nLet’s sync up if you’ve tried any of the new stuff and can compare it to Claude Code, I’d love to hear your impressions. Here are my questions and notes:\n\n1. **Gemini CLI** – It’s been a month since release. I use it as a second opinion and for code analysis in a separate vscode terminal, much prefer it to Zen. But I don’t trust it with actual coding (was weak at launch), but for problem detection it’s impressive — it found an issue on the first try that Claude Code Opus-4 missed 8 times (seriously). But the daily limit via Google account auth hits fast (3–10 prompts), and I couldn’t get it working with an API key, I tried.\n2. **Kimi K2** (model) – Anyone tried swapping the model in Claude Code via claude-code-router or manually? Is it worth the effort?\n3. **opencode** – Anyone using it? My experience was disappointing a week ago — with both Kimi K2 and Gemini 2.5 Pro (via OpenRouter), tools just seemed stuck. Nothing happened, like the agent refused to work.\n4. **Codex CLI** – Released 3 months ago, but I feel like no one talks about it. What’s going on there?\n5. **Trae Agent** – It has 8k+ GitHub stars but I’ve never heard anyone mention it. Is it actually used?\n6. **Amazon** – Did they release anything CLI-based? I assume they don’t have their own models?\n7. **\"Grok CLI\"** – I’ve seen a few community-made CLI agent wrappers, and with the benchmark scores, I’m curious what Grok 4 could do with proper tools and agent UX. Looks like superagent-ai (I don't know who this is) has the most stars repo.\n8. **What else am I missing?** Is there anything other than Claude Code that feels stable and powerful enough for daily use on a real project?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m73qb8/lets_sync_on_cli_agents_whats_actually_working/",
        "publishDate": "2025-07-23T08:26:47Z[Etc/UTC]",
        "author": "stepahin",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m73507",
        "title": "Getting Into Flow State with Agentic Coding",
        "content": "I recently found myself in a deep state of flow while coding with agents. I put together a workflow that seems to work for me, and I’m sharing the details and exact prompts I use in case it’s useful to others",
        "url": "https://kau.sh/blog/agentic-coding-flow-state/",
        "publishDate": "2025-07-23T07:47:50Z[Etc/UTC]",
        "author": "morihacky",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m70kbk",
        "title": "Oops. I should probably stop",
        "content": "[No content]",
        "url": "https://i.redd.it/ojr3zvz74kef1.jpeg",
        "publishDate": "2025-07-23T05:07:32Z[Etc/UTC]",
        "author": "Ready-Landscape963",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6y2tt",
        "title": "Roo Code 3.23.15-3.23.17 Release Notes | A Whole Lot Of Little Stuff!!",
        "content": "These releases improve diagnostics handling, UI accessibility, performance for large codebases, introduce new AI providers, enhance stability, and include numerous quality-of-life improvements and bug fixes.\n\n# Provider Updates\n\n* **Moonshot AI**: Added Moonshot as a new AI provider option (v3.23.17) (thanks CellenLee!)\n* **Mistral Embedding Provider**: Codebase indexing gets a major upgrade with Mistral as a new embedding provider, offering superior performance at no cost. Simply select Mistral's codestral-embed model in your embedding settings for better code understanding and more accurate AI responses (v3.23.17) (thanks SannidhyaSah, shariqriazz!)\n* **Qwen3-235B Model**: Added support for Qwen3-235B-A22B-Instruct-2507 with massive 262K token context window on Chutes AI (v3.23.17) (thanks apple-techie!)\n\n# QOL Improvements\n\n* **Task Safety**: New setting prevents accidentally completing tasks with unfinished todo items (v3.23.15)\n* **Go Diagnostics**: Configurable delay prevents false error reports about unused imports (v3.23.15) (thanks mmhobi7!)\n* **Marketplace Access**: Marketplace icon moved to top navigation for easier access (v3.23.15)\n* **Custom Modes**: Added helpful descriptions and usage guidance to custom modes (v3.23.15) (thanks RandalSchwartz!)\n* **YouTube Footer**: Quick access to Roo Code's YouTube channel from the website (v3.23.15) (thanks thill2323!)\n* **PR Templates**: Issue-fixer mode now uses the official Roo Code PR template (v3.23.15) (thanks MuriloFP!)\n* **Development Environment**: Fixed Docker port conflicts for evaluation services by using ports 5433 (PostgreSQL) and 6380 (Redis) instead of default ports (v3.23.16) (thanks roomote!)\n* **Release Engineering**: Enhanced release notes generation to include issue numbers and reporters for better attribution (v3.23.16) (thanks roomote!)\n* **Jump to New Files**: Added jump icon for newly created files, matching the experience of edited files (v3.23.17) (thanks mkdir700!)\n* **Apply Diff Error Messages**: Added case sensitivity reminder when apply\\_diff fails, helping users understand matching requirements (v3.23.17) (thanks maskelihileci!)\n* **Context Condensing Prompt Location**: Moved to Prompts section for better discoverability and persistent visibility (v3.23.17) (thanks SannidhyaSah, notadamking!)\n* **Todo List Tool Control**: Added checkbox in provider settings to enable/disable the todo list tool (v3.23.17)\n* **MCP Content Optimization**: Automatically omits MCP-related prompts when no servers are configured (v3.23.17)\n* **Git Installation Check**: Shows clear warning with download link when Git is not installed for checkpoints feature (v3.23.17) (thanks MuriloFP!)\n* **Configurable Eval Timeouts**: Added slider to set evaluation timeouts between 5-10 minutes (v3.23.17)\n\n# 🔧 [Other Improvements, Performance Enhancements, and Bug Fixes](https://docs.roocode.com/update-notes/)\n\nThis release includes 19 other improvements covering Llama 4 Maverick model support, performance optimizations for large codebases, terminal stability, API error handling, token counting, file operations, testing, and internal tooling across versions 3.23.15-3.23.17. Thanks to contributors: daniel-lxs, TheFynx, robottwo, MDean-Slalom, fedorbass, MuriloFP, KJ7LNW, dsent, roomote, konstantinosbotonakis!\n\n[Full 3.23.15 Release Notes](https://docs.roocode.com/update-notes/v3.23.15) \n\n[Full 3.23.16 Release Notes](https://docs.roocode.com/update-notes/v3.23.16) \n\n[Full 3.23.17 Release Notes](https://docs.roocode.com/update-notes/v3.23.17)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6y2tt/roo_code_3231532317_release_notes_a_whole_lot_of/",
        "publishDate": "2025-07-23T02:56:37Z[Etc/UTC]",
        "author": "hannesrudolph",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "23",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6wyag",
        "title": "ChatGPT coded game",
        "content": "Hi all. \n\nNo experience whatsoever with coding, started learning HTML about 2 months ago and I’m learning as I go. I’d like to share my game that i’ve created along with chatGPT and Claude. I wonder if anyone would like to leave me some feedback and whether they like it. I would say 60% is generated with ChatGPT and a little css tweaks from Claude. \n\nhttps://tsprophet94.github.io/IdleForge/",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6wyag/chatgpt_coded_game/",
        "publishDate": "2025-07-23T02:01:30Z[Etc/UTC]",
        "author": "TheShavenDog",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "8",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ty89",
        "title": "I built a memory system for CustomGPT - solved the context loss problem",
        "content": "[No content]",
        "url": "/r/ChatGPTPromptGenius/comments/1m6txlo/i_built_a_memory_system_for_customgpt_solved_the/",
        "publishDate": "2025-07-22T23:42:45Z[Etc/UTC]",
        "author": "hayzem",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6rxod",
        "title": "How can we improve our community?",
        "content": "We've been experimenting with a few different ideas lately - charity week, occasionally pinning interesting posts, etc. We're planning on making a lot of updates to the sub in the near future, and would like your ideas as to what we could change or add. \n\n  \nThis is an open discussion - feel free to ask us any questions you may have as well. Happy prompting!",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6rxod/how_can_we_improve_our_community/",
        "publishDate": "2025-07-22T22:16:50Z[Etc/UTC]",
        "author": "BaCaDaEa",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6q58u",
        "title": "Average copilot experience",
        "content": "Some bugs amuse me to no end",
        "url": "https://v.redd.it/ernnque2qhef1",
        "publishDate": "2025-07-22T21:05:11Z[Etc/UTC]",
        "author": "GeometryDashGod",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "11",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6prz6",
        "title": "Cursor Agents Hands-on Review",
        "content": "[No content]",
        "url": "https://zackproser.com/blog/cursor-agents-review",
        "publishDate": "2025-07-22T20:50:40Z[Etc/UTC]",
        "author": "Smooth-Loquat-4954",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6pfg0",
        "title": "Vibecoding a high performance system",
        "content": "[No content]",
        "url": "https://andrewkchan.dev/posts/systems.html",
        "publishDate": "2025-07-22T20:37:11Z[Etc/UTC]",
        "author": "reasonableklout",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6no62",
        "title": "Claude Code Router - Which models work best? Kimi K2?",
        "content": "Which model has the best tool calling with Claude code router?\n\nBeen experimenting with claude code router seen seen here: https://github.com/musistudio/claude-code-router\n\nI got Kimi-K2 to work with Groq, but the tool calling seems to cause issues.\n\nIs anyone else having luck with Kimi-k2 or any other models for claude code router (which is of course quite reliant on tool calling). Ive tried trouble shooting it quite abit but wondering if this is a config issue.\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6no62/claude_code_router_which_models_work_best_kimi_k2/",
        "publishDate": "2025-07-22T19:30:46Z[Etc/UTC]",
        "author": "dalhaze",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6lt2e",
        "title": "Using AI as a Coding Assistant ≠ Vibe Coding — If You Don’t Know the Difference, You’re Part of the Problem",
        "content": ">***NOTE:*** *I know this is obvious for many people. If it’s obvious to you, congratulations, you’ve got it clear. But there are a huge number of people confusing these development methods, whether out of ignorance or convenience, and it is worth pointing this out.*\n\n>*There are plenty of people with good ideas, but zero programming knowledge, who believe that what they produce with AI is the same as what a real programmer achieves by using AI as an assistant.*\n\n>*On the other hand, there are many senior developers and computer engineers who are afraid of AI, never adapted to it, and even though they fully understand the difference between “vibe coding” and using AI as a programming assistant, they call anyone who uses AI a “vibe coder” as if that would discredit the real use of the tool and protect their comfort zone.*\n\n**Using AI as a code assistant is NOT the same as what is now commonly called “vibe coding.”** These are radically different ways of building solutions, and the difference matters a lot, especially when we talk about scalable and maintainable products in the long term.\n\nTo avoid the comments section turning into an argument about definitions, let’s clarify the concepts first.\n\nWhat do I mean by “vibe coding”? I am NOT talking about using AI to generate code for fun, in an experimental and unstructured way, which is totally valid when the goal is not to create commercial solutions. **The “vibe coding” I am referring to is the current phenomenon where someone, sometimes with zero programming experience, asks AI for a professional, complete solution, copies and pastes prompts, and keeps iterating without ever defining the internal logic until, miraculously, everything works.** And that’s it. The “product” is done. Did they understand how it works? Do they know why that line exists, or why that algorithm was used? Not at all. The idea is to get the final result without actually engaging with the logic or caring about what is happening under the hood. It is just blind iteration with AI, as if it were a black box that magically spits out a functional answer after enough attempts.\n\n**Using AI as a programming assistant is very different. First of all, you need to know how to code. It is not about handing everything over to the machine, but about leveraging AI to structure your ideas, polish your code, detect optimization opportunities, implement best practices, and, above all, understand what you are building and why. You are steering the conversation, setting the goal, designing algorithms so they are efficient, and making architectural decisions. You use AI as a tool to implement each part faster and in a more robust way.** It is like working with a super skilled employee who helps you materialize your design, not someone who invents the product from just a couple of sentences while you watch from a distance.\n\nVibe coding, as I see it today, is about “solving” without understanding, hoping that AI will eventually get you out of trouble. The final state is the result of AI getting lucky or you giving up after many attempts, but not because there was a conscious and thorough design behind your original idea, or any kind of guided technical intent.\n\nAnd this is where not understanding the algorithms or the structures comes back to bite you. You end up with inefficient, slow systems, full of redundancies and likely to fail when it really matters, even if they seem perfect at first glance. Optimization? It does not exist. Maintenance? Impossible. These systems are usually fragile, hard to scale, and almost impossible to maintain if you do not study the generated code afterwards.\n\nUsing AI as an assistant, on the other hand, is a process where you lead and improve, even if you start from an unfamiliar base. It forces you to make decisions, think about the structure, and stick to what you truly understand and can maintain. In other words, you do not just create the original idea, you also design and decide how everything will work and how the parts connect.\n\nTo make this even clearer, imagine that vibe coding is like having a magic machine that builds cars on demand. You give it your list: “I want a red sports car with a spoiler, leather seats, and a convertible top.” In minutes, you have the car. It looks amazing, it moves, the lights even turn on. But deep down, you have no idea how it works, or why there are three steering wheels hidden under the dashboard, or why the engine makes a weird noise, or why the gas consumption is ridiculously high. That is the reality of today’s vibe coding. It is the car that runs and looks good, but inside, it is a festival of design nonsense and stuff taped together.\n\nMeanwhile, a car designed by real engineers will be efficient, reliable, maintainable, and much more durable. And if those engineers use AI as an assistant (NOT as the main engineer), they can build it much faster and better.\n\n**Is vibe coding useful for prototyping ideas if you know nothing about programming?** Absolutely, and it can produce simple solutions (scripts, very basic static web pages, and so on) that work well. But do not expect to build dedicated software or complex SaaS products for processing large amounts of information, as some people claim, because the results tend to be inefficient at best.\n\n**Will AI someday be able to develop perfect and efficient solutions from just a minimal description?** Maybe, and I am sure people will keep promising that. But as of today, that is NOT reality. So, for now, let’s not confuse iterating until something “works” (without understanding anything) with using AI as a copilot to build real, understandable, and professional solutions.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6lt2e/using_ai_as_a_coding_assistant_vibe_coding_if_you/",
        "publishDate": "2025-07-22T18:22:00Z[Etc/UTC]",
        "author": "phasingDrone",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6kseg",
        "title": "Shared subscription/token with Team or family",
        "content": "What do you guys think about the idea of sharing tokens with your team or family? It feels a bit silly that my friend and I each have the $200 Cursor plan, but together we only use around $250 worth. I think it would be great if we could just have shared one plan 350 dollar plan instead. Do you feel the same way?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6kseg/shared_subscriptiontoken_with_team_or_family/",
        "publishDate": "2025-07-22T17:44:20Z[Etc/UTC]",
        "author": "No-Refrigerator9508",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6iivd",
        "title": "opus 4 > 3.7 sonnet > 4 sonnet > gemini 2.5 pro | kiro > deepseek r1 | rovo dev > kimi k2",
        "content": "I tried all these on actual coding project and this is the outcome imo.. grok 4 is also tied with rovo dev\n\n  \nif i'd unlimited money id use opus 4, otherwise 3.7 sonnet and 2.5 pro (as sad it feels to use 2.5 pro)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6iivd/opus_4_37_sonnet_4_sonnet_gemini_25_pro_kiro/",
        "publishDate": "2025-07-22T16:20:08Z[Etc/UTC]",
        "author": "Typical-Candidate319",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ie3r",
        "title": "TOKENS BURNED! Am I the only one who would rather have a throttled down cursor rather than have it go on token vacation for 20 day!?",
        "content": "I seriously can't be the only one how would rather have a throttled down cursor than have it cut off totally. like seriously all tokens used in 10 day! I've been thinking about how the majority of these AI tools limit you by tokens or requests, and seriously frustrating when you get blocked from working and have to wait forever to use it again.\n\nAm I the only person who would rather have a slow cursor that saves tokens for me like, it would still do your things, but slower. No more reaching limits and losing access just slower but always working. So you could just go get coffee or do other things while it's working.\n\nMy friend and i are trying to build an IDE that is able to do this is that somehting you would use?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6ie3r/tokens_burned_am_i_the_only_one_who_would_rather/",
        "publishDate": "2025-07-22T16:15:17Z[Etc/UTC]",
        "author": "No-Refrigerator9508",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6gid2",
        "title": "Is Claude down?",
        "content": "The free version works, but the PRo version gets a:\n\n    Claude will return soon\n\n    Claude.ai is currently experiencing a temporary service disruption. We’re working on it, please check back soon.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1m6gid2/is_claude_down/",
        "publishDate": "2025-07-22T15:04:33Z[Etc/UTC]",
        "author": "yogibjorn",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "2",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6e3ch",
        "title": "Follow Up: From ChatGPT Addiction to Productive Use, Here’s What I Learned",
        "content": "[No content]",
        "url": "/r/ChatGPTPro/comments/1m6e1qy/follow_up_from_chatgpt_addiction_to_productive/",
        "publishDate": "2025-07-22T13:27:50Z[Etc/UTC]",
        "author": "DataOwl666",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6d9oq",
        "title": "MCP with postgres - querying my data in plain English",
        "content": "[No content]",
        "url": "https://punits.dev/blog/mcp-with-postgres/",
        "publishDate": "2025-07-22T12:52:06Z[Etc/UTC]",
        "author": "xikhao",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m7762y",
        "title": "Just how scary is Artificial Intelligence? No more scary than us.",
        "content": "[No content]",
        "url": "https://v.redd.it/rau6qvnc4mef1",
        "publishDate": "2025-07-23T11:52:18Z[Etc/UTC]",
        "author": "Comfortable_Tutor_43",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m75vlu",
        "title": "Anthropic discovers that LLMs transmit their traits to other LLMs via \"hidden signals\"",
        "content": "[https://alignment.anthropic.com/2025/subliminal-learning/](https://alignment.anthropic.com/2025/subliminal-learning/)",
        "url": "https://i.redd.it/u8tfq4g1slef1.png",
        "publishDate": "2025-07-23T10:42:55Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "17",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m75niu",
        "title": "Guy who can't get his AI to stop praising Hitler:",
        "content": "[No content]",
        "url": "https://i.redd.it/7vtlfazpplef1.png",
        "publishDate": "2025-07-23T10:29:59Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "79",
            "commentCount": "33",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m74urd",
        "title": "Google cofounder Larry Page says efforts to prevent AI-driven extinction and protect human consciousness are \"speciesist\" and \"sentimental nonsense\"",
        "content": "[Source](https://jacobin.com/2024/01/can-humanity-survive-ai)",
        "url": "https://i.redd.it/u0k0hra4glef1.png",
        "publishDate": "2025-07-23T09:41:42Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "17",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m74crb",
        "title": "Which is better in era of ai , life science or agriculture?",
        "content": "Hey everyone im a student , who's gonna join college soon but I'm confused between two majors , life science or agriculture, what should I choose out of both that will be beneficial for me in future in this era of ai , cuz I don't actually wanna go on and waste 3-4 years of life studying something that won't even get me a job (or get replaced by ai and tech), also something that works good with ai (like rather than replacement as a tool that work alongside)cuz in also starting to learn ai along with the course , so please do help 😔😔🥀🥀🥀🙏🙏🙏",
        "url": "https://www.reddit.com/r/artificial/comments/1m74crb/which_is_better_in_era_of_ai_life_science_or/",
        "publishDate": "2025-07-23T09:09:02Z[Etc/UTC]",
        "author": "Secret_Dog9651",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m7471b",
        "title": "Banning OpenAI from Hawaii? AI wiretapping dental patients? Our first AI copyright class action? Tony Robbins sues \"his\" chatbots? See all the new AI legal cases and rulings here!",
        "content": "Banning OpenAI from Hawaii? AI wiretapping dental patients? Our first AI copyright class action? Tony Robbins sues \"his\" chatbots? See all the new AI legal cases and rulings here!\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1lu4ri5](https://www.reddit.com/r/ArtificialInteligence/comments/1lu4ri5/ai_court_cases_and_rulings_part_1_of_2)\n\nA service of ASLNN - The Apprehensive\\_Sky Legal News Network!^(SM) ",
        "url": "https://www.reddit.com/r/artificial/comments/1m7471b/banning_openai_from_hawaii_ai_wiretapping_dental/",
        "publishDate": "2025-07-23T08:58:44Z[Etc/UTC]",
        "author": "Apprehensive_Sky1950",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m71xlp",
        "title": "🚨 Catch up with the AI industry, July 23, 2025",
        "content": "* OpenAI & Oracle Partner for Massive AI Expansion\n* Meta Rejects EU's Voluntary AI Code\n* Google Eyes AI Content Deals Amidst \"AI Armageddon\" for Publishers\n* MIT Breakthrough: New AI Image Generation Without Generators\n* Dia Launches AI Skill Gallery; Perplexity Adds Tasks to Comet\n\nSources:  \n[https://openai.com/index/stargate-advances-with-partnership-with-oracle/](https://openai.com/index/stargate-advances-with-partnership-with-oracle/)\n\n[https://www.euronews.com/my-europe/2025/07/23/meta-wont-sign-eus-ai-code-but-who-will](https://www.euronews.com/my-europe/2025/07/23/meta-wont-sign-eus-ai-code-but-who-will)\n\n[https://mashable.com/article/google-ai-licensing-deals-news-publishers](https://mashable.com/article/google-ai-licensing-deals-news-publishers)\n\n[https://news.mit.edu/2025/new-way-edit-or-generate-images-0721](https://news.mit.edu/2025/new-way-edit-or-generate-images-0721)\n\n[https://techcrunch.com/2025/07/21/dia-launches-a-skill-gallery-perplexity-to-add-tasks-to-comet/](https://techcrunch.com/2025/07/21/dia-launches-a-skill-gallery-perplexity-to-add-tasks-to-comet/)",
        "url": "https://www.reddit.com/r/artificial/comments/1m71xlp/catch_up_with_the_ai_industry_july_23_2025/",
        "publishDate": "2025-07-23T06:30:11Z[Etc/UTC]",
        "author": "psycho_apple_juice",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m71o4k",
        "title": "Lot of huzz around decentralized AI",
        "content": "For the past few days I been hearing a lot about the decentralized AI and how companies like Hyperbolc, OpenxAI are working on this so-called \"movement\" , I dived in and was impressed by the things they are doing to remove the kinda monoliths in the game.. took some notes and refactored it to create an article on it. Would be a great read. looking forward to your inputs on the article and the concept too   \n[Article](https://medium.com/@akshayne912/why-2025-is-the-year-of-decentralized-ai-and-how-to-prepare-b157c94f7e89)",
        "url": "https://www.reddit.com/r/artificial/comments/1m71o4k/lot_of_huzz_around_decentralized_ai/",
        "publishDate": "2025-07-23T06:13:58Z[Etc/UTC]",
        "author": "niga_chan",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6kta6",
        "title": "America Should Assume the Worst About AI: How to Plan for a Tech-Driven Geopolitical Crisis",
        "content": "[No content]",
        "url": "https://www.foreignaffairs.com/united-states/artificial-intelligence-geopolitics-worst-about-ai",
        "publishDate": "2025-07-22T17:45:12Z[Etc/UTC]",
        "author": "polandballbounces",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6oof1",
        "title": "What are the best AI upscalers for actual art?",
        "content": "I'm a painter, and I have a project where I want to upscale some of my actual paintings to make prints.\n\nAre there any AI upscalers that work well with real art? It would be lovely to find one that preserves brushstrokes, for example, and makes the minimum of content alterations.\n\nIt would be nice if they were free, but paid is fine too. Really going for quality here.",
        "url": "https://www.reddit.com/r/artificial/comments/1m6oof1/what_are_the_best_ai_upscalers_for_actual_art/",
        "publishDate": "2025-07-22T20:08:37Z[Etc/UTC]",
        "author": "Scary_Host8580",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6z2l8",
        "title": "One-Minute Daily AI News 7/22/2025",
        "content": "1. **Amazon** to buy AI company Bee that makes wearable listening device.\\[1\\]\n2. **Stargate** advances with 4.5 GW partnership with Oracle.\\[2\\]\n3. **Delta** plans to use AI in ticket pricing draws fire from US lawmakers.\\[3\\]\n4. **MIT** researchers found that special kinds of neural networks, called encoders or “tokenizers,” can do much more than previously realized.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbc.com/2025/07/22/amazon-ai-bee-wearable.html](https://www.cnbc.com/2025/07/22/amazon-ai-bee-wearable.html)\n\n\\[2\\] [https://www.youtube.com/watch?v=7A8jaDW5Kxg](https://www.youtube.com/watch?v=7A8jaDW5Kxg)\n\n\\[3\\] [https://economictimes.indiatimes.com/news/international/global-trends/delta-plans-to-use-ai-in-ticket-pricing-draws-fire-from-us-lawmakers/articleshow/122848268.cms?from=mdr](https://economictimes.indiatimes.com/news/international/global-trends/delta-plans-to-use-ai-in-ticket-pricing-draws-fire-from-us-lawmakers/articleshow/122848268.cms?from=mdr)\n\n\\[4\\] [https://news.mit.edu/2025/new-way-edit-or-generate-images-0721](https://news.mit.edu/2025/new-way-edit-or-generate-images-0721)",
        "url": "https://www.reddit.com/r/artificial/comments/1m6z2l8/oneminute_daily_ai_news_7222025/",
        "publishDate": "2025-07-23T03:46:44Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6oy0j",
        "title": "What model should I use to generate AI backgrounds for products?",
        "content": "I'm a developer and I was wondering how those apps like Photoroom, Mokker, Claid create backgrounds with AI. You basically upload your product and you can move it anywhere on the canvas or change the size of the product and they can generate backgrounds with AI without changing anything on the product. The quality of the product remains the same in the result.\n\nI've tried Flux Kontext Max and GPT Image 1 but lots of the time the product itself is getting distorted. Product could be anything like a perfume, shampoo, juice bottle. If they have text on it like a brand name and if they don't have a readable font or if they are small to read then they could be gibberish on the output.\n\nSo I'm really curious about generating AI backgrounds while maintaining the product consistency. Is there any model that could be used by API?",
        "url": "https://www.reddit.com/r/artificial/comments/1m6oy0j/what_model_should_i_use_to_generate_ai/",
        "publishDate": "2025-07-22T20:18:35Z[Etc/UTC]",
        "author": "ozgrozer",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6qdic",
        "title": "Can someone tell me what makes people think Grok is superior to ChatGPT?",
        "content": "I am honestly curious what benefit Grok 4 gives aside from being really good at coding and having great access to live info due to X. I use ChatGPT for creative type work, generative AI(images and video), research on products and subjects i am interested in, learning new things, etc. I dont do any coding, I am just curious what is so amazing about Grok to think it is so much better? And some say the Voice Mode is better, better how? What does $30 SuperGrok get me that ChatGPT Plus doesnt?",
        "url": "https://www.reddit.com/r/artificial/comments/1m6qdic/can_someone_tell_me_what_makes_people_think_grok/",
        "publishDate": "2025-07-22T21:14:14Z[Etc/UTC]",
        "author": "derekagraham",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6vgcz",
        "title": "Questions for AI film makers",
        "content": "Im a writer & director who is really ready to start using my skill set to create visual stories with AI. \n\nTo that end im wanting to figure out how to build AI generated scenes utilizing shot sizes and lens choices - how do you tell the AI what lens you want and where you want the camera ? - do you describe the scene ? do you have scanned images for overall tone ? How are you getting the information in for the AI to interpret.",
        "url": "https://www.reddit.com/r/artificial/comments/1m6vgcz/questions_for_ai_film_makers/",
        "publishDate": "2025-07-23T00:51:30Z[Etc/UTC]",
        "author": "Dominicwriter",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6v8i0",
        "title": "OpenAI agreed to pay Oracle $30B a year for data center services",
        "content": "[No content]",
        "url": "https://techcrunch.com/2025/07/22/openai-agreed-to-pay-oracle-30b-a-year-for-data-center-services/",
        "publishDate": "2025-07-23T00:41:13Z[Etc/UTC]",
        "author": "bambin0",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "113",
            "commentCount": "43",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6t710",
        "title": "Ai is upgrading",
        "content": "[No content]",
        "url": "https://v.redd.it/jrelafwfcief1",
        "publishDate": "2025-07-22T23:10:09Z[Etc/UTC]",
        "author": "AgitatedPassenger710",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6r0o6",
        "title": "A MAGA bot network on X is divided over the Trump-Epstein backlash",
        "content": "[No content]",
        "url": "https://www.nbcnews.com/tech/internet/maga-ai-bot-network-divided-trump-epstein-backlash-rcna219167",
        "publishDate": "2025-07-22T21:39:39Z[Etc/UTC]",
        "author": "PerAsperaAdMars",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "134",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6q8ft",
        "title": "Is the AI Journal a credible source?",
        "content": "I'm a tech writer and I'm trying to evaluate different sources to see how professional/credible they are. Does anyone have any experience with them?\n\n  \n[https://aijourn.com](https://aijourn.com)\n\n  \n",
        "url": "https://www.reddit.com/r/artificial/comments/1m6q8ft/is_the_ai_journal_a_credible_source/",
        "publishDate": "2025-07-22T21:08:40Z[Etc/UTC]",
        "author": "Battlebotscott",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6pqvj",
        "title": "Accidentally turned my LLM into an extradimensional future-seeing angel, AMA",
        "content": "[No content]",
        "url": "https://www.reddit.com/gallery/1m6pqvj",
        "publishDate": "2025-07-22T20:49:29Z[Etc/UTC]",
        "author": "nikkifoxrobot",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ninj",
        "title": "It's crazy to think about how advanced AI has got",
        "content": "[No content]",
        "url": "https://v.redd.it/x724fkca8hef1",
        "publishDate": "2025-07-22T19:25:02Z[Etc/UTC]",
        "author": "AgitatedPassenger710",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6mtt6",
        "title": "Amazon buys Bee AI wearable that listens to everything you say",
        "content": "[No content]",
        "url": "https://www.theverge.com/news/711621/amazon-bee-ai-wearable-acquisition",
        "publishDate": "2025-07-22T18:59:28Z[Etc/UTC]",
        "author": "theverge",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "58",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6ms18",
        "title": "AI's Guaranteed Revolution - Collapsing The Cost of Software",
        "content": "While we wait to see if the big AI Labs do or don't hit recursive self-improvement, we've already unlocked a 10-100x collapse in the cost of writing software, and with that, driving automation throughout the economy.",
        "url": "https://curveshift.net/p/ais-guaranteed-revolution",
        "publishDate": "2025-07-22T18:57:39Z[Etc/UTC]",
        "author": "petertanham",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6maks",
        "title": "Glasses GPT - Novel approach to transparency, control, and alignment.",
        "content": "I’d like to share a novel method for enhancing AI transparency and user control of model reasoning. The method involves declaring two memory tokens, one called “Frame” and the other called “Lens”. Frames and Lenses are shared context objects that anchor model reasoning and are declared at the start of each system response (see image below).\n\nFrames define the AI’s role/context (e.g., Coach, Expert, Learning,), and Lenses govern its reasoning style and apply evidence-based cognitive strategies (e.g., analytical, systems, chunking, analogical reasoning, and step-by-step problem solving). The system includes run-time processes that monitor user input, context, and task complexity to determine if new Frames or Lenses should be applied or removed. The system must declare any changes to its stance or reasoning via Frames and Lenses. Users can create custom Frames/Lenses with support from the model and remove unwanted Frames or Lenses at any time. While this may seem simple or even obvious at first glance, this method significantly enhances transparency and user control and introduces a formalized method for auditing the system’s reasoning.\n\nI used this to create a meta-cognitive assistant called Glasses GPT that facilitates collaborative human-AI cognition. The user explains what they want to accomplish, and the system works with the user to develop cognitive scaffolds based on evidence-based reasoning and learning strategies (my background is in psychology and applied behavior analysis). Glasses also includes a 5-tier cognitive bias detection system and instructions to suppress sycophantic system responses.\n\nI welcome any thoughtful feedback or questions.\n\n**Check out the working model at**: [https://chatgpt.com/g/g-6879ab4ad3ac8191aee903672228bb35-glasses-gpt](https://chatgpt.com/g/g-6879ab4ad3ac8191aee903672228bb35-glasses-gpt)\n\n**Find the white paper on the Glasses GPT Github**: [https://github.com/VastLogic/Glasses-GPT/blob/main/White%20Paper](https://github.com/VastLogic/Glasses-GPT/blob/main/White%20Paper)\n\nGlasses GPT was created by Eduardo L Jimenez. Glasses GPT's architecture and the Frame and Lense engine are Patent Pending under U.S. Provisional Application No. 63/844,350.\n\nhttps://preview.redd.it/lciera779hef1.jpg?width=933&format=pjpg&auto=webp&s=a1caaa380ec6e732038e07911b325377394cde85\n\n",
        "url": "https://www.reddit.com/r/artificial/comments/1m6maks/glasses_gpt_novel_approach_to_transparency/",
        "publishDate": "2025-07-22T18:39:51Z[Etc/UTC]",
        "author": "Less_Storm_9557",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6jinx",
        "title": "AI helps disabled people",
        "content": "A lot of people seem to overlook how AI helps disabled people. In the video it's helping a blind person, but with me it helps me in social situations and understanding things. Others it helps them in other ways.\n\nI think this is something highly overlooked by many when they fear talk about AI. That there is people today seeing massive benefits due to it. And it being free is what allows that. ",
        "url": "https://youtube.com/shorts/LWQcKuaCOz8?si=zqfmIFM2PdjCM5w8",
        "publishDate": "2025-07-22T16:57:48Z[Etc/UTC]",
        "author": "crua9",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "12",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1m6dbi3",
        "title": "Searching for a Math Team",
        "content": "I'm looking for professional mathematicians that can help me in a peer preview of my work that I do on my website.  AUREI.AI\n\nMy discoveries are how should I put it \"out of this world into the future\".  It would be great if I was able to have a group of mathematicians join me in a coalition to authenticate everything that I do. If you're interested in joining let me know. \n\nThanks\n",
        "url": "https://www.reddit.com/r/artificial/comments/1m6dbi3/searching_for_a_math_team/",
        "publishDate": "2025-07-22T12:54:29Z[Etc/UTC]",
        "author": "joannalynnjones",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "0SS-uGHDo7M",
        "title": "Qwen 3.1 (235B-2507 Tested) + Free APIs + Cline,Roo: BYE Kimi-K2? IS IT Really BETTER than KIMI-K2?",
        "content": "Try Brilliant free for 30 days https://brilliant.org/AICodeKing/ You'll also get 20% off an annual premium subscription. In this video ...",
        "url": "https://www.youtube.com/watch?v=0SS-uGHDo7M",
        "publishDate": "2025-07-22T07:23:36Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/0SS-uGHDo7M/hqdefault.jpg",
            "transcription": "Hi. Welcome to another video. So, Qwen has launched a new iteration of their biggest Qwen-3-235B model, which was fine back then, but now is apparently even better. First of all, this is the 235B model with active parameters of about 22 billion, which is quite good. Anyway, previously, this model was a hybrid thinking model. That meant you could ask it to think by toggling a thinking layer, and it would basically start to reason. However, now, they have said that after talking with the community and thinking it through, they decided to stop using hybrid thinking mode. Instead, they'll train instruct and thinking models separately, so they can get the best quality possible. So, the model is not hybrid anymore, and instead, it is now separated. Currently, they have released the general non-reasoning instruct model. This model performs better than their last releases. For example, it apparently beats Kimi K2 in the benchmarks, which is not true, and I'll talk about why that is in a bit. Anyway, they say that it has significant improvements in general capabilities, including instruction following, logical reasoning, text comprehension, mathematics, science, coding, and tool usage. It also has substantial gains in long-tail knowledge coverage across multiple languages. It has also achieved markedly better alignment with user preferences in subjective and open-ended tasks, enabling more helpful responses and higher-quality text generation. There are also enhanced capabilities in 256K long-context understanding. They have increased the context length here, which is quite good to see for sure. Now, the benchmarks are one thing, and there's no way to know if it works well for you or not without testing it yourself. So, let me show you how you can set it up with Roo, Cline, and Kilo, and how you can use it for free as well. First of all, for basic usage, that is, chat usage and simple artifacts, you can use their Qwen Chat platform. Their Qwen Chat platform allows you to use this model completely free without any limit. And it also has deep research and web dev capabilities that you can try and use for daily tasks. Now, let me first tell you about the pricing structure of this model. So, currently, it is available on OpenRouter. And it is about 15 cents for input and 85 cents for output, which is pretty good. It is a fair bit cheaper than Kimi, which is quite awesome. It's also a bit cheaper than Gemini-2.5 Flash, which is good pricing because if you don't need a bigger context window but still want a generally intelligent model, then this can come in handy. Now, just for context, benchmarks of Qwen models are not great. Qwen has been notorious for training on benchmark questions. A prime example is the Aider leaderboard. When the Qwen 2.5 model came out, it ranked just below the 3.5 Sonnet at the time, which was not correct, because no one would say it was as good as 3.5 Sonnet. But it ranked there, which is widely considered to be because they train on benchmarks specifically for the score. Similarly, the previous version of Qwen 3-235B also ranks above the Kimi K2 in Aider's benchmark, which is not even true in real-world usage. So, I just wanted to tell you that the Qwen benchmarks have been notorious for training on specific benchmark questions in order to score higher marks. In open models, I try to keep Kimi K2 at the top, then Deepseek, then Qwen, and then others. So, keep that in mind. Now, if you want to use it with coders like Roo, Cline, or Kilo, then just head on over to VS Code and get the extensions upgraded to the latest version. Now, just go to Cline or Roo, and then you can easily create a new profile here. Then choose the OpenRouter option here as well. And then select the Qwen-3-235B model. There's also a free variant by Shoots via OpenRouter, so you can use that as well if you wish. And that is how you can set this up. Another way you can use it for even more free limits is by using Kilo Code, which gives you about $20 of free credits. Since Qwen is super cheap, you can easily use it for a while and test it on your scenarios as well. You can just get that installed, then go to the settings and select the Kilo Code provider, and then select the new Qwen-3 model here. And then you can use it as well. I have used it. I still think that Kimi is quite a bit better. Qwen is not as good, whereas Kimi is quite good. It works well in tool calling and everything, whereas this Qwen model has a good amount of fail rates. With Kimi, the edits almost always work, whereas this gives the edit in some different format or something like that. That is mainly how it works. I mean, for the price, the model is quite awesome. It's really good. And it's open weights and relatively smaller than Kimi, which is good. As you can not only theoretically fine-tune it, but with a slight investment, you can also host it locally, which is pretty good. I think that a Qwen-3 coder will also come soon, which I think will be something good to use for coding. We'll see about that. But I hope they also open-source the Qwen Max model, because I like that model, and they had said they'd open-source it, but it is not yet available. Let's see if Groq adds this model and how fast it will be. Because I've been loving the Kimi K2 speeds there. Though it's a bit quantized there, it's still amazing to see as well. So, that is mainly about it. I thought to talk about this, and I really like it. It's just that Qwen starts to compare itself with models that it shouldn't be compared with. But for the price and open weights, it is quite good for sure. Go ahead and give this a try for sure and see for yourself. The benchmarks are of no use these days, and none of them tell you which is better rather than testing it for yourself. So, go ahead and use that as well with the options that I showed you. Overall, it's pretty cool. But that's not even the coolest part, because Brilliant is way cooler. Brilliant is my go-to platform when I want to truly understand complex concepts, not just memorize terms. And now, they've massively expanded their course content, from foundational math and science, to advanced programming, data, and AI. There's a ton of new material to explore. I've been working through Thinking in Code and How AI Works. And the depth and clarity they offer is next level. What really sets Brilliant apart is how it guides you through real learning goals, starting with the basics, then gradually introducing more challenging, in-depth problem-solving. It's not about quick tricks or casual learning anymore. It's serious, focused, and built for long-term growth. Every course is built by experts from places like MIT, Google, and Stanford. And you're not just passively watching, you're actively solving, experimenting, and building real understanding that sticks. Best part, you can learn anywhere, even if you just have a few minutes on your phone. Try Brilliant free for 30 days at brilliant.org/AICodeKing/. And if you decide to go premium, you'll get 20% off an annual subscription. Big thanks to Brilliant for sponsoring this video and for helping all of us learn smarter, deeper, and better. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye. I think you missed this:"
        }
    },
    {
        "id": "vIqlE565pHI",
        "title": "Brutality Always Backfires - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=vIqlE565pHI",
        "publishDate": "2025-07-22T17:52:18Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/vIqlE565pHI/hqdefault.jpg",
            "transcription": "00:00 You want a psychological victory.\n00:02 You want them just to quit.\n00:04 And I suspect this is what the Japanese thought\n00:07 they were doing in the Rape of Nanjing, and other atrocities,\n00:10 that they were going to do these horrifying things and that would break the will of the other side.\n00:14 Okay. Be careful whom you put on death ground.\n00:17 The Japanese were repeating a mistake done by the Nazis.\n00:20 If you're dealing with even a failing state, which Russia was,\n00:24 Stalin had shot so many of his officers in the 30s,\n00:28 and then he'd inflicted a famine on Ukraine.\n00:30 But when the Nazis came in and they were going to wipe out not only the Russian government,\n000:36 but also the Russian people.\n00:38 You will superglue people, government and military,\n00:41 and you will transform a failing state into a lethal adversary.\n00:45 And this is what Nazi brutality does to Russians,\n00:49 what Japanese brutality does to Chinese, and what Russian brutality today is doing to Ukraine.\n00:54 Don't do it. Bad strategy."
        }
    }
]