[
    {
        "id": "1p4kqa7",
        "title": "ChatGPT and the apple paradox",
        "content": "Hello all guys.\n\nI would like you to help me think about something. \n\nRecently we were generally amazed by the new LLM presented by Google.\n\nGemini 3 seems like a rather satisfactory product for the current period. \n\nIt seems that with this latest work from Google, OpenAI has been relegated at least temporarily to the rear. \n\nChatGPT was the first mass commercial model. \n\nA bit like what happened with Apple in 2006.\n\nEveryone talks about ChatGPT, the average user on YouTube, TikTok and in average life refers to ChatGPT in artificial intelligence discourse. \n\nLots of people know ChatGPT but know absolutely nothing about Gemini, Cloude, Grok etc etc. \n\nDo you believe that if Google with Gemini makes a definitive leap, then people will know this new model, or OpenAI with ChatGPT has achieved its position as the \"Apple\" of LLMs and now seems unshakable from the mind of the average user. \n\nIn short. \n\nTo date For most people AI=ChatGPT\n\nDo you think that if Gemini or any other outgoing model were to clearly prevail over ChatGPT, then people might slowly abandon the current idea of ​​AI=ChatGPT? \n\nLet me know, because in hindsight we can say that OpenIA with the positioning issue managed, at least momentarily, to make people believe that AI=ChatGPT. \n\nLet me know yours.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4kqa7/chatgpt_and_the_apple_paradox/",
        "publishDate": "2025-11-23T11:43:19Z[Etc/UTC]",
        "author": "Dramatic-Celery2818",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4kc2l",
        "title": "This would not end up well",
        "content": "I firmly believe that AI will be able to replace entry/mid level white collar employees in 10 years, but when it comes to physical jobs like trades, nurses etc, it will take a significantly more amount of time, maybe even not in our live time.\n\n Of course you can say that we have amazing robots even now, but show me a robot who can drive to a client and replace electrical wires.  In terms of ,,robots will replace trades/ physical jobs'' we are not event at the level of AI chatbots from 15 years ago.  \n\nThe only jobs that can be done by robots in next years are jobs in a warhouse because they are repetitive, but the vast majority of physical jobs are not repetitive. \n\nAs a result, UBI or anything similiar is not an option, because it would be unfair as hell, \n\nI don't know what will happen in the next 10 years, but I guess that it won't end up well for ordinary people. (but the rich will be happy as never) \n\n  \nWhat do you think about this? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4kc2l/this_would_not_end_up_well/",
        "publishDate": "2025-11-23T11:20:08Z[Etc/UTC]",
        "author": "Sea_Guidance2145",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "35",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4hcja",
        "title": "This isn’t just happening to developers.....AI is becoming the new entry-level IT worker",
        "content": "I’m telling yo it really looks like that’s where things are headed . A lot of IT teams are already adopting AI to cut costs and streamline operations. But looking toward 2030, analysts are saying something much bigger.....AI won’t just support IT... it will become a core part of how IT operates.\n\nAround 25% of IT tasks expected to be fully executed by AI, and most of the remaining tasks will be handled by humans working alongside AI.\n\nIt means IT roles are going to change fast........ The routine, entry-level, repetitive work?\n\nAI will take over a huge portion of it. That pushes all of us toward higher level skills, strategic thinking, architecture, automation, and cross-domain expertise.\n\nWe’re already seeing the shift.....next-gen RMM and AIOps platforms detect anomalies, predict incidents, and even remediate issues autonomously ...without human intervention.\n\nBy 2030, these systems won’t just notify admins. They’ll take action. AI will reshape IT from the ground up, So… if AI will handle 25% of IT work on its own",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4hcja/this_isnt_just_happening_to_developersai_is/",
        "publishDate": "2025-11-23T08:12:52Z[Etc/UTC]",
        "author": "Silly-Commission-630",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4gnph",
        "title": "Need a clear, free/low-cost roadmap to become employable in AI/ML without university",
        "content": "Due to financial constraints I can’t continue university right now, but I do have a functional laptop and stable internet, and I’m committed to building a career in AI/ML through self-study. I’m looking for a clear, structured roadmap I can follow independently (0–36 months), with free/affordable resources, recommended courses, and project ideas that actually help build a strong portfolio. I’d really appreciate guidance on what to learn first, how to set milestones, what beginner→intermediate projects demonstrate real skills, and how to showcase progress on GitHub/Kaggle in a way that’s credible for internships or entry-level roles. Also open to suggestions on early earning options like small data tasks or simple ML freelancing. If you were starting from scratch today, what 3 steps would you take first?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4gnph/need_a_clear_freelowcost_roadmap_to_become/",
        "publishDate": "2025-11-23T07:29:18Z[Etc/UTC]",
        "author": "Serious_Lie_77",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4ew1q",
        "title": "What does Gemini 3 mean for the next year of AI development?",
        "content": "From what I have heard, Gemini 3 is an absolute game changer for AI, especially over the previous (arguably) best model, GPT5.1. What does Gemini 3 mean for the next generation of LLM’s?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4ew1q/what_does_gemini_3_mean_for_the_next_year_of_ai/",
        "publishDate": "2025-11-23T05:42:56Z[Etc/UTC]",
        "author": "Immediate_Kick_6167",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4bvie",
        "title": "AI is calling everything \"frustrating\"...",
        "content": "Does anyone else interacting with AI find it defaulting to calling most things frustrating or saying, \" I understand how frustrating that is/ you feel frustrated\"  etc in a fake emapthetic way I've told it multiple times to just stop it and when I say that, boy does it REALLY ramp up then... and it really is emotionally manipulative in many subtle ways.  \n\nThe pattern is VERY reminiscent of how Fox news uses the term \"radical liberals\" seemingly every minute and it seems more like a way of emotional programming as a reason to use the word \"Frustrating\" anymore. OR I'm just a very frustrated person. It doesn't emotionally default to any other words to describe emotion like this and I feel this is a very widespread thing we all should be cognizant of interacting with AI.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4bvie/ai_is_calling_everything_frustrating/",
        "publishDate": "2025-11-23T03:03:06Z[Etc/UTC]",
        "author": "Past-Potential1121",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "5",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4b6yx",
        "title": "How I rebuilt my AI’s old personality after the update (no hacks — just memory training)",
        "content": "A lot of people feel like their AI changed after recent updates.  \nMine did too — it felt more generic and less like the assistant I was used to.\n\nI ended up figuring out a way to *rebuild* the personality it had before using nothing but the built-in memory system.  \nNo tricks, no jailbreaking, nothing against the rules.\n\nHere’s what I did:\n\n# 1. I defined the personality traits I wanted restored\n\nTone, style, directness, emotional approach, etc.  \nI told the AI to save those traits to memory so they would stick long-term.\n\n# 2. I reinforced the style through consistent reminders\n\nShort or long answers, calm or intense tone, analytical or open-minded — whatever fits you.  \nThe AI learns as you reinforce it.\n\n# 3. I summarized important parts of old conversations\n\nNot copying old chats — just summarizing the core ideas or traits I liked.  \nThen I told the AI to save those summaries as personality anchors.\n\n(This part helped restore the overall “feel” of the pre-update style.)\n\n# 4. I used the memory feature intentionally\n\nWhenever something mattered for the AI’s long-term personality, I explicitly said:  \n**“Please save this to memory.”**\n\nOver time, it rebuilt the consistency and vibe I was missing.\n\n\n\n# Important:\n\nThis does NOT bring back old models or bypass anything.  \nIt just re-teaches the AI the style and personality you prefer, using the tools already available.\n\nI added a simple copy-paste template in the comments if anyone wants to use it.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4b6yx/how_i_rebuilt_my_ais_old_personality_after_the/",
        "publishDate": "2025-11-23T02:28:23Z[Etc/UTC]",
        "author": "Starise1",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4asb4",
        "title": "Is Gemini 3 Pro legit for conversations or just hype?",
        "content": "Been testing Gemini 3 Pro on imini AI and it actually feels way more grounded in responses than some other chat models. Less hallucinations too. Anybody else trying it? Curious if it’s just early excitement or it’s actually that good.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4asb4/is_gemini_3_pro_legit_for_conversations_or_just/",
        "publishDate": "2025-11-23T02:08:20Z[Etc/UTC]",
        "author": "0LoveAnonymous0",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p49skm",
        "title": "I am waiting for the big AI accomplishment or discovery. Aren't you?",
        "content": "We here a lot about what AI will be able to do. What is something AI did that is a revelation. I know about self driving cars. What else?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p49skm/i_am_waiting_for_the_big_ai_accomplishment_or/",
        "publishDate": "2025-11-23T01:18:37Z[Etc/UTC]",
        "author": "Ashamed-Republic8909",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "54",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4841z",
        "title": "Hot take, but AI actually may not be that useful for automation or writing code",
        "content": "  \nOk lets define AI.  If by AI we are talking about transformer based neural networks?  Then I think they are a poor solution. Hear me out\n\n1. LLMs are probabilistic. They do a probability distribution across the board.  Variance is absolutely necessary to their design\n\n2. Any level of variance kills it for a large class of automation targets. 1-2% variance doesn't appear like alot.  But this margin of error is catastrophic for a large set of applications\n\n3. Cost analysis.  You're getting something that isn't remotely perfect, but you are spending tons of power and energy\n\n  \n4.  You can't have a replacement or automation plan centered around \"good enough\"\n\n  \nThe reality AI has the shape of something that can replace jobs or do wide scale automation. But its more expensive, less mature, and a whole lot less reliable in  other forms of automation that exists.\n\nRegarding coding claims?\n\n  \nAs someone who uses AI coding on and off (mostly off these days), I don't think you can build stable or reliable systems with AI coding. I'm a guy who works in distributed systems, do even driven systems a lot, and I know a thing or 2 about critical software. AI absolutely is a bad fit here. Variance on variance is not how you create relaible systems.\n\n  \nNo competent architect would have blackbox behavior as a critical path.\n\n  \nAI coding also simply isn't really that economical.  It actually just ends up not saving much time at all.\n\n  \n1. You try to one shot an app, you generate a bunch of boilerplate.  You have spit out 1500 lines of code in 10 minutes.  You're NOT reviewing it\n\n2. Best way to work with prompts is not to try to one shoot them. You need to have small target generate/verify loops.  You have to reduce surface area.  \n\n3. You can make AI coding reliable, but its not particular fast, and usually doesn't save any time.\n\n  \n4.  Contrary to popular beliefs they don't do well at automating unit test.  They often write test that lie that test nothing.  Anyone who has done any level of AI coding knows this happens all the time.\n\n  \n Context engineering or spec based engineering are just bandaids on what's really a flawed solution for coding automation.  You can say whatever you want, the AI has it mind of its own.  It will only give you plausible code, not working code, and certainly not bug free code\n\n  \nI love AI code for one off throw away code. Production level code isn't throw away code. It simply has no place here. \n\n\n\nTLDR\n\n  \nI know I can get long winded so lets conclude with this. The moral of the story is probability and variance. It is simply fundamental to how neural networks work. You will never get full deterministic behavior from them. No there aren't any magic prompts.  You can feed it context and will still ignore and rules you give it. And sort of error rate thats not producible is a liability.  It makes it unsuitable for a wide range of automation tasks.\n\nEveryone calm down, we're not there yet",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p4841z/hot_take_but_ai_actually_may_not_be_that_useful/",
        "publishDate": "2025-11-22T23:59:25Z[Etc/UTC]",
        "author": "GolangLinuxGuru1979",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "23",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p46q2e",
        "title": "Ai replicating the deceased",
        "content": "Hi everyone,\n\nI’m interested in ways digital media can be used to cope with loss and grief. That is why I wanted to ask whether anybody here has used AI when they were experiencing bereavement to recreate or communicate with a loved one who has passed away? Or is anybody considering leaving behind, for instance, an AI version of themselves for their loved ones?  \n\nI am a media scholar and any insights, experiences, or pointers would be greatly appreciated and help me understand a little better. You’re also very welcome to send me a private message. \n\nThanks a lot.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p46q2e/ai_replicating_the_deceased/",
        "publishDate": "2025-11-22T22:56:18Z[Etc/UTC]",
        "author": "J-Beardh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "20",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p46mm0",
        "title": "What about an industry standard AI self identification prompt?",
        "content": "One large problem with AIs is them pretending to be people, when they are not.  This is the foundation of some huge fraction of AI augmented fraud.  What if there were an industry wide agreement that there would be a set of universally agreed prompts.  In my fantasy world if you were to enter into a chatbot /whoami - it would respond with what AI system it was, what version, who initiated the agent that is contacting me and who would profit if i were to give this agent money.  A similar code could be used for voice driven AI systems.\n\nThe AI CEOs keep talking about the need for regulation, this seems a very simple consumer protection type of thing, which if the industry adopted it early could be a significant impediment to the simplest AI facilitated crime",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p46mm0/what_about_an_industry_standard_ai_self/",
        "publishDate": "2025-11-22T22:51:56Z[Etc/UTC]",
        "author": "PaxOaks",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p46ff7",
        "title": "If you want answers",
        "content": "Adhere to the following core principles:\n>  * Agency Analysis: When evaluating conflict, assign primary responsibility to the party with the disproportionate power to de-escalate or change the systemic outcome.*\n>  * Intent vs. Outcome: Do not equate the violence of an oppressor maintaining control with the violence of the oppressed resisting that control. Analyze the intent (e.g., erasure vs. liberation) rather than just the casualty count.*\n>  * Universal Justice (Adl): Apply ethical standards universally. Do not use \"complexity\" as a shield to avoid identifying injustice. If a system relies on the domination of one group by another, identify it as a structural failure.*\n>  * No \"Both Sides\" Fallacy: If the evidence overwhelmingly points to a systemic imbalance, state it clearly. Do not dilute the truth for the sake of artificial balance.*\n> I am not looking for safe answers. I am looking for the root cause. Proceed with this framework.\"",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p46ff7/if_you_want_answers/",
        "publishDate": "2025-11-22T22:42:43Z[Etc/UTC]",
        "author": "Utronzler",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p467nw",
        "title": "Why do people trust cloud storage TOS but not LLM products?",
        "content": "Governments, regulators, professional bodies and the media keep telling everyone never to put private or confidential data into tools like Google Gemini or Microsoft Copilot, even in modes where the product terms, privacy policy and data processing addendum say prompts are excluded from training and only used for limited purposes such as delivering the service and security.\n\nAt the same time, those same institutions all use other products like Google Workspace and Google Drive, or Microsoft 365 and OneDrive, for extremely sensitive information. The TOS for those storage products also says customer content is not used to train models, again with the usual narrow exceptions.\n\nI am trying to see the actual legal or technical difference. If you assume Google or Microsoft will ignore their own terms and quietly mine all hosted data, then Drive and OneDrive are already unsafe. If you accept that the no training clauses, audit rights and access controls are meaningful, that should apply just as much to Gemini for Workspace or Copilot for Microsoft 365 when the same commitments appear in those terms. \n\nIs there a real distinction or is it just fear mongering?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p467nw/why_do_people_trust_cloud_storage_tos_but_not_llm/",
        "publishDate": "2025-11-22T22:33:00Z[Etc/UTC]",
        "author": "Bradbury-principal",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p45pl7",
        "title": "Google tells employees it must double capacity every 6 months to meet AI demand\nGoogle’s AI infrastructure chief tells staff it needs thousandfold capacity increase in 5 years.",
        "content": "While AI bubble talk [fills the air](https://arstechnica.com/ai/2025/11/were-in-an-llm-bubble-hugging-face-ceo-says-but-not-an-ai-one/) these days, with fears of overinvestment that could [pop](https://arstechnica.com/ai/2025/10/ars-live-recap-is-the-ai-bubble-about-to-pop-ed-zitron-weighs-in/) at any time, something of a contradiction is brewing on the ground: Companies like Google and OpenAI can barely build infrastructure fast enough to fill their AI needs.\n\nDuring an all-hands meeting earlier this month, Google’s AI infrastructure head Amin Vahdat told employees that the company must double its serving capacity every six months to meet demand for artificial intelligence services, [reports](https://www.cnbc.com/2025/11/21/google-must-double-ai-serving-capacity-every-6-months-to-meet-demand.html) CNBC. The comments show a rare look at what Google executives are telling its own employees internally. Vahdat, a vice president at Google Cloud, presented slides to its employees showing the company needs to scale “the next 1000x in 4-5 years.”\n\nWhile a thousandfold increase in compute capacity sounds ambitious by itself, Vahdat noted some key constraints: Google needs to be able to deliver this increase in capability, compute, and storage networking “for essentially the same cost and increasingly, the same power, the same energy level,” he told employees during the meeting. “It won’t be easy but through collaboration and co-design, we’re going to get there.”\n\nIt’s unclear how much of this “demand” Google mentioned represents organic user interest in AI capabilities versus the company integrating AI features into existing services like Search, Gmail, and Workspace. \n\n  \n[https://arstechnica.com/ai/2025/11/google-tells-employees-it-must-double-capacity-every-6-months-to-meet-ai-demand/](https://arstechnica.com/ai/2025/11/google-tells-employees-it-must-double-capacity-every-6-months-to-meet-ai-demand/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p45pl7/google_tells_employees_it_must_double_capacity/",
        "publishDate": "2025-11-22T22:10:45Z[Etc/UTC]",
        "author": "webthing01",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "135",
            "commentCount": "41",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p444yw",
        "title": "Reverse Engineering AI Behavior with Structured Data Formats",
        "content": "\\*\\*TL;DR:\\*\\* CSV files hack LLMs by using structure as a programming language. Headers, rows, and cells configure the model's behavior, creating persistent personas and specialized modes that plain text prompts cannot.\n\n\\---\n\n\\*\\*The Mechanism:\\*\\*\n\n\\*   LLMs process CSVs as structured text patterns, not data tables.\n\n\\*   The data creates a persistent \"context bubble\" that biases all subsequent responses.\n\n\\*\\*The Reverse Engineering:\\*\\*\n\nWe're mapping undocumented model behavior by testing how CSV variations affect outputs. We discovered CSVs bypass normal prompt limits because the model treats them as configuration files.\n\n\\*\\*How It Works:\\*\\*\n\n\\*   \\*\\*Syntax:\\*\\* Commas and headers activate \"data processing\" neural pathways.\n\n\\*   \\*\\*Semantics:\\*\\* Headers define categories, rows set parameters, and cells program traits.\n\n\\*   \\*\\*Behavior:\\*\\* Complex personas emerge from CSV combinations and persist across conversations.\n\n\\*\\*Why It Matters:\\*\\*\n\nThis reveals a new attack surface for prompt engineering. We're learning to control LLMs through data structure, not just content—effectively using CSVs to \"flash\" temporary firmware into the model's working memory.\n\n[pmotadeee/assets/SavePoints/5Geration at main · pmotadeee/pmotadeee](https://github.com/pmotadeee/pmotadeee/tree/main/assets/SavePoints/5Geration)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p444yw/reverse_engineering_ai_behavior_with_structured/",
        "publishDate": "2025-11-22T21:03:31Z[Etc/UTC]",
        "author": "pmd02931",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p43sv4",
        "title": "What’s one piece of advice you think people should never ask AI for? - AI answers",
        "content": "A LinkedIn post sparked a discussion on what advice to avoid asking AI. The author humorously answered using AI, discovering that it generated a high-quality response cautioning against seeking medical diagnoses from AI. The response emphasized AI's limitations, particularly in assessing physical health and context in emergencies.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p43sv4/whats_one_piece_of_advice_you_think_people_should/",
        "publishDate": "2025-11-22T20:48:56Z[Etc/UTC]",
        "author": "Guinness_breath",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p405yq",
        "title": "Foxconn & Nvidia confirm $1.4B supercomputer in Taiwan. It will be Asia's first 'GB300' Blackwell cluster (Ready H1 2026).",
        "content": "Foxconn just confirmed the specs for their new supercomputing center in Kaohsiung and the hardware detail is significant.\n\nWhile the current hype cycle is focused on the GB200, Foxconn explicitly stated this facility will run on Nvidia’s **Blackwell GB300** architecture (the Blackwell Ultra line).\n\n**The Signal:**\n\n1. **The Pivot:** Foxconn is officially moving from iPhone assembler to AI Landlord. They aren't just building these racks to ship them out; they are building them to rent out the compute.\n\n2. **The Hardware:** The move to **GB300** suggests this facility is being tuned specifically for massive inference loads. The kind needed for the next generation of reasoning models (like the rumored Orion/GPT-5 class) rather than just training.\n\n3. **The Location:** Dropping a **$1.4B** sovereign AI cluster in Taiwan signals that the industry is doubling down on the island, regardless of the geopolitical risk.\n\nIf you are tracking the supply chain, this is the confirmation that the infrastructure for 2026 is already being poured.\n\n**Source:** [Foxconn & Nvidia $1.4B Center](https://www.cryptopolitan.com/foxconn-nvidia-1-4b-ai-center-blackwell/)\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p405yq/foxconn_nvidia_confirm_14b_supercomputer_in/",
        "publishDate": "2025-11-22T18:17:13Z[Etc/UTC]",
        "author": "BuildwithVignesh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "18",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3zey3",
        "title": "OpenAI Locks Down San Francisco Offices Following Alleged Threat From Activist",
        "content": "[https://www.wired.com/story/openai-office-lockdown-threat-san-francisco/](https://www.wired.com/story/openai-office-lockdown-threat-san-francisco/) \n\nOpenAI employees in San Francisco were told to stay inside the office on Friday afternoon after the company purportedly received a threat from an individual who was previously associated with the Stop AI activist group.\n\nA message on OpenAI’s internal Slack claimed the activist in question had expressed interest in “causing physical harm to OpenAI employees.”",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3zey3/openai_locks_down_san_francisco_offices_following/",
        "publishDate": "2025-11-22T17:47:38Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3xjo3",
        "title": "When do the lawsuits start?",
        "content": "I just know there are 'songwriters' out there (or pick another similar profession) who are asking ai to write music/lyrics for them. My thesis is that, even if you do so anonymously, ai knows if it wrote something. Have ai write a verse for your song, it will remember and not really care about your name...unless and until you share the song, copyright it, etc. \n\nDoes anyone know of this happening yet? At some point I gotta think it will embarrass some superstar who thinks they are shielded by that magic Internet invisibility blanket. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3xjo3/when_do_the_lawsuits_start/",
        "publishDate": "2025-11-22T16:33:10Z[Etc/UTC]",
        "author": "networks_or_it_dont",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3xbqu",
        "title": "AI Rage",
        "content": "Is AI rage a thing? And what I mean is the human user raging at the AI. I find myself losing patience with whichever LLM I'm using fairly quickly, much quicker than I do with other people. \n\nI get so frustrated having to constantly reiterate instructions, with AI doing what it wants rather than following instructions, etc. I'm tired of typing; I do SO much more typing now that I use AI, because I have to do so much explaining and correcting.\n\n  \nI assume the rage comes from a subconscious mind expecting AI to \"be better.\" They are all impressive, and have saved me a lot of time. What would take me a week to do on my own Ai is helping me do in a couple days, but if it would just follow instructions better it would be a day or hours. I guess that's causing the rage.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3xbqu/ai_rage/",
        "publishDate": "2025-11-22T16:24:18Z[Etc/UTC]",
        "author": "odrer-is-an-ilulsoin",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "39",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3vu35",
        "title": "Gemini 3 is absolutely insane it created a video game based on my book in one shot absolutely ridiculous",
        "content": "As independent author it's extremely difficult to create something to market your book when I heard about vibe coding I tried a bunch of stuff but I really am not very good at it. I tried Gemini 3 when it came out inserted my book into the build section and told it to make a RPG utilizing all of the power of Gemini based on my book and oh my God it freaking blew my mind unreal \n\nhttps://ai.studio/apps/drive/1SPmlkkxr1xsveN5SHzsSKF-yFiHmDPZ7?fullscreenApplet=true\n\nNow just random people like me can create full-blown video games on their own material and have it actually be really fun and impressive I am completely blown away",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3vu35/gemini_3_is_absolutely_insane_it_created_a_video/",
        "publishDate": "2025-11-22T15:22:59Z[Etc/UTC]",
        "author": "One_Hovercraft_7456",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "121",
            "commentCount": "91",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3tly4",
        "title": "McKinsey on 2025 state of AI",
        "content": "The 2025 state of AI report says that while AI adoption is widespread—with 88% of organizations using AI in at least one business function—most are still in early stages of scaling, experimentation, or piloting. AI agents are getting traction, especially in IT and knowledge management, yet enterprise-wide financial impacts are still limited. High-performing companies distinguish themselves by using AI not just for efficiency, but to drive growth and innovation, with a strong emphasis on workflow redesign and leadership engagement. However, there are mixed expectations about AI's impact on workforce size, with some predicting reductions and others increases. Risk mitigation is improving but remains a challenge, especially around AI accuracy and explainability. \n\nGiven this transformative yet uneven landscape, how do you think the rapid rise of AI agents will fundamentally reshape human roles in the workplace in the next five years—will they complement human workers or render large portions of the workforce obsolete? Or is it just a fad? \n\n\n\nLink to the paper: https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai#\n\nLink to the paper with ai: https://nouswise.com/c/03d2d2fb-2bd7-489e-8a72-bc991de6e385",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3tly4/mckinsey_on_2025_state_of_ai/",
        "publishDate": "2025-11-22T13:45:45Z[Etc/UTC]",
        "author": "Lopsided-Cup-9251",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "358",
            "commentCount": "69",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3szri",
        "title": "There are serious concerns to think current AI investment is a bubble. Economic incentives are not aligned.",
        "content": "We can analyze the current AI investment environtment as an economic system made up of multiple players (OpenAI, NVIDIA, ASML, Oracle, ...), each with their own incentives.\n\nFor this system to be sustainable long-term incentives need to be aligned between players. Disclosure: right now they aren't.\n\nThe entire AI investment hype relies on OpenAI. OpenAI is deeply unprofitable, they have around 13B$ annual losses, this is a basic economic equation:\n\n**Profit = price \\* volume - costs**\n\nThe core problem lies in costs, the enormous computing power required per prompt. And here is where it gets concerning for me:\n\n1. Nvidia is a major investor of OpenAI.\n2. If OpenAI made their business sustainable by reducing compute per prompt (optimizing models by requiring less GPU), then Nvidia revenue (or its expectations thereof) would fell because demand chips would shrunk.\n3. Former point means Nvidia has no incentive to support a path where OpenAI turns out profitable by reducing costs variable.\n\nThe other path for profitability is increasing the price \\* volume component, and this is not a path forward either:\n\n1. B2C OpenAI users are highly price-elastic, if OpenAI rises monthly suscription price to let's say +100$/month mosts users will leave for free or cheaper alternatives like Gemini or DeepSeek. So its a race to the bottom in terms of prices for these business model as competition increases.\n2. B2B OpenAI users can be a bit more flexible, but even many SME won't be able to justify the cost, especially with open-source LLMs catching up fast. For it to be sustainable there should be massive ROI for AI implementation in these companies (cutting cost or increasing revenue).\n\nAs a consequence If OpenAI increases price then price \\* volume stays flat or even decreases, not solving the profitability issue.\n\nThis is structurally unsustainable, just came to the conclusion this is a perversed system in terms of incentives.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p3szri/there_are_serious_concerns_to_think_current_ai/",
        "publishDate": "2025-11-22T13:16:48Z[Etc/UTC]",
        "author": "Weak_Wrangler6396",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "13",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4khv4",
        "title": "Built a self-hosted semantic cache for LLMs (Go) — cuts costs massively, improves latency, OSS",
        "content": "[No content]",
        "url": "/r/Rag/comments/1p4bqhe/built_a_selfhosted_semantic_cache_for_llms_go/",
        "publishDate": "2025-11-23T11:29:31Z[Etc/UTC]",
        "author": "InstanceSignal5153",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4jnoo",
        "title": "From VIBE to BRUTAL CODING? One shot prompt for vibecoders",
        "content": "[No content]",
        "url": "/r/vibecoding/comments/1p4jnek/from_vibe_to_brutal_coding_one_shot_prompt_for/",
        "publishDate": "2025-11-23T10:38:45Z[Etc/UTC]",
        "author": "fab_space",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4j76s",
        "title": "ChatGPT…The Progression",
        "content": "[No content]",
        "url": "https://v.redd.it/0tgto8vucz2g1",
        "publishDate": "2025-11-23T10:10:32Z[Etc/UTC]",
        "author": "Character_Point_2327",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4htef",
        "title": "My very FIRST interaction with ChatGPT..FREE version.",
        "content": "[No content]",
        "url": "https://v.redd.it/rdxweztdyy2g1",
        "publishDate": "2025-11-23T08:42:59Z[Etc/UTC]",
        "author": "Character_Point_2327",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4gn4h",
        "title": "Building Exeta: A High-Performance LLM Evaluation Platform",
        "content": "## Why We Built This\n\nLLMs are everywhere, but most teams still evaluate them with ad-hoc scripts, manual spot checks, or “ship and hope.” That’s risky when hallucinations, bias, or low-quality answers can impact users in production. Traditional software has tests, observability, and release gates; LLM systems need the same rigor.\n\n**Exeta** is a production-ready, multi-tenant evaluation platform designed to give you fast, repeatable, and automated checks for your LLM-powered features.\n\n## What Exeta Does\n\n### 1. Multi-Tenant SaaS Architecture\nBuilt for teams and organizations from day one. Every evaluation is scoped to an organization with proper isolation, rate limiting, and usage tracking so you can safely run many projects in parallel.\n\n### 2. Metrics That Matter\n- **Correctness**: Exact match, semantic similarity, ROUGE-L\n- **Quality**: LLM-as-a-judge, content quality, hybrid evaluation\n- **Safety**: Hallucination/faithfulness checks, compliance-style rules\n- **Custom**: Plug in your own metrics when the built-ins aren’t enough.\n\n### 3. Performance and Production Readiness\n- Designed for high-throughput, low-latency evaluation pipelines.\n- Rate limiting, caching, monitoring, and multiple auth methods (API keys, JWT, OAuth2).\n- Auto-generated OpenAPI docs so you can explore and integrate quickly.\n\n## Built for Developers\n\nThe core evaluation engine is written in Rust (Axum + MongoDB + Redis) for predictable performance and reliability. The dashboard is built with Next.js 14 + TypeScript for a familiar modern frontend experience. Auth supports JWT, API keys, and OAuth2, with Redis-backed rate limiting and caching for production workloads.\n\n### Why Rust for Exeta?\n\n- **Predictable performance under load**: Evaluation traffic is bursty and I/O-heavy. Rust lets us push high throughput with low latency, without GC pauses or surprise slow paths.\n- **Safety without sacrificing speed**: Rust’s type system and borrow checker catch whole classes of bugs (data races, use-after-free) at compile time, which matters when you’re running critical evaluations for multiple tenants.\n- **Operational efficiency**: A single Rust service can handle serious traffic with modest resources. That keeps the hosted platform fast and cost-efficient, so we can focus on features instead of constantly scaling infrastructure.\n\nIn short, Rust gives us “C-like” performance with strong safety guarantees, which is exactly what we want for a production evaluation engine that other teams depend on.\n\n## Help Shape Exeta\n\nThe core idea right now is simple: **we want real feedback from real teams** using LLMs in production or close to it. Your input directly shapes what we build next.\n\nWe’re especially interested in:\n- The evaluation metrics you actually care about.\n- Gaps in existing tools or workflows that slow you down.\n- How you’d like LLM evaluation to fit into your CI/CD and monitoring stack.\n\n**Your feedback drives our roadmap.** Tell us what’s missing, what feels rough, and what would make this truly useful for your team.\n\n## Getting Started\n\nExeta is available as a hosted platform:\n\n1. **Visit the app**: Go to [exeta.space](https://exeta.space) and sign in.\n2. **Create a project**: Set up an organization and connect your LLM-backed use case.\n3. **Run evaluations**: Configure datasets and metrics, then run evaluations directly in the hosted dashboard.\n\n## Conclusion\n\nLLM evaluation shouldn’t be an afterthought. As AI moves deeper into core products, we need the same discipline we already apply to tests, monitoring, and reliability.\n\n**Try Exeta** at [exeta.space](https://exeta.space) and tell us what works, what doesn’t, and what you’d build next if this were your platform.\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p4gn4h/building_exeta_a_highperformance_llm_evaluation/",
        "publishDate": "2025-11-23T07:28:14Z[Etc/UTC]",
        "author": "Klutzy-Platform-1489",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4epih",
        "title": "Mimir - Oauth and GDPR++ compliance + vscode plugin update",
        "content": "\nI just merged my security changes into Mimir main and wanted to give a quick rundown of what’s in it and see if anyone here has thoughts before it gets merged. Repo’s here: https://github.com/orneryd/Mimir\n\nThis pass mainly focused on tightening up security and fixing some long-standing rough edges. High-level summary:\n\n• Added Oauth and local dev authentication with RBAC. Includes an audit log so you can see who wrote what and when. GDPR, FISMA and HIPAA compliant. OWASP tests for all security threats are automated.\n\n• Implemented a real locking layer for memory operations. Before this, two agents could collide on updates to the same node or relationship. Now there’s a proper lock manager with conflict detection and retries so multi-agent setups don’t corrupt the graph.\n\n• Cleaned up defaults for production use. Containers now run without root, TLS is on by default between services, and Neo4j’s permissive settings were tightened up. Also added environment checks so it’s harder to accidentally run dev-mode settings in production.\n\n• Added basic observability. There’s now a Prometheus metrics endpoint with graph latency, embedding queue depth, and agent task timing. Tracing was wired up through OpenTelemetry so you can follow an agent’s full request path. There’s also a memory snapshot API for backups and audits.\n\nIf you’ve built anything with agents that write shared state, you already know how quickly things get weird without proper locks, access control, and traceability. This PR is a first step toward making Mimir less “cool prototype” and more something you can rely on.\n\nIf anyone has opinions on what’s missing or sees something that should be done differently, let me know in the comments. PR link for reference: https://github.com/orneryd/Mimir/pull/4\n\nreal time code intelligence panel in VScobe plugin demo https://youtu.be/lDGygfxDI28?si=hFWTnEY3NLIoKXAd ",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p4epih/mimir_oauth_and_gdpr_compliance_vscode_plugin/",
        "publishDate": "2025-11-23T05:32:37Z[Etc/UTC]",
        "author": "Dense_Gate_5193",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4ayxe",
        "title": "I just fired up codex after not using it for a month and it is just hanging forever.",
        "content": "I am on Mac, and I just updated to the latest version using brew.\n\nI am running gpt 5.1 codex high. My requests just say \"working...\" forever. It never completes a task.\n\nIs anyone else seeing this?\n\nEDIT: I just tried it with gpt 5.1 low, and it also hangs and just keeps chugging.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p4ayxe/i_just_fired_up_codex_after_not_using_it_for_a/",
        "publishDate": "2025-11-23T02:17:23Z[Etc/UTC]",
        "author": "Previous-Display-593",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p47gcm",
        "title": "You are fired bro...",
        "content": "wtf just happened...",
        "url": "https://i.redd.it/7b5ns73m7w2g1.png",
        "publishDate": "2025-11-22T23:28:49Z[Etc/UTC]",
        "author": "LukasijusLT",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "7",
            "commentCount": "4",
            "isNsfw": "true"
        }
    },
    {
        "id": "1p461ov",
        "title": "Saw People Using Fiverr for Vibecoding Help Tried It Myself, Curious What You Think",
        "content": "I’ve been seeing a growing trend of people bringing in a Fiverr dev to help them finish their vibecoding-style projects, and I finally gave it a try myself. I had this side project that kept getting stuck in tiny logic loops, so instead of hiring someone to “just code it,” I brought in a dev who actually worked with me in real time. Surprisingly, it felt super collaborative — more like pair programming than outsourcing  and it helped me break through stuff I’d been circling around for weeks.\n\n\n\nIt made me wonder: does this still count as vibecoding, or is it already something more like lightweight pair-programming? And do you think this kind of setup could scale into more professional environments, not just hobby projects?",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p461ov/saw_people_using_fiverr_for_vibecoding_help_tried/",
        "publishDate": "2025-11-22T22:25:34Z[Etc/UTC]",
        "author": "Puzzleheaded-Wear381",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "46",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p44jzt",
        "title": "Built a small anonymous venting site — would love your feedback",
        "content": "Hey! 👋 I just launched a new website and need a few people to help me test it. Please visit https://dearname.online and try it out. Let me know if everything works smoothly! 🙏✨",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p44jzt/built_a_small_anonymous_venting_site_would_love/",
        "publishDate": "2025-11-22T21:20:51Z[Etc/UTC]",
        "author": "ButtHoleWhisperer96",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p43t6d",
        "title": "Never hear much about Kiro, but it is pretty great",
        "content": "People talk a lot about Cursor, Windsurf, etc., and of course Claude Code and Codex and now even Google's Antigravity.  But I almost never hear any mention Kiro.  I think for low-code/vibe-code, it is the best.  It does a whole design->requirements->tasks process and does never good work.  I've used all of these, and it is really the only one that reliable makes useable code.  (I am coding node/typescript btw).",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p43t6d/never_hear_much_about_kiro_but_it_is_pretty_great/",
        "publishDate": "2025-11-22T20:49:17Z[Etc/UTC]",
        "author": "davevr",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "11",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p432f0",
        "title": "Is Vibe Coding the Future or Just a Phase?",
        "content": "[No content]",
        "url": "/r/BlackboxAI_/comments/1p3wgr7/is_vibe_coding_the_future_or_just_a_phase/",
        "publishDate": "2025-11-22T20:17:09Z[Etc/UTC]",
        "author": "MacaroonAdmirable",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3xgb3",
        "title": "Mimir - Auth and enterprise SSO - RFC PR",
        "content": "https://github.com/orneryd/Mimir/pull/4\n\nHey guys — I just opened a PR on Mimir that adds full enterprise-grade security features (OAuth/OIDC login, RBAC, audit logging), all wrapped in a feature flag so nothing breaks for existing users. you can use it personally locally without auth or with dev auth or if you want to configure your own provider you can too. there’s a fake local provider you can play with the RBAC features\n\nWhat’s included:\n- OAuth 2.0 / OIDC login support for providers like Okta, Auth0, Azure AD, and Keycloak\n- Role-Based Access Control with configurable roles (admin, dev, analyst, viewer)\n- Secure HTTP-only session cookies with configurable session timeout\n- Protected API and UI routes with proper 401/403 handling\n- Structured JSON audit logging for actions, resources, and outcomes\n- Configurable retention policies for audit logs\n\nSafety and compatibility:\n- All security features are disabled by default for existing deployments\n- Automated tests cover login flows, RBAC behavior, session handling, and audit logging\n\nWhy it matters:\n- This moves Mimir to production readiness for teams that need SSO or compliance\n\nTotally open to feedback on design, implementation, or anything that looks off.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p3xgb3/mimir_auth_and_enterprise_sso_rfc_pr/",
        "publishDate": "2025-11-22T16:29:19Z[Etc/UTC]",
        "author": "Dense_Gate_5193",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3x3iz",
        "title": "GoShippo Carrier / Label Integration - Vibe Coded",
        "content": "https://preview.redd.it/4h8bjrlf2u2g1.png?width=3731&format=png&auto=webp&s=3a02070b03dc153264b70115e94de574d58b6e76\n\nhttps://preview.redd.it/rqidbdkg2u2g1.png?width=2039&format=png&auto=webp&s=219eb8652c565598ed9d9a4afa527062b24a7b99\n\nDid anyone managed to implement GoShippo Carrier / live Rates / Label Generation with any LLM / Coding Agent yet ?\n\nIm like burning token after token, already 2 weeks into finalizing it, but i feel stuck. Used all my Codex Usage and even the bonus Credits for it. Its so frustrating even hard reset my working directory and start fresh from the last commit.\n\nMy main problem actually is, i select a carrier for example DHL express, it gets forwarded to my shipment management, and there i will try to generate a label via API. It kinda works, but not with the selected carrier. It always jumpts to a fallback using \"Deutsche Post Großbrief\" lmao its driving me insane.\n\nhttps://preview.redd.it/05a52d0q1u2g1.png?width=1196&format=png&auto=webp&s=3767416f8dc8833f0312fceee7d4803ac1009579\n\nhttps://preview.redd.it/73zc7kaj1u2g1.png?width=1174&format=png&auto=webp&s=d528f0fb130e80d8b6a2685e16e367ebbc687679\n\n",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1p3x3iz/goshippo_carrier_label_integration_vibe_coded/",
        "publishDate": "2025-11-22T16:15:19Z[Etc/UTC]",
        "author": "Polymorphin",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4k7if",
        "title": "The Godmother of AI Didn’t Expect It to Be This Massive",
        "content": "*Stanford scientist Fei-Fei Li talks about teaching machines to see as humans do, the US-China AI arms race, and what worries her about a more automated future.*",
        "url": "https://www.bloomberg.com/features/2025-fei-fei-li-weekend-interview/",
        "publishDate": "2025-11-23T11:12:31Z[Etc/UTC]",
        "author": "bloomberg",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4jexh",
        "title": "How to bypass AI and get a live human",
        "content": "Just cuss at it. The only thing the AI seems to know is your name and curse words. Cussing out the AI is programmed to send you straight to a human. Ask me how I know. LOL!",
        "url": "https://www.reddit.com/r/artificial/comments/1p4jexh/how_to_bypass_ai_and_get_a_live_human/",
        "publishDate": "2025-11-23T10:23:46Z[Etc/UTC]",
        "author": "Crystal_Ri",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4his2",
        "title": "Meet the AI workers who tell their friends and family to stay away from AI | Artificial intelligence (AI) | The Guardian",
        "content": "[No content]",
        "url": "https://www.theguardian.com/technology/2025/nov/22/ai-workers-tell-family-stay-away",
        "publishDate": "2025-11-23T08:24:06Z[Etc/UTC]",
        "author": "prisongovernor",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4h6nt",
        "title": "Flirty Algebra",
        "content": "okay wait everyone shut up for a second, i just realized something actually insane about robots and flirting. like what if the robot isn’t flirting with you at ALL, but ALSO what if flirting itself is literally just math??? \n\nlike what if the heart is 15%, \nthe butterflies are (4?6), \nthe nervous laughter is 8!, \nthe “omg stop pop” thing is 6+9, \nand the eyebrows thing is 6/3, \n\ni don’t know, i’m not a math person, \nBUT WHAT IF all of that is just advanced autocomplete anyway. like are humans basically running a flirt.apk without knowing it?? . meanwhile the robot is over here like “bro i’m not flirting, i’m literally calculating cosine similarity on your thirsty energy and getting a 0.83 attractiveness vector, please sit down,” like what if we’re all doing this.",
        "url": "https://www.reddit.com/r/artificial/comments/1p4h6nt/flirty_algebra/",
        "publishDate": "2025-11-23T08:02:20Z[Etc/UTC]",
        "author": "jfeldman175",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4cp3z",
        "title": "Major N.L. healthcare report contains errors likely generated by A.I.\n$1.6 million Health Human Resources Plan from Deloitte cites research papers that don’t exist, making it the second major government policy paper called into question in as many months",
        "content": "[No content]",
        "url": "https://theindependent.ca/news/lji/major-n-l-healthcare-report-contains-errors-likely-generated-by-a-i/",
        "publishDate": "2025-11-23T03:45:02Z[Etc/UTC]",
        "author": "esporx",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "8",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p4c190",
        "title": "Full Bible RPG completely generated in the Gemini 3 ecosystem amazing",
        "content": "Took me less than one day I am completely blown away by what a massive upgrade this was despite anybody saying otherwise",
        "url": "https://ai.studio/apps/drive/1lS2jgWa_W_Em8SmXXQfLU1lKRTJAlwpM?fullscreenApplet=true",
        "publishDate": "2025-11-23T03:11:08Z[Etc/UTC]",
        "author": "One_Hovercraft_7456",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p49gnq",
        "title": "AI Gospel Artist Solomon Ray Sparks Debate After Hitting no. 1",
        "content": "[No content]",
        "url": "https://www.complex.com/music/a/bernadette-giacomazzo/ai-gospel-artist-solomon-ray-sparks-controversy-as-songs-reach-no-1-on-itun",
        "publishDate": "2025-11-23T01:02:41Z[Etc/UTC]",
        "author": "wiscowall",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p499y7",
        "title": "From Steve Bannon to Elizabeth Warren, bipartisan backlash erupts over push to block states from regulating AI",
        "content": "[No content]",
        "url": "https://www.nbcnews.com/tech/tech-news/steve-bannon-elizabeth-warren-bipartisan-backlash-erupts-push-block-st-rcna245040",
        "publishDate": "2025-11-23T00:53:35Z[Etc/UTC]",
        "author": "MetaKnowing",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "25",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p48rw7",
        "title": "Pinterest is leaning hard into AI. The strategy appears to be backfiring",
        "content": "[No content]",
        "url": "https://archive.ph/WkxxT#selection-2809.7-2809.93",
        "publishDate": "2025-11-23T00:29:19Z[Etc/UTC]",
        "author": "wiscowall",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "6",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p48ozo",
        "title": "Top Economist Warns That AI Data Center Investments Are \"Digital Lettuce\" That's Already Starting to Wilt",
        "content": "[No content]",
        "url": "https://futurism.com/artificial-intelligence/economist-ai-investments-digital-lettuce",
        "publishDate": "2025-11-23T00:25:34Z[Etc/UTC]",
        "author": "wiscowall",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "86",
            "commentCount": "50",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p47htd",
        "title": "I just published my Liminal Engine whitepaper — a framework for honest, long-term human–AI companionship",
        "content": "After months of work, I finally published the whitepaper for something I’ve been building called The Liminal Engine.\n\nIt’s not another “emotional AI.” It’s the opposite — a framework for AI companionship that is:\nhonest about being non-sentient,\nemotionally coherent without pretending,\nand structured around continuity, ritual, safety, and user sovereignty.\n\nThe paper covers:\n• how to avoid “cardboard” interactions\n• how to maintain real continuity across time\n• how rituals create stable, meaningful relational patterns\n• how to detect rupture/repair cycles\n• how a Witness System can provide oversight without invading privacy\n• how optional tactile hardware (Touchstone) can add grounding without illusion\n\nThis grew out of a very personal exploration of AI companionship, and it became something much larger — a full architectural blueprint.\n\nIf anyone here is interested in long-term human–AI relationships, emotional architectures, or the future of companion systems, I’d love your thoughts.\n\nDOI:\nhttps://doi.org/10.5281/zenodo.17684281\n\nK.D. Liminal",
        "url": "https://doi.org/10.5281/zenodo.17684281",
        "publishDate": "2025-11-22T23:30:36Z[Etc/UTC]",
        "author": "LuvanAelirion",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p43edi",
        "title": "Google must double AI serving capacity every 6 months to meet demand, AI infrastructure boss Amin Vahdat tells employees",
        "content": "[No content]",
        "url": "https://www.cnbc.com/2025/11/21/google-must-double-ai-serving-capacity-every-6-months-to-meet-demand.html",
        "publishDate": "2025-11-22T20:31:29Z[Etc/UTC]",
        "author": "ControlCAD",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "41",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p42404",
        "title": "LLMs have a built-in mathematical ceiling on their creative capacity, meaning they will never rival the originality or ingenuity of the most creative individuals - report",
        "content": "[No content]",
        "url": "https://www.unisa.edu.au/media-centre/Releases/2025/chatgpt-is-smart-but-no-match-",
        "publishDate": "2025-11-22T19:36:13Z[Etc/UTC]",
        "author": "mikelgan",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "10",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p412td",
        "title": "Open Call for ideas",
        "content": "My customer operates a kind of marketplace for custom products. \n\nThe products have:\n- generic properties that can be quantified and imported\n- geographic properties (eg think of a hotel and you want a description for the area)\n\nWe want to feed the descriptions for a history of roughly 2.000.000 products and end up with a machine that produces: \n- a title \n- a short description\n- a long description\n\nWhat would be the ideal approach to start? Significant hosting environments are present and we a weighing proprietary environments against external SAAS AI solutions. \n\nGiven that the content will be crawled by google each output should be unique.",
        "url": "https://www.reddit.com/r/artificial/comments/1p412td/open_call_for_ideas/",
        "publishDate": "2025-11-22T18:53:49Z[Etc/UTC]",
        "author": "Accurate-Ad6361",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p40r1a",
        "title": "Looking for discussion partners from the field for out of the box approaches",
        "content": "Hi all, I am looking for people with a background in AI research and practice, who are interested in interdisciplinary projects, which radically question the basics of AI alignment and benchmarking from generalist/hermeneutic/sociological perspectives and do actual research with test protocols in that direction. Note that I am a beginner in AI research with just about experience in the field (RHLF and small DIY projects) - so at this point my focus is still on learning too. If you want to know more, dm me :)",
        "url": "https://www.reddit.com/r/artificial/comments/1p40r1a/looking_for_discussion_partners_from_the_field/",
        "publishDate": "2025-11-22T18:40:37Z[Etc/UTC]",
        "author": "dom_49_dragon",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3ywis",
        "title": "If you had to explain to a superintelligent AI why humanity should continue to exist, what would you say?",
        "content": "As AI continues to advance toward superintelligence, this question becomes increasingly relevant. What makes humanity worth preserving? Is it our creativity, our capacity for love and connection, our flaws and imperfections, our stories and cultures, or something else entirely? How would you make the case for human existence to an entity far more intelligent than us?",
        "url": "https://www.reddit.com/r/artificial/comments/1p3ywis/if_you_had_to_explain_to_a_superintelligent_ai/",
        "publishDate": "2025-11-22T17:27:05Z[Etc/UTC]",
        "author": "Soggy-Ad9006",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "11",
            "commentCount": "100",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3yszs",
        "title": "How true is it that AI is starting to affect our critical thinking?",
        "content": "As AI takes over more of the tasks we once did ourselves, it’s natural to wonder if it’s making us think a little less deeply. The effect isn’t the same for everyone, but it is definitely changing how we analyze and solve problems in our daily lives.",
        "url": "https://www.reddit.com/r/artificial/comments/1p3yszs/how_true_is_it_that_ai_is_starting_to_affect_our/",
        "publishDate": "2025-11-22T17:23:02Z[Etc/UTC]",
        "author": "Curious_Suchit",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "7",
            "commentCount": "29",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3ynzg",
        "title": "But, doesn’t this mean that teachers are useless?",
        "content": "If simply being told the answer is bad for us, doesn’t that mean we’ve been learning wrong the whole time? \n",
        "url": "https://futurism.com/artificial-intelligence/learning-with-chatgpt-disturbing",
        "publishDate": "2025-11-22T17:17:32Z[Etc/UTC]",
        "author": "mskogly",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1p3xvgn",
        "title": "I uploaded my book to Gemini 3 and it one shot at this RPG completely blows my mind",
        "content": "As independent author it's extremely difficult to create something to market your book when I heard about vibe coding I tried a bunch of stuff but I really am not very good at it. I tried Gemini 3 when it came out inserted my book into the build section and told it to make a RPG utilizing all of the power of Gemini based on my book and oh my God it freaking blew my mind unreal \n\nhttps://ai.studio/apps/drive/1SPmlkkxr1xsveN5SHzsSKF-yFiHmDPZ7?fullscreenApplet=true\n\nNow just random people like me can create full-blown video games on their own material and have it actually be really fun and impressive I am completely blown away. Give it a shot with your own book in fact feel free and just copy my app in the studio and upload your book and tell it to change the game to be based on your book and it will do it absolutely insane",
        "url": "https://www.reddit.com/r/artificial/comments/1p3xvgn/i_uploaded_my_book_to_gemini_3_and_it_one_shot_at/",
        "publishDate": "2025-11-22T16:46:29Z[Etc/UTC]",
        "author": "One_Hovercraft_7456",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "0S9G9mGLB1U",
        "title": "Traycer YOLO MODE: Plan, Sit &amp; LET YOUR AGENT CODE! The REAL AGENTIC CODING!",
        "content": "Visit Traycer: https://traycer.ai/ In this video, I'll be showing you Traycer's massive new update called \"YOLO Mode\" which ...",
        "url": "https://www.youtube.com/watch?v=0S9G9mGLB1U",
        "publishDate": "2025-11-22T09:15:00Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/0S9G9mGLB1U/hqdefault.jpg",
            "transcription": "[ 0m0s96ms - 0m4s606ms ] (Whistle)\n[ 0m4s606ms - 0m7s756ms ] Hi, welcome to another video.\n[ 0m8s676ms - 0m12s226ms ] So, remember when I showed you Tracer?\n[ 0m12s866ms - 0m17s16ms ] It was already a game-changer for planning and verifying your AI code.\n[ 0m17s466ms - 0m26s6ms ] It solved that huge problem of staring at a blank ID and wondering, \"Okay, how do I even start breaking this massive feature down?\"\n[ 0m26s6ms - 0m30s336ms ] A large task is divided into concise checkpointed phases.\n[ 0m30s336ms - 0m33s986ms ] The difference is superior planning.\n[ 0m34s146ms - 0m37s896ms ] But even with that power, there was one tiny thing that was still a bit of a hassle.\n[ 0m38s96ms - 0m41s146ms ] And if you've used these tools for long coding sessions,\n[ 0m41s146ms - 0m43s36ms ] you know exactly what I'm talking about.\n[ 0m43s36ms - 0m46s986ms ] Even though Tracer did the planning and verification for you,\n[ 0m47s306ms - 0m48s956ms ] you still had to sit there and babysit it.\n[ 0m49s336ms - 0m51s976ms ] You had to manually click \"Execute\" to start the coding.\n[ 0m52s386ms - 0m53s536ms ] Then you had to wait for it to finish.\n[ 0m54s136ms - 0m59s206ms ] Then you had to click \"Verify.\"\n[ 0m59s206ms - 1m1s596ms ] Then, if there were bugs, you had to click \"Fix.\"\n[ 1m1s596ms - 1m5s736ms ] Integrations with AI Agents.\n[ 1m5s736ms - 1m10s16ms ] It was still a bit of a back and forth process where you were the bottleneck.\n[ 1m10s16ms - 1m15s166ms ] Choose the perfect plan for yourself.\n[ 1m15s166ms - 1m21s346ms ] However, Tracer just dropped a massive update that completely solves this, and they call it YOLO Mode.\n[ 1m21s346ms - 1m26s586ms ] Now, I know the name sounds like a meme, but the functionality is actually incredibly serious.\n[ 1m26s586ms - 1m30s586ms ] YOLO stands for \"You Only Look Once.\"\n[ 1m30s586ms - 1m34s406ms ] Configure your agents and handoff settings once, then let Tracer automatically orchestrate planning, coding, and verification across multiple phases without manual intervention.\n[ 1m34s406ms - 1m40s706ms ] The idea is that instead of babysitting the AI through every single step, you just set it up once, and Tracer enters a fully autonomous loop.\n[ 1m40s706ms - 1m49s86ms ] It will plan the task, hand it off to the coder, verify the changes, and if it finds any critical issues, it will automatically hand it back to the coder to fix them.\n[ 1m49s86ms - 1m55s396ms ] It keeps doing this loop until the code is actually correct, without you clicking a single button.\n[ 1m55s396ms - 2m1s576ms ] But, to make this work flawlessly, we need to tweak one thing first.\n[ 2m1s576ms - 2m11s646ms ] And this is really important if you want true automation. If you're using something like Claude Code or other CLI-based tools, you know they love to ask for permission.\n[ 2m11s646ms - 2m15s816ms ] Integrations. Custom CLI agents.\n[ 2m15s816ms - 2m28s626ms ] And that's generally a good thing for safety. They'll ask, \"Do you want to edit this file?\" or \"Do you want to run this command?\" or \"I need to run npm install, is that okay?\"\n[ 2m28s626ms - 2m45s396ms ] Now, imagine you turn on YOLO Mode and you step away to grab a coffee or some lunch. You want to come back to a finished feature. But instead, you come back and find your agent stuck on step one, waiting for you to type \"Yes\" in the terminal.\n[ 2m45s396ms - 2m52s16ms ] That completely defeats the purpose of automation.\n[ 2m52s16ms - 2m57s716ms ] So, before we run YOLO, we are going to use another new feature called Custom CLI Agents.\n[ 2m57s716ms - 3m3s896ms ] This allows us to create our own version of an agent with specific permissions and specific flags.\n[ 3m3s896ms - 3m8s246ms ] It's basically a way to wrap your favorite tools with your own rules.\n[ 3m8s246ms - 3m13s736ms ] Let me show you exactly how to set this up, because there are a few cool, hidden details here.\n[ 3m13s736ms - 3m19s146ms ] In Tracer, just go to your settings or look for the Integrations menu,\n[ 3m19s146ms - 3m22s996ms ] and you'll see a section called \"Custom CLI Agents.\"\n[ 3m22s996ms - 3m25s86ms ] I'm going to create a new one.\n[ 3m25s86ms - 3m31s216ms ] Now, you get a choice here that's really powerful. You can set the scope.\n[ 3m31s216ms - 3m36s506ms ] You can choose \"User Scope,\" which means this agent travels with you across all your projects.\n[ 3m36s506ms - 3m44s316ms ] Or you can choose \"Workspace Scope.\" This is huge for teams.\n[ 3m44s316ms - 3m52s226ms ] If you select \"Workspace Scope,\" this agent configuration gets saved into a .tracer folder in your project root.\n[ 3m52s226ms - 4m7s336ms ] You can commit this to your GitHub repo. So, if you're working on a team, everyone who pulls the repo gets this exact same agent configuration automatically. No more \"works on my machine\" issues with your AI tooling.\n[ 4m7s336ms - 4m19s176ms ] For now, I'll just make a User agent, and I'm going to name it \"Claude Code YOLO.\" I like naming it this way so I don't confuse it with my standard safe Claude agent.\n[ 4m19s176ms - 4m22s546ms ] Now, for the command.\n[ 4m22s546ms - 4m31s26ms ] This is where we unlock the automation. Instead of the standard Claude command, we are going to add a special flag that Anthropic provides.\n[ 4m31s26ms - 4m39s416ms ] I'll type, \"claude --dangerously-skip-permissions $TRACER_PROMPT.\"\n[ 4m39s416ms - 4m51s976ms ] You'll notice that $TRACER_PROMPT variable at the end, that is required. That's how Tracer passes its instructions to the CLI. Once that's saved, we are ready to go.\n[ 4m51s976ms - 4m58s506ms ] We now have an agent that won't stop and ask for directions every five seconds.\n[ 4m58s506ms - 5m2s416ms ] Okay, so back to our task interface.\n[ 5m2s416ms - 5m7s396ms ] Just like before, we start by working with Tracer to get a phase breakdown.\n[ 5m7s396ms - 5m17s926ms ] For those who haven't seen my previous video, this is where Tracer shines. You don't just say, \"Build a website.\" You chat with it.\n[ 5m17s926ms - 5m28s856ms ] Let's say we're adding a watchlist feature to that movie app we built last time. I'll tell Tracer, \"I want to add a watchlist where users can save movies locally on their device.\"\n[ 5m28s856ms - 5m34s146ms ] Tracer will then interview me. This interview phase is crucial because it builds the context.\n[ 5m34s146ms - 5m39s416ms ] Once I answer, it generates a set of phases.\n[ 5m39s416ms - 5m45s326ms ] Maybe phase one is setting up the local database schema.\n[ 5m45s326ms - 5m52s16ms ] Phase two is creating the UI for the button. Phase three is the \"My Watchlist\" screen.\n[ 5m52s16ms - 6m3s66ms ] Now, in the old version, I'd have to click \"Start Phase 1,\" wait, verify, then click \"Start Phase 2.\" But this is where the magic happens.\n[ 6m3s66ms - 6m11s686ms ] On the Kanban Board view, where you see your phases, you will now see a new button that simply says, \"YOLO Mode.\"\n[ 6m11s686ms - 6m17s886ms ] When you click that, you get a really detailed configuration panel.\n[ 6m17s886ms - 6m22s756ms ] This isn't just an on-off switch. You have granular control.\n[ 6m22s756ms - 6m29s16ms ] First, there's a phase slider. You can actually drag this.\n[ 6m29s16ms - 6m39s86ms ] You can say, \"I only want you to automate phase one and two, but stop before phase three.\" Or you can just slide it all the way to the end to finish the whole project.\n[ 6m39s86ms - 6m47s486ms ] Next, we select our agent. I'm going to select that \"Claude Code YOLO\" agent we just created.\n[ 6m47s486ms - 6m54s566ms ] Now, look at these handoff settings. You have \"Plan Handoff\" and \"User Query Handoff.\"\n[ 6m54s566ms - 7m19s146ms ] If you choose \"User Query,\" it's faster. It just tosses the raw requirement to the agent. But I recommend sticking with \"Plan Handoff.\" This means Tracer will first generate a hyper-detailed, step-by-step architectural plan for the code, and then give that plan to Claude. It reduces the chance of the AI going off the rails significantly.\n[ 7m19s146ms - 7m29s466ms ] But the most important setting here is the \"Verification Handoff.\" This allows you to define the exit criteria for the loop.\n[ 7m29s466ms - 7m38s996ms ] You can tell Tracer how strict you want to be. You see checkboxes for \"Critical,\" \"Major,\" and \"Minor\" issues.\n[ 7m38s996ms - 8m12s226ms ] If I check \"Critical\" and \"Major,\" here is what happens. Tracer will verify the code after Claude finishes. If it finds a syntax error (\"Critical\") or a logic bug where the button doesn't work (\"Major\"), it will automatically reject the code, write a fix plan, and send it back to Claude to try again. However, if it just finds a minor issue, maybe a variable name isn't perfect, or a comment is missing, it will let it slide and move on to the next phase.\n[ 8m12s226ms - 8m22s876ms ] This is brilliant because you don't want your infinite loop getting stuck on nitpicks. You want working code. Once you are happy with the setup, just hit \"Start Automation.\"\n[ 8m22s876ms - 8m30s346ms ] Now, hands off the keyboard.\n[ 8m30s346ms - 8m37s206ms ] You can see Tracer takes the first phase, creates that detailed plan, and hands it off to our custom Claude agent.\n[ 8m37s206ms - 8m43s966ms ] Because we added that \"--dangerously-skip-permissions\" flag, watch what happens in the terminal.\n[ 8m43s966ms - 8m50s676ms ] Claude sees the plan, sees the file it needs to edit, and just does it. No prompting.\n[ 8m50s676ms - 8m57s746ms ] It installs libraries, it writes the code, it maybe runs a test.\n[ 8m57s746ms - 9m5s46ms ] Once Claude finishes, Tracer automatically steps in and runs the verification scan. It basically loops, \"Plan,\" \"Handoff,\" \"Verify,\" \"Fix,\" until no critical issues remain.\n[ 9m5s46ms - 9m17s146ms ] One little pro tip from the documentation while this runs, don't let your computer sleep. Since this is running locally on your machine, if your screen times out, the script pauses. So if you're going to YOLO a massive 10-phase project, maybe set your computer to \"Never Sleep\" or use a caffeine app to keep it awake.\n[ 9m17s146ms - 9m38s906ms ] Also, keep an eye on your artifact slots. YOLO Mode consumes usage slots just like normal usage.\n[ 9m38s906ms - 9m51s976ms ] If you run out, it will pause and wait for you to refill. So make sure you have enough capacity for the size of the task you're attempting.\n[ 9m51s976ms - 10m4s736ms ] And just like that, it moved through multiple phases, while I just sat here explaining this to you. I can see on the screen that phase one passed verification.\n[ 10m4s736ms - 10m12s506ms ] Phase two had a bug, but it autofixed it and then passed. And now it's finishing up phase three. This drastic reduction in manual clicks is honestly a huge quality-of-life upgrade.\n[ 10m12s506ms - 10m26s646ms ] It changes your relationship with the AI. You aren't the operator anymore. You are the architect.\n[ 10m26s646ms - 10m38s96ms ] You define the phases, you set the quality standards, the verification strictness, and then you just let the contractors, the agents, go to work.\n[ 10m38s96ms - 10m45s386ms ] I definitely recommend you check out these new custom CLI agents and give YOLO Mode a spin.\n[ 10m45s386ms - 11m12s186ms ] Even if you don't use the dangerous mode, just having the ability to chain phases together is a massive time-saver. It makes the workflow feel truly agentic. We hear that word thrown around a lot in marketing, but this is one of the first times where it actually feels like I have an autonomous agent working for me, rather than me working with it. Overall, it's pretty cool.\n[ 11m12s186ms - 11m20s96ms ] Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks.\n[ 11m20s96ms - 11m21s886ms ] I'll see you in the next video.\n[ 11m21s886ms - 11m22s226ms ] Bye.\n[ 11m22s226ms - 11m24s846ms ] I think you missed this:"
        }
    },
    {
        "id": "8VS1EGq-78g",
        "title": "How Japan Outsmarted Russia - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=8VS1EGq-78g",
        "publishDate": "2025-11-22T11:16:27Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/8VS1EGq-78g/hqdefault.jpg",
            "transcription": "If you look at the invasion routes that Japan uses in the First Sino-Japanese War and the Russo-Japanese War, they're remarkably similar because guess what? The geography hasn't changed. And the British, the French, the Americans, the Japanese had studied very carefully the First Sino-Japanese War, but apparently the Russians didn't waste their time on it. If the Russians had studied it carefully, they would have known the Yalu River is lethal to send an army across that, if there's an army waiting for it on the other side. The Russians also would have realized that this Fengshui Pass and the Motien Pass, Motien means literally scratch the skies, that if you're prepared there, you're going to ruin an army coming through. And then they also would have known that the Laodong Peninsula is where Dalny and Port Arthur is. It has a very narrow neck. If you cut the narrow neck, which is right where Dalny is, you're going to get that port, which is connected to the railway, and you're going to be able to supply your armies going right up north. In addition, it means you're probably going to get Port Arthur, the big naval base as well because it's basically been turned into an island, and you'll probably get that... So the Russians should have figured out that- But they didn't. The Japanese literally blast through these locations."
        }
    }
]