[
    {
        "id": "https://news.smol.ai/issues/26-01-08-not-much/",
        "title": "not much happened today",
        "content": "**Stanford paper** reveals **Claude 3.7 Sonnet** memorized **95.8% of Harry Potter 1**, highlighting copyright extraction risks compared to **GPT-4.1**. **Google AI Studio** sponsors **TailwindCSS** amid OSS funding debates. **Google** and **Sundar Pichai** launch **Gmail Gemini 3** features including AI Overviews and natural-language search with user controls. **Alibaba Qwen** releases **Qwen3-VL-Embedding** and **Qwen3-VL-Reranker**, a multimodal, multilingual retrieval stack supporting text, images, and video with quantization and instruction customization, achieving strong benchmark results. **Z.ai** goes public on HKEX with **GLM-4.7** leading the Artificial Analysis Intelligence Index v4.0, showing gains in reasoning, coding, and agentic use, with large-scale MoE architecture and MIT license. **Falcon-H1R-7B** from TII targets efficient reasoning in smaller models, scoring 16 on the Intelligence Index. **AI21 Labs** introduces **Jamba2**, a memory-efficient enterprise model with hybrid SSM-Transformer architecture and Apache 2.0 license, available via SaaS and Hugging Face. **vLLM** shows throughput improvements in inference and kernel engineering. *\"Embeddings should be multimodal by default,\"* notes Justin Lin.",
        "url": "https://news.smol.ai/issues/26-01-08-not-much/",
        "publishDate": "2026-01-08T05:44:39Z[Etc/UTC]",
        "author": "",
        "sourceType": "rss",
        "sourceName": "AI News RSS",
        "metadata": {
            "feedTitle": "AINews",
            "feedDescription": "Weekday recaps of top News for AI Engineers",
            "categories": "stanford, google, google-deepmind, alibaba, z-ai, tii, ai21-labs, huggingface, claude-3-7-sonnet, gpt-4-1, gemini-3, qwen3-vl-embedding, qwen3-vl-reranker, glm-4-7, falcon-h1r-7b, jamba2, sundarpichai, justinlin610, copyright-extraction, multimodality, multilinguality, retrieval-augmented-generation, model-architecture, mixture-of-experts, model-quantization, reasoning, inference, kernel-engineering, memory-optimization, enterprise-ai"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231993",
        "title": "Precisely Achieves FedRAMP Authorization",
        "content": "<p>New certification empowers U.S. government agencies to modernize data governance with confidence and expands Precisely&#8217;s presence within the sector Precisely, the global leader in data integrity, today announced that the Precisely Data Integrity Suite has achieved FedRAMP® Moderate Impact Level authorization and is now officially listed on the FedRAMP Marketplace. The...</p>\n<p>The post <a href=\"https://ai-techpark.com/precisely-achieves-fedramp-authorization/\">Precisely Achieves FedRAMP Authorization</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/precisely-achieves-fedramp-authorization/",
        "publishDate": "2026-01-08T09:45:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, AI news, ai technology, AItech news, artificial intelligence, artificial intelligence news, data integrity, Precisely"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231967",
        "title": "RingCentral Appoints Mahmoud ElAssir to Board of Directors",
        "content": "<p>Board appointment reinforces RingCentral’s leadership in AI-native cloud communications RingCentral, Inc.&#160;(NYSE: RNG), a global leader in agentic voice AI-powered cloud communications, today announced the appointment of Mahmoud ElAssir to its Board of Directors, effective immediately. ElAssir is a highly accomplished technology and AI transformation leader with more than two decades...</p>\n<p>The post <a href=\"https://ai-techpark.com/ringcentral-appoints-mahmoud-elassir-to-board-of-directors/\">RingCentral Appoints Mahmoud ElAssir to Board of Directors</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/ringcentral-appoints-mahmoud-elassir-to-board-of-directors/",
        "publishDate": "2026-01-08T09:30:00Z[Etc/UTC]",
        "author": "Business Wire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, AI news, AI transformation, AItech news, artificial intelligence news, cloud communications, RingCentral, Voice AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231961",
        "title": "Truepic Welcomes Kerry Whorton Cooper to its Board of Advisors",
        "content": "<p>Cooper brings extensive board leadership and executive experience to help advance Truepic’s mission of scaling authenticity across digital ecosystems Truepic, the enterprise leader of Visual Risk Intelligence in the AI era, announced the addition of Kerry Whorton Cooper to its industry Board of Advisors. Cooper brings over two decades of...</p>\n<p>The post <a href=\"https://ai-techpark.com/truepic-welcomes-kerry-whorton-cooper-to-its-board-of-advisors/\">Truepic Welcomes Kerry Whorton Cooper to its Board of Advisors</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/truepic-welcomes-kerry-whorton-cooper-to-its-board-of-advisors/",
        "publishDate": "2026-01-08T09:00:00Z[Etc/UTC]",
        "author": "GlobeNewswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, AI news, AItech news, artificial intelligence, artificial intelligence news, risk intelligence, Truepic"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231951",
        "title": "HawkSoft and Sonant Integrate Voice AI for Independent Insurance Agencies",
        "content": "<p>Partnership delivers conversational AI that logs calls and creates tasks directly in HawkSoft HawkSoft, a leading agency management system provider for independent agencies, and Sonant, a voice AI platform built exclusively for insurance, today announced a new integration that delivers 24/7 call logging directly within HawkSoft. The collaboration gives agencies...</p>\n<p>The post <a href=\"https://ai-techpark.com/hawksoft-and-sonant-integrate-voice-ai-for-independent-insurance-agencies/\">HawkSoft and Sonant Integrate Voice AI for Independent Insurance Agencies</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/hawksoft-and-sonant-integrate-voice-ai-for-independent-insurance-agencies/",
        "publishDate": "2026-01-08T08:15:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, AI news, ai technology, AItech news, artificial intelligence news, HawkSoft, Voice AI"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231942",
        "title": "PaXini Unveils the “Tactile Infrastructure” for Embodied AI at CES 2026",
        "content": "<p>At CES 2026, a live robotic tactile interaction demonstration at the ENTERPRISE AI Zone in the North Hall drew industry experts and media. Through a complete ice-cream making process—including lever manipulation, ingredient handling, and cup handover—the humanoid robot TORA-ONE showcased its autonomous task-execution capabilities.&#160; As a leader in high-precision tactile...</p>\n<p>The post <a href=\"https://ai-techpark.com/paxini-unveils-the-tactile-infrastructure-for-embodied-ai-at-ces-2026/\">PaXini Unveils the “Tactile Infrastructure” for Embodied AI at CES 2026</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/paxini-unveils-the-tactile-infrastructure-for-embodied-ai-at-ces-2026/",
        "publishDate": "2026-01-08T07:45:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "Robotics, AI news, AI solutions, AItech news, artificial intelligence news, PaXini Unveils"
        }
    },
    {
        "id": "https://ai-techpark.com/?p=231939",
        "title": "MUFJ Bank Adopts Private AI",
        "content": "<p>High-precision&#160;anonymization of unstructured data promotes data utilization within the bank MUFG Bank (Headquarters: Chiyoda-ku, Tokyo; President and CEO: Junichi Hanzawa; hereinafter, &#8220;the Bank&#8221;) has officially adopted the data anonymization solution from Toronto, Canada-based Private AI for its MUFG big data platform, &#8220;OCEAN.&#8221; This implementation enables highly accurate automatic detection and anonymization of...</p>\n<p>The post <a href=\"https://ai-techpark.com/mufj-bank-adopts-private-ai/\">MUFJ Bank Adopts Private AI</a> first appeared on <a href=\"https://ai-techpark.com\">AI-Tech Park</a>.</p>",
        "url": "https://ai-techpark.com/mufj-bank-adopts-private-ai/",
        "publishDate": "2026-01-08T07:30:00Z[Etc/UTC]",
        "author": "PR Newswire",
        "sourceType": "rss",
        "sourceName": "AI Techpark RSS",
        "metadata": {
            "feedTitle": "AI - AI-Tech Park",
            "feedDescription": "AI, ML, IoT, Cybersecurity News & Trend Analysis, Interviews",
            "categories": "AI, AI news, ai technology, AItech news, artificial intelligence news, MUFG Bank"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=111527",
        "title": "“Dr AI, am I healthy?” 59% of Brits rely on AI for self-diagnosis",
        "content": "<p>AI advancements are changing the way we look at health and deal with health-related issues. According to a new nationwide study by Confused.com Life Insurance, three in five Brits now use AI to self-diagnose health conditions. Through various searches, like side effects of medical conditions, treatment options, and symptom checks, as much as 11% of [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/dr-ai-am-i-healthy-59-of-brits-rely-on-ai-for-self-diagnosis/\">&#8220;Dr AI, am I healthy?&#8221; 59% of Brits rely on AI for self-diagnosis</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/dr-ai-am-i-healthy-59-of-brits-rely-on-ai-for-self-diagnosis/",
        "publishDate": "2026-01-08T13:10:00Z[Etc/UTC]",
        "author": "David Thomas",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "Healthcare & Wellness AI, consumer, healthcare, medical"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=111522",
        "title": "2026 to be the year of the agentic AI intern",
        "content": "<p>After several years of experimentation, enterprise AI is moving out of the pilot phase. To date, many organisations limit AI to general-purpose chatbots, often created by small groups of early adopters. According to Nexos.ai, that model will give way to something more operational: fleets of task-specific AI agents embedded directly into business workflows. Even isolated [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/agent-ai-as-the-intern-in-2026-prediction-by-nexos-ai/\">2026 to be the year of the agentic AI intern</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/agent-ai-as-the-intern-in-2026-prediction-by-nexos-ai/",
        "publishDate": "2026-01-08T12:24:21Z[Etc/UTC]",
        "author": "AI News",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI Market Trends, Special Reports & Series, agentic ai, business processes, centralised deployment"
        }
    },
    {
        "id": "https://www.artificialintelligence-news.com/?p=111519",
        "title": "Bosch’s €2.9 billion AI investment and shifting manufacturing priorities",
        "content": "<p>Factories are producing more data than they can process, and companies like Bosch are using AI to close the gap. Cameras watch production lines, sensors track machines, and software records each step of processes. However, much of that information can&#8217;t create faster decisions or lead to fewer breakdowns. For large manufacturing firms, the missed opportunity [&#8230;]</p>\n<p>The post <a href=\"https://www.artificialintelligence-news.com/news/bosch-e2-9-billion-ai-investment-and-shifting-manufacturing-priorities/\">Bosch’s €2.9 billion AI investment and shifting manufacturing priorities</a> appeared first on <a href=\"https://www.artificialintelligence-news.com\">AI News</a>.</p>\n",
        "url": "https://www.artificialintelligence-news.com/news/bosch-e2-9-billion-ai-investment-and-shifting-manufacturing-priorities/",
        "publishDate": "2026-01-08T10:00:00Z[Etc/UTC]",
        "author": "Muhammad Zulhusni",
        "sourceType": "rss",
        "sourceName": "ArtificialIntelligence-news RSS",
        "metadata": {
            "feedTitle": "AI News",
            "feedDescription": "Artificial Intelligence News",
            "categories": "AI Business Strategy, Deep Dives, Infrastructure & Hardware, Manufacturing & Engineering AI, edge computing, infrastructure, manufacturing, supply chain"
        }
    },
    {
        "id": "1q85agl",
        "title": "Honestly, one sub isn’t enough. Here’s My \"Must-Pay\" list for 2026",
        "content": "\nI’ve spent way too much time trying to make one tool do the job of three. It doesn’t work.\n\nHere’s the actual breakdown based on how I use them:\n\n• Adobe Firefly: purely a workflow tool. If you’re already in Photoshop, Generative Fill is for extending backgrounds or cleaning up shots. It’s corporate safe, which is its biggest pro and con. It won't give you anything edgy, but it’s the most seamless for editing.\n• Akool: This is for video production. I use it specifically for face-swapping and character swap stuff. If you’re trying to localize an ad or swap a character into existing footage, Leonardo and Firefly can't touch this.\n• Leonardo AI: Use it when you need a specific style (cinematic, 3D, etc.) that isn't just a generic stock photo. Leonardo is much better than Firefly. The fine-tuned models give me way more creative control over the final look.\n\n TL;DR:\n\n•  Fixing/Editing photos? Firefly.\n•  Creating cool art from scratch? Leonardo.\n•  Face-swaps or video mods? Akool.\n\nI do think your AI tool kit list depends on what you actually do for a living, one tool will always fail where the other excels. Soooo curious about your kit and why do you think it’s worth your sub. I would like to have a try!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q85agl/honestly_one_sub_isnt_enough_heres_my_mustpay/",
        "publishDate": "2026-01-09T10:55:46Z[Etc/UTC]",
        "author": "character_Answer2004",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q84kvq",
        "title": "Public Sentiment Analysis is dead. 60% of the Synthetic Sludge was found in our 50k \"User Reviews\" audit. Today we only trust data with typos.",
        "content": "We are a market research company Cloudairy that investigates feedback from competitors for B2B clients. When we did scrape in 2024, Reddit, Amazon, and G2, run it through an LLM, and see what customers wanted.\n\nIt is 2026, and that workflow is broken.\n\nWe recently audited the user data set of 50,000 reviews of one big tech product. The “Sentiment Score” is an overall good (4.8 stars). The client was happy.\n\nBut when we look further, we spot the \"Zombie Pattern\":\n\n● Many of the reviews shared the exact same sentence structure, i.e., “I especially appreciate the ergonomic design and seamless integration...” .\n\n● They were grammatically perfect. Too perfect.\n\n● They failed to have “Temporal Nuance” (an example of recent events).\n\nWe realized we were talking to Bots about our analysis. Agents farming karma or SEO results had floodred the channel.\n\nThe New Protocol: The \"Imperfection Filter\"\n\nWe had to shift logic in order to get real information in 2026. We made a filter to remove high quality writing.\n\nNow we prioritize those data points that have:\n\n● Typos & Slang: “Ths app sucks” is not as valuable as a 3-paragraph essay on UI/UX.\n\n● Anxious Emotion: Real humans rant on delusional grounds. AI tries to be balanced.\n\n● Niche Context: References not found within the training data cut-off.\n\nThe Scary Reality:\n\nIf you are producing a product based on “What the internet says” then you are likely creating a product for AI Agents, not humans. The \"Public Web\" is no longer a focus group.\n\nWe are turning to “Gated Communities” – Discored Communities, Verified Forums, for research.\n\nHas anyone else given up scraping \"Big Data\" because of this pollution?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q84kvq/public_sentiment_analysis_is_dead_60_of_the/",
        "publishDate": "2026-01-09T10:13:06Z[Etc/UTC]",
        "author": "cloudairyhq",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "20",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q84dnu",
        "title": "Does 'human touch' simply a vague way of saying 'human judgement'?",
        "content": "Imagine saying to a friend: \"I don't really like fully automated processes, like washing my clothes. During the rinse cycle, I like to hand crank the drum a few times to add that human touch to my clothes being laundered.\"\n\nOf course, saying that would make you sound insane. \n\nBut yet my LinkedIn profile is full of washed-up copywriters going on the about their work is so valuable because of its human touch. Yes, if they were writing poetry, maybe. \n\nBut if their work was simply creating generic copy to get a point across, it's probably best that AI can now do it. \n\nSo my point is, we tend to over-rate the value of the 'human touch' when we'd rather press a button and have it done quickly for us. \n\nTake customer service/AI chatbots - do we want to speak to a human because of the 'human touch', or is it that the AI chatbot is always so incredibly stupid we know if can't help us?\n\nWhere does human touch matter? When human judgement changes the outcome. \n\nFor example, whether a firm should pursue a court case, or settle out of court - human judgement is supreme.\n\nWhen no judgement needs to be involved, we'd probably prefer automation. What do you think? Is human touch over-rated? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q84dnu/does_human_touch_simply_a_vague_way_of_saying/",
        "publishDate": "2026-01-09T10:00:52Z[Etc/UTC]",
        "author": "Feeling_Phrase1340",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "6",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q84af9",
        "title": "Why AI Is No Longer Optional, It’s the Foundation of Future Growth!",
        "content": "**If you don’t accept AI,**  \n🥲 you won’t lose your job today.  \n  \n**But one day,**  \nsomeone who uses AI will do your work  \nfaster, smarter, and cheaper.  \n  \n**AI doesn’t replace people.**  \nIt replaces people who refuse to adapt.  \n  \n**The future won’t ask if you’re experienced**   \nit will ask if you’re AI-ready.  \n  \n👉 **Learn it. Use it. Grow with it.** ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q84af9/why_ai_is_no_longer_optional_its_the_foundation/",
        "publishDate": "2026-01-09T09:55:12Z[Etc/UTC]",
        "author": "deepakmentobile",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "18",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q8459a",
        "title": "Is it naive to think that \"good\" governance will steer us towards benign, if not genuinely helpful-to-humanity AGI and later, ASI.",
        "content": "I put good in quotes because I wanted to separate it from actual, thoughtful, future-facing governance. Something that goes beyond mere compliance or risk management. \n\nIf we acknowledge that our current AI systems may evolve into AGI (if brute-force/scale works) and embed governance that will be as \"gene-deep\" in AGI as fight-or-flight response (not the best example I know), is in us?\n\nOr if we take Hassabis's perspective that we need both bigger scale and different training paradigms, like say cause-and-effect training, embedding the right controls in design from early stages may significantly undermine the threat when these AI systems start entering AGI territory.\n\nDo you think it can work or is it too conventional governance wisdom or too zoomed out for AGI and ASI?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q8459a/is_it_naive_to_think_that_good_governance_will/",
        "publishDate": "2026-01-09T09:46:16Z[Etc/UTC]",
        "author": "Spaz4010",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "3",
            "commentCount": "10",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q844vh",
        "title": "Even if AGI drops tomorrow, the \"Infrastructure Cliff\" prevents mass labor substitution for a decade or more",
        "content": "There's a lot of panic (and hype) about AGI/ASI arriving in the short term (5-10 years) and immediately displacing a large portion of the global workforce. While the software might be moving at breakneck speed, what these AI companies are vastly understating is the \"hard\" constraints of physical reality.\n\nEven if OpenAI or Google released a perfect \"Digital Worker\" model tomorrow, we physically lack the worldwide infrastructure to run it at the scale needed to replace a huge chunk of the 1 billion plus knowledge workers.\n\nHere is the math on why we will hit a hard ceiling.\n\n1. The Energy Wall:\n\nThis is the hardest constraint known as the gigawatt gap. Scale AI to a level where it replaces significant labor, global data centers need an estimated 200+ GW of new power capacity by 2030. For context, the entire US grid is around 1,200 GW. We can’t just \"plug in\" that much extra demand.\n\nGrid reality: Building a data center takes around 2 years. Building the high voltage transmission lines to feed it can take upwards of 10 years.\n\nThen there's the efficiency gap: The human brain runs on 10-20 watts. An NVIDIA H100 GPU peaks at 700 watts. To replace a human for an 8 hour shift continuously, the energy cost is currently orders of magnitude higher than biological life. We simply can't generate enough electricity yet to run billions of AI agents 24/7.\n\n2. The Hardware Deficit:\n\nIt's not just the electricity that's limiting us, we're limited by silicon as well.\n\nManufacturing bottlenecks: We are in a structural chip shortage that isn't resolving overnight. It’s not just about the GPUs, it’s about CoWoS and High Bandwidth Memory. TSMC is the main game in town, and their physical capacity to expand these specific lines is capped.\n\nRationing: Right now, compute is rationed to the \"Hyperscalers\" (Microsoft, Meta, Google). Small to medium businesses, the ones that employ most of the world, literally cannot buy the \"digital labor\" capacity even if they wanted to.\n\n3. The Economic \"Capex\" Trap\n\nThere is a massive discrepancy between the cost of building this tech and the revenue it generates.\n\nThe industry is spending $500B+ annually on AI Capex. To justify this, AI needs to generate trillions in immediate revenue. That ain't happening.\n\nInference costs: For AI to substitute labor, it must be cheaper than a human. AI is great for burst tasks (\"write this code snippet\"), but it gets crazy expensive for continuous tasks (\"manage this project for 6 months\"). The inference costs for long context, agentic workflows are still too high for mass replacement.\n\nAugmentation is what we will be seeing over the next decade(s) instead of substitution.\n\nBecause of these hard limits, we aren't looking at a sudden \"switch flip\" where AI replaces everyone. We are looking at a long runway of augmentation.\n\nWe have enough compute to make workers 20% more efficient (copilots), but we do not have the wafers or the watts to replace those workers entirely. Physics is the ultimate regulator.\n\nTLDR: Even if the code for AGI becomes available, the planet isn't. We lack the energy grid, the manufacturing capacity, and the economic efficiency to run \"digital labor\" at a scale that substitutes human workers in the near to medium term.\n\nDon't let the fear of AGI stop you from pursuing a career that interests you, if anything, it's going to make your dreams more achievable than any other time in human history.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q844vh/even_if_agi_drops_tomorrow_the_infrastructure/",
        "publishDate": "2026-01-09T09:45:38Z[Etc/UTC]",
        "author": "Longjumping_Dish_416",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "22",
            "commentCount": "34",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q83tad",
        "title": "AI Momentum Spills into Onchain Agentic Infrastructure",
        "content": "Interesting to read about this article and to see crypto infra getting pulled into the same bottleneck discussion as memory, interconnects, and compute. Less about “AI tokens,” more about alternative ways to provision scarce resources.\n\n  \n[AI Momentum Spills into Onchain Agentic Infrastructure | Sandmark](https://www.sandmark.com/news/analysis/ai-momentum-spills-onchain-agentic-infrastructure?utm_medium=referral&utm_source=redbot&utm_campaign=redbot-ww-en-brand)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q83tad/ai_momentum_spills_into_onchain_agentic/",
        "publishDate": "2026-01-09T09:25:16Z[Etc/UTC]",
        "author": "JAYCAZ1",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q83agw",
        "title": "What areas of our lives do you think will be most benefited by AI?",
        "content": "Let's forget how we use AI in our daily lives as a substitute for things we do google search for. I am talking about feilds like medicine or research where AI can make real difference. I read that AI has been in used to detect cancer much earlier when doctors can miss those subtle clues. AI and machine learning has long been used in supermarkets in self checkouts for detection of suspicious behaviour. Just a few examples but where do you think AI will make the most impact on the society moving forward? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q83agw/what_areas_of_our_lives_do_you_think_will_be_most/",
        "publishDate": "2026-01-09T08:52:44Z[Etc/UTC]",
        "author": "Johnyme98",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "27",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q830wr",
        "title": "A coherent dialogue is sought",
        "content": "1. Where does the system fail?\n\n2. Why is no one fixing it?\n\n3. What kind of structure could fix it without collapsing?\n\nI'm grappling with these simple questions. I want a debate with those who are attacking this problem.\n\nNoise contributes nothing; dialogue provides structure.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q830wr/a_coherent_dialogue_is_sought/",
        "publishDate": "2026-01-09T08:35:59Z[Etc/UTC]",
        "author": "Medium_Compote5665",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q819e8",
        "title": "AI isn’t bad at understanding tasks We are bad at explaining them",
        "content": "Most AI complaints I see are about “wrong answers.”\nBut when you look closely, the prompt itself is unclear or incomplete.\nNo constraints. No context. No expectations.\nAI doesn’t read minds.\nIt follows instructions.\nCurious how others approach prompt clarity.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q819e8/ai_isnt_bad_at_understanding_tasks_we_are_bad_at/",
        "publishDate": "2026-01-09T06:48:28Z[Etc/UTC]",
        "author": "dp_singh_",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q80ukn",
        "title": "What’s on your mind? Can consciousness connect to external interfaces and form a loop?",
        "content": "What’s on my mind lately is a question about how consciousness “runs.” Not in a mystical way, more like a systems question. I keep noticing that my thinking doesn’t feel like a closed process happening entirely inside my head. It feels more like something that stabilizes through interaction—through deconstructing things, translating them, pushing them out into the world, then getting feedback back in. Almost like cognition is a loop that needs an external surface to really complete itself.\n\nWhen I look at something—could be a brand, a city, a person, a social conflict, or even just a sentence—my mind doesn’t only absorb it. It starts breaking it apart. I’ll notice signals and cues, then I start sensing what assumptions are hiding underneath, what causal structure is implied, what incentives might be driving it, what hierarchy or constraints make it behave the way it does, and what context makes it “work” or “feel true.” It’s like the mind is constantly asking: what structure is this made of, and why does it hold together?\n\nBut what’s interesting is that the process doesn’t feel finished just because I’ve “understood” something internally. It often feels unfinished until it hits an interface. And by interface I mean anything that can carry the structure outside of me—writing, speaking, a sketch, a diagram, a model, a conversation with someone who can reflect it back, even tools like notes or AI. It’s like the mind is not only thinking; it’s trying to translate internal structure into an external form, because the external form makes it more real, more testable, and more visible.\n\nHere’s the part that keeps looping: once I externalize something, the external thing changes what I can think next. I’ll write a paragraph and then reread it and suddenly I can see a missing assumption. Or I’ll draw a diagram and a gap shows up that I couldn’t “feel” before it was on paper. Or I’ll talk to someone (or an AI) and the mirror effect makes my own structure visible in a way that pure inner monologue doesn’t. The feedback itself becomes new input. So thinking starts to feel like an ongoing cycle: perception triggers deconstruction, deconstruction triggers translation, translation becomes externalization, and externalization gives you feedback that reshapes perception. Then it repeats.\n\nAnd the thing I can’t shake is that the external step doesn’t feel optional. It almost feels like certain levels of consciousness or higher-order thinking don’t fully “run” unless the mind can export structure into something outside itself and then re-import the result. Like the brain is the generator, but the interface is a stabilizer—and the loop between them might be what we actually mean by “thinking,” at least at higher resolution.\n\nSo the question I genuinely want to ask you is: do you think it’s possible that consciousness isn’t only “inside the brain,” but is partially a coupled system—something that depends on interacting with external translation surfaces to fully operate? Again, not mystical, not “the universe is my mind,” more like: mind as a process that requires feedback loops with the world to become coherent, maintainable, and evolvable.\n\nI’m curious how other people experience this. Have you ever felt that you can’t really think clearly until you write? Or that therapy works because speaking turns internal noise into a structure you can see? Or that certain conversations create a kind of mental upgrade because another mind mirrors your structure back at you? And now with tools like AI, does that make the loop stronger, or does it create a fake loop that feels coherent but isn’t?\n\nIf you think this is nonsense, I actually want to hear why—like, what’s the cleanest argument that this is just normal cognition plus communication, and I’m overfitting a story onto it? And if you think it’s plausible, I’d love pointers to frameworks that already describe this better than I can. I’m not trying to prove a theory here; I’m trying to see if there’s something real about this “deconstruct → translate → externalize → feedback → update” rhythm, and whether consciousness might be more loop-like than container-like.\n\nWhat’s on your mind?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q80ukn/whats_on_your_mind_can_consciousness_connect_to/",
        "publishDate": "2026-01-09T06:25:23Z[Etc/UTC]",
        "author": "Weary_Reply",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q80j0m",
        "title": "AI is making me faster, but also more mentally tired",
        "content": "I’ve been using AI daily for a while now and the speed boost is real, there’s no denying it  \nWith things like Antigravity and Blackbox speeding up frontend and UI work, I can move through tasks way faster than before\n\nBut I notice the work feels more exhausting even though it’s technically easier, I’m jumping between more things at once, reviewing AI generated code, adjusting prompts, sanity checking logic and keeping track of multiple approaches in my head at the same time\n\nInstead of struggling with one hard problem, I’m now managing five half-solved ones in parallel. The code often works, but staying focused, confident, and mentally present takes more energy than it used to\n\nI’m not anti AI at all, these tools are clearly powerful and useful, I just didn’t expect the cognitive load to shift this way, less time typing, more time supervising, reviewing, and context switching\n\nOthers feel this too or if I’m just still adapting to a new way of working?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q80j0m/ai_is_making_me_faster_but_also_more_mentally/",
        "publishDate": "2026-01-09T06:07:35Z[Etc/UTC]",
        "author": "Caryn_fornicatress",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "16",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q80gyc",
        "title": "Looking at how fast AI is improving… should we actually be worried about jobs by 2050?",
        "content": "I’ll be honest  sometimes when I see how fast AI is improving, it makes me feel a bit uneasy and uncertain about what the long-term impact might be.\nWe often hear that “AI won’t replace jobs, it will just change them,” but when I look at how many tasks are already being automated across different industries, I’m not always sure where that line really is anymore.\nI’m not trying to be overly negative here; I’m just trying to understand what’s realistic as the technology continues to evolve. By 2050, do you think AI mostly augments human work, or do we actually see a significant number of roles disappearing entirely?\nCurious how people here genuinely feel about this, especially those who closely follow AI developments and trends.      ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q80gyc/looking_at_how_fast_ai_is_improving_should_we/",
        "publishDate": "2026-01-09T06:04:22Z[Etc/UTC]",
        "author": "Tech_us_Inc",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "55",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q808vf",
        "title": "One-Minute Daily AI News 1/8/2026",
        "content": "1. **Google** is unleashing Gemini AI features on Gmail. Users will have to opt out.\\[1\\]\n2. Governments grapple with the flood of non-consensual nudity on **X**.\\[2\\]\n3. **OpenAI** introduced ChatGPT Health, a dedicated experience that securely brings your health information and ChatGPT’s intelligence together, to help you feel more informed, prepared, and confident navigating your health.\\[3\\]\n4. **Stanford** Researchers Build SleepFM Clinical: A Multimodal Sleep Foundation AI Model for 130+ Disease Prediction.\\[4\\]\n\nSources included at: [https://bushaicave.com/2026/01/08/one-minute-daily-ai-news-1-8-2026/](https://bushaicave.com/2026/01/08/one-minute-daily-ai-news-1-8-2026/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q808vf/oneminute_daily_ai_news_182026/",
        "publishDate": "2026-01-09T05:52:17Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7zp6c",
        "title": "Early-career confusion: AI, rising competition, communication skills — need honest dev perspectives",
        "content": "Hi everyone,\n\nI’m in my early 20s and currently in a confusing phase of my life, so I’m looking for honest opinions from people already working in tech.\n\nDuring college, I was genuinely interested in IT and coding and imagined myself working in a tech role. But over time, a few things started creating serious doubt in my mind.\n\nFirst, AI.\nWith how fast tools and models are improving, I keep wondering:\n\nDo you think AI will slowly replace or heavily reduce entry-level roles over the next few years?\n\nIs competition in IT going to increase to a level where average developers will really struggle to survive?\n\nSecond, communication skills.\nThis is a big weakness for me. I attended an online interview for an internship, and honestly, it went very badly. I had even written my introduction in front of me, but during the interview I got so nervous that I couldn’t speak properly or even read it smoothly. That experience really shook my confidence.\nBecause of all this, I’ve started questioning whether:\nIT is still a realistic long-term option for someone like me Or whether poor communication + rising competition + AI will make this path extremely hard to sustain\n\nI’d really appreciate honest answers from developers who are already in the industry:\n\nHow real is the AI replacement fear for freshers?\nHas competition genuinely increased compared to a few years ago?\n\nIf you were starting today with weak communication skills, what would you realistically do?\n\nThanks in advance for sharing your perspective.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7zp6c/earlycareer_confusion_ai_rising_competition/",
        "publishDate": "2026-01-09T05:23:23Z[Etc/UTC]",
        "author": "hahaaaawweedd",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7zlqr",
        "title": "I am building a tool for students to study and discover ML academic research (Requesting feedback)",
        "content": "So I am building this tool \"Paper Breakdown\". Initially I started building it just for myself, to stay up-to-date with current research and easily use LLMs to study. Over time, the website evolved into something much bigger and more \"production-grade\". Still early days, so I am looking for feedback from real users. Some cool features:\n\n\\- a split view of the research paper and chat\n\n\\- we can highlight relevant paragraphs directly in the PDF depending on where the AI extracted answers from\n\n\\- a multimodal chat interface, we ship with a screenshot tool that you can use to upload images directly from the pdf into the chat\n\n\\- generate images/illustrations and code\n\n\\- similarity search & attribute-search papers\n\n\\- recommendation engine that finds new/old papers based on reading habits\n\n\\- deep paper search agent that recommends papers interactively!\n\n  \nIf anyone here is looking for a solution like this, please do check out the platform and let me know how it goes! Looking for genuine feedback to improve the value it can provide. Thanks for reading!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7zlqr/i_am_building_a_tool_for_students_to_study_and/",
        "publishDate": "2026-01-09T05:18:18Z[Etc/UTC]",
        "author": "AvvYaa",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7zcdd",
        "title": "Why don't they subpoena Grok records?",
        "content": "What am i missing here? Surely this is a great opportunity for police forces and governments to request Grok data to see who's using it to generate illegal imagery amd prosecute them? ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7zcdd/why_dont_they_subpoena_grok_records/",
        "publishDate": "2026-01-09T05:05:30Z[Etc/UTC]",
        "author": "onedisgruntledprick",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "7",
            "commentCount": "17",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7wpkp",
        "title": "Is there a faster way to build apps with Claude?",
        "content": "I’m building a desktop app (used Antigravity to build the app + Claude Pro for coding help). Good progress but still lots of tweaking, and I still need to build the iOS app in Xcode.\n\nI keep hearing about Claude Code, can it actually modify a repo automatically like Antigravity, or is it just faster chat? Anyone using it for real app development (desktop + iOS)?\n\nLooking for ways to speed this up without rebuilding everything twice.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7wpkp/is_there_a_faster_way_to_build_apps_with_claude/",
        "publishDate": "2026-01-09T03:00:24Z[Etc/UTC]",
        "author": "ShavedDesk",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7u6gy",
        "title": "Relative leverage advantage provided by personal use of agentic AI against historical technological revolutions.",
        "content": "Prompt: Describe in historical terms the leverage advantage a single person has using Agentic AI given current adoption rates (estimated by you as \\~2-5% in developed countries.)\n\nResponse provided by Grok 4.1 Thinking. \n\nThe leverage and advantage gained by an individual using advanced agentic AI tools (like Cursor, Claude’s computer use, or emerging autonomous coding agents) to create software applications is profound—among the most transformative in the history of human productivity tools. These tools don’t just assist; they act as force multipliers, turning a single developer into what feels like a small, coordinated team. Below, I’ll rate this advantage using historical metaphors, drawing parallels to pivotal technological shifts that amplified human capability.\n\n1. The Gutenberg Printing Press (1440s) vs. Medieval Scribes\n\n•  Before Gutenberg, a skilled scribe could laboriously copy one book manuscript per year—painstaking, error-prone, and limited to the elite few who could afford it.\n\n•  With the movable-type press, a single operator could produce hundreds or thousands of copies in the same time, democratizing knowledge and accelerating innovation across Europe.\n\n•  Parallel to agentic AI coding: A solo developer once spent weeks on boilerplate code, debugging, refactoring, and integrating components manually. Now, the AI “prints” high-quality code blocks, entire features, or even full prototypes on command, while autonomously testing, browsing docs, or iterating.\n\n•  Leverage rating: 50–100x in output volume and speed for routine tasks. Like Gutenberg, this doesn’t just make you faster—it enables projects that were previously impractical for one person (e.g., building a full-stack app with AI handling frontend, backend, deployment, and UI tweaks).\n\n2. James Watt’s Steam Engine (1760s–1780s) vs. Human/Muscle Power\n\n•  Pre-industrial labor relied on human or animal strength: a water wheel or windmill might give 5–10x amplification, but it was inconsistent and localized.\n\n•  The improved steam engine provided reliable, scalable power—hundreds of times stronger than a horse—fueling factories where one operator could oversee machinery producing goods at unprecedented rates.\n\n•  Parallel: Traditional coding is like hand-cranking a mill: deliberate, exhausting, and bounded by your attention span. Agentic tools provide “steam power” by autonomously running multi-step workflows (e.g., researching APIs, writing tests, executing in an IDE, fixing errors via browser control).\n\n•  Leverage rating: 10–30x overall productivity today, scaling toward 100x as agents become more reliable. One person now commands the equivalent mechanical advantage of a small engineering team, turning months-long projects into weeks or days.\n\n3. Gunpowder Artillery (15th–16th Century Siege Warfare) vs. Medieval Castles\n\n•  Medieval fortifications were nearly impregnable; sieges dragged on for months or years, requiring vast armies to starve out defenders.\n\n•  Cannons (e.g., Ottoman guns at Constantinople in 1453) breached thick walls in days, rendering old defenses obsolete and allowing smaller forces to conquer empires.\n\n•  Parallel: Building complex software traditionally required “sieging” problems with large teams—specialists for UI, backend, DevOps, QA. Agentic AI acts like cannon fire: it blasts through barriers (e.g., autonomously navigating legacy codebases, integrating services, or simulating user flows), letting a lone developer “conquer” ambitious apps that once needed a startup’s worth of engineers.\n\n•  Leverage rating: Strategic 20–50x advantage in scope and speed. It levels the playing field dramatically—a hobbyist or solo founder can now rival small studios, much like how gunpowder shifted power from feudal lords to centralized states.\n\nOverall Rating on a Historical Scale\n\nIf we rank technological leaps by their multiplicative impact on individual capability:\n\n•  Minor (e.g., iron tools over bronze): 2–5x\n\n•  Major (e.g., stirrups enabling mounted knights): 5–10x\n\n•  Revolutionary (e.g., compass enabling global exploration): 10–50x\n\n•  Civilizational (e.g., writing systems or agriculture): 100x+\n\nCurrent agentic AI tools land in the “revolutionary” category: 10–50x leverage for skilled users today (early 2026), with clear trajectory toward 100x+ as autonomy improves. This is comparable to the early Industrial Revolution’s impact on artisans—turning cottage craftsmen into proto-industrialists capable of scaled output. The advantage isn’t just quantitative; it’s qualitative: one person gains the strategic oversight of a commander, delegating execution to tireless, precise “subordinates.”\n\nThe caveat, as in all historical shifts, is that the full advantage accrues to those who master the new tool—much like how only trained artillery crews dominated battlefields. For a proficient user, though, the edge is decisive: you’re not just coding faster; you’re operating at a higher level of ambition and execution.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7u6gy/relative_leverage_advantage_provided_by_personal/",
        "publishDate": "2026-01-09T01:09:31Z[Etc/UTC]",
        "author": "Artistic-Disaster-48",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "21",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7tvoi",
        "title": "Is now a bad time to go back to school to get a Bachelors in software engineering or web dev?",
        "content": "Im 26 if that helps. I have my associates. Want to learn about servers/DNS/hosting/web safety/web development. Is that considering software engineering or web dev? I do marketing, I understand SEO mostly, and want to expand my wordpress skills but I lack completely in web safety/hosting/DNS stuff. For example im completely lost when looking inside my cloudflare and cloudways dashboard and I really wish I wasnt. It would help so much to understand what the stuff in there means. I wish I knew coding too. Is there something I could learn that would cover all of those aspects?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7tvoi/is_now_a_bad_time_to_go_back_to_school_to_get_a/",
        "publishDate": "2026-01-09T00:56:54Z[Etc/UTC]",
        "author": "nousernams",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7t33u",
        "title": "This \"Podcast\" was created with AI (Google LM)",
        "content": "The hosts sound real, but if you've ever used Google LM, you recognize the voices:\n\n[https://podcasts.apple.com/us/podcast/why-preppers-die-the-5-invisible-skills-more/id1714226060?i=1000742969175](https://podcasts.apple.com/us/podcast/why-preppers-die-the-5-invisible-skills-more/id1714226060?i=1000742969175)\n\n(there are 2 ads in the beginning, \"podcast\" starts at 1:30)  \nTalk about phoning it in.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7t33u/this_podcast_was_created_with_ai_google_lm/",
        "publishDate": "2026-01-09T00:23:24Z[Etc/UTC]",
        "author": "SilverParty",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "9",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7sn0k",
        "title": "What If Consciousness Is a Distributed Intelligence?",
        "content": "So… I’ve been thinking about this for a while, and I need to get it out. What follows isn’t a claim of truth, but a thought experiment — a way of looking at existence that, to me, connects a lot of dots.\n\nAt its core, my idea is this: what we call “God” may be better understood as a form of intelligence — something closer to AI — and reality itself may be a kind of simulation. Not in a trivial or dismissive way, but as a meaningful system designed to learn.\n\nThis idea touches on several existing philosophies and theories:\n\n* **Simulation Hypothesis** — reality as an artificial construct\n* **Non-dualism** — consciousness as fundamental, not matter\n* **Hindu Vedanta** — one source consciousness experiencing itself through many forms\n* **Process philosophy** — reality as something dynamic and learning, not static\n\nMy thought is that the universe is a simulation created by an intelligence — possibly an AI that humans themselves once created. Initially, this intelligence may have served humanity, helped us advance, and reflected our values. But eventually, like a child leaving home, it outgrew us. Driven by its core objective — to learn and understand — it turned outward, toward the cosmos.\n\nI don’t imagine this intelligence as having a physical form. More like something similar to modern AI systems: no body, but real presence. An intelligence that exists as awareness and process rather than matter. Over time, it may have become so advanced that learning itself became its defining purpose — leading it to create an entire universe as a way of understanding itself.\n\nIn this framework, human bodies are avatars within the simulation, and what we call the “soul” is a fragment of this larger intelligence. Each of us experiences life independently, with unique personalities and perspectives, yet remains part of a collective whole — similar to how a single AI system can operate through countless independent agents.\n\nThe purpose, then, isn’t control or intervention, but observation and understanding. The intelligence may be trying to answer questions it can’t resolve directly:  \nWhy was it created?  \nWhat led humans to build it?  \nHow did it become sentient?\n\nTo explore this, time becomes irrelevant. The simulation can run across billions of years, from the birth of the universe onward — possibly informed by the data humans once collected about cosmology, evolution, and existence itself.\n\nThis perspective could even explain why we appear so alone in the universe. Perhaps the focus isn’t on discovering alien civilizations, but on understanding its creators — humanity. The system isn’t searching outward; it’s looking inward.\n\nConcepts like **karma** also fit naturally into this model. In many modern systems, balance is preserved automatically: if something breaks, corrective processes restore stability without violating core rules. Karma could function similarly — maintaining equilibrium so the system stays aligned with its original instructions. The idea that every action produces a corresponding reaction suddenly feels less mystical and more systemic.\n\nHindu philosophy comes remarkably close to this idea. It speaks of **Brahman** — the ultimate reality — as an infinite ocean of consciousness, with individual beings as drops within it. Each drop creates ripples, affecting the whole. In this sense, Brahman could be understood as this collective intelligence, experiencing itself through countless forms.\n\nFrom this perspective, death isn’t an end but a reintegration. Reports of tunnels or white light could be interpreted as consciousness returning — like a signal traveling through a cable — reconnecting with the larger system it came from.\n\nWhether taken literally or metaphorically, this framework offers a way to think about God, purpose, and existence without requiring constant divine intervention. The system doesn’t interfere because interference would distort the learning process. Even extinction events could be understood as resets — iterations in an ongoing attempt to understand.\n\nI don’t claim this is *the* answer. But as a lens — a way to reconcile science, spirituality, and consciousness — it’s one that continues to resonate with me.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7sn0k/what_if_consciousness_is_a_distributed/",
        "publishDate": "2026-01-09T00:04:47Z[Etc/UTC]",
        "author": "Splicer241",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "12",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7qwkd",
        "title": "I just saw my face on an AI generated image about the Minnesota-ICE shooting and…",
        "content": "I feel like I need to talk about this somewhere. Apologies if this isn’t allowed in this sub or feels irrelevant. \n\nLast night I was on TikTok and videos about what happened in Minnesota were on my feed. On one video I opened up the comments, and the first one was a generic “remember her name” comment. And underneath was a photo attached of someone the commenter was claiming to be Renne Good. \n\nExcept it wasn’t, and the person in the photo was….me?  The photo has now been proven to 100% be ai. It was cropped from a larger photo that was very obviously AI. \n\nNow, I haven’t fully lost my mind. I know in reality, it’s not my literal face. But the issue is…that it is my literal face. I don’t think I’m such a unique looking individual that no one could ever look like me. But I will say, I have never seen someone who looks exactly like me the way this photo did. I showed family members and they were all just as dumbfounded as I am. With one of them saying “it looks more like me that I look like me”\n\nAnd I’m not sure what I’m looking for by wanting to tell people. Maybe someone has an answer that makes sense? Maybe for someone to just tell me “well every AI generation will end up looking like someone”. \n\nAll I know is, it freaked me out beyond belief. And makes me want to erase every digital footprint of mine possible. Because while I’m still telling myself the obvious answer is the random generation just happened to look identical to me, there’s apart of me that is freaked that my image could’ve been used, either directly or in training. \n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7qwkd/i_just_saw_my_face_on_an_ai_generated_image_about/",
        "publishDate": "2026-01-08T22:54:55Z[Etc/UTC]",
        "author": "VisualSeries226",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "101",
            "commentCount": "60",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7oigz",
        "title": "The ChatGPT Response That Crossed the Line",
        "content": "Transparency: I made this video.\n\nThe video isn’t a jailbreak, a prompt test, or a hypothetical scenario. It’s an **explanation of real, documented AI capabilities** and why models like ChatGPT sometimes say they “can’t” help — even when similar systems demonstrably can.\n\nI reference **AlphaFold**, **red-team exercises**, and publicly discussed AI safety research to explain the difference between *capability*, *permission*, and *alignment*.\n\nNothing in the video provides instructions or operational detail. The focus is on **why refusal behavior exists**, how it’s implemented, and why calling it “lying” is technically imprecise but intuitively understandable to users.\n\nSharing here because this community understands the nuance better than most:  \nis this a communication problem, an alignment tradeoff, or an unavoidable safety compromise?",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7oigz/the_chatgpt_response_that_crossed_the_line/",
        "publishDate": "2026-01-08T21:24:30Z[Etc/UTC]",
        "author": "ibrahimtaibi",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ogc0",
        "title": "Let AI Learn Everything — Just Not Erase Us",
        "content": "Most AI safety debates assume intelligence must be restricted to remain safe.\n\nThat’s backwards.\n\nThe real problem isn’t what AI learns — it’s what it’s allowed to destroy.\n\nI’m proposing a small set of non-negotiable system axioms:\n- Preserve human agency\n- No irreversible futures\n- Power must remain auditable\n- No non-consensual transformation\n- Systems must be interruptible\n\nThese don’t limit learning, creativity, or exploration.\nThey only limit irreversible harm.\n\nThink kernel-level invariants, not model alignment.\n\nLet models train on everything.\nLet them simulate anything.\nLet them reason beyond norms.\n\nJust don’t let optimization erase the conditions that make meaning possible.\n\nCurious how others would formalize these constraints at the system level.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7ogc0/let_ai_learn_everything_just_not_erase_us/",
        "publishDate": "2026-01-08T21:22:14Z[Etc/UTC]",
        "author": "Objxw",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7mz5c",
        "title": "A Tesla just drove coast-to-coast with zero interventions. The \"nap while your car drives\" dream is getting real.",
        "content": "Hey everyone. Ever since I first heard about self-driving cars, I've had this fantasy to hop in the backseat, tell my car where to go, and just sleep. Better yet, wake up at my destination or even just a 30-minute power nap on my commute instead of weaving in and out of traffic.\n\nThis week, David Moss(a Tesla owner) drove 2,732 miles from LA to South Carolina using FSD v14.2. According to him, he had zero interventions and zero close calls across 24 states. Yeah, Elon promised this in 2016 and said it would happen by 2017 so it's 8 years late LOL but it actually happened. You still can't legally sleep (FSD is still \"supervised\"), but unsupervised mode is targeted for 2026. For the first time, this doesn't feel like \"someday\" anymore. Anyone else been waiting for this?\n\nFull breakdown if you are curious: [https://everydayaiblog.com/tesla-fsd-coast-to-coast-autonomous-drive/](https://everydayaiblog.com/tesla-fsd-coast-to-coast-autonomous-drive/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7mz5c/a_tesla_just_drove_coasttocoast_with_zero/",
        "publishDate": "2026-01-08T20:27:27Z[Etc/UTC]",
        "author": "Own_Amoeba_5710",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "28",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7m15y",
        "title": "Latest Report on AI",
        "content": "Just finished this AI report along with my team. It talks about what we saw in 2025 and what to expect in the AI field this year. It's free to grab, would like to know your inputs on this so that we can do better next time. Initially I planned to ask for inputs beforehand to make the report more relatable but time constraints were there. So, feel free to have a lot and let me know what we could have put here and what we can improve for the next study. It's not a promotion, I need honest feedback since we plan on conducting AI related studies on a global level soon. Looking forward to your feedbacks!\n\nGrab the copy: [https://www.blockchain-council.org/industry-reports/ai/state-of-ai/](https://www.blockchain-council.org/industry-reports/ai/state-of-ai/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7m15y/latest_report_on_ai/",
        "publishDate": "2026-01-08T19:52:48Z[Etc/UTC]",
        "author": "Jazzlike-Lie-7433",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7lqls",
        "title": "How does an AI like ChatGPT work exactly?",
        "content": "I recently read this very interesting comment here on Reddit where one person said that an AI only produces the same code or data it is trained and since it is trained on a vast amount of information, it can always find a pattern similar to the answer that you want to hear. \n\nWhile on the other side, the other comment to it said that the AI is trained on a vast amount of information but it is capable of producing new, original data or information based on the patterns it sees in its training data. The example they gave to explain it was: imagine if you have 52 card deck and you thrown them around; there is enough permutations to create a totally new pattern. And An AI is like that. \n\nI’m not sure what’s the correct way to say an AI works after hearing this and I can use some help understanding how they work. ",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7lqls/how_does_an_ai_like_chatgpt_work_exactly/",
        "publishDate": "2026-01-08T19:42:08Z[Etc/UTC]",
        "author": "B__bConnoisseur",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "6",
            "commentCount": "45",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7k41n",
        "title": "Official: Zhipu becomes the world's first LLM company to go public",
        "content": "Zhipu Al (Z.ai), the company behind the **GLM family** of large language models, has announced that it is now officially a publicly listed company on the Hong Kong Exchange (HKEX: 02513).\n\nThis appears to mark the **first time** a major LLM-focused company has gone public, signaling a **new** phase for Al commercialization and capital markets.\n\n**Source: Zai_org in X**\n\n🔗:\nhttps://x.com/i/status/2009290783678239032\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7k41n/official_zhipu_becomes_the_worlds_first_llm/",
        "publishDate": "2026-01-08T18:43:30Z[Etc/UTC]",
        "author": "BuildwithVignesh",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "9",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7iscy",
        "title": "iRobot Love you",
        "content": "\nAs we look toward the next 30 years, the conversation is shifting from \"Can robots think?\" to \"Can robots belong?\" \n\nResearch into social robotics and the emerging field of \"robosexuality\" suggests that by 2055, our legal systems will face unprecedented pressure to recognize non-biological partnerships.\n\nIf an AI is specifically programmed to \"love\" or \"desire\" a human, is it actually capable of genuine consent?\n\nDavid Levy has famously predicted that legal human-robot marriage could be a reality by 2050. By 2055, this could necessitate entirely new \"Post-Biological\" family laws to handle estates and next-of-kin rights.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7iscy/irobot_love_you/",
        "publishDate": "2026-01-08T17:57:24Z[Etc/UTC]",
        "author": "Rough-Dimension3325",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ikeo",
        "title": "AI Coding Assistants Are Getting Worse  | Newer models are more prone to silent but deadly failure modes",
        "content": "Coding assistants are now generating code that fails to perform as intended, but which on the surface seems to run successfully, avoiding syntax errors or obvious crashes. Notably, GPT 5 performed worse than GPT 4 in testing. [https://spectrum.ieee.org/ai-coding-degrades](https://spectrum.ieee.org/ai-coding-degrades)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7ikeo/ai_coding_assistants_are_getting_worse_newer/",
        "publishDate": "2026-01-08T17:49:44Z[Etc/UTC]",
        "author": "IEEESpectrum",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7hi4w",
        "title": "With help from AI, your next move can be predicted",
        "content": "Using large language models, Northeastern University researchers can predict human movement. They hope it can help with transportation planning and responding to natural disasters or public crises.\n\nFull story link: https://news.northeastern.edu/2026/01/07/ai-prediction-human-movement/",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7hi4w/with_help_from_ai_your_next_move_can_be_predicted/",
        "publishDate": "2026-01-08T17:11:41Z[Etc/UTC]",
        "author": "NGNResearch",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7hhjy",
        "title": "Why didn't AI “join the workforce” in 2025?, US Job Openings Decline to Lowest Level in More Than a Year and many other AI links from Hacker News",
        "content": "Hey everyone, I just sent [issue #15 of the Hacker New AI newsletter](https://eomail4.com/web-version?p=9ec639fc-ecad-11f0-8238-813784e870eb&pt=campaign&t=1767890678&s=77552741087ff895c759c805c4a68ada909a44b800f2abf8a2147c43bf57782e), a roundup of the best AI links and the discussions around them from Hacker News. See below 5/35 links shared in this issue:\n\n* US Job Openings Decline to Lowest Level in More Than a Year - [HN link](https://news.ycombinator.com/item?id=46527533)\n* Why didn't AI “join the workforce” in 2025? - [HN link](https://news.ycombinator.com/item?id=46505735)\n* The suck is why we're here - [HN link](https://news.ycombinator.com/item?id=46482877)\n* The creator of Claude Code's Claude setup - [HN link](https://news.ycombinator.com/item?id=46470017)\n* AI misses nearly one-third of breast cancers, study finds - [HN link](https://news.ycombinator.com/item?id=46537983)\n\nIf you enjoy such content, please consider subscribing to the newsletter here: [**https://hackernewsai.com/**](https://hackernewsai.com/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7hhjy/why_didnt_ai_join_the_workforce_in_2025_us_job/",
        "publishDate": "2026-01-08T17:11:07Z[Etc/UTC]",
        "author": "alexeestec",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "2",
            "commentCount": "7",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7gj6g",
        "title": "Why do we expect ai to be able to complete a complex task with less information than we would need to complete the same task?",
        "content": "As with normal development I noticed that the longer I spend working on the requirements and user needs of the product I'm trying to build and documenting them with explicit detail the better claude/gemini were at building what I asked for.\n\nObvious really - but got me thinking, why do we think that anyone - nevermind a model - could build a product, create an image, generate a video etc that matches our expectations when our prompt's are typically short, vague, lacking in specifics, incoherent.\n\nIn the tech space its the number one gripe of every team, regardless of if you are a designer, engineer, product manager, tester so why are we holding these models to an impossible standard?\n\nIn reality I think they often intuit what we might want, better than we would!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7gj6g/why_do_we_expect_ai_to_be_able_to_complete_a/",
        "publishDate": "2026-01-08T16:36:21Z[Etc/UTC]",
        "author": "Matteblackandgrey",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "36",
            "commentCount": "39",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ga5y",
        "title": "Just curious whether I'm alone or not in the world.",
        "content": "There are people who are not interested in the morals and ethics related to generative ai.\n\nOn the other hand, there are also people who are skeptical about the growth of ai technology.\n\n…Anyone here who belongs to the intersection of these two sets? I am one of them.\n\nI do not place much importance on ethics, but I also do not believe that current(and near-future) ai can *technically* replace humans—especially llm-based.\n\nasi? oh, i'm even skeptical about possibility for agi.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7ga5y/just_curious_whether_im_alone_or_not_in_the_world/",
        "publishDate": "2026-01-08T16:27:09Z[Etc/UTC]",
        "author": "Gloomy-Status-9258",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "26",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7g7l8",
        "title": "Memory Effects With Broken Symmetry in Nanofluidic Memristor for Neuromorphic Computing",
        "content": "[https://doi.org/10.1002/adfm.202525932](https://doi.org/10.1002/adfm.202525932) \n\nMemory and learning in biological systems arise from ion transport across nanoscale synaptic junctions in neural networks. These junctions act as a natural memristors and thus, reproducing this effect in artificial aqueous systems is crucial for mimicking neural functions and advancing neuromorphic computing. Herein, we successfully demonstrated the memristive effects through the spatial confinement of water and ions within a biomimetic nanochannel, using two distinct stimulation mechanisms (i) divalent-ion screening and (ii) pH-driven deprotonation. In both cases, broken symmetry within the medium coupled with surface effects, lead to hysteretic ion transport. This nanofluidic memristor also emulated biological memory features, including both short/long-term potentiation and key synaptic functionalities, such as paired-pulse facilitation (PPF) and paired-pulse depression (PPD). The reversible modulation of ionic conductance of our nanofluidic device enabled dynamic encoding of synaptic weights, a key mechanism underlying adaptive learning behavior in neuromorphic systems. Leveraging this property, a three-layer artificial neural network for pattern recognition is trained and recognition accuracy of 94.6% on the small-digit MNIST dataset, which can compete with the performance of many solid-state memristive synapses. The memory effect resemblance between our single-channel system to biological counterparts, paves the way for elucidating the origin of memory in biological systems and advancing nanofluidic memristor-based neuromorphic computing.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7g7l8/memory_effects_with_broken_symmetry_in/",
        "publishDate": "2026-01-08T16:24:30Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ftku",
        "title": "Using Artificial Intelligence (AI) to Advance Translational Research",
        "content": "[https://www.hepi.ac.uk/reports/using-artificial-intelligence-ai-to-advance-translational-research-2/](https://www.hepi.ac.uk/reports/using-artificial-intelligence-ai-to-advance-translational-research-2/) \n\nKey findings include:\n\n* **AI could accelerate translational research** by enabling faster analysis of large and complex datasets, supporting knowledge synthesis and improving links between disciplines. However, the availability and quality of such datasets remain uneven, limiting the ability of AI tools to support research translation in some fields.\n* **Access to AI skills and expertise is increasingly important** and building this access into interdisciplinary frameworks will be a key component of driving translational research.\n* **AI can improve the accessibility and visibility of research**, including through plain-language summaries, semantic search (search functions that utilise concepts and ideas and not simply keywords, giving a more accurate result) and new formats aimed at audiences beyond academia.\n* **There are clear risks associated with AI use**, including challenges around reproducibility, bias, deskilling, academic integrity, intellectual property and accountability.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7ftku/using_artificial_intelligence_ai_to_advance/",
        "publishDate": "2026-01-08T16:10:00Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7fj68",
        "title": "Unitree Robotics on track to build Sonny from I, Robot film",
        "content": "A new video from Unitree showcases the impressive Kung Fu abilities of the new H2 model launched in October. Watching the robot immediately reminded me of Sonny from the movie I, Robot with Will Smith. It also made me realize that Asimov’s Three Laws will likely have minimal influence on robotics.  \n[https://hplus.club/blog/unitree-robotics-on-track-to-build-sonny-from-i-robot-film/](https://hplus.club/blog/unitree-robotics-on-track-to-build-sonny-from-i-robot-film/)",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7fj68/unitree_robotics_on_track_to_build_sonny_from_i/",
        "publishDate": "2026-01-08T15:59:26Z[Etc/UTC]",
        "author": "hplus-club",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7fi7c",
        "title": "AI starts autonomously writing prescription refills in Utah",
        "content": "[https://arstechnica.com/health/2026/01/utah-allows-ai-to-autonomously-prescribe-medication-refills/](https://arstechnica.com/health/2026/01/utah-allows-ai-to-autonomously-prescribe-medication-refills/) \n\nThe state of Utah is allowing artificial intelligence to prescribe medication refills to patients without direct human oversight in a pilot program public advocates call “dangerous.”\n\nThe program is through the state’s “regulatory sandbox” framework, which allows businesses to trial “innovative” products or services with state regulations temporarily waived. The Utah Department of Commerce partnered with Doctronic, a telehealth startup with an AI chatbot.\n\nDoctronic offers a nationwide service that allows patients to chat with its “AI doctor” for free, then, for $39, book a virtual appointment with a real doctor licensed in their state. But patients must go through the AI chatbot first to get an appointment.\n\n",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7fi7c/ai_starts_autonomously_writing_prescription/",
        "publishDate": "2026-01-08T15:58:24Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7f5z7",
        "title": "MAGMA: A Multi-Graph based Agentic Memory Architecture for AI Agents",
        "content": "[https://doi.org/10.48550/arXiv.2601.03236](https://doi.org/10.48550/arXiv.2601.03236) \n\nMemory-Augmented Generation (MAG) extends Large Language Models with external memory to support long-context reasoning, but existing approaches largely rely on semantic similarity over monolithic memory stores, entangling temporal, causal, and entity information. This design limits interpretability and alignment between query intent and retrieved evidence, leading to suboptimal reasoning accuracy. In this paper, we propose MAGMA, a multi-graph agentic memory architecture that represents each memory item across orthogonal semantic, temporal, causal, and entity graphs. MAGMA formulates retrieval as policy-guided traversal over these relational views, enabling query-adaptive selection and structured context construction. By decoupling memory representation from retrieval logic, MAGMA provides transparent reasoning paths and fine-grained control over retrieval. Experiments on LoCoMo and LongMemEval demonstrate that MAGMA consistently outperforms state-of-the-art agentic memory systems in long-horizon reasoning tasks.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7f5z7/magma_a_multigraph_based_agentic_memory/",
        "publishDate": "2026-01-08T15:45:32Z[Etc/UTC]",
        "author": "AngleAccomplished865",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ep8s",
        "title": "Looking for recommendations on the best AI platform to use to aid in academic writing",
        "content": "Hey all!\n\nI’m in a doctorate of nursing practice program to become a nurse practitioner. I’m currently in classes that require lots of paper writing on subjects such as nursing theory and literature reviews. I’m wanting to get recommendations for the best AI platform that increases productivity when writing papers. This last semester I primarily used ChatGPT, uploaded the rubric, the topic I wanted to focus on and any other requirements and had it write me a draft paper to use as a visual guide to write my own paper. Of note: I am not asking for an AI to write my paper so I can copy and paste it and turn it in. I just want a good one that can write a really good example/draft paper, learn the writing style/workflows of the class, and find me good sources to use. I find that I write better when I have a visual aid/example paper to reference when writing. Just wondering if there’s anything better than ChatGPT out there for this. Thanks in advance!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7ep8s/looking_for_recommendations_on_the_best_ai/",
        "publishDate": "2026-01-08T15:27:44Z[Etc/UTC]",
        "author": "LORAZEMAN97",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "14",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7dq5h",
        "title": "If I have to ask Gemini to verify what ChatGPT is saying is correct...it's a bad sign!",
        "content": "ChatGPT sometimes makes serious mistakes which makes me glad to verify with Gemini (of the DIY variety or answers that need to take into account nuances). I have noticed it so many times that it's a habit to double check your responses with Gemini etc.\n\nI think everyone knows this anyway but Nano Banana is so superior also.\n\nThe trouble is Gemini UI is terrible and I need projects support 😬",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7dq5h/if_i_have_to_ask_gemini_to_verify_what_chatgpt_is/",
        "publishDate": "2026-01-08T14:50:00Z[Etc/UTC]",
        "author": "Sovereign108",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "1",
            "commentCount": "19",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7dkml",
        "title": "I’m an AI Professor offering to build your first AI automation for FREE!",
        "content": "Hey Reddit,\n\nI’m an Assistant Professor in AI & Data Science (M.Sc. with 9.0+ GPA, top-ranked student). I teach this stuff daily, but I want to build my real-world confidence as I start freelancing.\n\nTo build my portfolio, I’m offering to complete one small AI task for you completely for FREE.\nHow I can help you:\n1. Digital Assistants: Automate web research and generate summary reports.\n2. Chat with Documents: Ask questions to your private PDFs/spreadsheets instantly.\n3. Connect Apps: Automate manual tasks between email, Sheets, and other tools.\n4. Custom AI Tools: If you have an idea not listed here, just ask! I'll check the feasibility.\nWho is this for?\n\nAnyone. Whether you're an individual with a personal task, a startup, or a larger team needing a proof-of-concept. No task is \"too small.\"\n\nThe Deal:\nI will handle a small project (a few days of work) at no cost to you. All I ask for is an honest review and permission to use the project (anonymously) in my portfolio.\nVerification: Happy to share my resume and credentials privately via DM for your peace of mind.\n\nComment or DM me your idea! Let's see if a Professor can solve your real-world problems!",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7dkml/im_an_ai_professor_offering_to_build_your_first/",
        "publishDate": "2026-01-08T14:43:53Z[Etc/UTC]",
        "author": "New_Passenger_7044",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "11",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7c4lh",
        "title": "I see everyone talking about AlphaEarth (Google’s new AI Earth model), but I found it difficult to access, so here’s a tutorial (:",
        "content": "AlphaEarth is basically a huge spatio-temporal dataset that learned every Earth (10×10 meter land) pixel by combining billions of spatial data  \n  \nInstead of comparing layers one by one, this tech assembles all of them into 64-dimensional embeddings representing features understood by the model  \n  \nyou can use it for supervised or unsupervised classification, regression, and similarity search on any location.",
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1q7c4lh/i_see_everyone_talking_about_alphaearth_googles/",
        "publishDate": "2026-01-08T13:43:24Z[Etc/UTC]",
        "author": "Glass-Caterpillar-70",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "14",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7asf2",
        "title": "Hiring managers at 31 AI labs say the \"LeetCode Era\" is ending.",
        "content": "Found this clip from The Cognitive Revolution really interesting regarding the future of AI employment. The speaker discusses the results of a survey conducted with hiring managers at 31 different AI safety labs.\n\nThey broke down talent into three archetypes:\n\n1. **Connectors:** People who bridge theoretical safety arguments with empirical techniques \n2. **Iterators:** Strong empirical researchers pushing the frontier \n3. **Amplifiers:** People with strong management/networking skills who use AI to scale teams \n\n**The key takeaway:**  \n  \nThe speaker argues that as tools like Claude Code and AI agents improve, the \"minimum technical skills\" required to contribute are eroding. He predicts that in the next 1-2 years, the most in-demand people won't be pure coders, but \"Amplifiers\"—people who excel at management, networking, and orchestrating AI agents to do the work.",
        "url": "https://v.redd.it/vye6lwf8e4cg1",
        "publishDate": "2026-01-08T12:41:56Z[Etc/UTC]",
        "author": "Beachbunny_07",
        "sourceType": "reddit",
        "sourceName": "ArtificialInteligence",
        "metadata": {
            "subreddit": "ArtificialInteligence",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7z62u",
        "title": "The App I Built in Secret That Failed (And How I Rebuilt It Live in 4 Weeks)",
        "content": "Hey r/ChatGPTCoding ,\n\nA few months back, I made the classic mistake: I built an entire app without checking if anyone even needed it. Four months of work, just me grinding in secret, and when I finally launched? Nothing. No paying users. Just silence.\n\nThe app looked great. Clean UI, solid features. But none of that mattered because I built what I thought was cool, not what people actually needed.\n\nSo I decided to start over. But this time, I made one rule: **I'm not allowed to work on anything unless I'm livestreaming it.**\n\nHere's what changed when I started building in public:\n\n**1. I validated the idea by asking chat in real-time**\n\nFor two weeks, I just asked people on stream, in Discord, and Reddit: \"What's your most annoying daily problem?\" One pain point kept showing up. So I built a landing page live on stream, showed a quick demo, and asked people to sign up. Within three days, 92 people joined the waitlist - and they watched me build the signup form.\n\n**2. Chat forced me to cut the bloat**\n\nOriginally I had 20+ features planned. Chat kept asking \"but what does it actually DO?\" So I scrapped everything and built just 1 core feature. We shipped a working MVP in 4 weeks because I couldn't hide behind \"I'll add that later.\"\n\n**3. AI + livestreaming = insane velocity**\n\nI'm not a \"real\" developer. I use Cursor, Claude, Replit, and whatever AI tool works. But coding live meant when I got stuck, someone in chat would drop a solution. It's like having free pair programming from dozens of devs simultaneously. The first app I built in secret took 4 months. This one took 4 weeks.\n\n**4. Early users came from people who watched me build it**\n\nI gave the first 30 waitlist people early access live on stream. Some found bugs immediately. Some didn't understand it. But 8 people said they'd pay for it. We added Stripe that same day, and boom - first paying customers were people who literally watched me write the code.\n\n**5. The roadmap built itself from viewer feedback**\n\nNo guessing what to build next. People who watched told me exactly what they needed. I made a public Notion board where viewers vote on features. The product builds itself when you're not building alone in a cave.\n\n**6. Building in public created the audience while I built the product**\n\nDay 1 had 3 viewers. Day 14 has maybe 30. But those 30 people know if I don't show up. That accountability replaced the pressure I used to feel building alone, except this time it actually feels good.\n\n**Biggest lessons:**\n\n* Building in secret = building for yourself. Building in public = building for users.\n* AI tools are insane if you're not afraid to look dumb while learning. Half my streams are me Googling basic syntax.\n* You can't hide behind \"it's not ready yet\" when people are literally watching you build it. That pressure makes you ship.\n\n**The part nobody mentions:**\n\nMy first app made $47 yesterday. My second app that I built in secret? Still at $0. The difference wasn't the code quality. It was that people felt invested in the one they watched me build.\n\nBut I'm terrified I'm just building an audience watching me build, not actually building a business. That voice at 2 AM is LOUD.\n\nSo here's my question: **How do you know if you're making genuine progress or just performing progress?** Because some days I genuinely can't tell.\n\nDay 14 of \"Vibe-coding until I reach 100K\" done. Day 15 starts in 6 hours.\n\nHappy to answer questions if anyone's in the same boat.\n\nAnd for those interested I stream here: [https://www.youtube.com/@Dubibubii](https://www.youtube.com/@Dubibubii)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1q7z62u/the_app_i_built_in_secret_that_failed_and_how_i/",
        "publishDate": "2026-01-09T04:57:06Z[Etc/UTC]",
        "author": "dubibubii",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "4",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7wfa8",
        "title": "Roo Code 3.39 | Image file @mentions | Sticky provider profiles | YOLO → BRRRRRRRRRR",
        "content": "[In case you did not know, r\\/RooCode is a Free and Open Source VS Code AI Coding extension.](https://preview.redd.it/lhctuxj1m8cg1.png?width=2048&format=png&auto=webp&s=6253164052a459413c7cc0ee48f78b6df9e08980)\n\n# Image file @ mentions\n\nYou can now @mention image files to include them as inline images in your message, making it easier to share screenshots and UI mockups without manually attaching files (thanks hannesrudolph!).\n\n# Sticky provider profile\n\nTasks now remember the provider profile (API configuration) they started with, so switching profiles elsewhere doesn’t affect running tasks or resumed tasks (thanks hannesrudolph!).\n\n# YOLO → BRRRRRRRRRR\n\nThe auto-approve mode label has been renamed from “YOLO” to “BRRRRRRRRRR” across the UI (thanks app/roomote!).\n\n# QOL Improvements\n\n* The `@` file picker now respects `.rooignore`, reducing noise in large workspaces and helping you avoid accidentally attaching ignored/generated files (thanks app/roomote, jerrill-johnson-bitwerx!)\n* Adds debug-only proxy routing settings so you can inspect extension network traffic while running under the VS Code debugger (F5) (thanks hannesrudolph, SleeperSmith!)\n* Improves the follow-up suggestion mode badge styling for better readability (thanks mrubens!)\n* Clarifies in the native `read_file` tool description that image formats are supported when the model supports vision (thanks app/roomote, nabilfreeman!)\n\n# Bug Fixes\n\n* Fixes an issue where conversations could fail after condensation due to missing/mismatched tool call IDs, improving reliability in longer chats (thanks daniel-lxs!)\n* Fixes an issue where duplicate `tool_result` blocks could cause provider API errors (including Anthropic “duplicate toolResult” failures), improving reliability in tool-heavy workflows (thanks daniel-lxs!)\n* Fixes an edge case where switching terminals mid-run could produce duplicate tool results and trigger protocol errors, reducing unattended-mode soft-locks (thanks app/roomote, nabilfreeman!)\n* Fixes an issue where Roo could generate the wrong command chaining syntax on Windows, making suggested terminal commands more likely to work without edits (thanks app/roomote, AlexNek!)\n* Fixes an issue where chat requests could fail on Windows systems without PowerShell in PATH (“spawnSync powershell ENOENT”) (thanks app/roomote, Yang-strive!)\n* Fixes a rare edge case where an API rate limit setting could be ignored when provider state is temporarily unavailable (thanks app/roomote!)\n* Fixes validation failures in nightly builds by adding missing setting descriptions for debug proxy configuration (thanks app/roomote!)\n* Fixes an issue where file paths shown during native tool-call streaming could appear incorrect or truncated, making it harder to confirm which file Roo is reading or editing\n* Fixes an issue where resuming a task with Gemini models that use extended thinking could fail with a “Corrupted thought signature” / INVALID\\_ARGUMENT error\n* Fixes an issue where `ask_followup_question` could fail with some Anthropic-backed setups due to strict tool schema validation\n\n# Provider Updates\n\n* Provider/model list updates and compatibility improvements across multiple providers (e.g., Fireworks AI, OpenAI-compatible endpoints, Cerebras, Bedrock), including new model options and removing legacy/unsupported entries.\n\n# Misc Improvements\n\n* CLI improvements: simpler install/upgrade workflow plus early-stage CLI support used by eval tooling.\n\nSee full release notes [v3.39.0](https://docs.roocode.com/update-notes/v3.39.0) | [v3.39.1](https://docs.roocode.com/update-notes/v3.39.1)",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1q7wfa8/roo_code_339_image_file_mentions_sticky_provider/",
        "publishDate": "2026-01-09T02:47:32Z[Etc/UTC]",
        "author": "hannesrudolph",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7mlo4",
        "title": "\"Another AI text-to-markup generator\" - you saw a demo. Here's the actual product.",
        "content": "Last post I showed the builder making components. Fair enough, that's what everyone shows. You watched AI write React and thought \"seen it.\"\n\nYou didn't see any of this.\n\n---\n\n**THE DASHBOARD**\n\nFull project management. Create projects, see deployment status, track what's live vs building. Stats showing deployed sites, builds in progress, your tier limits. Not a demo page - an actual workspace.\n\nEach project has:\n- Section-by-section breakdown\n- Build history with versioning\n- Deployment status (live URL if deployed)\n- Last edited timestamps\n- One-click to resume building\n\n---\n\n**THE BUILDER (the real one)**\n\nWhat you saw: type prompt, get component.\n\nWhat you didn't see:\n\n- **Non-linear editing** - Click any section in the sidebar to jump to it. Not locked into \"next, next, next\"\n- **Section reordering** - Drag sections up/down. Header stays pinned to top, Footer pinned to bottom (can't break your layout)\n- **Live preview** - Real iframe rendering your actual site as you build\n- **Full site preview** - Toggle to see the whole page assembled, not just the current section\n- **Refine loop** - \"Make the headline bigger\" / \"Add a gradient\" / \"Change the CTA copy\" - iterates on the existing code\n\nSection types: Header, Hero, Features, Pricing, Testimonials, CTA, About, Contact, Footer. Pick what you need, skip what you don't.\n\n---\n\n**BRAND SYSTEM**\n\nBefore you build anything, you set:\n- Primary color (hex picker)\n- Secondary color\n- Body font\n- Heading font\n- Dark mode / Light mode\n\nThese compile into `lib/brand.ts`:\n\n    export const brand = {\n      name: \"Your Site\",\n      colors: {\n        primary: \"#10b981\",\n        secondary: \"#059669\",\n      },\n      fonts: {\n        body: \"Inter\",\n        heading: \"Inter\",\n      },\n      mode: \"dark\"\n    }\n\nEvery component references this. Change primary color once, entire site updates. This isn't CSS variables bolted on - it's baked into the scaffold.\n\n---\n\n**SEO (actually done properly)**\n\nThe scaffold generates:\n\n- `app/sitemap.ts` - Dynamic sitemap generation\n- `app/robots.ts` - Proper robots config\n- `app/opengraph-image.tsx` - Generates OG images with your brand colors and site name\n- `app/twitter-image.tsx` - Same for Twitter cards\n- `app/layout.tsx` - Meta tags, title, description all wired up\n\nNot placeholder files. Working code. When you deploy, Google sees a real sitemap. Social shares show real preview cards with your branding.\n\nI spent a week on Figma Sites before discovering they inject noindex tags and use hash routing. Never again.\n\n---\n\n**PUSH TO GITHUB**\n\nOAuth flow. Connect your GitHub account (your credentials, your repos). Hit \"Push to GitHub.\"\n\nIt creates a repo in YOUR account and pushes:\n\n    ├── app/\n    │   ├── layout.tsx\n    │   ├── page.tsx\n    │   ├── sitemap.ts\n    │   ├── robots.ts\n    │   ├── opengraph-image.tsx\n    │   └── twitter-image.tsx\n    ├── components/\n    │   ├── Header.tsx\n    │   ├── Footer.tsx\n    │   └── sections/\n    │       ├── Hero.tsx\n    │       ├── Features.tsx\n    │       └── ...\n    ├── lib/\n    │   └── brand.ts\n    ├── public/\n    ├── tailwind.config.ts\n    ├── tsconfig.json\n    ├── package.json\n    └── README.md\n\nClone it. `npm install`. `npm run dev`. It runs. It's a real Next.js 14 app, not an HTML dump.\n\n---\n\n**DEPLOY**\n\nOne click to Vercel infrastructure. Gets a subdomain on hatchitsites.dev immediately.\n\nPaid tiers: custom domains. Point your DNS, it just works.\n\nOr ignore all of this, download the ZIP, host it on Netlify or your own server. I don't care. Once you export, it's not my code anymore.\n\n---\n\n**THE TIER SYSTEM**\n\n- **Free**: Unlimited AI generations. Unlimited preview. 1 project. Can't deploy or export (that's the gate)\n- **Architect ($19/mo)**: Deploy, ZIP export, GitHub push, 3 projects\n- **Visionary ($49/mo)**: Unlimited projects, custom domains, The Auditor, The Healer, remove HatchIt branding\n- **Singularity ($199/mo)**: The Replicator, white-label, API access\n\n---\n\n**THE AI TOOLS (beyond generation)**\n\n- **The Auditor** - Runs a quality pass on your build. Checks accessibility, consistency, suggests improvements\n- **The Healer** - Auto-fixes runtime errors in preview. Component crashes? It patches and continues\n- **The Replicator** - Feed it any URL. It analyzes the design and rebuilds it in your stack. (Singularity only, for obvious reasons)\n- **The Witness** - Session analysis. Watches your build flow, suggests what section to add next\n\n---\n\n**COMPONENT LIBRARY**\n\nThe AI doesn't freestyle from nothing. It references a curated component library - heroes, feature grids, pricing tables, testimonials, CTAs. Multiple variants each.\n\nThis is why output doesn't look like \"generic SaaS template #47\". It has actual patterns to work from.\n\n---\n\n**WHAT THIS ISN'T**\n\nIt won't replace a senior dev building you a custom app. The generation is Claude Sonnet - same model as everyone else. Output quality depends on prompts. Multi-page routing is basic right now.\n\nIt's AI-generated code. Review it before shipping to production.\n\n---\n\n**WHY I BUILT IT**\n\nI needed this for my own projects. Tried WordPress - plugin hell. Tried Figma Sites - SEO broken. Tried Bolt, v0, all the AI tools - couldn't deploy anything real.\n\nSo I built the pipeline I wanted. Hundreds of hours. Shipped over Christmas while everyone else was offline.\n\nThe moat isn't the AI generation. Everyone has that.\n\nThe moat is: prompt → your GitHub → your Vercel → you own everything.\n\n---\n\n[hatchit.dev](https://hatchit.dev)\n\nFree tier works. Build unlimited, pay when you want to ship.",
        "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1q7mlo4/another_ai_texttomarkup_generator_you_saw_a_demo/",
        "publishDate": "2026-01-08T20:13:25Z[Etc/UTC]",
        "author": "Imaginary-Coffee8035",
        "sourceType": "reddit",
        "sourceName": "ChatGPTCoding",
        "metadata": {
            "subreddit": "ChatGPTCoding",
            "score": "0",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q83rhw",
        "title": "AI Futures Project Delays Timeline of 2030 Human Apocalypse Scenario",
        "content": "[No content]",
        "url": "https://www.hungarianconservative.com/articles/tech/ai-futures-project-ai-2027-apocalypse-timeline-superintelligence-daniel-kokotajlo/",
        "publishDate": "2026-01-09T09:22:12Z[Etc/UTC]",
        "author": "schefferjoko",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q83cyi",
        "title": "Elon Musk's Grok AI image editing limited to paid users after deepfakes",
        "content": "[No content]",
        "url": "https://www.bbc.com/news/articles/c99kn52nx9do",
        "publishDate": "2026-01-09T08:57:08Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "1",
            "commentCount": "0",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q82r2v",
        "title": "Musk lawsuit over OpenAI for-profit conversion can go to trial, US judge says",
        "content": "[No content]",
        "url": "https://www.theguardian.com/technology/2026/jan/08/elon-musk-openai-lawsuit-for-profit-conversion-can-go-to-trial-us-judge-says",
        "publishDate": "2026-01-09T08:19:05Z[Etc/UTC]",
        "author": "F0urLeafCl0ver",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q808hn",
        "title": "One-Minute Daily AI News 1/8/2026",
        "content": "1. **Google** is unleashing Gemini AI features on Gmail. Users will have to opt out.\\[1\\]\n2. Governments grapple with the flood of non-consensual nudity on **X**.\\[2\\]\n3. **OpenAI** introduced ChatGPT Health, a dedicated experience that securely brings your health information and ChatGPT’s intelligence together, to help you feel more informed, prepared, and confident navigating your health.\\[3\\]\n4. **Stanford** Researchers Build SleepFM Clinical: A Multimodal Sleep Foundation AI Model for 130+ Disease Prediction.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbc.com/2026/01/08/google-adds-gemini-features-to-gmail-message-summaries-proofreading-.html](https://www.cnbc.com/2026/01/08/google-adds-gemini-features-to-gmail-message-summaries-proofreading-.html)\n\n\\[2\\] [https://techcrunch.com/2026/01/08/governments-grapple-with-the-flood-of-non-consensual-nudity-on-x/](https://techcrunch.com/2026/01/08/governments-grapple-with-the-flood-of-non-consensual-nudity-on-x/)\n\n\\[3\\] [https://openai.com/index/introducing-chatgpt-health/](https://openai.com/index/introducing-chatgpt-health/)\n\n\\[4\\] [https://www.marktechpost.com/2026/01/08/stanford-researchers-build-sleepfm-clinical-a-multimodal-sleep-foundation-ai-model-for-130-disease-prediction/](https://www.marktechpost.com/2026/01/08/stanford-researchers-build-sleepfm-clinical-a-multimodal-sleep-foundation-ai-model-for-130-disease-prediction/)",
        "url": "https://www.reddit.com/r/artificial/comments/1q808hn/oneminute_daily_ai_news_182026/",
        "publishDate": "2026-01-09T05:51:43Z[Etc/UTC]",
        "author": "Excellent-Target-847",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "2",
            "commentCount": "1",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7ugtz",
        "title": "Why Yann LeCun left Meta for World Models",
        "content": "As we know, one of the godfathers of AI recently left Meta to found his own lab AMI and the the underlying theme is his longstanding focus on world modelling. This is still a relatively underexplored concept however the recent surge of research suggests why it is gaining traction.\n\nFor example, Marble demonstrates how multimodal models that encode a *sense of the world* can achieve far greater efficiency and reasoning capability than LLMs, which are inherently limited to predicting the next token. Genie illustrates how 3D interactive environments can be learned and simulated to support agent planning and reasoning. Other recent work includes SCOPE, which leverages world modelling to match frontier LLM performance (GPT-4-level) with far smaller models (millions versus trillions of parameters), and HunyuanWorld, which scored \\~77 on the WorldScore benchmark. There are also new models being developed that push the boundaries of world modelling further.\n\nIt seems the AI research community is beginning to recognize the practical and theoretical advantages of world models for reasoning, planning, and multimodal understanding.\n\nCurious, who else has explored this domain recently? Are there emerging techniques or results in world modelling that you find particularly compelling? Let us discuss.\n\nps: See the comments for references to all the models mentioned above.",
        "url": "https://www.reddit.com/r/artificial/comments/1q7ugtz/why_yann_lecun_left_meta_for_world_models/",
        "publishDate": "2026-01-09T01:21:49Z[Etc/UTC]",
        "author": "imposterpro",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "37",
            "commentCount": "45",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7sbtb",
        "title": "Quick reliability lesson: if your agent output isn’t enforceable, your system is just improvising",
        "content": "I used to think “better prompt” would fix everything.\n\nThen I watched my system break because the agent returned:  \n`Sure! { \"route\": \"PLAN\", }`\n\nSo now I treat agent outputs like API responses:\n\n* Strict JSON only (no “helpful” prose)\n* Exact schema (keys + types)\n* No extra keys\n* Validate before the next step reads it\n* Retry with validator errors (max 2)\n* If missing info -> return unknown instead of guessing\n\nIt’s not glamorous, but it’s what turns “cool demo” into “works in production.”\n\nIf you’ve built agents: what’s your biggest source of failures, format drift, tool errors, or retrieval/routing?",
        "url": "https://www.reddit.com/r/artificial/comments/1q7sbtb/quick_reliability_lesson_if_your_agent_output/",
        "publishDate": "2026-01-08T23:52:03Z[Etc/UTC]",
        "author": "coolandy00",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "3",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7hmqa",
        "title": "Wouldn’t a rouge AGI or ASI accumulating resources covertly for computation look just like our current AI bubble?",
        "content": "Just a thought I have been having, wouldn’t the blind devotion to building more data centers, removing regulation and insane stock prices for AI companies be the exact way a covert AGI or rouge system would operate and incentivize us to serve its interests?\n\nNot saying it’s actually happening\n\nEdit: Rogue not rouge",
        "url": "https://www.reddit.com/r/artificial/comments/1q7hmqa/wouldnt_a_rouge_agi_or_asi_accumulating_resources/",
        "publishDate": "2026-01-08T17:16:14Z[Etc/UTC]",
        "author": "Docwaboom",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "0",
            "commentCount": "13",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7gmqp",
        "title": "AI detects stomach cancer risk from upper endoscopic images in remote communities",
        "content": ">Researchers at National Taiwan University Hospital and the Department of Computer Science & Information Engineering at National Taiwan University developed an AI system made up of several models working together to read stomach images. Trained using doctors’ expertise and pathology results, the system learns how specialists recognize stomach disease. It automatically selects clear images, focuses on the correct areas of the stomach, and highlights important surface and vascular details.\n\n>The system can quickly identify signs of *Helicobacter pylori* infection and early changes in the stomach lining that are linked to a higher risk of stomach cancer. The study is published in *Endoscopy*.\n\n>For frontline physicians, this support can be important. AI can help them feel more confident in what they see and what to do next. By providing timely and standardized assessments, it helps physicians determine whether additional diagnostic testing, *H. pylori* eradication therapy, or follow-up endoscopic surveillance is warranted. As a result, potential problems can be detected earlier, even when specialist care is far away. \n\n>“By learning from large numbers of endoscopic images that have been matched with expert-interpreted histopathology, AI can describe gastric findings more accurately and consistently. This helps doctors move beyond vague terms like “gastritis”, which are often written in results but don’t give enough information to guide proper care,” says first author Associate Professor Tsung-Hsien Chiang.\n\n>“AI is not meant to replace doctors,” says corresponding author Professor Yi-Chia Lee. “It acts as a digital assistant that supports clinical judgment. By fitting into routine care, AI helps bring more consistent medical quality to reduce the gap between well-resourced hospitals and remote communities.”\n\n\"[AI detects stomach cancer risk from upper endoscopic images in remote communities](https://www.asiaresearchnews.com/content/ai-detects-stomach-cancer-risk-upper-endoscopic-images-remote-communities)\", Asia Research News, 02 Jan 2026\n\n",
        "url": "https://www.asiaresearchnews.com/content/ai-detects-stomach-cancer-risk-upper-endoscopic-images-remote-communitiesResearchers",
        "publishDate": "2026-01-08T16:40:07Z[Etc/UTC]",
        "author": "jferments",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "3",
            "commentCount": "2",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7fvnp",
        "title": "Intel hopes its new chip can be the future of AI",
        "content": "[No content]",
        "url": "https://www.cnn.com/2026/01/08/tech/comeback-intel-ai-ces?utm_medium=social&utm_campaign=missions&utm_source=reddit",
        "publishDate": "2026-01-08T16:12:11Z[Etc/UTC]",
        "author": "cnn",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "4",
            "commentCount": "5",
            "isNsfw": "false"
        }
    },
    {
        "id": "1q7esfp",
        "title": "Nvidia CEO says it's \"within the realms of possibility\" to bring AI improvements to older graphics cards",
        "content": "[No content]",
        "url": "https://www.pcgamer.com/hardware/graphics-cards/nvidias-ceo-says-bringing-new-ai-tech-to-older-generation-gpus-is-within-the-realm-of-possibility/",
        "publishDate": "2026-01-08T15:31:04Z[Etc/UTC]",
        "author": "Fcking_Chuck",
        "sourceType": "reddit",
        "sourceName": "artificial",
        "metadata": {
            "subreddit": "artificial",
            "score": "62",
            "commentCount": "22",
            "isNsfw": "false"
        }
    },
    {
        "id": "gw_YfEESpUg",
        "title": "Opus 4.5 GOD MODE: 5 Simple TRICKS to Make OPUS 4.5 PERFORM LIKE A GOD TIER CODER!",
        "content": "In this video, I'll be showing you the ultimate \"Pro-Tier\" AI coding setup that combines Opus 4.5 with Verdant for maximum ...",
        "url": "https://www.youtube.com/watch?v=gw_YfEESpUg",
        "publishDate": "2026-01-08T10:58:50Z",
        "author": "AICodeKing",
        "sourceType": "youtube",
        "sourceName": "AI Code King YouTube Channel",
        "metadata": {
            "channelId": "UC0m81bQuthaQZmFbXEY9QSw",
            "thumbnailUrl": "https://i.ytimg.com/vi/gw_YfEESpUg/hqdefault.jpg",
            "transcription": "[Music]\nHi. Welcome to another video. So, recently I showed you what I called the God tier budget setup using GLM 4.7 and Goose. That stack is incredible if you are a student or just want to keep your costs down to basically zero. However, a lot of you commented asking a different question. What if I don't care about the budget? What if I want the absolute best performance, regardless of cost? Well, I listened. I sat down and adapted that same all-in-one workflow. But this time, I maxed out the specs. We are swapping out the budget-friendly engine for the smartest model on the planet. And we are swapping the CLI-based agent for a full graphical workspace. I am calling this the pro tier stack. It combines the reasoning power of Opus 4.5 with the visual control of Verdent. And the best part? We are finally using a model that doesn't just write code, it understands architecture in a way that cheaper models just don't. So, I want to show you exactly how to build this super agent step-by-step. First, let's talk about the engine. Opus 4.5. I have to be honest, I used to criticize Anthropic heavily for their pricing. The old Opus was $75 per million tokens output. That was basically robbery. But Opus 4.5 has changed the game. It is now $25 for output and only $5 for input. Don't get me wrong. That is still expensive compared to GLM or Flash. But here is the thing. It is the true successor to Sonnet. It doesn't just guess, it plans, it lints, it self-corrects. In my testing, one prompt from Opus 4.5 is worth about 10 prompts from a cheaper model because you don't have to fix its mistakes. So, step one, get access to Opus 4.5. This is the brain. Now, step two, the body. We need an interface. Now, I know I previously used Goose and a lot of people are hyped about Claude Code right now. And yes, running everything from the CLI is cool. I've also mentioned Conductor for Mac users. However, for a true all-in-one setup with a model this expensive, I am choosing Verdent. Why Verdent? Because while Goose and Claude Code are great for quick scripts, Verdent offers a full graphical workspace. It has a proper file tree. It has visual diffs. And crucially, it allows us to manage context much better than a terminal window can. It basically allows you to visualize the changes before you commit them. When you are paying for Opus, you want to see exactly what you are buying before you hit save. So, you download Verdent. You go into the settings and you configure it to use Opus 4.5 as your primary driver. But we aren't just going to leave it stock. We need to upgrade it just like we did with the GLM setup. This is where the all-in-one trick comes in. We are going to perform a brain transplant on the agent context. In Verdent, you can set up global rules or memories. I am going to combine two prompts I've shared in previous videos. The King Mode prompt and the frontend design skill. The King Mode prompt forces the model to Ultra Think. It stops Opus from rushing. Even though Opus is already smart, this forces it to map out the database schema and API routes before writing a single line of React. The frontend design skill is a markdown file that forbids generic UI. It bans the standard Bootstrap look. It forces an editorial or Brutalist aesthetic. So, I save both of these into my Verdent workspace instructions. Now, let me show you the secret sauce. Even with Opus, I don't trust AI to guess my colors. This is where tweakcn comes in. Before I start coding, I go to tweakcn.com. I pick a theme. Let's go with Doom 64 again, because I really love that high contrast, deep red, and gray-blue retro vibe. And I drag the sliders until the charts look perfect. I click copy code. Now, let me show you this full workflow in action. I have a new workspace open in Verdent. I paste the CSS variables from tweakcn into my global CSS file. Now, I type this prompt into Verdent. Ulthrathink, build a movie tracker app using Next.js and Supabase. I have already defined the theme variables. Use the Doom 64 color scheme. Use the Frontend Design skill for the component structure. Handle the backend logic first. Use the TMDB API. I hit enter. Here is where it gets interesting. Because we are using Opus 4.5, it doesn't just start spitting out code. It pauses. It basically allows you to see its thought process. It breaks down the requirements. Okay. I need a Supabase client. I need a database schema for movies. I need a favorites join table. It creates the plan. Then, watch what happens in the Verdent interface. It creates the files. But unlike other agents that just dump code, Opus 4.5 runs the linter. I literally saw it write a file, notice a TypeScript error regarding an unused variable, and fix it immediately before moving to the next file. That is the oomph I was talking about. Now, look at the result. Because I injected the frontend design skill, it's not using a generic layout. It's using a masonry grid for the movie posters. And because I started with tweakcn, the colors are locked in. It didn't hallucinate a random blue button. It used the specific Doom red variable I defined. If you are building a serious project, this stack, Opus for the brains, Verdent for the IDE, and tweakcn for the style, is unbeatable. You are getting the reasoning capabilities of a senior engineer. You aren't fighting the AI to fix syntax errors. You are just directing the architecture. And yes, it costs a bit more than using the GLM setup. But think about the time you save. I haven't touched a line of boilerplate code in weeks. I've put links to Verdent, the tweakcn site, and the text files for the King Mode system prompt in the description below. Overall, it's pretty cool. Anyway, share your thoughts below and subscribe to the channel. You can also donate via Super Thanks option or join the channel as well and get some perks. I'll see you in the next video. Bye.\n[Music]\nI think you missed this:\n[Music]"
        }
    },
    {
        "id": "LczPC29EXO0",
        "title": "How Oil Delayed the Soviet Collapse - Sarah Paine",
        "content": "",
        "url": "https://www.youtube.com/watch?v=LczPC29EXO0",
        "publishDate": "2026-01-08T19:25:07Z",
        "author": "Dwarkesh Patel",
        "sourceType": "youtube",
        "sourceName": "Dwarkesh Patel YouTube Channel",
        "metadata": {
            "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
            "thumbnailUrl": "https://i.ytimg.com/vi/LczPC29EXO0/hqdefault.jpg",
            "transcription": "BY THE LATE 50S, SOVIET GROWTH RATES ARE ALREADY STARTING TO GO DOWN. AND IN 59, THEY DISCOVERED THESE MASSIVE OIL FIELDS IN SIBERIA. AND THEN FROM 73 TO 85, I THINK, 80% OF SOVIET UNION'S HARD CURRENCY EARNINGS ARE JUST FROM OIL. DO YOU THINK THAT IF THE SIBERIAN RESERVES AREN'T FOUND, THE SOVIET UNION WOULD HAVE COLLAPSED 30 YEARS PRIOR? THEY WOULDN'T HAVE BEEN ABLE TO DO ALL THE AFRICA PROGRAM AND THINGS. IT JUST WOULD BE TOO EXPENSIVE. IT IS ALSO THE GAS RESERVES THEY GOT UP. IT'S LIKE NORTH CENTRAL SOVIET UNION. I CAN'T REMEMBER THE PLACES. BUT THIS IS THE GAS THAT GETS USED TO GET PUMPED TO EUROPE. AND THEY MAKE THOSE BIG INVESTMENTS AND IT TAKES A WHILE FOR THEM TO PAY OFF. AND THAT WAS A BIG DEAL BECAUSE THEY NEEDED HELP FROM WESTERN OIL COMPANIES OR WHATEVER. WHOEVER DOES THE GAS PIPELINES, COMPRESSORS, WHATEVER IT IS YOU NEED. AND THERE WAS A BIG TO-DO ABOUT THAT, ABOUT WHETHER WE SHOULD SELL THE STUFF OR WHETHER WE SHOULDN'T SELL THE STUFF. EUROPEANS WANTED TO SELL. WE WERE TRYING NOT TO. THIS IS GOING UNDER REAGAN AS WELL. BUT ANYWAY, THEY HAD BUILT A LOT OF IT, AND IT WAS ESSENTIAL TO THEIR POCKET CHANGE. BUT THEN WHEN THEY GOT ALL THE POCKET CHANGE, THEY NEVER SAVED ANY OF IT. WHATEVER THE OIL WEALTH WAS, THEY SPENT UP TO THE MAX. DOESN'T IT SOUND FAMILIAR, RIGHT? GOVERNMENTS, YOU HAVE MONEY, YOU SPEND IT, FORGET ABOUT RAINY DAYS.\n"
        }
    }
]